{"songs": [{"title": "Club Night", "album": "So Hard", "year": "2013-05-22", "image": "https://images.genius.com/701a46350909affbfec12488b53a9b66.500x500x1.jpg", "lyrics": "[Intro]\nYep, ayy\nYep, ayy\nMan, you know who it is\n\n[Verse 1]\nFriday fucking night, we 'bout to do this right\nDicky rollin to the club, he about to find his wife\n'Cause he fresher than a kid that called his mom a fuckin' hoe\nBunch a bitches getting low, pimpin'? You already know\nI'm 'bout to get up on the flow and then bring the chicken to my crib\nGetting drunk up in this muthafucka, fuck you think this is?\nThen I see a bad bitch with a booty and a half\nI make a move on that cutie, \"Excuse me, do you wanna dance?\"\nThen she looked at me and laughed like I didn't have a chance\nLike I shouldn't even ask, so I proceeded to get trashed\nThen I'm at the bar now and it's so loud, but I'm takin' shots and I'm throwin down\nAnd I see a pretty lady, so I send her some of that cold brown\nAnd she turned around, and then turned it down\nBecause in her words, she \"Don't like to flirt with clowns\"\nAnd I'm alone and pouting, overcrowded, I need to get up out this club\n\n[Chorus]\nI been inside this club for way too long\nI wanna leave and eat calzones\nNone of these females wanna bone\nMy self esteem is all but gone\n\n[Verse 2]\n'Bout to quit, but I'm bitter I paid that cover\nSo I guess I gotta stay in this stupid club a bit longer\nAnd I'm sweating like a jew in a multicultural sauna\nThey been playing fuckin' dubstep for ten consecutive songs\nAnd then I bumped into a guy, he was roughly six-foot-five\nPretty sure it was his fault, but I apologized\nPretty sure you know the type, probly bankin' every night\nVodka sprite, lookin' round to find a kike that he can fight\nOr suckerpunch, I'm kinda drunk, and I been up in the club for way too long\nNow I'm up in the corner, all alone, ESPN up on my phone\nMy self esteem is so depleted, such a mess, I'm overheated\nI regretfully just tweeted some depressing shit, I need to leave this club\n\n[Chorus]\nI been inside this club for way too long\nI wanna leave and eat calzones\nNone of these females wanna bone\nMy self esteem is all but gone\n\n[Verse 3]\nIs this really for the bathroom, are you kidding?\nThis the type of line where people squeeze they dick to prevent pissing\nWhen I get inside the stall it's like a yeti had been shitting\nMan, there's piss all on the ground, so as I'm wizzing I keep slipping\nFuck this hand stamp, club is really damn cramped\nFuck it, I'ma suck it up and take another damn chance\nUghh, here goes nothing (c'mon D)\n\"Ayy girlie, what's the word? At first glance I may look like a nerd\nBut if you let me, bet D, get thee all up in the bed so wet like a mafuckin' jet ski\nReal rap if you tryna go, then put your name right here up inside my phone\nShe took bait, no way, typing out her home, she pressed save\nWalked away, and her name was no?\n\n[Post-Verse]\nNo? She wrote no and no number. She just wrote the word no. Ooh, I get it. She's a bitch\n\n[Chorus]\nI been inside this club for way too long\nI wanna leave and eat calzones\nNone of these females wanna bone\nMy self esteem is all but gone\n\n[Outro]\nFuck this club, man. I knew I shouldn't have worn this shirt. Or at least I should've buttoned the top two buttons. My chest hair poking out, looking like taco meat. So Hard."}], "artist": "Lil Dicky"}