{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Intro: Havoc]\nCrazy motherfuckers in here son\nYeah no doubt, crazy motherfucker, yo, yeah, yo\nKnow we just just just, just chilling now\n\n[Hook: Havoc {Mr. Eon}]\nRugged Man, a nigga you don't wanna fuck with\nHavoc, a nigga you don't wanna fuck with\nRugged Man, a nigga you don't wanna fuck with\n{The High and Mighty} you don't wanna fuck with\n\n[Verse 1: R.A. the Rugged Man]\nYo, Yo, It's the return of the all time dirty\nCrusty, robbery, adultery, gluttony\nOn your block and, in your crib break the lock in\nWe go shopping, get knocking, ho hopping\nIt's Rugged Man no stopping, sex pistol\nJohnny Rotten, so shocking\nYour throat poor folks stay broke\nHalf-ape, The Legend of Tarzan, Greystoke\nStay dirty hate soap, hate bathing\nMaintaining, blowtorch ain't aiming\nFlame raining, brain wasting, if she pretty we ain't dating\nIf the bitch fuck us we make payments\nWho am I? Dirty boy original pervert\nHumbert H. Humbert, no job, fuck work\nLocally hoodlums suburban, Chris Berg\nQuick fith heard 'um, the German, we turn on, hits\n\n[Hook x2]\n\n[Verse 2: Havoc]\nGot my drink on, reminiscing drama on God\nStepped out my crib, politic with the gods\nOver gats, even though the hood is hot\nJakes on bikes, gotta hold down the block\n'Cause my life this automatic instant, ice grills, without a blink\nPermanently stained, they surface like Big\nThey shitting on my name, some ask why\n'Cause the sign just a regular gangsta, fuck DKNY\nScuffed Timbs laid up in Holiday Inn's\nAnd shortie wanna fret, I'm running up in her friend\nOfficial roaches, Scarface, shitting on mister Sosa, stay bent\nHold my liquor, like a cup coaster, handle mines\nSever great lines, cut throats while you drop dimes\nSnitch niggas on my shit list, quietly cock the biscuit\nThe Rugged Man have it, Mobb we infamous\n\n[Hook x2]\n\n[Verse 3: Mr.Eon]\nIt hurts a lot when I blurt the plot\nI don't work to rock, man I burn the crops\nIt's automatic, this addict stay addict\nSmoke shit the same color as The Philly Phanatic\nBehind wheels get dizzy or something\nMan I can't drive for goodness ain't my cousin Lizzie Grubman\nMy verse full throttle, hit a supermodel\nPay you off throw away the joint and the bottle\nI won't sell out, got a fear for God\nAhh fuck it, just give me 'bout a G a bar\nYou fools talking karma, I laugh (ha ha ha ha ha)\nI ain't the one getting choked up by Mos Def's dad\nSo watch EC dumb out\nI stretch the pussy more than when the baby's head come out\nYa stupid kids should not fuck with this\nThat's like Rocky messing around with Thunderlips\n\n[Hook x2]", "title": "You Don’t Wanna Fuck Wit", "image": "https://images.genius.com/ed9f08835c8c28feff14ecfbd0a2dc79.700x700x1.jpg"}]}