{"songs": [{"image": "https://images.genius.com/3fad66d67bd830fa5d4df71688c1997b.500x500x1.jpg", "album": "Generation Gaming XII", "title": "Dishonoured", "lyrics": "[Verse 1]\nThe Empire's got a new boss\nDelilah Copperspoon, what a loon, not human, too posh\nHer city's a machine and I'm a loose cog\nI'm popping out the wall like a cuckoo clock\nTo move across rooftops in two hops\nI'm mute, but if I need to I'll blow the roof off\nAnd kudos to you lot, that do what you've got to do to follow through and shoot a true shot\nWhen a bolt from the blue shocks you\nI'm going to watch to determine who's true and who's not\nThe world's bursting with vermin and parasites\nWho surface disturbing this permanent paradise\nCannibalising itself then metabolising the toxins\nAnd we're shocked when it's paralysed\nI know violence is glamorised so I have analysed and agonised on every dying man I've sliced!\n\n[Hook]\nTAKE BACK WHAT'S YOURS\nWalk through floors, walls, and locked doors\nTAKE BACK WHAT'S YOURS\n'Til warm water pours from all your pores\nTAKE BACK WHAT'S YOURS\nAll aboard, pull the oars 'til we storm all your shores\nTAKE BACK WHAT'S YOURS\n'Til your foes crawl gory floors on all fours\n\n[Verse 2]\nThere's smoke and dust choking us\nI hope it won't combust\nIt's coating the mechanism of oppression's spokes with rust\nThere's only so much that we'll let our load be pushed\nTo the overseers who oversee us I show disgust\nHow come they get the loaf while we beg below for crusts?\nI don't trust them just as far as I could throw the fucks\nAnd when stones are chucked, bones are bust, wounds are opened up\nResistance and revolt's a must\nWe're going for broke or bust\nFed up of hanging 'round shanty towns in hand-me-downs\nI'm tracking down your family if you don't hand me the crown\nToday's the day that I will finally find the fire inside\nTo come and claim what's rightfully mine\nI'm tripping the kingdom and crying for children, men, and women to rise\nYour tyranny's rivers are dry\nMy, this is a riveting sight\nIn the blink of an eye, you're going to die\nSo think of your imminent plight\nGive it a try\nI decline to give up the fight 'til the end of my life\n\n[Hook]\n\n[Verse 3]\nI'm going in\nI'm of the inclination to instigate an insubordination\nThis is an incantation; an invocation, invitation to an investigation\nI'll infiltrate, interpret and inseminate insider information\nIncite intimidation in interrogation to get an indication of the indignatious indoctrination inundated in her nation\nOf integration, immigration, indiscrimination, interrelation, and inflammation in inhabitation under industrialization\nInnocuous inoculation against an infestation\nInsinuation? Incrimination\nImplication? Incarceration\nIt's an illustration of the inculcated inconsideration incubated in us since her installation\nThe inauguration initiated intensification of inebriation imitating inspiration\nIntoxication impersonates invigoration\nInstrumental in inhibiting imagination\nInnovation replaced with irritation\nInfatuation with infuriation\nIllumination with immolation\nIncineration and inhalation of the vapour's incapacitation\nI'm impudent indemnification's insolent incarnation\nYour argument just is invalidation\n\n[Hook]", "year": "2016-11-10"}], "artist": "Dan Bull"}