{"songs": [{"year": "2005-06-28", "image": "https://images.genius.com/989cba8a29e0880306781855e77f4a35.500x491x1.jpg", "title": "I’m So Cool", "album": "Hannicap Circus", "lyrics": "[Intro: Bizarre]\nAight here we go, yeah\nThis track is dedicated, to my grandfather, Sweet Red\nWe love you.. can't nobody walk like you tonight\n\n[Hook: Bizarre]\nI'm so coooool - look at the way, look at the way I walk\nI'm so coooool - my gangsta lean, look at the way I talk\nI'm so coooool - look at the way, look at the way I walk\nI'm so coooool - my gangsta lean, look at the way I talk\n\n[Bizarre - singing]\nGirl, you don't have to have no sex (no sex)\nJust bend your body, and work yo' neck\nSee I'm so coooool.. I ain't tryin to break no sweat (phew)\nJust give you some sex, that you won't forget (ahh!)\nSo just chill.. and just roll the weed up {*cough cough*}\nIt's the way I walk, my legs ain't messed up\nSee I'm so coooool.. coolest nigga that you know (that you KNOW!)\nCause Jerry Hollywood is 'bout to go (YEAH!)\n\n[Hook]\n\n[Bizarre - singing]\nI'm the big guy with the shower cap on TV (yeah)\nAnd all the hoes, they all love to see me\nCause I'm so coooool - my sexy stomach, they love all my tats\nIn a hotel room, hittin it from the back (who yo' daddy!)\nCause I'm so coooool - all the hoes let me nut, on they clothes-es\nAnd when I fart, MOTHERFUCKERS SMELL LIKE ROSES!\n\nCAUSE I'm SO COOL! Ahh, cool, motherfucker I'm cool\nAiyyo Chav, show these motherfuckers how cool I am! YEAH!!\n\n[Hook]\n\n[Interlude: Bizarre]\nJust be cool man\nYou havin problems with your label, be cool\nYou havin problems in yo' marriage, be cool\nCause I'm cool, can't nothin fuck up my spirit, WHOO!\nI'm just gon' keep poppin these pills\nAnd livin in \"Alice in Wonderland,\" with the butterflies\nHa ha, I wanna give a shout out to\nAll them old folks, in the old folks home\nSmokin that weed when the nurse leave\n\n[Hook]\n\n[Outro: Bizarre]\nYeah, what's cooler than bein cool?\nAiyyo Proof, why don't you do that Young Legend walk? (hahaha)\nWalk like Young Legend Proof.. ahh I see you, hahahaha\nI see you, ha ha ha, aiyyo Obie! Ha ha\nAy walk like you be walkin when you walkin in the airport\nDo that airport walk.. ah-hahaha, yeah, heh\nBoy you a damn fool {*fades out*}"}], "artist": "Bizarre"}