{"artist": "9th Prince", "songs": [{"album": "Prince of New York", "lyrics": "[Intro: ShoGun Assason]\nYeah, like... yeah\nSo 740 like... yeah, yeah\nIt's like, it's like\n\n[ShoGun Assason]\nI'mma set it off like, then kill it like\nLike just the way you like and make you feel it, like\nGot fire from the gats peel, like\nIt's 740 like, Steuby Steuby like\nThe killing field like, my mentality is fucked up like\nLike I don't give a fuck, like\nLike, I don't even like you, like\nLike, you the snake type\nGive me 50 feet like, I got 25 niggas like\nThat's 50 toasters like, that's so much heat, like\nEnough to burn beef like\nTo a crisp like, the words that I speak like\nThe steps that I take, and the moves that I make\nAnd the jewels that I spit like, are so precise like\nMarksmen type, don't fuck around and get\nWesley Sniped, or get your hair cut by the blade like\nTo the white meat, like, to the grissle, like\nIt's ShoGun, Mr. Pistol, like\nDeadly the dart, like, on the mic, like\nD.D.C. like, Alibastor St. Troy\nThe first wit your bitch ass, like\nSouthside muthafucka, what up though, like\nThat's how I'm signing the fuck out though, like, like\nFor real, like\n\n[Dom Pachino]\nBlowing smoke like Popeye out his pipe\nEverything I write's out of sight, and start a mic fight, like\nHype off the white-white, my shit so dark\nYou might need a night light, like\nI don't like these imitators, Killarmy\nThe militant innovators, like, right?\n\n[9th Prince]\nI'm a legend in this rap game, all lanes\nBe aware of the unexplained\nThe Granddaddy Flow, bitches understand the name\nDragon breath niggas spitting flames that burn like propane\nNow chill, let the God build, be still\nGuns conceal, this year, yo, we gotta make a mil' like a dollar bill\nLike a dollar bill and build like Crazy Legs breakdancing like windmills\nI'm like mad skill, lay bell, now on the run like treadmills\nMe and P.R., is like Batman & Robin\nWe like Shan and Al Sharpton\nWe like swords that stay sharpened", "year": null, "title": "Like Like", "image": "https://images.genius.com/5491ced6515f8b9c5af8dbaefebec9df.300x300x1.jpg"}]}