{"songs": [{"image": "https://images.genius.com/89026ea1dc7518eef373c3891314768f.300x300x1.jpg", "year": null, "lyrics": "Yo, All the fans we love yall\nWe gon make one fo the haters like fuck that\n\n(Ali)\nOld School 9-8 and you see the Camilion\nBelow in the celing wood with wheel on\nWith a flyin bitch some old gangsta shit\nFlat screen dvds smoking stank and shit\nAin't dat shit Sunday bull tank and shit\nTop down air forces white tank and shit\nAin't nothing soft on boy stop thankin it\nI got a trophy at the playa ball banquet\nThis bank I get\nStyle we all that to the back we all that to the back\nRed or blue new wall cap\nPause that bull shit you talking bout\nBefore the people start walkin out\nIf you please we succeed regardless\nShine the hardest and I'll sign an artist\nLongevity like the BeeGee's\nPlease be awarre we don't carre\nDo you like us?\n\n(Chorus)\nNo, no, I know y'all ain't say no uh oh\nBe back in a minute wit dat chrome 4-4\nAnd when I get back everybody gone hit the flo flo\nCause I just asked him was the Tics tight and I think he just said\nNo, no, I know y'all ain't say no uh oh\nBe back in a minute wit dat chrome 4-4\nAnd when I get back everybody gone hit the flo flo\nCause I just asked him was the Tics tight and I think he just said no\n\n(Murphy Lee)\n1993 creation for steps of born leezys\nWrote rhymes in class, bored by teachers\nChurch only on easter, ignore the preacher\nDo the grown up at school right unda the bleachers\nA wild little bity doin lunatic rules\nTo this day they be like \"Lunatic Rules\"\nI'm hangin wit the dudes that done it, don't even stunt it\nYou cats stay in the back doin too much frontin\nSee you hatas like to take risk sonofabitch\nI really disc jockeys at home jockin my disc\nI'm gon pretend yall ain't heard that shit\nSchool boy 5'9 receive the hairlines and halfway rich\nI'm gon run niggas out of town\nNaw fuck yall hatas I'm gon chill til they run out of crown\nRoyal, Blue Jack right at the door\nAy yo I'm Murphy Lee can I park my car here?\n\n(Chorus)\n\n(Kyjuan)\nSwervin excursion limited fo 12's\nFo amps don't know what my limit is\nIve been packin 22's like Emmitt did\nI've been po before +No+ what a +Limit+ is\nNew engine new paint ain't them d's spinnin\nLove rims, love Lakers, who I love winnin, love women\nSpinnin grindin since the beggin no mo limits\nDrom tops cuttys on 4's\nNo love fo hoes\nChange them like clothes\nHit em like switches then I pass them on\nWe all know dats how the game should go\nWe all know most of us love the same hoes\nLike Carla the preachers daughter fucked wit the barber\nOver there on the utha side of College Encarta\nFor starters I know both yall smash\nI didn't get no ass so I had to ask\nShe said...\n\n(Chorus)\n\n(Nelly)\nI'm feelin frost bit oh shit is he in town?\nCheck the paper weather say temperature goin down\nYep that's him he come to make his rounds\nTell him how it feel ten mill skin found\nBeta not continue I can show you how\nFrank Mill aww he done flood it wit rounds\nDon't know what to call me I can think of some nouns\nMr. Hoe Hopper, Trick Knocker, Free City\nMy g's getting depp like P. Diddy\nI'm feelin like B round looking for my Whitney\nHeel I'd take a Cidney if the stash is right\nCocked fo legged and her pants is tight\nIt ain't got to be fo eva it can be fo tonight\nFirst class flight to Nellyville\nSo how it feel doin sit ups on the virgin rug\nDrinkin criss out a mug, Part boughee, Part Thug, call me Bug Ok?\n(Chorus)\n\nUh Oh\nNorth side one time let me herre ya.... Uh Oh\nSouth side one time let me herre ya.... Uh Oh\nEast side on time let me herre ya.... Uh Oh\nWest side on time let me herre ya.... Uh Oh\n\nThat's why man yo breath smell like shit\nIf yo momma breath smelled like that nigga\nShe libel to kill some motherfucker\nMan if yo momma's eyebrows look the way yo's do\nIt look like a caterpillar layin on her fo'head\nNigga yo momma snort anthrax and she still mobbin", "title": "No", "album": "Heavy Starch"}], "artist": "Ali Jones"}