{"songs": [{"year": null, "title": "Life is What Distracts You From Death", "image": "https://images.genius.com/c91c4b7e3aa8a9503855d1070f1f85cd.640x640x1.jpg", "lyrics": "Yo I got this, I got this, it goes like this, unh\nLife is what distracts you from death\nGaspin for breath\nGrabbin your chest\nNow look to God and ask him what's left?\nNo answer, now how can I pass the test?\nI can't figure out the order of this bastard's mess\nI'm feelin disasterous\nMassive stress\nIt's futile like you child trying to sell me bags of sess\nNow put that to rest\nI'm sportin rags when I dress\nWhile you're mad obsessed\nWith Tommy Hil, Polo and Guess\nGot selected best when rap was a braggin contest\nNow you could of sounded like THIS\nTo sell records act possessed\nI've blasted the best\nFast like the wild west and had intercourse with the bulletholes in the chest\nHooooes need to get their fat asses dressed\nMasters of sex\nMust have been molested ___?___ committed incest\nViolated mother earth, grabbed her ass and breasts\nGot father time ticked off the kid's soft I had to fess...up\nI never fuck with what your raps suggest they make me laugh mos def\nAs you get gassed by the press\nMe? I'm ridin on E, I got no gas left\nI had to walk my way home but I forgot the address\nOnce I got there I had no access\nTo my house\nMoms changed the lock cause of my bad ass mouth\nMy bad ass mouth? I ain't one to hold back\nI know I'm jet white for some reason my balls act bald black\nAsk your girl about 'em yo that bitch is so whack\nShe gave my spirit a disease called the sooooouuuuul clap\nThe way she does when she smoooookes crack\nYou don't believe me? look here I got the koooodak moment\nOpponents are slow to react\nLike when I got to gave a pound and you throw dap\nNow you know that\nEvery man is listenin\nChange your hand positioning\nIt makes no sense like a satanic christening\nThey panic from all the shit I bring\nYou ain't been dissed by Sage yet? just keep on listening\nI make it interesting\nThey keep distancing themselves from what I have to say\nPeace to my family members that are gone and passed away\nDay after day it makes me think about my worth and purpose\nOn this earth's surface\nSince birth, this world has been a circus\nOf three rings\nOnce Armageddon begins\nWe'll hang ourselves from the tree limbs\nWith G strings\nYou see there's too much swinging\nFrom the hips\nRead my lips\nAs you watch what I say you're hopin that my toungue slips\nBut I made Linda \"Tripp\", turned Kenneth to a \"Star\"\nSex scandals just distract you from the real problems there are\nDon't get fooled my the media\nDon't believe everythin you read or eat, everythin they feed to ya\nEmcees to me, HA, they got lazy lips\nI'mma take hip hop back to Eighty-Six\nSage Francis got you thinkin maybe it's...\nAll down hill from here just like the Patriots", "album": "Still Sick... Urine Trouble"}], "artist": "Sage Francis"}