{"songs": [{"lyrics": "[Intro: KRS-One]\nCome now\nYes, now everyone comes in and says that they are\nThe lyrical champion, but of course there is only a few that can really stand by that\nCome now\n\n[Hook]\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhymin skills (come now)\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhyme\n\n[Verse 1: D Nice]\nThe TR 808, and I cultivate with this trait\nNobody can imitate or relate, cause I'm the great (say what?)\nHere's your fate, put your weight down on it\nAnd if you try to step to me, I make you pay down pon it (bo!)\nCause I'm the one, and some compare me to the drum\nThe lyrics and bass combined will make your sound system hum\nSo when I come you should bow down greatfully\nCause even if you're protected, ya can't face the D\nCause the microphone is just a crumb in your possession\nConsidering that I take the cake in this profession\nSo here's a lesson on the bass with smooth deliverance\nAnd it's called the 'TR 808 experience' (Come now)\n\n[Hook]\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhymin skills (come now)\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhyme\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhymin' skills (come now)\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhyme\n\n[Verse 2: D Nice]\nThere's no mistakin, there's not another brother great when\nI step in the place, step out my face with the haste, and\nCause I'm the TR 808, and\nRippin' the mic up, in other words you know I'm breakin'\nNew grounds with my sounds, so don't consider\nTryin me (say what?) cause I don't pop the glitter\nOn my gear, no, not even a tiny bit\nI'm Nice, not Ice, so I don't rock the shiny shit\nI rock my Nikes instead when I strut (say what?)\nI may rock a ring when I feel, but so what?\nMy rhymes are sharp, so they cut\nYou're on my tip so much, I mistake you for my cup\nYeah\nRight about know I want all y'all suckers to know this is real\n(Yes, D-Nice, you got the rhymin skills)\nSo anyone who cannot go with the flow that I throw\nI get the dough, and oh, now you know\nI got the\n\n[Hook]\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhymin' skills (come now)\nRhymin' skills, rhymin' skills (bo!)\nYes, D-Nice, you got the rhyme\n\n\n[Outro: KRS-One]\nEase up and hold tight\nAll Brooklyn massive\nAll Bronx massive\nAll Uptown crew\nJust sekkle\nThe mighty D-Nice come down ruff and wicked\nPop this in your cassette\nThe Don [?] must rule everytime, seen?\nRhymin' skills, say rhymin' skills - come!\nYes, D-Nice, you have de rhymin' skills - come now!\nRhymin' skills, say rhymin' skills - bo!\nYes, D-Nice, you have de rhymin' skills - bo!\nNo peace till justice\nWe outta here", "album": "To Tha Rescue", "year": "1991-11-26", "title": "Rhymin’ Skills", "image": "https://images.genius.com/b2d7657f73b5437df65f81efafb363a6.400x394x1.jpg"}], "artist": "D Nice"}