{"songs": [{"title": "Half The Battle", "image": "https://images.genius.com/238b9e6cc2f4ca89654df080d14cbadf.240x240x1.jpg", "lyrics": "[Intro]\nNo one. None. The idea's become obnoxious. I watch the clock as I practice. Time slips though my fingers\nQuicker than I thought it would. Okay\n\n[Hook]\nNo one to talk to except the voices in my head\nThe voices are the ones telling me to go to bed\nNo one to talk to except the voices in my head\nThe voices are the ones telling me to go to bed\n\n[Verse One]\nI feel like a hero, I wanna rescue\nMy journey's illuminated by sentimental value\nI'm here for you, who made me like this?\nThe night gets dark enough to shut down my eyelids\nI don't give up, my shirt is your blanket\nSudden movement always keeps a quiet man alert\nYou're sleeping on my shirt, I hear it\nShades of bass in the distance\nMy patience begin to melt\nI built no room for explanation\nThe remains of my brain splash against my protection\nI'm the man in the mirror, I'm the criminal's reflection\nI'm empty, serving justice before you let me\nI barely ever get to share my poetry\nClass, put down your pencils, it's now 8:30\nIt's now 2:30, retire from your desk\nI said to go to bed, but you're headed towards the deck\n\n[Hook]\nNo one to talk to except the voices in my head\nThe voices are the ones telling me to go to bed\nYou're not smart, but that doesn't mean you're stupid\nI'm not smart, I've always been creative\nIt's not something I decided I was\nIt happened when I wrote how I was feeling cause\nI never say never, and the fact I won't say it\nIs the reason that I don't believe it\n\n[Verse Two]\nThat still doesn't explain all this meaningless time\nWhen there's no one home, and there's no one alive\nMy mind disappears yet things remain clear\nIt's part of my nature as I creep down the stairs\nThere's people under the stairs who don't seem to care\nThey say go to bed in a tone that makes me scared\nBeware, discovery destroys my purpose\nThinking about thinking, wrestling in bar dust\nI can't put my finger on it, it's part of human science\nMy life's an experiment, tears went rolling down my shoulder\nWell, I'll understand this battle when I'm older\nI'm glad when it's over, release me from this cage\nPeople always tell me that I'm mature for my age\nBut I haven't wrote one mature line on this page\nI'm just a teenage capture in a teenage stage\n\n[Hook]\n\n[Verse Three]\nI don't make suggestions, I just answer questions\nSo if you're not asking, then we're probably not talking\nFrom school to dinner was always isolation\nAnd after dinner time, everyone started sleeping\nI've beaten all these ideas into my head\nAnd it seems that by now, I should deserve to go to bed\nPhysically, with energy, there's plenty of me left\nBut mentally I've gently been beaten to death\nBut mentally I've gently been beaten to death\n\n[Hook]\n\nI never say never\n\nNever ever ever", "year": "1999-01-01", "album": "Lifefirst: Half The Battle"}], "artist": "Braille"}