{"songs": [{"album": "The Iron Way", "image": "https://images.genius.com/e85952df47bb3600fdb266b971314e87.768x768x1.jpg", "year": "2015-03-27", "title": "Ever", "lyrics": "[Verse 1]\nA thousand rounds, about a million shots\nI’m going pound for pound, so I can feel the drop like (woah!)\nBut I can’t enen feel my hands\nBut this liquor in my system make me need to go and dance\nI - wanna go, hit a thousand chicks, like I got a thousand dicks\nBut I really need just one, Imma take her to my house 'n shit\nLounge 'n shit, yeah, we gon' drink until we fall\nBut I’m gon' sip a little bit more 'cause I just can’t feel it at all\n\n[Hook]\nIs this love?\nI know it ain’t but we can say it is right now\nHow crazy is this? From the club\nNow you 'bout to have the best sex - ever (woah!)\nYou wouldn’t know I did it like that, shawty\nSo never say never\nLook out below!\nWe was just up in the club, now we 'bout to have the best sex - ever\nYou done heard it all before, I guarantee that I do it better\nLook out below!\nWe was just up in the club, and we just had the best sex - ever\nHold up, wait\nOk, you gotta go (Peace!)\n\n[Verse 2]\nBack in the club, fresh from under the covers\nMouth still smelling like pussy, hands still smelling like rubbers (Oh yeah!)\nWhat’s up shawty, come and sip on this moscato\nMe and my niggas got VIP sections, you think that we just hit the lotto (we got money, oh wait)\nGirl you need to understand, that the more that I keep drinking\nI’m gon' need to put my hands on that (whoop, go 'head)\nRight now we don’t give a damn\nBut that pussy getting gushy like you peed up in your pants\n\n[Hook]\nIs this love?\nI know it ain’t but we can say it is right now\nHow crazy is this? From the club\nNow you 'bout to have the best sex - ever (woah!)\nYou wouldn’t know I did it like that, shawty\nSo never say never\nLook out below!\nWe was just up in the club, now we 'bout to have the best sex - ever\nYou done heard it all before, I guarantee that I do it better\nLook out below!\nWe was just up in the club, and we just had the best sex - ever\nHold up, wait\nOk, you gotta go (Peace!)"}], "artist": "T-Pain"}