{"artist": "Half A Mill", "songs": [{"album": "Milíon", "lyrics": "[Verse 1: Half-A-Mill]\nKeyser Soze intention\nGlide in a hummer with the flying saucer engine\nWillied out at my crib, in the winter havin cookouts\nSmack my whiz, look out\nI'm like Barnabas, crab niggas tryna conquer us\nThey mad, cuz they jump outta cabs and hop on the bus\nCop wit us, Firm clique rock the whole Metropolis\nBitches who burn dick, won't put a stop to us\nNiggas who turn snitch, gotta run\nCoward you ain't a part of us\nSend you flowers, you part of the dust\nHard to discuss, this ill life is hard to live up\nOnce you fall it's hard to get up\nOnce you ball it's hard to give up\nSee how it all started up from stick ups\nIn father's Dodge pickup, it wasn't really my fathers\nBut the pulley made it starter kick up\nThe money made even the hardest get stuck\nThe smartest get fucked, artist for what?\nThis world is Sodom and Gomorrah, niggas ain't promised tomorrow\nOnly thing you promised is projects\nFall prophets, 50 cent beers, S.S.I. checks\nPrison bars, prison yards, knowledge thru wisdom God\nLivin large, get with the mob, ain't nothin personal\nStrictly a job, six in the heart, for six hundred lard\nWe gunnin hard, comin hard, hundreds and cars\n\n[Hook: Half A Mill & AZ]\nQuiet money, retired money\nEarth, Wind & Fire money, or quiet money\nYou wanna die, try it money\nSeven six and five money\nLive money, Ill Click to ride from me\nQuiet money, retired money\nEarth, Wind & Fire money, or quiet money\nYou wanna die, try it money\nSeven six and five money\nProvide for my Fam and my Fam provide for my\n\n[Verse 2: AZ]\nGlaciers of ice, niggas in the race for they life\nRaisin the hype, for real niggas playin tonight\nBlazin the pipe, dope fiends will blaze at your wife\nWho want what? Nigga, let's engage in a fight\nBlow fire wit the gray seal, for laid real for this spit it\nSo niggas can hit it like Curtis Mayfield\nFront door shit, we pump raw shit\nPretty portraits, nickel plate gats that gorgeous\nOn the run away, flip and run, relax on Sunday\nWho want a gun play? My mind only work one way\nRose up a wise man, got love on the streets, I van\nAnd never snitch, and never flip or even beat my man\nPlay the game for ya niggas, re-avenge ya shit\nE&J ya shit, cuz ya say ya rich, hahahaha\nSpit subliminal, school hustler, black criminal\nSmack ya general, even my bitch'll clap ten to you\nMacs identical, barely react when I'm interviewed\nIn the Q, peep on ya niggas in the new\n\n[Hook]\n\n[Verse 3: Half-A-Mill]\nI still rock Gucci sneakers, money green to match my cream\nI don't sleep, niggas just blast in they dreams\nYou couldn't match my team\nYou ain't original, you like a fluke, Ron Howard beam\nYou was rockin Bugle Boys, had nothin, like for shootin boys\nAll of a sudden you Super Boy\nYou just a pigeon in the coup\nPeace to them ill cats, livin the proof, manifestin the truth\nFirm affil', landin jets on your roof\nExceptional, got a set schedule, ganja festival\nPrime line fish and vegetable, I'm skeptical\nMy man seen it thru his Cardiere spectacles, I'm tellin you\nThis BMW life is best for you\nThe ghetto brought out the hell in you\nThe heat took over the L in you\nCopers of the wilderness, put the spell on you\nWhat's left of you? Caught in the game, is like a hex on you\nWhat's next to do? Not every one's chosen, just a few\nI know it's fucked up, when everyone's holdin, except for you\nTough luck's gotten the best of you, we livin\nHummer wit the flying saucer engine, satellite system\nHype, travel at night, thru the ninth dimension\nEvery word, precise wisdom, varies verbs in this life I'm livin\nMy dunn shoot dice in prison, I would like to mention\nMy insight is like ice that's glisten\nAnd took a page of my book and build Princeton\nUniversity, I move for this paper personally\nYou heard of me the first time your purchased a key\nFeds got pictures, and niggas holdin bitches in g's\nCut you arms off, in case you got tricks up ya sleeve\nSplit up the cheese, I got hollow tips for the dees\nPimpin disease, my bitches swallow ships in the sea\nBlack marquise, you ain't a player, you's a car theif\nStomp you wit gators on, squash you like beef\nMake it hard for your heart to beat\nSpread ya hood, darken the streets\nMarket the beats, push stars weekend\nPark in the streets, it's heat", "year": "2000-05-09", "image": "https://images.genius.com/23e45bc88de0a6f6a0ac73d6b9f6b05f.500x500x1.jpg", "title": "Quiet Money"}]}