{"songs": [{"lyrics": "[Verse One]\nThe allure of breaking the law\nWas always too much for me to ever ignore\nI've got a thing for the big-body Benzes, it dulls my senses\nIn love with a V-Dub engine\nMan, I'm high off life, fuck it, I'm wasted\nBathing Ape kicks, Audemars Piguet wrist\nMy womenfriends get tennis bracelets\nTrips to Venice, get their Winters replaced with\nThe sun...it ain't even fun no more, I'm jaded\nMan, it's just a game, I just play it to play it\nI put my feet in the footprints left to me\nWithout saying a word, the ghetto's got a mental telepathy\nMy brother hustled so - naturally -\nUp next was me...but what perplexes me\nShit, I know how this movie ends! yet still I play\nThe starring role in \"Hovito's Way\"\n\n[Hook]\n\"In the valley of my world\nYou'll be my only girl\"\nOnce again it's the life, Oh no!\n\"In the valley of my world\nYou'll be my only girl\"\nOnce again it's the life, Oh no!\n\n[Verse Two]\nI'm like a Russian mobster, drinking distilled vodka\nUntil I'm under the field with Hoffa...it's real\nPeel the top up like a toupée\nMix the water with the soda\nTurn the pot up, make a soufflé\nAll of y'all can get it like group-page on your 2-way\nI'm living proof that crime do pay\nSay \"hooray\" to the bad guy, and all the broads\nPutting cars in their name, for the stars of the game\nPutting 'caine in their bras and their tomorrows on the train:\nAll in the Name of Love\nJust to see that love locked in chains and the family came\nOver the house to take back everything that they claimed\nOr even the worse pain is the distress\nLearning you're the mistress only after that love gets slain\nAnd the anger and the sorrow mixed up leads to mistrust\nNow it gets tough to ever love again\nBut the allure of the game, keeps calling your name\nTo all the Lauras of the world, I feel your pain\nTo all the Christies in different cities and Tiffany Lanes:\nWe all hustlers in love with the same thing\n\n[Hook]\n\n[Verse Three]\nI'm like Pookie in New Jack, cleaned up with the roof back\nOn the other side of the tracks I produce crack\nStill a fiend no less, for the green i just\nGo through a thing I guess, brings out my best\nBrings out my worse, just the gift and the curse\nNo one said it would be easy, nigga livin is work\nIt's hard to not style in the Arnage, or fuck the Arnage\nWhen the Benz doors lift up from the floor\nAnd every night fake willies wanna match ya ball\nBut I'm far out of reach like Abdul-Jabbar\nI'm so into this life, you know who I are\nEvery corner, every hood, nigga ghetto superstar\nIt's the life\n\n[Hook]", "title": "Allure (Just Blaze Remix)", "image": "https://images.genius.com/02a0f82510886fabd5df0b12741b4b58.360x360x1.jpg", "year": null, "album": "S. Carter The Re-Mix"}], "artist": "JAY-Z"}