{"artist": "Casey Veggies", "songs": [{"title": "I’m The King", "album": "Live & Grow", "year": "2015-09-25", "image": "https://images.genius.com/e4635c8f2676255ecd4610e6ea16dd52.1000x1000x1.jpg", "lyrics": "[Produced by Freshchuck]\n\n[Intro Skit: Corey Jones & Casey Veggies]\nHey Casey, where you about to go?\nI'm about to go to the studio, man\nMan nigga, you know we got practice\nBro, I ain't going to practice today\nMan you miss practice again, dad gon' fuck you up\nOh well, I'm tryna do this music, man\nShit, you tripping but fuck it bro, be safe nigga\n\n[Interlude 1: Casey's Father]\nLike any parents would, we wanted our son to have more than we did. So we pushed for him to use basketball and academics to get out the hood\n\n[Verse 1]\nPicture me on my side of town with the top down and I'm riding\nAC on cause it's hot outside, got a bad one beside me\nWe done came up\nIt's been a long time coming, I'm still getting excited\nForeign whips, exotic trips, my whole family got a pot to piss\nSee I'm the one to put the blame on, I grew up getting my fame on\nThey hear me but don't see my name on it\nYou took my swag, shame on you\nIf you knew better, then lil nigga you'd do better\nMy mind right, my whip clean\nMy money match my new sweater\nWho better? They slept on me, we taking this to a new level\nI be over shit, I dropped her off and I got right back into the cheddar\nNigga this my city and I run it like Usain Bolt\nI been on tour not the videos and I always see the same hoes\nEvery track I spill my pain on it, nothing been the same for me\nWake her up in the morning and I make her tat my name on it like\n\n[Interlude 2: Casey's Father]\nAfter a while, my little man gained a strong will and different plans. It was then that he picked up a mic. I knew about the rap game and the last thing I wanted him to do was lose focus. He didn't. Not only did he make the honor, he had several acceptance letters to colleges. And a mixtape so compelling he was buzzing everywhere. He won my respect and he was allowed to pursue his dream. Now today when I listen to his music, there is no bigger fan. I'm Big Joe, Casey's father. Watch it work\n\n[Verse 2]\nA lot on my mind, I'm trying to show ya\nThat's part of life, you live and you grow\nShe sucking me slow, making me feel I'm on top of the world and I'm letting her know\nI'm a young man, shit I'm getting manners\nI just get this feeling, I don't understand it\nI'm high off life and she faded off me\nLove is a drug and I'm bout to O.D\n\n[Bridge]\nI can tell shit gon' change\nThe crazy things she would for them diamond rings\nBaby girl got her own she can be my main\nI wonder if she all the way so that she wanna stay\nThe good ones go, no I can't let her down\nI can't wait for it no, I need it right now\nShe tryna lay me down, know she a turn around\nMy mind go to different places when I spend time alone\nIt's sounding like \"la-la-la-la-la-la-\nLa-la-la-la-la-la-la\"\nWhat's on your mind, I want you to tell me right now\nLately I been feeling down and she go down\nGo down, go down\nBaby do it so good, she deserve a crown\nAnd I'm the king\n(Aw man, aw man, aw man\nAw man, aw man, aw man\nAw man, yeah)\n\n[Interlude 3: Casey's Father]\nIt took a long time for Casey to get here. The trials and tribulations of life. The things that turn a boy into a man. The things that made my son live and grow. I know you waited patiently for this album, I hope it was worth the wait. I hope you see his vision, I hope you see his vision\n\n[Outro]"}]}