{"artist": "A$AP Ferg", "songs": [{"title": "Hood Tales", "image": "https://images.genius.com/a2522ed78ae6cc4ab55e3d7bef329d06.640x640x1.jpg", "album": "Ferg Forever", "lyrics": "[Intro: DJ Drama]\nLet's get it right\nNew niggas is coming to eat up all the food\n(Gangsta Grillz!)\nMan they hungry\nIt's an appetite for destruction out here\nThe mob is equipped with full-armed artillery\nWhat ya gon' do?\n(DJ Drama, fuck these niggas up!)\n\n[Verse 1: A$AP Ferg]\nI was born in Harlem where them things pop\nAt the block parties, niggas had to run\nAnd they caught the motherfuckers on the same block\nAnd they all at the war with the gun\nR.I.P. Lil Na, Sharon, why they kill ya son?\nDamn it, if I could've did it, I'mma hit 'em with the ton\nClit-a-dick, little-dick, feeling shit, hot in you lungs\nTurn you bitch niggas to a couple nuns (lay 'em down)\nI came in the store and saw the whole thing\nHe said, I hope that you not one of them\nThen I run around the corner, got the OG's\nI told 'em, We got jumped by a couple punks\nI swear to God, these niggas softer than the Brady Bunch\nThey gon' get it, man, this shit been goin' for a couple months\nThen turn around the corner, seen a crowd looking stunned\nWith the all shaking on the floor, not saying nothin'\n\n[Chorus: A$AP Ferg]\nThis just where we from\nWe all dyin' some day\nAt a picnic having fun\nProbably dyin' by the gun\nThis just where we from\nWe prayin' every Sunday\nWhen the killas gonna come\nShe about to lose her son, son\n\n[Verse 2: A$AP Ferg]\nLet me D bop\nSpanish nigga, everybody thought he black (From the block)\nUsed to wear a tank top with a fresh fade\nOJ, kinda fat, (OJ give low)\nFace stay greasy pollo all you eatin'\nThug nigga with the Cuban on the neck\nAlways carried a tech, Dominicano\nTrappin' the bando, Orlando, he was Diablo in the flesh\nDimelo got into a little mess with D Bach\nAnd he shot up the block with the Desert\n'Bout to leave him messy but the bullets hit the belly\nYou could call me Hollywood, not \"the hood Tyler Perry\"\nNiggas making movies, more niggas getting buried\nNiggas died, Desert, but this shit ain't really necessary\nCaught up in the life, he got rich and got blurry\nHe took his own life and the one that he married, Ferg\n\n[Chorus: A$AP Ferg]\nThis just where we from\nWe all dyin' some day\nAt a picnic having fun\nProbably dyin' by the gun\nThis just where we from\nWe prayin' every Sunday\nWhen the killas gonna come\nShe about to lose her son, son\nThis just where we from\nWe all dyin' some day\nAt a picnic having fun\nProbably dyin' by the gun\nThis just where we from\nWe prayin' every Sunday\nWhen the killas gonna come\nShe about to lose her son, son", "year": "2014-11-28"}]}