{"songs": [{"lyrics": "(DJ chatter)\n\n[Verse I]\n\nCheck it, in a box marked \"divinity\", I trap the trinity\nOf honor, evolution, and serenity\nPulled the reign into me\nThis archetype hyped oddities of style\nLost child prodigy intrigued\nFatigued by a suit and tie spy claiming post-Modern peacemakers\nWith the worlds ends calibrated in their briefcases\nCase em when the sun bursts...\nAnd the populace awaited my reply:\nI spit a billion tiny, brilliant white lights into the sky (What)\nWhen your last murmurs fade like colors in graff burners\nSoon to be flustered and clustered in with comrade trash hurlers\nColor me a sideline observer, alerted not yet retreating\nAnd the climate stubbornly hovered slightly above freezing\nPenny for your reasoning, Doug, which luckily I ain't as blessed to hold your attendance\nSo I could slide my guided tenants on the one\nThat drop in the bucket boogie begun\nBrick in the wall installments draw a fallen performance\nFifth element, critical endurance\nKingpin allow only the murkiest swamp bot\nTo slip beneath the skin, this is Aesop\nRecording til your TDK stops\nWatch laboratory clone demotions dodge on natural hate crops\n\nWith the bearers of the reptile smile\nAgain and again, blendin' a friend with a fiend\nLending' a bended dream\nKeen, cold, the straight soul drenched, temper\nFuckin, back boogie, I'm a settler\nKids wanna know the Aesop Rock...\nThe off the top, prototype, straight RoboCop\nIf you're Quasimoto, and you're slo-mo to stop\nYa rock bells, I block spells casted\nIf you wanna straight flaccid pass me towards... you\nWhat? Kids wanna jet? 'Tis I, the 6 foot 4 space cadet\nAll up in you, kids wanna bend you back\nSo who's the next kid to rock upon the track?\n\n(other rapper begins, cuts out)\n(another rapper finishes, DJ)\n\nAesop Rock:\n(Verse from \"Wake Up Call\")\n\n(studio chatter)\n\nAesop Rock:\n(Verse from \"Shere Kahn\")\n\n(shout-outs all around)", "title": "Live On 89.9FM Nighttrain", "album": "Music for Earthworms", "image": "https://images.genius.com/355a2e1156bc79b1e8d0997024f4cc06.300x302x1.jpg", "year": null}], "artist": "Aesop Rock"}