{"songs": [{"image": "https://images.genius.com/b6b1954249340a8a91aa3595088a3bab.500x500x1.jpg", "title": "It’s Hard Out There", "album": "Bullets Ain’t Got No Names Vol. 1", "year": "2008-09-26", "lyrics": "[Chorus]\nIt's so hard out here\nBut I'm still breathin'\nI said it's hard out here\nBut my nigga, I ain't leavin'\n\n[Verse 1]\nLookit, I show niggas too much love, not enough discipline\nNow look at all this backwards shit a nigga in\nHomies want my head, they'd rather see me dead\nThan papered up on BET, that nigga gettin' bread\nWhat you thought? What you think? What that shit do?\nI heard Nipsey gettin' paper, is that shit true?\nYeah, he used to hustle off Slauson\nType of nigga probably deuce up on a coffin\n'Cause homies' families was hurtin'\nBut what's it worth when these niggas want you curtains?\nYeah, I know, they probably smile up in your face\nBut I know you niggas phony 'cause there's sweat up in your shake\nNigga, jealousy, how easily niggas forget\nUsed to walk through the hood, nigga didn't have shit\nI just hustled off the corner, and I stacked a couple chips\nThen I hit the parking lot, with that brand new whip\nHow you love that? Ain't you 'posed to smile for me?\nWhy you hate that? Oh, you playin' high for me\nThey say cut the grass and the snakes'll show\nIs you niggas mad at me or do you hate my dough?\nJust let me know\n\n[Chorus]\nIt's so hard out here\nBut I'm still breathin'\nI said it's hard out here\nBut my nigga, I ain't leavin'\nI said it's hard out here\nBut I'm still breathin'\nIt's so hard out here\nBut my nigga, I ain't leavin', no\n\n[Verse 2]\nWhen I was 15, my mama kicked me out and changed the locks\nHer husband used to beat on us and talk shit a lot\n\"You ain't my daddy, nigga, I ain't gotta listen to you\"\nThen my mama switched sides, like, \"Nigga, yeah you do\"\nI used to wanna stay away, used to hate to come home\nOutcasted from the family 'cause we wasn't his own\nNow that's scandalous — how you let him hit me that hard?\nAnd that's scandalous — how you let your two kids starve?\nNo lunch money, was bummy, and treated like a step-child\nLet me loose on these streets, the nigga went wild\nNo direction, false concept of family\nQuick to bust the first damn burner that they handed me\nMama, these white folks'll never understand a G\nCryin' to the judge and they still reprimanded me\nUsed to wonder why you act like you always was mad at me\nWhen cuz was the issue, but mama, I forgive you\n\n[Chorus]\nIt's so hard out here\nBut I'm still breathin'\nI said it's hard out here\nBut my nigga, I ain't leavin'\nI said it's hard out here\nBut I'm still breathin'\nIt's so hard out here\nBut my nigga, I ain't leavin', no"}], "artist": "Nipsey Hussle"}