{"artist": "A$AP Rocky", "songs": [{"title": "Excuse Me", "image": "https://images.genius.com/3054c642a320e82b70b35c53ad1cc8d5.1000x1000x1.jpg", "album": "AT.LONG.LAST.A$AP", "lyrics": "[Intro]\nFor all them hoes that was frontin' on niggas back in the days, man\n(You know I'm sayin'? This for my broke jiggy niggas right now, you know)\nExcuse me, fuck out my face\nThey say wealth is in the mind, not the pocket\nI learned that from a very wise man\n(Gotta pocket full of stones like Pimp say, this shit)\n\n[Verse 1]\nOkay excuse me, Mr. Bill Collector, I got problems\nMy check arrive mañana, I'ma pay my debt, I promise\nI spent 20 thousand dollars with my partners in Bahamas\nAnother 20 thousand dollars on Rick Owens out in Barneys\nI said excuse me, why the fuck you lookin'? What's your problem?\nI swear we gon' have drama if you touch my tailored garments\nAll you see is niggas here, so that means it's triggers there\nWhat you mean? We got weed, and codeine and bricks for sale\nI bet a lot of niggas plottin' so you know I got that heater, bruh\nDrive my side of Harlem, catch me ridin' with my Nina, bruh\nShe got an apple bottom that remind you of Bonita, bruh\nOh, you mean like Q-Tip? Now that girl my new bitch\nExcuse me, no, I believe the proper term's excuse you\nI could switch up on you niggas and start shittin' if I choose to\nThat's when the new you becomin' different since they knew you\nI guess the new me is just gon' take some gettin' used to\n\n[Chorus]\nExcuse me, I tell them they're excused\nWhat's the word around town, tell me what's the latest news\nAnd uh, who them niggas, I tell 'em we them dudes\nAin't got time to make excuses bruh we steady making moves\nAnd I, run the game even when they bend the rules\nI pay very close attention after that I pay my dues\nAnd uh, excuse me, may I be excused?\nCause I gave this shit my all, ain't got nothing left to lose\n\n[Verse 2]\nTell me why these little niggas talking like they killas, bruh\nNowadays these niggas always caught up in they feelings, bruh\nBut I stay 100 cause you know I keep it trilla, bruh\nMobbin like 2Pacalypse or Bishop how I Hit 'Em Up\nFill 'em up with lyrics, bury all my victims, kill 'em\nDig 'em up again, to say I did it\nSnitch, excuse me, mind your business, bruh\nSwear that you could get it, girl\nShe a fashion killa, huh? Killa girl, I'm a go-getter, she get it, girl\n\n[Bridge]\nFlacko, where you been? I've been thuggin' with my niggas, bruh\nFlacko, how you been? I'm still thuggin' with my niggas, bruh\nFlacko, where you been? I've been thuggin' with my niggas, bruh\nFlacko, how you been? I've been thuggin' with my...\n\n[Verse 3]\nBuggin' with my niggas, gold sluggin'\nTell me who fuckin' with my niggas\nWho run it, my niggas, fuck the fussin', they buckin' and bussin'\nNow niggas slump over Robitussin in public\nCup full of purple substance or something\nMy niggas, the only thing that move me:\n'Excuse me'\n\n[Chorus]\nExcuse me, I tell them they're excused\nWhat's the word around town, tell me what's the latest news\nAnd uh, who them niggas, I tell 'em we them dudes\nAin't got time to make excuses bruh we steady making moves\nAnd I, run the game even when they bend the rules\nI pay very close attention after that I pay my dues\nAnd uh, excuse me, may I be excused?\nCause I gave this shit my all, ain't got nothing left to lose\n\n[Outro]\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko\nFlacko", "year": "2015-05-26"}]}