{"artist": "Fat Joe", "songs": [{"year": "1993-07-27", "album": "Represent", "image": "https://images.genius.com/74218f34fc7a7f477441922b9caced21.1000x1000x1.jpg", "lyrics": "Here we go, now I'm back\nI got soul, although I'm not black\nPass the mic and I'm a spark it\nCause I'm the hottest rapper on the market\nI used to shoot dice to the curb\nPeace to my brothers on 163rd\nHold your head and stay strong\nMy main man Roadie got it going on\nSo now you know the time\nBust how I flip it, check the rhyme\nI kick the hits even with the big belly\nCause I freak the funk like my man R. Kelly\nSo give me that honey love\nYou know what I'm thinking of\nJoe's the man with the master plan\nI got more rhymes than the beats got fans\nPeace to Greg Nice and Smooth B\nAnd if you don't believe then you soon shall see\nThat I'll be the last to survive\nI won't fake the funk, I won't take a dive\nSo now you know what's up\nI make the crowd bounce and get on up\n\n\"Get on up\" \"Get on up!\" (Repeat 4x)\n\nThis is a jam for the radio station\nPeace to the whole Zulu Nation\nI'm so bad, call the cops\nI got props, I'm gonna rule hip-hop\nCause I'm the only real rap monster\nI love eating shrimp and lobster\nCity Island is my favorite place\nStep in Sammy's and dog my face\nLosing weight, that must be a joke\nCause I eat four steaks and drink a Diet Coke\nAlthough I'm big I won't take a swig\nOf the Moet, it makes me a much worse poet\nAnd you know that's not the mood, black\nDiamond always hits me with the crazy fat tracks\nSo now you know what's up\nI make the crowd bounce, get on up\n\n\"Get on up\" \"Get on up!\" (Repeat 4x)\n\n\"Get On Up\" is the name of this song\nBounce to the beat if you got it going on\nNow in '93, maybe '94\nThey'll have a Fat Joe tour\nComing to your town with the brand new sound\nRepresenting for the whole Boogie Down\nSo don't grab the mic or you'll get hurt\nIf you come in a Bez then you'll leave in a hearse\nThat's that, everybody knows the flav\nMisbehave and you'll dig your own grave\nFat Joe, chopping down trees\nNuff respect to Showbiz & A.G\nPeace to my buckwild crew from the Bronx\nI hope you'll strike me gets a good response\nAnd if you like the vibe, act like you know\nYou can get on up with your man Fat Joe, and I'm out\n\n\"Get on up\" \"Get on up!\" (Repeat 4x)\n\nTo my people from Brooklyn, get on up\nAnd to my people from Manhattan, get on up\nTo my people from the Bronx (Get on up)\nTo my people from Cali\nTo my people from Texas\nTo my people from Atlanta\nTo my people in Detroit\nEverybody in the world just get on up\n\n\"Get on up\" \"Get on up!\" (Repeat 4x)", "title": "Get On Up"}]}