{"artist": "Big Boi", "songs": [{"lyrics": "[Intro]\nShawty what yo' number is? (ohh)\nShawty what yo' number is?\n\n[Hook One]\nIf you behave I'll, take your number baby\nAnd then I'll save it, in a very special place\nGirl I hardly know you\nBut you got your very own theme song (very own theme song)\nVery own ringtone (your very own ringtone)\n\n[Hook Two]\nAnd then I'll save it, in a very special place\nGirl I hardly know you\nBut you got your very own theme song (your very own theme song)\nVery own ringtone (very own ringtone)\n\n[Big Boi]\nCome on baby, come on baby to my jungle\nProgram my name and my number, under Plumber\nAnd I'mma lock you in as the Plunger\nCause you and your mouth really do wonders\nUmm, I think I still like you baby, my drawers in the backyard\nI like a J{?} when you say hit the crack hard\nHer doggy-style pulled the black card?\nNo way we ain't tryin to take it that far\nBut you a star, and I'mma let you shine\nI see all the signs when you showed the full moon from behind\nClosed do's, come out them under-clothes\nShawty I chose you and not them other hoes\nA toast I propose to all those\nWho know the G-code and got they very own\nSha'mon!\n\n[Hook One]\n\n[Big Boi]\nHow do I even begin? Shit, I'm him\nThe B-I to the G, B-O-I, no hyphen\nAnd then be puttin that icing on your cake\nLike lightning strikes in the same place - not me\nI tell 'em hurry up and waaaave\nLike a jailhouse getaway driver with his foot on the braaaake\nDyin to accelerate\nAnd tryin to get hitched, bitch I'm tryin to celebrate\nConfiscate digits\nThen vacate the premises, this is not the way we finish this\nThis is just the genesis\nWith the most winningest player on the team but no tennis's\nI been a member since\nI turned the age of innocence and if you behave then\nSha'mon!\n\n[Hook One]\n\n[Interlude]\nNo matter where you are I hear yo' song\nAnd I'm comin to scoop\nSwoop you and sliiiide, slide inside\nSlide inside you baby\n\n[Hook One] + [Hook Two]\n\n[Outro]\nOoooooooooooooooooh\nVery own ringtone\nYou got your very own ringtone\nVery own, very own, very own\nOoh yeah~!\nI got to save your number, save your number\nSave your number, save your number\nYeah yeah yeah, save your number", "image": "https://images.genius.com/d490a9246c93be0a14dc0d13699d97a2.908x908x1.jpg", "year": "2010-07-06", "title": "Theme Song", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}