{"songs": [{"image": "https://images.genius.com/093524f55308e0c3a99f8d6f7746a3bf.1000x1000x1.jpg", "title": "Notepad", "album": "Mansion", "year": "2015-03-31", "lyrics": "[Intro]\nYou and I, we've been through a lot together\nAnd I look back and I just, uh, I appreciate all the times that...that we had together, you know?\nI remember just goin' down in my room and, you know, dealin'... tryna deal with some things\nAnd you've always been there for that\nAlways, just me and you\n\n[Verse 1]\nYou and I been best friends, ever since I was a young kid\nEverything we did, where has time went?\nGot a lot of years comin' up ahead of us and ever since we met\nI knew we'd get somewhere, but the fact is I ain't really, I ain't really know when\nI don't really know how either, but I can feel the goosebumps, my skin writin'\nAnd I've been waitin' for the moment, you and I can make it happen\nLot of people think we ain't gonna make it rappin'\nI ain't got a problem with 'em though, they don't even matter\nWe ain't lookin' for the people tryna say that we the baddest\nNo, I never liked that\nCame a long way, never did it for the money\nWe ever make it big, I'ma give it to the family\nLookin' back now everything is lookin' funny\nYou and I in the room writin', up late when the mood strikes us\nWe don't care if they do like us\nWritin' songs for the haters we ain't even got yet\nFreestylin'? Somebody turn the mic up\nTalkin' 'bout things we don't really understand\nTalkin' 'bout things we don't really comprehend\nMe and you tryna get it, we ain't quittin' 'til the end\nNow I'm standin' on stage tryna give it to the fans, yah!\n\n[Interlude]\nWe took that karaoke machine from my room and, uh, we put it up to the CD player and played the instrumentals\nAnd, man, we've come a long way\nA long way\n\n[Verse 2]\nI made a lot of mistakes, you've been there for the whole thing\nHelp me with the drama\nRappin' in the car outside daily\nWe don’t care if it’s the winter, we don’t care if it's the summer\nI remember writin' raps with the curse words\nI just wanna hear it, seems like everybody does it\nDid it for awhile wasn't into all the cussin'\nTried to find who I was, bein' everything I wasn't, real life, yeah!\nGot a lot of anger, you know where I'm at, put it all over the pages\nAnd wrote it into raps, said that we could be amazin'\nIf I give us a chance now I'm lookin' round like yeah, look at where we at\nLook at where we at now, we ain't made it yet\nBut they can hear us in the background comin'\nSome are gonna hate it, some are gonna love it\nI'ma put it in His hands and let God do the judgin', yeah\nRemember me and you, always had you in the backpack\nTook you into school writin' on you like it's nothin', a lot of people in the room\nSee me scribble on a page but they ain't got a clue, nah, they ain't got a clue\nWe at the beginnin'\nHopin' someday you and I can say we made it and we did it\nYou ain't nothin' but a notepad to me, who you kiddin'?\nI'm just runnin' out of space, I'll be back in a minute\nTurn the page, homie\n\n[Interlude]\nYou know what’s crazy is\nThis just started as somethin' that was an escape for us, you know?\nAnd now I look around and there’s a lot of people out there goin' through the same things, you know, we've been through\nNow this music we write is actually makin' an impact, it’s crazy\n\n(Oh oh, oh oh)\n(Oh oh, oh oh)\n(Oh oh, oh oh)\n(Oh oh, oh oh)\n\n[Outro]\nNF Real Music"}], "artist": "NF"}