{"songs": [{"title": "Cry for You", "album": "All Things Work Together", "year": "2017-09-22", "image": "https://images.genius.com/747844e49a25266360c34f8cab2cc4de.1000x1000x1.jpg", "lyrics": "[Pre-Chorus: Taylor Hill]\nThis thorn in my flesh\nIs the only thing I got left\nAnd it's so hard to confess\nWhen everybody thinks you're perfect\n\n[Chorus: Taylor Hill]\nBut I cry for you\nIf you feel it too\nAnd I'll cry for you\nIf you show how to lose\nThe elephants in the room\n\n[Verse 1: Lecrae]\nTake it away, I beg you, take it all away\nThe pain it causes, it makes me wish I could fade away\nIf they knew what you knew, they'd probably shun me\nI'm surprised you know it all and you love me\nI know I break your heart\nBody of death, give me rest if my heart stops\nThen it don't hurt no more, can't get worse no more\nCan't pursue all these desires, it ain't cursed no more\nNo more lies about my worth no more\nI understand the thoughts of suicide that do reside\nBut when I stop and think about my family, I feel new inside\nI promised I would die a thousand deaths 'fore I cause them any pain\nBut somehow I end up killing everything\nI cry for you\nIf you feel a dark, twisted, heart-wrenching, hate-to-see-your-own-reflection\nPraying for an intervention, feeling guilt and feeling shame\nI just call on Jesus name\nPraying daily, can you take away this pain?\nTake the thorn away\nStill, it remains, I\nFeel the same, I\nKnow that I'm here, but\nStill feel insane\nSatan would love to see me give up and throw up my hands\nHe say I'm guilty but You say I'm clean\n\n[Pre-Chorus: Taylor Hill]\nThis thorn in my flesh\nIs the only thing I got left\nAnd it's so hard to confess\nWhen everybody thinks you're perfect\n\n[Chorus: Taylor Hill]\nBut I cry for you\nIf you feel it too\nAnd I'll cry for you\nIf you show how to lose\nThe elephants in the room\n\n[Verse 2: Lecrae]\nYeah, Sunday morning, or Sunday mourning?\nI woke up dead inside from all the hurt I saw before me\nEvil tryna take away my testimony\nStarin' at my phone, feelin' like a phony\nOh, I cry for you, I would die for you\nTo escape the pain I feel from all that I've been through\nI feel it in my soul and in my chest\nTake away this ugly thorn inside my flesh\nGive me death\nBut grace is sufficient to start my mission\nI'm so far from perfect, can't believe they listen\nBut hear a broken man 'til your healin' happens\nAnd hear a liar tell you truth to bring you gladness\nI could never boast in my accomplishments\nI can only hope in God with confidence\nOpposite of optimist, U and I are consonants\nBroken all the vowels, deservin' of every consequence\nWill you cry for me, or will you judge me?\nWill you throw stones at my head, or will you love me?\nI could never be everything that you wanna see\nBut crooked sticks draw straight lines, just look at me\n(But crooked sticks draw straight lines, just look at me)\n\n[Pre-Chorus: Taylor Hill]\nThis thorn in my flesh\nIs the only thing I got left\nAnd it's so hard to confess\nWhen everybody thinks you're perfect\n\n[Chorus: Taylor Hill]\nBut I cry for you\nIf you feel it too\nAnd I'll cry for you\nIf you show how to lose\nThe elephants in the room"}], "artist": "Lecrae"}