{"artist": "Angel Haze", "songs": [{"title": "Impossible", "image": "https://images.rapgenius.com/0b3b34f76c5cf788795fb41a2eebb8d1.493x490x1.png", "album": "Back to the Woods", "lyrics": "[Verse 1]\nThere is no part of me left in my brain\nI am outside it, man I can't complain\nI have seen so much you cannot contain\nOr even create or even explain\nFuckboy I'm wild as a buck in the rain\nWild as a fox who be runnin' with rabies\nWild as that pedo that's scopin' your block out for months\nCause he's plannin' to eat all your babies\nSorry I'm crazy, but I open my third eye\nAnd the view is amazing\nI mean poppin' them bars can turn blues into greys\nAnd I say what I mean and I do what I say\nDo you know all the things I could do in a day?\nI'm prohibited, nigga, I usually stay\nWith bitches whose daddies keep two in the safe\nCry for the kid 'til they're blue in the face\nHop on the jet then I flew out the states\nLaid on a beach with a view of my face\nConsidered suicide, I do that these days\nI thought about what I could do with my grave\nGoogle search how to make a grenade\nToggle my aim, scribble some names\nTook a few breaths, blew out some steam\nAnd I sent that shit out and I blew up the game\n\n[Hook]\nI am a little bit out of my brain\nMan this shit's a problem, man this shit's a problem, man\nI just threw, did you not understand?\nThat this shit's a problem, man this shit's a problem, man\nI just rose from my ashes again\nDefeat all my obstacles, 'feat all my obstacles\nThere is nothin' that can't hold me down\nThis shit is impossible, shit is impossible, man\nIt's impossible, man\nShit, shit, shit is impossible, man\nIt's impossible, man\nShit, shit, shit is impossible, man\nIt's impossible, man\nShit, shit, shit is impossible, man\n\n[Verse 2]\nI am a sickness, man: I am a cancer\nSee, I know the devil, man: I am his handler\nYou should not try it, man I have your soul\nI really show you the realm of disaster\nI am a junkie for fuckin' semantics\nI smoke all the flowers, I fill out the pasture\nI got my middle finger up to white America\nBut tryin' to whitewash my blackness\nFuck you, you could never break me\nWhat you mean, my nigga?\nThought I told you I'm not human\nI'm machine, my nigga\nGo brrratata, boom, bop, bop, bang, bang, bang, my nigga\nThink these honkies here don't got us on no genes, my nigga\nWhen it all falls down, I'm a free soul\nNow can't nobody take that from me\nNot a price in the world, not a diamond or pearl\nAin't a lot that could take that for free\nI am wild in the jungle with Tarzan and George\nChillin' high in the trees with a bundle of whores\nAnd I only come back home for fun when I'm bored\nBitch, I'm made from the flowers, I just rose from the thorns\n\n[Hook]\nI am a little bit out of my brain\nMan this shit's a problem, man this shit's a problem, man\nI just threw, do you not understand?\nThat this shit's a problem, man this shit's a problem, man\nI just go through my options again\nDefeat all my obstacles, 'feat all my obstacles\nThere is nothin' that can't hold me down\nThis shit is impossible, shit is impossible, man\nIt's impossible, man\nShit, shit, shit is impossible, man\nIt's impossible, man\nShit, shit, shit is impossible, man\nIt's impossible, man\nShit, shit, shit is impossible, man", "year": "2017-03-27"}]}