{"songs": [{"year": null, "title": "Cafe Girl", "image": "https://images.genius.com/af357ab92dde48966f2efd2335518e9f.268x268x1.jpg", "lyrics": "Author: Sage Francis\n\nWe walk as two, but we'll leave one set of tortured footprints/\nNow here she comes...walking through the door...giving that look. Since/\nI roll with shook wimps...I'm shaking in my boots/\nKids are behind me eating steak and soup, talking 'bout beatbreaks and loops/\nAnd I wanna' turn around...join in on the convo, but I ain't got jack to say/\nAnd it's sad to say...I'm just a poetry fag actin' gay in my black beret/\nI just came to this wack-ass café /\nTo drink an ice coffee and kill a bit of time before the matinee/\nWhy oh why did I need Cappaccino Cooler?/\nNow I'm trying to avoid eye contact. Lets see if I can fool her/\nI put a look of concentration on my face as I scribble on a napkin/\nSquinting my eyes, acting like I'm really serious about this mess of non-sensical pen action/\nA web of chicken scratch and ink blots/\nIs she still there? Standing awkwardly glaring? I think not/\nLook up....think again. Shit...now when/\nIs she going stop making me waste ink from my pen as I sit and pretend/\nI knew I should have come with a friend. I shrink and I send/\nMyself into meditation...and I'm on the brink of Zen/\nIs she buying it? I pick up my empty glass...tilt it..and drink the flem/\nShe's STILL scoping! in fact, this chick's a 10/\nAt least in my book...which isn't all that well read, but it's been said /\nOnce she gets her grip on men they simply bend/...backwards\nShe attracts nerds, jocks, substitutes and student teachers /\nWho all profess their love for all of her protruding features/\nThere's no fooling this creature, she's WAY fine/\nSo dope, I'd have to smuggle her across state lines or else pay fines/\nWhat's holding me back is what I heard through the grape vine/\nShe's a non-conformist freak who only comes out in the daytime/\n\n\"Don't look at me.\" I can feel the burn of her stare on my sensitive skin/\nI'm anti-social and I don't know how conversational sentences begin/\nPlus, I'm allergic to the medicine of sexual healing/\nThis impotence is sickening. She's sensual...appealing/\nNow I'm covering up my crotch region by crossing my legs/\nLost in thoughts of whores in my bed. It's awful...so I'm forcing my head/\nInto my forearms. I should...invite her for a cup of Joe/\nIt would do more harm than good...I just know/\n\nI mean...she's no Natalie Portman, and I've been kind of holding out for her/\nNaturally...Now my thoughts spin...and she's on the \"out\" for sure/\nGradually...contort my mindframe so no doubts occur/\nI activate testicular bravery and I shout to her/\n\nOur eyes lock\nAnd time stops.../\n\nShe floats over to my spot...\nAnd I say \"Hi, I'm not/\n\nTrying to hit on you like the way all these other guys jock/\nI just wanna' let you know...I'm the type of person who lies a lot/\n\nSometimes I fart and I pick my nose like a maniac/\nI'd be glad to front the cost of a date with you as long as you pay me back/\nIf we ever reach the friendship level where things like that are shared/\nAnd I know my facial hair is weird...but I've been waiting for someone like you to shave my beard/\n\nI'm usually more discreet about my insecurities, but today...I just ain't prepared.\"/\nIn all honesty...this dame just stared/\nAnd I was like \"Uhhh...yeah.../\nSo ummm...heh...\"\nNervous twitches were initiated and out nostrils flared/\nOur eyes started wandering and I was rocking in my chair/\n\nI just continued on scared that I lost her...in my upfront approach/\nShe looked at my napkin and noticed what I wrote/\n...which was nothing\nI said \"The funny thing is...I could have used you as a muse/\nWrote you sonnets in iambic pentameter and then produced/\nMass amounts of unsent love letters and out-of-tune love ballads/\nSome valid...but most just to get you thinking of marriage/\nIt's untrue. I don't want to create a first impression I can't live up to/\nI...just...wanna...\n\nShe said \"Nuff said. I'm a theme park. Ride me until the sun sets.\"/\nSo I jumped up on her shoulders as we exited the entrance", "album": "The Known Unsoldier...Sick Of Waging War"}], "artist": "Sage Francis"}