{"songs": [{"year": "2017-12-14", "image": "https://images.genius.com/b90ef37f23b9fc6775e3e426d96c29a4.1000x563x1.jpg", "title": "Black Thought Freestyles on Flex | Freestyle #087", "album": "Funk Flex Freestyles", "lyrics": "[Verse]\nUh, I'm sorry for your loss\nIt's a body dead in the car and it's prob'ly one of yours\nThe writing all across the window and the walls\nWhether it was true or false, we shouldn't have got involved\nRemember, we walked past the teacher, take the chalk and laugh\nWe wrote punishments: \"I will not talk in class.\"\nNow it's pistols punishin' people for talkin' fast\nAnd all these innocent bystanders is haulin' ass\nI hate to say I told y'all, but I told y'all\nThings fall apart when the center too weak to hold y'all\nI'm just collectin' what you owed to my old jawn\nYou 'bout to get swooped down on and stoled on\nFools swear they wise, wise men know they foolish\nWell, we was headed for the web, even before computers\nI never thought you'd give me a reason to do this\nCain and Abel, Jesus and Judas\nCaesar and Brutus, I see intruders, avert your eyes\nI told you keep out of the hood: circumcise\nHow could you sleep? I thought you always was the first to rise\nAyo, you heard the line, \"Everybody plays the fool\"?\nWell, I'll be that exception to the rule\nThe principal that hand-deliver lessons to the school\nI was makin' major moves, my dollar déjà vu\nMy mission when my ambition was brandishin' a tool\nTo be a icon, wearin' slippers made of python\nGet mine quicker 'cause I'm slick as a pipeline\nTransportin' the oil, tribulation and toil\nHit the operation, but I'm back in the soil\nGot my crown tilted, my gown quilted, silk with cashmere\nBurnin' Rome down in a minute, built it last year\nNewsflash, I dodged the bullet that killed the cashier\nMy homie told me to come with him to the masjid\nThem brothers said, \"Don't go from written bars filled with rage\nTo primetime television and your gilded cage\nThen forget it's people in the world still enslaved.\"\nI barbwired my wrist and let it fill the page\nGun fire and flares, sirens glare\nI'm in a iron chair where people who care don't get the lion's share\nWhen I don't give a fuck then I ain't fair\nI'm on a higher tier with people gettin' money like the financier\nCatch the herald, I'm fresh chopped and beveled\nRap on a doctorate level, so F. Scott Fitzgerald\nMaybe I'm the new Rakim, maybe I'm fat Pharaohe\nUndergarments of armor be my intimate apparel\nPre-Kardashian Kanye, my rhymeplay immaculate\nSame cadence as D.O.C. pre-accident\nMaybe my acumen's on par with Kool G. Rap and them\nGive me the proper respect, mothafucka, we back again\nFor a couple things we lost in a fire\nThe drive, the desire to perform on a higher\nPlateau, I'm at that show lost in a mire\nWonderin' how we got so far from inspired\nLook, when photos were sepia-toned\nAnd record players were somethin' you would keep in your home\nYo, the traveler, the meaning of Tariq he was known\nFor the exemplary performance uniquely his own\nI made the twenty-one pound for some a newfound religion\nWhere money's put down, it's only one sound that make\nOGs and young lions equally proud to listen\nThe secret amalgamism of algorithm\nComin' from where only kings and crowns permitted the darkness\nWhere archaeologists found my image in parchment\nRolled into a scroll, holdin' a message for you\nIt said, \"The only thing for sure is taxes, death and trouble.\"\nThe anomaly sworn solemnly, high snobbidy\nFreakonomics and war policy, dichotomy\nThat's Heaven and Hades, Tigris and Euphrates\nHis highness, the apple of the Iris to you ladies\nAs babies we went from Similac and Enfamil\nTo the Internet and Fentanyl\nWhen all consent was still against the will\nI got that detox for y'all\nThe microphone doctor, black Deepak Chopra\nI'm a griot that make you wanna peacock your arm\nEvery heavy dignitary payin' me top regards\nBoy, I'm three optics far from your binoculars\nSo that smart money finna get the heat out the car\nYo, I'm K.Dot Lamar meets 2Pac Shakur\nGot profiled by a few cops, too hot to charge\nListen, somebody said a price tag was on a rapper's head\nSo we gon' see a nice bag when the rapper dead\nThe mask black, the flag green, black and red\nThey'll probably wave a white flag after plasma shed\nNo doubt, yo the game went they own route\nI can't explain what these lame kids is talkin' 'bout\nOr how they fit they whole foot into they own mouth\nI put a couple bodies in a brown bag, then I'm en route\nI'm sneaker shoppin' with my son, a size 8\nPrior to they release 'cause why wait?\nLook, in my estate I got electrified gates\nFor these blasé guys hatin' at a high rate\n'Cause I dodged fate, then got great, the fly's straight\nIf we ain't family or friends then we don't vibrate\nAnd I'm that gun in y'all face, none of y'all safe\nIf I catch you at the right time in the wrong place\nSlippin', sippin' on somethin' with a strong taste\nLike Whiskey or bootleg Bourbon with a corn base\nMy Levante resemble a vehicular threat\nThe mic I spray resemblin' the sickle of death\nIt ain't strenuous to come from a continuous breath\nI set fire to the venue, I'ma spin you and step\nRinse, repeat, you checkin' for the sound of the beast\nI'm the hound, I'm a creep, I get down, I'ma eat\nI'ma keep somethin' to lay a naysayer to sleep\nPlayin' with heat, nobody and nothin' fuckin' with 'Riq\nYo, these weaklings is claimin' they cuttin' up in the street\nNigga peace, you ain't workin' with nothin' but the police\nListen, you ain't finna be nothin' but the deceased\nListen, you in interment with a permanent crease\nI strike fear in the hearts of rap figures\nWho mind bare the stigmas of time, no black privilege\nFrom boom bap niggas to trap niggas\nYou in the trap with us, when the lines is as vivid\nAs the walls on the graph, autographed by the Lord of Wrath\nI reside between the seconds on the chronograph\nHow much more CB4 can we afford?\nIt's like a Shariah Law on \"My Cherie Amour\"\nHow much hypocrisy can people possibly endure?\nBut ain't nobody workin' on a cure, my young bull\nY'all just regular, I'm an apex predator\nBrim stay fresh, feathered up, etcetera\nNevertheless, I got a message and left\nOne dead messenger, yep\nMy pen is Henry Kissinger, Buzz Bissinger\nLook, my caporegime is to no redeem\nAnd my oldest son Ahmir Saleem out of New Orleans\nTook a golf cart to the Baccarat from the Waldorf\nWhat was on the wall? That depend on what you call art\nI'ma say 300k ain't even in the ballpark\nI charge more just for awkward small talk\nSo yes, who's fuckin' with it if it's not the best?\nI get the lobby painted fresh upon my request\nIt's Kafka-esque, his holiness, stop the press\nThat Cobalt blue, reminiscent of Makkaresh\nLord, we got Padma Lakshmi for you\nLet her massage your back with black seed oil\nThe foundation is firm, the flags need soil\nMe? I need royalty because I bleed royal\nGo through the veins to the brain, fabulous and strange\nMy journalistic range is a catalyst for change\nIt got anybody that listen pissin' flame\nAnd 'cause the Hall of Fame got so many missin' names\nI'll acknowledge the original People's not Oliver\nY'all go get the next challenger for Excalibur\nI'm more policed for my core beliefs\nThey tried to capture me\nAnd brand me on the cheek with a fleur-de-lis\nThe side of my heart'll be more discreet\nI'm international, my passport page is like War and Peace\nI've always played my part from the start\nBack in Philly where the triggers is mandatory to spark\nWith a slightest inflammatory remark\nI have you and the livin' a category apart\nListen, a grain of salt'll tip the scales, it never fails\nWalk on egg shells, sleep on a bed of nails\nCriminal records like record sales\nMakin' heads or tails, we like Henrietta Lacks up in the cells\nMy mother was a working class, very lovin' woman\nWho struggled, every dinner coulda been the last supper\nI come home, chasin' good-for-nothin' half-cousins\nAnd then walk in the crib to the smell of crack cookin'\nShe was introduced to that substance abuse\nOn some of the strongest drugs that the government produced\nLook, I even got excused by the principal\nMy story is out of the dub dub interview\nI've seen some ice-cold summers, hot winters too\nI never thought I'd win Grammy Awards with The Roots\nI never thought I would be gettin' long in the tooth\nMy OGs told me, \"Boy you better go and live your truth!\"\nI am a walking affirmation, that imagination\nAnd focus and patience gets you closer to your aspiration\nAnd just 'cause they give you shit don't mean you have to take it\nMy words capture greatness, sworn affidavits\nYours truly, the celestial bein'\nYou stay seein' pullin' up in the fresh European\nHigh-steppin' out of it dressed to a T and\nNot another got more soul, 'less you Korean\nI’ve been havin' visions of Nat Turner holdin' his master’s head\nLike Yorick and Horatio in Hamlet\nSmackin' it like a tennis racket, underhanded\nSend a message through the Gram: ''The Eagle has landed.''\nDressed in a military jacket made of canvas\nI am no guerilla, I just make 'em go bananas\nOutstandin', red, black and green bandanas\nCocked hammers, hairs on my chin is antennas\nCan't manage the weight of war, they're just out ballin'\nLook, I'll fall up from the sky to see my callin'\nI'm not crawlin', I'm a free man like Morgan\nSeein' manhood in the hood is a damn good bargain\nIf a black man don't tap dance\nAnd every girl that got a fat booty don't lapdance\nWell, I guess it's somethin' wrong, huh?\nNiggas completely uninformed\nI don't burn bridges, yo I keep the haters' runnin' for em'\nI ain't one of y'all peers, I'm the sum of all fears\nSomebody stronger than me? Who that? I'm all ears\nLike Obama, I wish he had another four years\nY'all some jolly good Hollywood Squares\nI'm like, ahem, approach the altar with your offering\nI spoil rappers rotten like my only offspring\nBeing his excellency gets to be exhausting\nYou in the residency of the one they call King\nDada, Ali Baba, the talented Mr. Trotter\nInside of my right palm, the mark of the stigmata\nBig Poppa, wig chopper, emperor Jaffe Joffer, muhfucka\nI'm stronger than the coffee out in Kaffa\nAll y'all niggas vagina-hot, remind me of Icona Pop\nI step in the booth, I'm a bull inside a China shop\nMollywhoppin', watch another cotton pickin' body drop\nEvery time we rock, yo they actin' like it's Mardi Gras\n'Til the party stop, skirt off like she that Ferrari drop\nSoul Cycle pumpin' that Earth, Wind & Fire ba-di-ah\nCoolin' 'pon the dock, à la marina, hard body yacht\nYou seen another rapper cleaner, mami? Prob'ly not\nHow it feel to be the best that did it, I admit it\nI'm visitin' from planet Bring-These-Niggas-Death-In-Minutes\nAnd y'all know I'm exquisite, wicked as Wilson Pickett\nThe sickness I exhibit, I'm too legit to quit it\nI don't fake it 'til I make it, I take it to the limit and break it\nNever timid, what I'm 'bout, I represent it\nInfinite just like Chace is, been a million places\nConversation is how beautiful my face is\nPeople hated on how sophisticated my taste is\nThen I pulled up on these mothafuckas in a spaceship\nPantomime, I'm made of elements you can't combine\nI'm at a level of intelligence you can't define\nEinstein, Shakespeare, Voltaire, Tesla\nRecording artist slash psychology professor\nI preach for the East, never fold under pressure\nThe beast from the East and I glide like Clyde Drexler\nAyo, my new name is eighty five X's\n'Cause I'm the rap game certified specialist\nWhen I was reckless I was worried 'bout the guest list\nI'm helpin' rappers everywhere fulfill a death wish\nYo, Flex, I'm glad we made contact\nMy nigga, also know this shit for Combat\nBrain matter contain too much data\nI tell a story like fingerprints and blood splatter"}], "artist": "Black Thought"}