{"artist": "R. Kelly", "songs": [{"album": "Chocolate Factory", "year": "2003-02-18", "lyrics": "Baby, it's nobody like you\nYou're a good friend, you know\nYou been there for me from the beginning\nThis is why I love you\nI mean I place no one above you\nYou know what I'm saying\nAnything you want you just come to daddy\n\nListen\nWhen I discovered you, I discovered a piece within\nJoy like no other, you are my closet friend\nIf you were a number you'd be a perfect 10\nRight out of the blue skies you were heaven sent\n\nThe way we made love over and over again\nIf I had to describe it wouldn't know where to begin\nI am so proud to be your next of kin\nYou prayed over me when I had no reason to live\n\nCandy carmel coated, taf-fies, chocolate covered strawberries, love so sweet you're my chocolate factory, gum drops\nMixed with chocolate, milk bars, there's so much variety love so sweet, you're my chocolate factory\n\nWait a minute baby!\nNow if I could write a book on how you make me feel\nThe title would read a strong black man and that's for real\nI've been going round and round just like a ferris wheel\nBeen in and out of relationships but you're that deal\nBut ain't nobody else on god's great earth for me\nHeaven stirred us up together and made the perfect chemistry, wouldn't change you for the world as long as I exist, you're always in the kitchen cooking up my favorite dish yeah\n\nCandy carmel coated, taf-fies, chocolate covered strawberries, love so sweet you're my chocolate factory, gum drops\nMixed with chocolate, milk bars, there's so much variety love so sweet, you're my chocolate factory\n\nYou're that puzzle piece that completes me, girl you set my soul free, girl\nYou're everything, girl you're everything that I could need, you're my escape when I wanna be free, when I wanna\nBe free, you're full of dainty treats, like peppermint, sweet tarts, big blues, red hots\n\nBaby you are! Wooo-ooooooh!\n\nCandy carmel coated, taf-fies, chocolate covered strawberries, love so sweet you're my chocolate factory, gum drops mixed with chocolate, milk bars, there's so much variety you're so sweet, you're my chocolate factory\n\nListen, I went over the rainbow, found my pot of gold\nHear me baby, yeah, sweetheart, said I'm just like a kid in a candy store\nSweet – baby Oooh Hey You are my – Said You are my - chocolate factory Yeah\nBaby please believe me. Said you are my, you are my chocolate factory. Love so sweet, all those little dainty treats yeah yeah yeah yeah", "title": "Chocolate Factory", "image": "https://images.genius.com/c23c7ad166aff9317b7dbbc35ffe83db.1000x1000x1.jpg"}]}