{"artist": "V-Nasty", "songs": [{"title": "Not Today", "year": "2012-03-04", "lyrics": "[Intro]\nBitch, you keep calling me! This shit is hella irritating, god damn\nThese hoes just be crazy nowadays Sheesh!\n\nBitch, stop hittin' my phone, hoe leave me alone\nI'm high up in my zone, can you please not call my phone?\nWhat the fuck bitch, I don't even like you\nYou keep hittin' my phone gone make me wanna fight you\nI just woke up and you callin' with that bullshit\nYou remind me the reason I walk round with a full clip\n\nIrritating bitch gone make me want a new bitch\nI'm hopin' she a cool bitch cause girl you are just through wit\nI'mma hit you next week, cause bitch you are just crazy\nYou are not my lady, tomorrow is a maybe\nBut bitch you gotta pay me, so I hope you pay\nCause if you not, then its not your day\n\n[Hook]\nNot today, not today\nBitch, no, not today\n(x2)\nGirl, get up out my way, ho\nNot today, ho\n(x2)\nNot today, not today\nBitch, no, not today\n(x2)\nGirl, get up out my way, ho\nNot today, ho\n(x2)\n\nTomorrow, might be your day. Call me, I might be feelin' great\nYou got some dope? Well that's good\nMeet me at 12, I'll be in the hood\nNot today, though, I'm with my other bitch\nYou a ugly ho, I'm with my gutta bitch\nYou keep textin' me, on some funny shit\nYou distractin' me while I'm with my money, bitch\n\nWhat you say? You at my mama house? Aw hell nah, you just started drama now!\nWatch how she come outside with them fuckin' choppas out\nYou a dumb ho, girl you should have watched your mouth\nAll I said was, not today, now you got my mom outside about to catch a case\nGot a bad bitch, you quick to be replaced\nHo, you is a dirty bitch, you quick to be erased\n\nNot today, not today\nBitch, no, not today\n(x2)\nGirl, get up out my way, ho\nNot today, ho\n(x2)\nNot today, not today\nBitch, no, not today\n(x2)\nGirl, get up out my way, ho\nNot today, ho\n(x2)", "album": "Doin Numbers", "image": "https://images.genius.com/8028fa16ee73fe0c1fddcba9f9c9fab0.500x500x1.png"}]}