{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/5b472f0faec75a7ea8e5ca246c5f8acf.1000x1000x1.jpg", "title": "Developing Story", "year": "2013-02-25", "album": " The Psychic World of Walter Reed", "lyrics": "[Intro]\nAyo, turn that TV down\nHere is fifty thousand dollars, let's do this\nI want him dead, nah mean?  Don't even worry about it\nYou going to take him out? Yeah\n\n[Verse 1: Killah Priest]\nAmongst the heat busting\nWeed functions, street discussions\nA fleet's coming! Niggas keep hustling\nOne rushing, his head blooded, his eyes all wild\nThe night sky had a devil-like smile\nRain, lightning stabbing at the earth\nWhich takes us down to an area where murderers lurk\nAnd burglars search through bottomless pockets\nAll alone apartments, a place well known,  controlled by crime and convicts\nA place we all familiar with, it's called the projects\nNow take a look at the scene, that's in progress\nA black Chevy slowly brewed around the block\nHolding four killers with loaded up Glocks, they scoping the spots\nTheir eyes were gouging the city housing, for areas least allowed in\nMore less, least the crowded\nFrom the distance heard police sirens, quickly faked the silence\nThe night's air became every thug's greatest challenge\nEach assassin wore the face of violence\nThey found the spot, then they docked\nEach killer leather missed they mark, they quietly submarined around the park like a shark\nBestowed through the dark\nFour hooded shadows, high against the crack wars in war apparel\nThese outlaws travel\nEight silent, creaped upon the back of the lobby door\nWhen on the other side lays all kinds of war\nNines and razors, guns galore, ones with lasers\nCooking strangers, look at danger\nGangsters and gamblers, Hustlers are servicing customers\nMurderers and grandmothers, smugglers and grams and others\nBlocks away, the noisy street murmured\nThey took out their burners, perfect time\nTheir mood was fact, murder\nThey spot two, they crack workers\nPlaying games of chance, they quickly advanced\nThey stalked cat-like. Ass tight amongst the crack pipes and scattered dice\nThe lobby domino with stairs, a vague trace of weed fumes hung in the air\nEach heart played a game of truth or dare\nEyes surveyed the place, for a familiar face, and traps\nEach clutching they gat, cause everybody strapped\nThey spotted the hit, eyes were fixed, let the other three knows this was it\nA smile twitched, ghost-like, at the corners of his mouth, before he shot the dude name out. The kid slid out\nHe crouched as he squeezed the trigger\nIn a sudden all types of death, and bleeding niggas\nBullets hissing, like locked snakes\nHands suddenly stopped on the clock of faith, his body rocked away\nHorrific sight, reporters said the grizzy murders, happened last night\nEleven shot, now pronounced dead, bottom beds\nFrom pounds and bread, to rounds of led\nNow the soul's dragged down by hounds pulling the sled\nThe sun brought forth, the power on the streets, the newspaper read..."}]}