{"artist": "G-Eazy", "songs": [{"title": "Good For Great", "album": null, "year": "2010-11-22", "image": "https://images.genius.com/fd7ed1a82cc621a07ef0ec67ae88b145.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, Yeah, Let's go\nI've got some homework to do that I prolly should be doing right now\nBut I feel like I'm gettin' more out of life doing this shit\n\n[Hook: Matt & Kim]\nSo many books that I didn't read (So many books that I've never read)\nBut theres so much air I chose to breathe (I've been all over the world)\nHow about the colors that I've seen (If you could see what I've seen)\nSo I'll leave these pages in the trees\n\n[Verse 1: G-Eazy]\nAnd with all due respect to my professors\nFuck school, as of now this my conjecture\nI learned from adventures\nMore than I learned from your lectures\nAnd I only put in effort to alleviate the pressure\nI'm talkin' 'bout the pressure that society applies\nGo to school, get a job, then retire, then he dies\nI'd rather live fast than be entirely surprised\nThey tell me I should plan ahead, then I would be wise\nWhat 'bout a rainy day? What can a cyclone store?\nTo turn the rain to sunshine I'm known for\nThey tell me if I stay in school, I'd grow more\nBut still ain't made a good case, iPhone 4\n\n[Hook: Matt & Kim]\nBooks that I didn't read (So many books that I've never read)\nBut theres so much air I chose to breathe (I've been all over the world)\nHow about the colors that I've seen (If you could see what I've seen)\nSo I'll leave these pages in the trees\n\n[Verse 2: G-Eazy]\nAnd I just want to live my own life instead of living yours\nI mean, isn't that what free will is given for?\nMy lifestyle's changin' now, I'm stayin busy more\nThis time last week I was openin' the Drizzy tour\nShameless plug, but word up that shit was cool\nOn the road for about a month skippin' school\nTill I check my inbox and my teacher wrote\n\"Can't miss another class and still pass.\" This is a joke\nThis opportunity was huge\nTeacher why you hatin' on me now, what a douche\nYou mean I gotta leave this fun trip\nAnd all these fools I hung wit\nOnly simply to return back to this fuckin' dumb shit\n\n[Hook: Matt & Kim]\nBooks that I didn't read (So many books that I've never read)\nBut theres so much air I chose to breathe (I've been all over the world)\nHow about the colors that I've seen (If you could see what I've seen)\nSo I'll leave these pages in the trees\n\n[Verse 3: G-Eazy]\nThe real world's what he faces\nFuck a classroom, I learn more going places\nTryna gain information\nRefuse to let college stand in the way of education\nWord. Teachers say thats just my point of view\nBut I'll still be in debt when I'm 32\nSo wait, You mean to tell me that if i stay in school\nI could maybe grow up to be just like you\n\n[Hook: Matt & Kim]\nBooks that I didn't read (So many books that I've never read)\nBut theres so much air I chose to breathe (I've been all over the world)\nHow about the colors that I've seen (If you could see what I've seen)\nSo I'll leave these pages in the trees"}]}