{"songs": [{"title": "Clean Up Man", "lyrics": "[Young Buck]\nAiyyo you niggas done ate long enough\nG-UNIT! OHH!\n\n[Hook]\nAYYY, I'm the clean up man!\nIt ain't too many niggas that can do it like I can\nWhen them records ain't sellin and the stitches start tellin\nMotherfucker they yellin - GET 'EM BUCK!!\nGrindin grindin, I can make it happen\nCause I'm - grindin grindin, I ain't only rappin\nMan I'm - grindin grindin, you know who to call\nI be - grindin grindin, this is for my dawgs\n\n[Young Buck]\nWhat's goin on with the Unit these days? (let 'em know)\nWell I'mma tell you e'rybody gettin paid\nAnd I hear you niggas talkin, prayin on our downfall\nTook a couple losses, still we some outlaws\nYa bitch still lovin my swag\nWe let you niggas eat, why the fuck is you mad?\nI never left the streets, I really ran to 'em\nAnd since I know they watchin me I let my man do 'em\nMoney, a house and a bad bitch\nWay 'fore the rap game man I had this (niggas know)\nYou don't know about bein broke\nStandin on the block sellin fiends soap\nHolla at me\n\n[Hook]\n\n[Young Buck]\nLet's sip the 'gnac for a minute\nShawty you feelin this then put your back in it (hey!)\nI'm back in it in an all-black fitted\nIn an all-black tinted-up drop top Bentley\nLike - AYYY! You know what it is (yeah!)\nI got my own jewelry baby, this ain't none of his (okay!)\nJust holla when you NEED ME\nShow a nigga love when you SEE ME\nI can carry the weight, 50 just put it on my shoulders\nG-Unit is the gang, I'm a motherfuckin soldier\nThey thought it was over, he let me out the cage (hey!)\nSo now they got me standin on this goddamn stage, like\n\n[Hook]\n\n[Young Buck]\nBefore I leave let me put this on your brain\nIf rap stop today, I still do my thang\nI bought a Benz way before I bought me a chain\nTook my momma out the Bricks and bought a car in her name\nPaid my nigga Head bond just to get him on the streets\nHope if I get locked up niggas do it for me\nKeep the project lights on, payin e'rybody bills\nAll my homies dead, I'm takin care of e'rybody kids\nAnd I got this, you can count on me\nTo come through, when the home team down by three\nI'm gon' shoot, and even if a nigga did miss\nI bet you next quarter I'll be back in this bitch, like\n\n[Hook] w/ ad libs\n\n[Outro: Young Buck]\nYeah, y'know niggas out there\nNah nah, hold on\nY'know SOME niggas out there\nMighta thought the Unit was over or some shit\nYou niggas is losin your fuckin minds man, ha ha\nAiyyo man I got this shit right now, ya mean?\nGet the FUCK out my lane, yeah\nY'know, that's why that nigga 50\nThat's why he got his feet kicked up right now\nHa ha, Sha Money I got you nigga\nStraight up, so, oh yo\nI'm expectin to be at the AWARDS this year!\nYeah...", "album": "Buck the World", "year": null, "image": "https://images.genius.com/c575145ecec0cf746c69f02ad15139be.1000x1000x1.jpg"}], "artist": "Young Buck"}