{"songs": [{"image": "https://images.genius.com/e26c11a11641792fa018f343eae0e4f4.1000x563x1.jpg", "year": "2011-10-11", "title": "Boss Level", "album": null, "lyrics": "[Intro]\nYeah, this shit sound like video game music\nLike the Boss Level\nWell, that's where we should take it\nHaha, yeah!\n\nBoss Level, Boss Level, Boss Level\n\n[Bridge]\nYeah, It's that King Bowser flow\n\n[Verse 1: XV]\nUh, creeping up on that boss level, tell me what that cost for you?\nJewelry all made in China, no wonder them diamonds is all yellow\nI be out in NY hitting that lala like I'm Carmelo\nYou know they trying to lock the rappers, don't fuck around and let the dogs smell you\nUsed to ball like EA, now I'm on that 2K\nThirsty bitches like \"Who they?\", that's fly boy club, baby hooray\nAnd all my niggas get foolay, talking shit to me, you could get souffled\nSo just kick back like Liu Kang before a nigga pop at your toupee\nAnd I don't ever fuck with the two-face, you can leave that up to Bruce Wayne\nRun this town, and I run this block, and I run this street, give me two lanes\nCome alive at night, give me two fangs, ray bans, entree, and a few chains\nAnd I'm sorry girl, I done had a few drinks, Man, I couldn't tell you who came\nSee, I used to wanna rub the stump on Apollo, now I'm bout to run the fuckin' Apollo\nI don't even mean that joint up in Harlem, I'm talking about space shuttles up in the cosmos\nWhere we at? Someone better call and tell 'em\n\n[Hook]\nBoss Level, Boss Level, Boss Level x2\nCreepin' up on that Boss Level, Boss Level, Boss Level x2\n\n[Bridge]\nYeah, Bowser flow\nSephiroth swag\nHaha, we came too far to turn around now\n\n[Verse 2: XV]\nGot more checks than I got more numbers\nGot more bread then I got more wonder\nBroads in my hand model chicks like summer\nAnd are high maintenance like top floor plumbers\nAnd I keep mad rubbers\nAMEX card yea I keep that from her\nCause all in all they know I ball and so they call just to see that jumper\nOne night stand at the United Center\nThen I got to stop at the TD bank\nCause I turned to mall in the Madison Square\nThis flow right here don't see no breaks\nRunning back throw, ? in flows, he's wanted at shows\nI'm fucking mad hoes, you give me that pussy like Thudercat hoes, oh!\nI shoot for the moon like witches on brooms\nNiggas is wondering when Vizzy gon' boom\nI tell you the key now nigga stay tuned\nWhy is you gassed? Niggas is fumes\nLook at yo ass, you niggas is doomed\nSee this is trash, I pick up a broom\nI'm up in the room with bitches on shrooms\nLA mornings and Vegas nights\nToga parties, the Pagan life\nAll I know is this ain't just Sprite\nBut she said, \"Drink. It'll change your life.\"\nNow I'm...wondering where we are, tell 'em\n\n[Hook]"}], "artist": "XV"}