{"songs": [{"image": "https://images.genius.com/1e9d47cc7d2d89c839c4ec32d0815a5e.929x929x1.jpg", "lyrics": "[Chorus:]\nA good man is gone, a good man is gone, gone, gone...\nA good man is gone, a good man is gone, gone, gone...\nIf he had..\n\n[Verse 1:]\nI ain't shoot him. I ain't kill that kid\nThe police did it in front of 20 witnesses. (NYPD!)\nThat was a good man, now that man dead\nThey thought his phone was a gun so they shot him in his head\nWho gonna police the police for what they did?\nHe had a job, no felonies, and two kids. (He was a good man!)\nShit, tell the system to go to hell!\nThey been killing us out here way before Sean Bell. (That's the truth!)\nYa probably thought I was talkin' bout Sean Bell\nBut I was talkin' about this other kid, his name was Jamell. (Rest In Peace!)\nHe wasn't no thug, son I went to school with him\nHe was like cornbread, the whole hood was cool with him. (He was!)\nThen the police shot him in the projects\nThey said they thought they saw a shiny object. (That was a phone!)\nThat kid ain't deserve to get shot\nHe wasn't on it like me\nHe wasn't livin' like Pac. (Damn)\n\n[Talking: Uncle Murda]\nThat was a good man\nAn the NYPD killed him cause they thought his cellphone was a gun\nThat's how it is in my hood\nThat's what we gotta deal with in my hood\n(And I wonder what he would say)\nI wonder what he would say\nIf he was here today\n(Somebody got the Devil to pay)\n\n[Verse 2:]\nYo remember little Timothy? (Yea!)\nHe got killed, apparently had some enemies. (Who?)\nYea, they hit him like 2 in the morning\nHe was on the bench, two kids walked up on him. (Uhh)\nDamn he was out there hustlin'\nNo pops, his moms got high, he ain't like struggglin'\nEven though she got high, he loved his mother\nAnd everything thing he did was for him and his little brother. (It was!)\nHe made sure he ate, had clothes, went to school\nHe did things that Mommy and Daddy was supposed to do. (He was a man!)\nHe made a little, 4-500 a day\nHe wasn't greedy, just making sure his Fam was OK. (That's it!)\nNow look, where he was grindin' at wasn't at block\nBut he was cool, niggas understood so they let him rock. (They let him!)\nBut when their money start slowin' up they told him to stop. (They told him!)\nTimmy wasn't hearing that, and that's when Timmy got shot. (Damn)\n\n[Talking: Uncle Murda]\nDamn, damn he was a good man, that's the game though\nI wonder what's gonna happen with his little brother\nI hope he aight damn man, you heard he was just tryin' feed his family\nEverybody tryin' feed their family in the hood\n(And I wonder what he would say)\nI wonder what he would say though\n(If he was hear today)\nIf he was hear today\n(Somebody got the Devil to pay)\n\n[Verse 3:]\nLet me tell you bout his O.G. nigga name Dave\nHe was a thug, but now he tryna change his ways. (He found God!)\nHe done killed mad niggas back in the days\nNow he in the hood sayin' put them guns away. (Stop the violence!)\nThis nigga Dave really changed his life\nHe be tryna talk to the youth, tryna save their life. (Everyday!)\nI can't believe that's killer Dave preachin'\nHe say he tired of all the violence he be seein'. (Uhh)\nHe tellin' them about things he did when he was younger\nExplaining why it's not cool to shoot another brother. (That's not cool!)\nThey know he official so they listenin' man\nThey respect what he sayin' when he kickin' it man. (They respect it!)\nLook, they know he a G, they know he put work in. (They know!)\nBut you know they say, the Devil always workin'. (Satan)\nOne of the kids he talkin' too, he killed his cuzin'\nShawty shot Dave in the head and took of running. (Damn)\n\n[Talking: Uncle Murda]\nAin't that somethin' man\nIt's like the Devil always workin' because Dave was tryna do good, but his past caught up to him man\nLike I'm confused, I don't know if Dave going to Heaven or Hell like, and that's for real man like, you know, damn yo\nI think he was a good man though\n(And I wonder what he would say)\nI wonder if Dave would forgive that kid\nI don't know. I don't know\n(Somebody got the Devil to pay)\nWhoo!", "title": "A Good Man Is Gone", "year": null, "album": null}], "artist": "Uncle Murda"}