{"songs": [{"year": null, "image": "https://images.genius.com/8979e195a075754dfc6965f7356b0293.700x700x1.jpg", "title": "Dusty", "album": "Rapper’s Delight", "lyrics": "[O-Dash]\nThey say Hip Hop's dead, well I can resuscitate\nWe getting bread homeboy, you better get a plate\nThen we so controversial, starting to sound commercial\nThought talking money's universal\n\n[Rapper Big Pooh]\nThey say I'm young, black and angry, niggas can't tame me\nNever had a habit doing shit that ashamed me\nSay I gotta change be, careful what you ask for\nYou don't want it with a nigga when he come through that door\n\n[O-Dash]\nPooh come with it, shit I'm coming with the fo'-fo'\nAll glow like a fiend, eyes at the corner sto'\nLooking for snow in the middle of August\nDiamond in the rough boy, spitting that flawless\nNever been a coach, still running with ballers\n\n[Rapper Big Pooh]\nYou know I'mma bar spit, PSA what you call us\nBeat kinda grainy, Rapper Pooh spit heartless\nLand of the dead where these niggas run lawless, uh\n\n[Hook]\nYou know we tell it like it is right?\nTalk shit till these pussy niggas wanna fight\nSleep days, making moves under moonlight\n\"Niggas mad because I know that cash rules\" --] Notorious B.I.G\nYeah, you know we tell it like it is right?\nTalk shit till these pussy niggas wanna fight\nSleep days, making moves under moonlight\nHOJ is the crew right?\n\n[O-Dash]\nThis ain't just hype, two niggas with mics\nGun talk, off safety, we ain't too pussy to fight\n\n[Rapper Big Pooh]\nAiyyo you muh'fuckin right, I don't claim to be\nCause I am who I am, pretty soon you gon' see\n\n[O-Dash]\nGuess it is what it is then, we can shoot the five\nBeen deprived so long, just lucky to be alive\nWon't be survived by our wife and sons\n\n[Rapper Big Pooh]\nThey know I won't be removed from the space till I'm done\nThe undisputed one, pound for pound, second round\nThey say third time's a charm, I'm liking how it sound\n\n[O-Dash]\nHaters wipe me down from my fitted to my shoes\nBeen paying my dues, brud' check the interviews\n\n[Rapper Big Pooh]\nCause I'm on, niggas I keep being on the cusp\nBeen blazing trails, been leaving dust\n\n[O-Dash]\nNow we on the road to riches and finer things\nForeign cars, pulling stacks out our jeans like 'bling'"}], "artist": "Rapper Big Pooh"}