{"songs": [{"year": null, "title": "Jets Over Boston", "image": "https://images.genius.com/8ec7b3fd691b6f406a5ab62708b7b991.600x600x1.jpg", "lyrics": "[Intro: Curren$y (Sammy Adams)]\nYeah (Adams)\n(Yeah) Fly Jets Over Boston\nYeah oh\nWe not playing with 'em\n\n[Verse 1: Sammy Adams]\nWhite picket fence not me I'm on the top floor\nRoof top city spot looking over all yours (I see ya)\nChillin' with a crush I don't really have time for\nI'm the 3 white keys in C, you're a minor\nKnew my shit bang when my music hit the highways\nFound out that hard work pays off like Fridays\nAnd, plenty of people do this our age\nBut don't seem to be blowin' like Penelope and Johnny's\nSorry, sound so big headed\nI'm just flowin' no clue where this clouds headed (no way, no clue)\nNever been addicted to the fame, no star fetish\nYou worried 'bout yours, but we count all of this, uh\n\n[Hook: Curren$y]\nAll we gon' do is spit that reals\nSo if you fake then don't come round here\nOh you thought that this was your year?\nThere's the door get the fuck outta here\nI'm not playin, I'm just sayin\nI'm not playin, I'm just sayin\nI'm not playin, I'm just sayin\nI'm not playin\n\n[Verse 2: Curren$y]\nUh, and when it all come down to it\nThe homie Spitta do his thing you gotta give it to him\nRefer in 3rd person tell myself about my music\nYou got them screen door lyrics, we can see through 'em\nYou and your team don't get it how you say you doin'\nYou just tryna keep the crowd moving lying to 'em\nDisrespecting the game and gettin' paid for it\nLost sight of what you first got in the game for\nI seen it all from my stadium seat chair\nNumber 1 rolled OG brand new\nOld sneaks man what you mean?\nIt's like club life shoppin' in a time machine\nKinda light headed in my heavy Chevy\nTalkin' to my light skinned red bone on my blackberry\nHeaded wherever I haven't been already\nFuck all else jets over every\n\n[Hook: Curren$y]\nAll we gon' do is spit that reals\nSo if you fake then don't come round here\nOh you thought that this was your year?\nHere's the door get the fuck outta here\nI'm not playin, I'm just sayin\nI'm not playin, I'm just sayin\nI'm not playin, I'm just sayin (straight up)\nWord to Sam, fool\nRoll me another one", "album": "Boston’s Boy"}], "artist": "Sammy Adams"}