{"songs": [{"album": "Paper Trail", "image": "https://images.genius.com/cfd0caa9a36fd23db9dec05ae1a43aed.953x953x1.jpg", "year": "2008-09-29", "title": "56 Bars (Intro)", "lyrics": "[Intro: T.I.]\nYeahhhhh (hey!)\nHahaha, hey, hey, ha (all right)\nAight Toomp, man\nThis what the folks been waiting on, I guess (that's right)\nLet's give it to 'em, baby (hey!)\nGrand Hustle, nigga\nAye, man\nThey been waitin on this shit since \"What You Know,\" huh?\nYeahhhh, it's the King, bitch!\nAight, my nigga, the wait is over, nigga\nHey, hey!\n\n[Verse: T.I.]\nOne for the money, two for the show dawg\nThree for the niggas hatin on the low, y'all\nKnow a picture's worth a million words I'mma show y'all\nDeath before dishonor, family befo' all\nWithout the braids I'm the closest thing to O-Dog\nMinus the testimony; say it ain't so homie\nHey! Shorty like that, don't he?\nWorld hopped off my jock, I got 'em right back on it\nOhh! Step back, brush myself off\nPicked bid'ness back up right where I left off\nI could show my dough, that other guy just talk\nHey where I live just as big as yo' projects dawg\nAY! Ha ha, better check my swagger\nHow I walk, how I talk, how I stack that cheddar\nWhat I drive, how I dress, nigga let's just bet a\nHundred stacks on that, nigga I'm just, better\nHahahaha, somebody better tell 'em mayne\nThey swag owe my swag everythang\nIt's very plain to see you study me awful hard\nTo the point that my swag need a bodyguard\nI think a Thank You card's in order, y'all oughta be\nHavin y'all swag sendin mines an apology\nA lot of little me's I see, got beef\nBut what's the possibilities? Stop seek, you not me\nHardly worth a hill of beans, step up to the guillotine\nGet decapitated; don't see how half of you rappers made it\nSay good-bye to the fame and fortune, c'est la vie\nAnd what the game need with you nigga? They got me\nI ride through the city, so clean, seat really low\nAutomo-bil-ey so, pretty but I'm illy though\nNo comparison, ain't a nigga mo', thorough than\nThis gangsta American flow, doper than heroin\nKing like Evelyn, Champagne mayne\nSo deranged and belligerent; right up there with Benjamin\nWho? André 3K, B.I.G., Jay-Z, UGK\nScarface, Makaveli the great, Wayne, Common, Kanye and, Lupe\nSo fuck what you say, you welcome to ask who you may\nBet they say as of today I'm back on top like a toupee\nHey! All objections overruled, it's overdue\nBoth high, and sober too, I'm so high, up over you\nSame guy you see in the streets is as fly as here in the booth\nSo don't be surprised when you meet me to see I'm really the truth\nOoh, so uncouth, nigga who want proof?\nMust agree if shit I did can't no one undo\nI stay on my, one-two, nigga who want to\nTurn a brunch into a brawl, do what you gon' do\nI'm why it's, hot as a bitch in here still, cool as a Frigidaire\nThis year I'm on a mission dear\nThink that was somethin, listen here"}], "artist": "T.I."}