{"songs": [{"lyrics": "[Intro]\nOh yeah\nOooh\nHey\nDaBaby\nTurn up!\n\n[Verse]\nBitch it's DaBaby, let me suck a titty\nI like to stack it up before I spend it\nI just play eenie meenie miney mo\nI got some options when it come to bitches\nI done hit plenty different kind of hoes\nThen I just pass 'em around to my niggas\nYou get on the sprinter bus, anything goes\nShe told me her name but I ain't gon' remember\nYour baby momma wanna give me a taste\nShe drinkin' on a nigga, she wanna play\nI could have put it on her but I was lazy\nI got them racks on me, 'bout to go crazy\nI just got in the club with a .380\nI don't wanna pull it out, bitch do not make me\nI cut off that bitch because she was too basic\nI'm fuckin' his bitch because that nigga hatin'\nSpendin' that check and I get it right back\nI fuck up the show and I count up the sack\nI get off the road and I go to the trap\nAnd hittin' that lame nigga over the back\nDon't hand me your mixtape, your mixtape is wack\nMan who the fuck told these niggas they could rap?\nWe pull up and hop out, they be like, \"Who dat?\"\nWalk in fifty deep, they like, \"How we do that?\"\nShe textin' my phone, she like, \"Babe, where you at?\"\nI'm on my way home, baby pick up the phone\nYou know I be duckin' and dodgin' these hoes\nThey in love with DaBaby, won't leave me alone\nI'm on the highway, I just left a show\nI got three women with me and you gon' be four\nFive minutes away baby, unlock the door\nDon't ask me no questions, you already know\nI got a whole lot of hoes in my bed\nThey givin' me head while they givin' her head\nAll of 'em 'bout it, ain't none of 'em scared\nGo ask about me, they know how I play it\nI got 'em cuttin' up because I'm winnin'\nShe let you fuck her but she made you spend it\nAin't nothin' wrong with that, that ain't none of my business\nI ain't had to trick on a hoe in a minute\n\n[Chorus]\nYeah them bitches made you spend that shit (Hey)\nSpend that shit (Hey) spend that shit (Oh yeah) spend that shit (Turn up)\nI heard you had to spend a check, them bitches like that (Oh yeah)\nI heard you had to spend a check, them bitches like that (Ha)\nThat ain't DaBaby, that's my baby!", "album": "Baby Talk", "year": "2017-01-23", "title": "Spend It (Remix)", "image": "https://images.genius.com/fa242d3e0e043b6323716b6cd4f41477.600x600x1.jpg"}], "artist": "DaBaby"}