{"songs": [{"title": "No Feelings", "album": null, "year": "2018-12-04", "image": "https://images.genius.com/bfe8b8e92b64abc40246efe30fdb73c7.1000x1000x1.jpg", "lyrics": "[Intro]\nAhh\nWe love you, Tecca\n\n[Chorus]\nIs it bad that I never made love? No, I never did it\n'Cause she ain’t show me right, she was a bad girl\nShe told me that she loved me but she really didn't\nI tried to leave all that shit in the past, yeah\nBut I know I want you and I wish I didn't\nAnd sometimes I really wish I ain’t had no feelings\nYeah, sometimes I really wish I ain't had no feelings\nSo it's fuck your feelings, yeah\n\n[Verse]\nAnd that's the reason I don't trust bitches\nFeelin' like A Boogie, D.T.B., no, I don't trust bitches\nGave you all my heart and all my feelings, and you run with it\nTelling all your friends about your ex, told me you done with him\nI'on even know him, but he hurt you, I can’t fuck with him\nYou be stuck on stupid if you really gon’ fuck with him\nDon't be on my phone saying you miss me when you done with him\nFuck you and your feelings, go and find you a new bum nigga\nI’m really sick and tired of hearing that shit\nThat niggas ain't shit, you got bad selection\nEvery shawty want a nigga that be doin' bad shit\nI'm with my new jawn, foreign whip in traffic\nI know you really salty, I got me a bad bitch (Whoa)\nAre you big mad? (Big mad)\nAre you lil’ mad? (Lil' mad)\nShould I care now? (Care now)\n'Cause you ain't care then (Care then)\nAyy, you ain't care then (Care then)\nI'm really sick and tired of hearing that shit\nThat niggas ain't shit, you got bad selection\nEvery shawty want a nigga that be doin' bad shit\nI'm with my new jawn, foreign whip in traffic, hol' on\nAre you big mad? (Big mad)\nAre you lil' mad? (Lil' mad)\nAnd why I care now?\n'Cause you ain't care then\nAyy, you ain't care then\nAnd should I care now?\n'Cause I'on care, yeah\n\n[Chorus]\nIs it bad that I never made love? No, I never did it\n'Cause she ain't show me right, she was a bad girl\nShe told me that she loved me but she really didn't\nI tried to leave all that shit in the past, yeah\nBut I know I want you and I wish I didn't\nAnd sometimes I really wish I ain't had no feelings\nYeah, sometimes I really wish I ain't had no feelings\nSo it's fuck your feelings, yeah\n\n[Outro]\nAnd that's the reason I'on trust bitches\nThe reason I'on trust bitches\nYeah, that's the reason I'on trust bitches\nGon' fuckin' fall in love with 'em\nYou gon' fuckin' fall in love with 'em\nAnd that's the reason I'on trust bitches\nYeah, that's the reason I'on trust bitches\nYou gon' fuckin' fall in love with 'em"}], "artist": "Lil Tecca"}