{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "The Men in Blue", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Intro: Everlast/Officer O'Malley Bitchkowski (Sample)]\n(Give me some time to blow the men down)\nYou have the right to remain silent. Anything you say can and will be twisted around and used against you in the court of law. I'll make damn fuckin' sure of it! You have the right to an attorney. If you cannot afford an attorney, which you probably can't, one will be provided for you, you stupid, freakin', moulignan bastard!\n\n[Verse 1: Everlast/Officer O'Malley Bitchkowski]\nIt's the bad lieutenant, runnin up in your tenement\nPlantin' evidence on any black resident\nNew York's largest crew, it's the Men in Blue\nWe stick together like glue and make lies come true\nMy name's Officer O'Malley, I shoot you in the alley\nAnd burn you like a cross at a fuckin' Klan rally\nI got spics sellin' nicks in the L.E.S\nI stay untouchable like my name's Eliot Ness\nNew York's finest, with my bulletproof vest\nI confiscate the chronic, I let you keep the stress\nThat is unless you wanna try and test\nI'm D.T. undercover, I lock up your mother\nYou're just another brother, you ain't a mafia don\nWho the fuck's payroll do you think that I'm on?\n\n[Hook: Everlast/Officer O'Malley Bitchkowski]\nThe Police Department is like a crew\nIt does whatever it wants to do\nThe Police Department, we're like a crew\nWe do whatever we want to do!\nThe Police Department, it's like a crew\nIt does whatever it wants to do\nThe Police Department, it's like a crew\nIt does whatever it wants to do!\n\n[Verse 2: Everlast/Officer O'Malley Bitchkowski]\nYou know this ain't Serpico and you ain't Al P\nI got it locked from Hunter's Point in the Square of Albee\nFrom the Bronx to Queens to Brooklyn to Staten\nWe're the most organized criminals in Manhattan\nWhen we come, we swarm in full uniform\nWhen the blue lights flash, start runnin' your cash\nIt goes back to the days of Al Capone and Frank Nitti\nIllegal business controls the city\nOh, what a pity, if your attitudes shitty\nFuck my money up, kid, and you'll be doin' this bid\nIf you spill what I did, I'll put a pill in your lid\nOr get you bustin like a cherry waitin' in the comissery\n\n[Interlude: Everlast/Officer O'Malley Bitchkowski]\nAhh, what's this? Crack? Is that a gun?\nYou stupid moulie fuck!\nYou're gonna be doin' some real time, son!\n\n[Hook: Everlast/Officer O'Malley Bitchkowski]\nThe Police Department is like a crew\nIt does whatever it wants to do!\nThe Police Department, we're like a crew\nWe do whatever we want to do!\n\n[Verse 3: Everlast/Officer O'Malley Bitchkowski]\nI raid stairways in the PJs just for thrills\nAnd pull triggers on niggers that won't hurt the crills\nIt's brought up to paper, punk, that's the caper\nIf we make this connection, I'll give you protection\nAnd this year, the mayor's up for reelection\nSo rat out all the competition in your section\nAnd the next day, there'll be a drug sweep around your way\nSo let your crew know, it's time to stay low\nKeep up in the dough and you get the info\nOn what's goin down and we can run this town\nStraight into the ground, while we rise to the top\nThere ain't no such thing as a dirty cop\nCause I plant what I want on any crime scene\nI keep my hands clean, you know what I mean?\n\n[Hook: Everlast/Officer O'Malley Bitchkowski (Sample)]\nThe Police Department is like a crew\nIt does whatever it wants to do\nThe Police Department, we're like a crew\nWe do whatever we want to do!\nThe Police Department, it's like a crew\nIt does whatever it wants to do\nThe Police Department, it's like a crew\n(Blow the men down!) [*gunshot*]", "year": "1999-02-23"}]}