{"artist": "Big Daddy Kane", "songs": [{"lyrics": "Lean on me! (2x)\n\n\"big daddy kane, a teacher..\" (2x)\n\"big daddy.. big daddy..\"\n\"goes a little somethin like this!\"\n\n\"can I get a yes\" (4x)\n\"just lean on me\" - kane *cut n scratched*\n\n[big daddy kane]\n\"can I get a yes? \" no \"why? \" I ain't happy\nCause I came back for these troubles to grab me\nAnd they've gotten a hold on me\nMy oh my, things ain't what they used to be\nLooks to me like eastside got problems\nNow it's time to see what we can do to solve them\nChange for the better, letter\nNew rule be enforced in school so we can get rid of\nAll the bad apples in the bunch\nClean up the wall and cook better lunch\nPut the students in class where they should be\nTo stop roamin the halls, and oh could we\nPlease, eliminate the drug situation\nStop smokin and get an education\nPoint blank, let's change the whole scenery\nYou need help? well hey, lean on me\n\n\"just lean on me\" - kane *cut n scratched*\n\"lean on me!\" - 2x\n\n\"whattaya do in a situation like this? \"\n\"special mix\"\n\"please! like this.. like this..\"\n\"whattaya do in a situation like this? \"\n\"like this\" - *cut n scratched*\n\"goes a little somethin like.. like..\"\n\n[big daddy kane]\nWhattaya do in a situation like this?\nGet tough - or get dissed\nThe job is yours to play the boss enforce the laws\nBecause the source is knowledge, wanna go to college?\nOr wannabe garbage?\nIt's up to do so what you gonna do\nI-i prefer to learn, cause this is for your own concern\nYou gotta-you gotta earn, however the world turns\nSo wake up-wake up, to put some sense in your head\nDon't be-don't be mislead, use your brain instead\nBecause-because a brother like me, can't understand you\nPlayin yourself cheap, like a soggy old pamper\n\nSince i'm-since I'm around, I'm destined and bound\nTo resurrect and perfect the entire school around\nThe whole-the whole entourage, a class so large\nUnder joe clark, \"i am the head [nigga] in charge!\"\nThe man-the man with the master plan for discipline\nMakin changes-makin changes, no matter what we twist or bend\nYou may not-you may not understand what this mean to me\nBut for your-but for your own good.. just lean on me\n\n\"just-just-just-just\"\n\"for your own good\" \"special mix\"\n\"you may not understand what this mean to me\nBut for your own good.. just lean on me\"\n\n\"just lean on me\" - *cut n scratched*\n\"big daddy kane, a teacher..\" (4x)\n\n\"special mix\"\n\"goes a little somethin like this!\"\n.. \"special mix\" (2x)\n\"goes a little somethin like.. like..\"\n\"big daddy kane, a teacher..\" *cut n scratched 2x*\n\"..teachin a lesson\" *cut n scratched 2x*\n\"..teachin a lesson to be heard, that's word\"\n\n\"can I hear a yes? \" (2x)\n\n[big daddy kane]\n\"can I hear a yes? \" yes! \"why? \" things are better\nAnd we are finally, workin together\nIn unity, and you're soon to see\nEastside high as a better place to be\nThe students, the pupils, have morals and scruples\nOur learning ability is increased quadrupled\nAnd we're off to a brand new start\nI played my part to prove that you're smart\nAnd it's proven, but I ain't movin, I won't be gone\nI'm here, when you need someone to lean on\nSo take heed to this as a blessing and remember..\nAin't no \"half-steppin\"\nGet in full gear, I'm sure that you'll care\nIn the long run, when you got pull here\nThat means authority\n\"r-e-s-p-e-c-t\" word!\nSo let knowledge uproot ya\nGo for yours, cause we are the future\nThe ones who rise to supremecy\nAnd if you ever need a hand, just lean on me\n\n* more cuttin, scratchin, and samples to fade*", "image": "https://images.genius.com/e5112b31d8bd715b9e736175eff672d9.1000x1000x1.jpg", "year": null, "title": "Rap Summary (Lean On Me) (Remix)", "album": "It’s a Big Daddy Thing"}]}