{"songs": [{"album": "Klusterfuk", "image": "https://images.genius.com/d81918b5eb66018731d6fb1da718ea1e.900x900x1.jpg", "year": "2012-03-13", "title": "Awkward", "lyrics": "[Intro: Tech N9ne]\nYeah, heh..\nI'm just gon' tell a couple stories real quick\nShit that I think is pretty awkward, you know what I'm sayin'?\nCheck it out\n\n[Verse 1: Tech N9ne]\nKickin' it up in Salt Lake City\n'Bout to be doin' a show and the boss stay really\nLovin' a nigga, I think it's because I'm becoming a killer forever\nThe piece of my thoughts weigh gritty\nBut one day someone say: \"Why does he gotta be closin'?\"\nI am the one with the frozen flow and pockets bulgin'\nFair ground it was a explosion\nI told the promoter to hold up and I told him I came to rock\nGive the famous spot to the man that claim he hot\nTwenty-two thousand people saw me make the planet rock\nBut when I was done, nigga, the show was done\nRight when he took the stage everybody runs\nAnd the outcome was three hundred folks set a show\nSo I'm at the shilo and it was\n\n[Hook: Tech N9ne]\nAwkward, situation is absurd\nIrregular and awkward\nSuch a feeling is, not heard\nIn my circle when it's awkward\nSituation is absurd\nIrregular and awkward\nSuch a feeling is, not heard, awkward\n\n[Verse 2: Tech N9ne]\nGreat sex, thanks, Tech\nThat's what she say, I grab the latex\nOff of me, and throw it away to be safe\nAnd I give her the getaway-look and I say softly:\n\"We gotta move, my bus is leavin'\"\nI guess that wasn't a good enough reason\nTo have to go, I gave her a shirt\nNot my jersey, I know it hurts\nAnd then I heard call somebody saying come and get me\nGrab the gun that's with me that's a no-no\nYou came and you leaving solo, keep it dolo\nMaking the walk of shame then I let her out the front\nI was in the crunch when the person standin' at the door\nSaid: \"I'm her husband, man, we love you\nAnd this is what she really wants\"\n\n[Hook: Tech N9ne]\nAwkward, situation is absurd\nIrregular and awkward\nSuch a feeling is, not heard\nIn my circle when it's awkward\nSituation is absurd\nIrregular and awkward\nSuch a feeling is, not heard, awkward\n\n[Outro: Tech N9ne]\nI ain't even gonna rap this verse, I'm just gonna tell you the story\nCause it's funny as hell to me, you know what I'm sayin'?\nWe shootin' \"Am I A Psycho?\" video down in Atlanta\nSomewhere outside of Atlanta, it was cold as hell, it was dark\nYou know what I'm sizzlin', we only had like one trailer for everybody\nIt was just me, B.o.B and his people, my people\nYou know what I'm sizzlin'? Aqualeo, satin star, their people, you know what I'm sizzlin'?\nHopsin's people, uh, uh, the make up ladies, people that are in the video\nYou know I'm sizzlin'? We all in there drinkin' you know what I'm sizzlin'?\nI'm in the back all the time, I'm reclusive kinda you know what I'm sayin'\nSo B.o.B came in the back and he said to me:\n\"Hey, man, you fuck with them tools?\"\nI said: \"Tools?\" He say: \"Yeah, man, you fuck with them tools?\"\nAnd he pointed his hand like like a gun\nAnd I said: \"I ain't got no tools here if that's what you askin'\"\nAnd he said: \"No, I thought I saw some tools back here\"\nI said: \"Hell nah, nigga, I ain't got no tools back here, man\"\n\"Nigga, I got God with me, nigga, and angels around me,\"\nAnd we start laughing, and he's like: \"Nah, nah, cause I go to the gun range\"\nAnd I'm like: \"Oh, that's cool, but we good right here, man\nWe ain't got no guns down here\" and we was laughing\nAnd when he was leaving out I said: \"Hey, nigga, it's all Jesus my brotha!\"\nHahahaha, nigga talkin' 'bout tools, you know what I'm sayin'?\n\n[Hook: Tech N9ne]\nAwkward, situation is absurd\nIrregular and awkward\nSuch a feeling is, not heard\nIn my circle when it's awkward\nSituation is absurd\nIrregular and awkward\nSuch a feeling is, not heard, awkward"}], "artist": "Tech N9ne"}