{"artist": "Booba", "songs": [{"album": "Prochain album", "title": "Glaive", "year": "2019-08-01", "lyrics": "[Intro]\nNe crois-tu pas qu'je sais c'que j'fais?\n\n[Couplet unique]\nNe  crois-tu pas qu’je sais c’que j’fais?\nTellement  longtemps que j’fais la guerre\nLe prochain c’est Damso, m’fais pas jurer la vie d’ma mère\nChacun sa croix, chacun sa Elvira\nLa  paix s’ra toute nouvelle, peut-être qu’on l’appréciera\nJe  crois en Dieu à ma manière, sûrement pas Jésus qui me guide\nUn demi-siècle qu’j’suis au pouvoir, peut-on parler de génocide?\nTu  préfères le raconter, moi, je préfère le vivre\nJ’ai du réécrire tous ces livres, j’dois faire le plein pour faire le vide\n9.2, c’est l’élite, pas dur d’écouler tous ces litres\nJe n’s’rai jamais un mythe, j’ai bien griffonné tous ces titres\nLiasses  de billets si hautes, wallaye bilaye, j’perds l’équilibre\nSur écoute à droite à gauche, j’ai dû faire sauter toutes les lignes\nElle m’a cherché dans tout l’étage, elle a frappé à toutes les suites\nY a qu’Didier qu’on n'aime pas, j’passe le salam à toute l’équipe\nTrop d'argent, je ne rêve plus mais hamdoullah, j'ai tout\nElle dit que je l'ai niqué, Hassoul, j'l'ai pas ché-tou\nSept zéros sur les chèques, poto, j'ai plus vingt ans\nVide la caisse et vite, salope, le changement, c'est maintenant\nLa paix n'tiendra pas longtemps si rate-pi n'fait pas son chiffre\nIent-cli n'a pas son fixe, t'es au tard-mi, t'as pas ton shit\nTout peut sombrer si vite, ici, rien ne reste sans suite\nJ'suis au placard, j'vois pas mes mômes mais même Drake voit pas son fils\nCe n'est qu'un au revoir, see you de l'autre côté des lois\nJ'passais une commande Uber Eats pendant qu'j'lui mettais des doigts\nJe sais qu'tu vas la retourner donc j't'ai mis ta veste à l'envers\nEspèce d'enculé d’requin, j'vais t'mettre dans un bocal en fer\nY a ceux qui ont sorti le glaive, y a ceux qu'ont pas gé-bou\nL'alcool sur la table, c'est pour les tchoins, j'suis pas rré-bou\nJ'ai trop d'argent, je ne rêve plus mais hamdoullah, j'ai tout\nElle dit que je l'ai niqué, Hassoul, j'l'ai pas ché-tou", "image": "https://images.genius.com/ce2f7248f83487747bfd436563f29eaa.1000x1000x1.jpg"}]}