{"songs": [{"album": "Life on Life", "year": null, "title": "What It Do", "image": "https://images.genius.com/47ed6f727e34a8fcaf81f6743e4943fc.1000x1000x1.jpg", "lyrics": "[Verse 1 – Titus]\nHey what it do, does the truth came down your avenue\nGivin' you that 20/20 but no need for attributes\nSo see that Christ is king well what's inside your treasure chest\nDon't know why God? We murderers we kill the flesh\nWe serve the best He crush the rest I thought I told you\nOur King so great He makes Alexander look mediocre\nNow hold up, no sir, boy you must be trippin’\nThe resurrection from Christ affliction has been redemption\nIf you say we rippin’ but don't get it you should reverse it\nCome back to the first look how 'cause Christ is the top of your purpose\nSo what you stoppin’ for? Go give them what they askin’ for\nChrist loved us so much he died for sin, high metaphor\nLook at the picture boy we in this grind we goin’ true\nLike Catholic sinners we bring our confessions right into the booth\n100 fruits go blend it in, this here is absolute\nLike Tropicana juice we bear the fruit, now tell me …\n\n[Hook – Json & Trip Lee]\nHey whatchu do?\nDaily dyin’, I ain't mine, I belong to him\nHey whatchu do?\nHoly grind, all the time, on the grind for him\nHey whatchu do?\nRenew my mind, all the time, when I'm in the streets\nHey what it do?\nYou might find me, and mine when you’re on the streets\nThat’s what it do\n\nAlready make it do what it do\nThat's what it do\nAlready make it do what it do\nThat's what it do\nAlready make it do what it do\nThat's what it do\nAlready make it do what it do\nThat's what it do\n\n[Verse 2 – Trip Lee]\nHey you got questions for me like what I'm doin’ on a daily basis?\nI love the light and hate the dark, since I been saved I'm racist\nI'm trying to rep the God who saved me, said he’d trade me places\nAnd by his grace my ways was straightened like them legs with braces\nI'm tryin’ to grow up in the faith forget them baby skaters\nThat's why I'm training every day like I play for the Lakers\nMy crew reveal with Him man, we took his grace and drank it\nSome call it drunk in the Spirit but you might say I'm wasted\nAnd cats is burnin’ to know\nWhat's poppin’ after the music stops and them curtains is closed\nYes sir we servin’ and we worship Him, we certainly go\nAnd hit the curb 'cause cats is hurtin’ and this world doesn’t know him\nThat's why we servin’ in whole, we reimburse as we go\nGettin’ to cats so they can know Him, they can learn and be grown\nThis life is harder when my back’s on the wall\nBut remind myself that my own self is dead, casket and all\n\n[Hook – Json & Trip Lee]\n\n[Verse 3 – Json]\nI rep Christ (rep Christ) ’cause I know for my sins he was martyred\nI die with him so say hello to the dearly departed\nPerhaps you might hear me rappin’, I'm not nearly an artist\nThe fact is I happen to spit like I'm really retarded\nWas weary-hearted when Christ came in and then did an audit\nSaw that the law demanded that every man would live Godless\nBut then he switched my aim, gave me a new direction\nI live to lift his name, hope you see a reflection\nI resemble my daddy, not in physical either\nI personally inherited his character feature (that's what it do)\nSo yeah my pants is baggy and still my fitted lean\nBut if my head cause me to sin then bring on the guillotine\nSee my actions have stopped since I'm attached to the Rock\nWho died and popped out the grave like a Jack-in-the-Box\nWho you know murdered death huh? Well then death couldn't murder\nIt's Christ the King we rep, with every breath we give Him worship\n\n[Hook – Json & Trip Lee]"}], "artist": "Json"}