{"songs": [{"album": "Growing Pains", "year": null, "title": "Parent Me", "image": "https://images.genius.com/7e85622bc62e8bfa09b3556f1fc80f0c.540x540x1.jpg", "lyrics": "[Hook: J.R.]\nLook at my life\nLook at my pain\nLook at my tears\nThese tears I shed\nI feel so alone, with nobody to talk to\nCause of the days that I spend without you\nIt's like you're here, but you're gone (but you're gone)\nYou're here, but you're gone (but you're gone)\nIt's like you're here, but you're gone (but you're gone)\nAnd you're gone, gone, gone, gone away\n\n[Verse 1: J-Son]\nI know you're working, I appreciate your grind\nYou give me everything I need, but I really want your time (I want your time)\nI must confess, it's hard to express how I'm feeling\nBut I'm growing blocks of bitterness, quickly becoming buildings\nListen, you're never home\nTo the point to that I don't notice when you're gone\nI'm getting older, but I'm growing all alone (I'm all alone)\nHow can you raise me, without even knowing me?\nEverything I do, is just to get you to notice me (I miss you)\nRealize, you're the great influence in my life\nAnd you're absence just might be what's ruining my life (you're ruining my life)\nI got questions, but we don't talk on the usual\nMy friends are having sex, and I'm wondering, should I do it too? (What should I do?)\nWho should I go to, if you are never there? (Where?)\nAnd if you never ask, will you ever be aware? (Be aware)\nYou say you care for me, you don't get it apparently!\nI'm young and just a child, I need my parent to parent me!\n\n[Hook]\n\n[Verse 2: J-Son]\nI know you're hustling (I know), I see you on your grind\nYou give me everything I need, but I really want your time (I want your time)\nI stay in fresh J's, laced in new gear\nBut I would trade it all, if I'd only have you here\nI smell the dope you be blowing, cause it be so potent\nOh yeah, I notice, but you don't think I'm a wanna smoke it? (I wanna blow)\nI see your love for the streets, and I want that love too\nYou taught me to be hard, but you rarely tell me, \"I love you\" (I love you) (Please love me)\nMoms be mad, she always be talking bad about you\nBut honestly, Dad, I don't think I'll become a man without you\nAnd she be gone, matter of fact she never home\nShe come into work, and I'm living like I'm already grown\nI gotta place to stay, then get ta shop at the mall\nBut I'll honestly say, I don't have no guidance at all\nYou say you care for me, but don't know I can barely read\nI'm young and just a child, I need my parents to parent me!\n\n[Hook]\n\n[Verse 3: J-Son]\nI know you're in Church, I see your love for God (I do)\nYou give me everything I need, but I really need your time (I need your time)\nYour godly life and love for people amazes me\nBut tell me should the Church take my mom and my dad away from me?\nI say this simply, you know a lot spiritually\nInvolved in ministry, but often, you don't remember me (Remember me?)\nYou teach the youth and show them how to model and live (Yep)\nBut at home you've never shown me what the Gospel is (Father I need you)\nHow can you share with those seem direly hopeless?\nInside I cry, cause we've never cracked the Bible open\nAnd I'm dealing with pressure, and don't know what to do\nKnow what it's like to be the only Christian in your school?\nI bump that 1-1-6, they tell me to live unashamed (I'm ashamed)\nBut that's hard when those around you are on another thing\nYou study thoroughly, but don't get it apparently!\nI'm a babe in the faith, I need my parents to parent me!\n\n[Hook]"}], "artist": "Json"}