{"songs": [{"lyrics": "These lil', lil' fuckin' Martians\nYou gotta love em' though\n\nMars attacks wit' electric gats\nNot for sapien abduction (what's up then?!)\nBilly took a laser to the mug piece; hollowed out the mandible\nChannel headquarters, order the cannonballs (Mars attacksssss)\nBFI demands column to this pigeon ankle\nAnd boomeranging' our harvest; 51st area sickness\nNot a threat, nary a witness won't injure the promise\nMonster lead- carry your ligament fanged in the mosh pit\nDodge phaser, labor days are major A, sir\nCater the alien decomposer soldier platter like Caddy Shack eight\nI told her \"Go for C4 magic's\"\nSmolder as did Bazooka Tooth holster fabric\n(This fucker's rabid and still breathing!) (Hiding cabbage!)\nOh, the heater claps to leave me\nI'mma ninja this shit with sugar in the fuel tank of the saucer\nBuddy up and head down to the metal corporate tunnels\nIce pick the soldered ship wiring; pissed off the mother and um\nI'd be lying if I said I knew your intentions\nSee my sexy sabotage thinks defensive action'll save the race\nYou lend a hand on board to mention magma (Blaze the place!)\nSpread fire of your revival, there's wires in your Bible\nObviously, ultra tech advanced when I point-counterpoint\nComparison of ET vs. little old freak me (She be on somethin')\nHey riddle sweet peas wit' your nickel PCs, fickle CDs, miserable TV sitcom (Typical!) Pathetic ritual collective slackership\nBeautiful establishment; you ain't established shit! I consider you foul\nProwl back to the numbers under burnt pride in the dark (Sup, y'all!)\nThey want us dead or alive without the alive part!\nThe sun rose over a body bag shortage\nLast week I was like \"God bless the saint that invented the cordless.\"\nThis week I sorta re-routed of the bull's-eye of my worship:\nTemple-body slash full cabinet master my diversions\nFuck y'all, lets do this shit; My movement soothes any space invader practice\nStomped up to enemy like \"Hey what now, bitch!?\nI am human, hear me rise above material and cardinal sin.\"\nThey shot me in the face:\n\nMars wins. (Mars wins. Mars wins. Mars wins. Mars wins...)\n\n(God morning, sir. May I show you something? Sir.)\n(Jet-black smoke on the horizon.) Black smoke in the air\nMaaaaaaaaaaarrrrrrrrrrrrrrsssss wins! (I thought you would like it.)\nWho you screaming at dog? I got this! (Let's go.)\n\nZig zag 'zooka, pinnacle stitch\nUnleash the unlimited edish primitive piss\nI slip a cynical Mickey to most military ops\nMonkey - here's how the filament drops\nWe on a pre-three prong ancient elephant tusk\nBetamax fully, break bread\nYou shruggin' it off, keep it electric, sure\nBut NY Electric's not about electric war\nIt's \"hunt, gather\", see the poor man's clan set bait (Last page!)\nThree, two, one, domesticate!\nIn the corner of the cave reinventing the wheel and roll out funny\nSitting on them Barney Rubble twenties, subtle;\nSipping saber tooth blood puddle-\nI could roll with the lackey's, that's if we hustle\nKnuckle in the mud, hell's bells in the chuckle\nRed-berried face means smudge around the muzzle\nI'm allergic to the now-born solar panel cuddle\nStole cold to the core, dirt menace\nStone cold sans Alcor cryogenics - stubborn\nCan't talk shit with a tongue full of rug burn\nGot bad cholesterol, good blood sugar;\nFour-piece heartbeats wit' a subwoofer!\nI'm not asking you to act like you notice (Oh, Aesop's SO Mesozoic.)\nAnd now I see that cabinets pills be old (Potent!)\nOpen the mirrors while I pulse with the voltage\nKeeping me alive is the vibe with the Vulcan's hope!\nTangle the vine catapult (Catapult!)\nI break it down to the bones of the crux with the goals of the age old\nEat. Sleep. Fuck\nStructural droids; more bounce for the buck\nBut they want a last stegosaurs - thorns in its butt (buck wit' it!)\nPrehistoric land shark business, cradled in the arms of the karma and kismet\nSwarm to the sickly thawed out the glacier\nBeggin' for the freezer burn; back every day, sir!\nSir, your science loves to fuck nature\nSir, your right to the dawn of my day, sir\nSir, your violent lab coat and beak can vivisect witches til we all catch vapors\n(GIVE HIM)\nDon't call it a sound-off, \"Mars Attacks\" be the malarkey downfall\n(ONE)\nIt's not a game no more, run from the flash, leave your panic at the door\n(THESE)\nA lotta of magic gadgets, give em all back just to nullify the savage\n(PILLS)\nMics crumble if we rock 'em right\nIn the year of the troglodyte\nSaw a grey mouse gravy poured on a board\nTo the dull morose world like a lull in a storm\nAnd I know you was hopin' that the piece for the ox was a dull sword, Ahk\nGuess what: it's not! Guess what else: I transmit for the block!\nT-Rex - X-Ray with triple X Hex (give it up!)\nFor the yesterdays, or the next I can assure you if there is I got the sword\n(dead flesh!)\n\nAin't no time left. (Keep ya head up now)\nMaaaaarrrrrrrrssss wins! (I thought you would like it)\nSaw a- a bleak ending real quick", "title": "Mars Attacks", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}