{"songs": [{"lyrics": "[Sample: The Big Lebowski]\n\n\"Where's the fucking money, shitheaddddddddd???!!!\"\n\n[Action Bronson]\n\nYo, fucking Paulie TRYBE, man\nGet your muthafucking hand out her asshole\nWe gotta go, fam, we gotta go, kid\nYo, get the whip, get the whip!\n\n[Verse 1: Action Bronson]\n\nI'll take 21st Century poets that's for a thousand\nCurly hair or Nubian women get me aroused\nTo the point I wanna gamble it all\nI was smashing from the back\nShe put her hands on the wall\nShe couldn't take the thrust\nOnly lust like a fiend for the dust\nOr the pizza from Pezzi, perfect\nWant to sleep with the crust\nOr the 740 Alpina, leather seats is a must\nAnd my shorty holding a nina\nRolling green in a duuuuuuuuuutch!\nBronsolini, organically I rise to paper\nIn the purest form, lyrically derived from nature\nLike the Amazon, put your cameras on\nWatch this muthafucka turn into an animal!\nLight stubble, rock the muzzle like Hannibal\nJump off the top of the boat into a cannonball\nHoes with gold teeth, we off the coast of Greece\nIn under 3 seconds, muthafucka load the piece\n\nKid, the bag of money coming with me\nYou muthafucka\nThe bag of money coming with me\nYeah, the bag of money's coming with me\nMuthafucka you\n\n[Verse 2: Meyhem Lauren]\n\nSurprise! Lauren is in the house\nI eat fowl birds and keep a hen inside my mouth\nAlways extra, guest featuring with Dr. Lecter\nLike Bald Head Slick, I hold my mic like a scepter\nRest in peace, Guru, son I rep Q-U\nChains on chunk\nThey looking at me like \"who you?!\"\nThese handmade Cubans probably fucking up my posture\nPesto sauce properly drizzled upon my pasta\nNo imposter, son I'm authentic\nAround drugs so much, I'm probably raw scented\nBag of money dips, triceps is all dented\nPrecise painting pictures\nThink about life and then I pen it\nNike Air extraordinaire, it’s a cold world, prepare\nThat’s what it is, dad\nWinterize your vehicle\nI love kicks like Action Bronson loves a reefer pull\nPeace to good, bad girls that let us both sleep with you\n\nThe bag of bitches coming with me\nWord up, son, all the bitches coming with me\nYeah, yo, the bag of bitches coming with me\nWe go raw son, all the bitches coming with me!\n\nWe making babies tonight, nigga\nYeah, smoke what you want, sniff what you want\nYou wanna have five daddies, you ever have five daddies before?\n\n[Verse 3: Action Bronson]\n\nAyo, 2010, got ‘em buzzing like a beeper\nRound table discussion\nConference in Geneva\nLeaders at the table, poly over nasal\nForty seven minutes since the time I lit the basil\nMy rhymes are carte blanche\nLiver than the Oscars\nExtra virgin olive oil drizzled on the pasta\nFry the bacon, make it sizzle for the chazers\nHonor in this thing of ours\nLiving like the mobsters\nCompliments go to the chef and that’s the real\nMy crew of goonies in the joint\nWe need some extra veal\nYou know the Caddy got an extra wheel\nAnd if I’m ever in a pickle, I can hand a fucking Tek to Steele\nTake aim and knock an apple off your head\nAnd I’m a play like Polamalu\nYou get tackled for the bread\nWe’re running in your crib\nYour shorty shackled to the bed\nMoney laying on the Persian\nLeaking plasma from the lead\nAnd it’s on!\n\n[Outro: Action Bronson & Meyhem Lauren]\n\nThe bag of money’s coming with me, muthafucka\n(It’s all coming with us, nahimean?\nOutdoorsmen!)\nQueens, kid, the bag of money’s coming with me\nUptown connection, you fucking pussy\n(Word up, man, It’s all marvel\nYa’ll niggas know everything is marvel)\nBronsonlini, Bronsolovski, Team Facelift\n(Everything we drink, everything we smoke\nEverything we buy, everything we sell\nIt’s all marvel!)\nMy muthafucking man Shaz\nPaulie TRYBE, Paulie Walnuts\n(Action Marvel, Meyhem Marvel, nahimean?)\nMachine, Fonda, Tommy Guns\n(Tommy Marvel, Marvel is everybody’s middle name we fuck with\nMeyhem Marvel Lauren, it’s all marvel\nThe bag of money’s coming with us)", "title": "Bag of Money", "album": "Dr. Lecter", "image": "https://images.genius.com/9b10376fe5cc5f697702488523dba2cd.580x521x1.jpg", "year": "2011-03-15"}], "artist": "Action Bronson"}