{"songs": [{"year": "2015-09-24", "album": "For Drug Dealers Only", "image": "https://images.rapgenius.com/c62bb6d788743fc092b3fc6fe5b5413f.640x640x1.jpg", "title": "Hands Official", "lyrics": "[Intro 1: Kevin Gates]\nEverybody know me, every section I be stepping in\nIn the club, they know my hands official, ain't no weapon in\n\n[Chorus : Kevin Gates]\nA-a-ain't no weapon in\nEverybody know me, every club that I be stepping in\nAnd my hands official I ain't gotta bring my weapon in\nThis bitch like a bitch n she tell me she tell me that she a lesbian\nI like bitches too, i told her, i think i'm a lesbian\nAll her friends wants chill in VIP, i told her, let em in!\nI could make it rain in here for weeks, but that's irrelevant!\nMichelle Obama married to my hustle like the president\n(Squiiirrtttt!)\nPorsche trunk is in the front just like an elephant\n\n[Verse 1: Kevin Gates]\nTurnin up in the foreign, got a bad bitch Nicaragua\nFlipping in the pussy like a dolphin\nShawty say i'm too cold hearted\nNever had a family I'ma orphan\nQuick to put a nigga in the coffin\nHit the weed go to caughin\nI be speaking Spanish when i'm talking\nCafé con leche my coffee\nHit a nigga with the carbine\nIf I got off-subject, i'm sorry\nEx-boyfriend, he a stalker\nI just like to chill in her apartment\nSay she love me cuz I'm not a stalker\nI be ballin hard like Spalding\nDrop dick off, and never called her\nNigga tried to jack he gotta kill me\nIf you a pussy nigga, you say \"really?\"\nIf you stand for something, then you feel me\nSelling H-Town by the fitten\nI'm the lil nigga with the mouth full, when it come to guns I got a house full\nIf you called your girl, she in route soon\nDidn't answer? Probably got her mouth full\nUh, diamonds bitch I got a mouth full, I blind a bitch I got a mouth full\nDiamonds bitch I got a mouth full, I blind a bitch I got a mouth full\n\n[Chorus: Kevin Gates]\nEverybody know me, every club that I be stepping in\nAnd my hands official I ain't gotta bring my weapon in\nThis bitch like a bitch n she tell me she tell me that she a lesbian\nI like bitches too, i told her, i think i'm a lesbian\nAll her friends wants chill in VIP, i told her, let em in!\nI could make it rain and hit for weeks, but that's irrelevant!\nMichelle Obama married to my hustle like the president\n(Squiirttt)\nPorsche trunk is in the front, just like an elephant\n\n[Verse 2: Stitches]\nI could shoot this gun, or I could throw them hands\nI demand my respect, nigga, that's from every man\nIf you die for your squad, then you must be a real nigga\nGot my nigga Lito, his first pistol, he better pull that trigger\nIt's a homicide on trial, you beat the case I smile\nWho you think you playin with, I'm the king of my town\nThe judges squrred, police is squrred\nAnd if I say that I'ma kill you, I'm a man of my word\nI swear!\n\n[Outro: Kevin Gates]\nEverybody know me, every club that I be stepping in\nAnd my hands official, I ain't gotta bring my weapon in\nThis bitch like a bitch n she tell me she tell me that she a lesbian\nI like bitches too, I told her, I think I'm a lesbian\nAll her friends wants chill in VIP, I told her, let em in!\nI could make it rain and hit for weeks, but that's irrelevant!\nMichelle Obama married to my hustle like the president\n(Squiirttt)\nPorsche trunk is in the front, just like an elephant"}], "artist": "Kevin Gates"}