{"artist": "Professor Green", "songs": [{"album": "At Your Inconvenience", "title": "Nightmares", "image": "https://images.rapgenius.com/77fac9cb635136345d2df6c14f88ad3b.1000x1000x1.jpg", "lyrics": "[Hook: Kobe]\nAnd I'm drunk and I'm blown, and I don't know what I'mma do\nGot it cocked ready, loaded, and I'm looking for you\nIn your nightmare\nI'll be right there\n\n[Verse 1: Royce Da 5'9]\nYeah, uh, you ain't even in a realm we spit\nNightmare's mental, Freddy Krueger pencil on my Elm Street shit\nBelieve none of what you see, none of this shit you've heard\nI call rolling a blunt of herb turning over a new leaf\nA mixture of Biggie and Pac, going upside your head\nWith a mic stand at your show, it's me giving you props\nMy mind's pure, I thank Pope, I game 'til the bank's broke\nAnd my flow's Novacane as Frank Ocean\nIt ain't a thing to hang-a-ling, night tears by day\nNightmares of the night like dang-to-dang\nIt's 6 million ways to end your life\nAnd I chose the tool over the bloody glove with the finger knives\nI'm who you can't stand, probably leanin'\nYou probably dreamin' 'bout Mr. Sandman mixed with up with Robert Englund\nMe? I put it right there to see\nHow could I ever have a bad dream when the nightmare's me? Nickel\n\n[Hook: Kobe]\nAnd I'm drunk\nAnd I'm blown\nI don't know what I'mma do\nGot it cocked\nReady loaded\nAnd I'm looking for you\nIn your nightmare\nI'll be right there\n\n[Verse 2: Professor Green]\n\nHahaha\nEverything in life comes at a price\nIt's time for you to pay\n\nMy pen is my paintbrush\nI'm forever taking it farther and further\nGod forbid that I ever extend my art to murder\nYou don't wanna see me and these Shih-Tzu's in a pen\nI'm a pit-bull\nThe world needs a new Fritzl doesn't it\nI ain't thinking about pistols\nFuck a stick\nI'm more interested in doing some other shit\nPlanning shit out\nAnd really having some fun with it\nDisintegrating your body instead of dumping it\nI don't care how uncomfortable your cupboard is\nI'll be up in it\nUntil I hear your front door opening\nYou're coming in (Surprise)\nTil it's time to get to work\nWith the screws and all the other tools that I come here with\nYeah I'm fucking sick in the head\nShould I operate in silence?\nOr pick a cassette\nTo drown out the screams\nAs the blade tickles your flesh\nI can hear the heart in your chest beat as you plead to me\nUntil I cut your tongue out when I'm sick of hearing you beg\nShould have quit while ahead\nYou little fuck\nYou think a little blood is punishment enough\nFor all the things that you said?\nJust as the blade I picked to finish you hits your neck\nYou wake up shivering in your bed\nYeah I'm a nightmare\n\n[Hook: Kobe]\nAnd I'm drunk\nAnd I'm blown\nI don't know what I'mma do\nGot it cocked\nReady loaded\nAnd I'm looking for you\nIn your nightmare\nI'll be right there", "year": null}]}