{"songs": [{"year": "1990-01-01", "album": "Tell the World My Name", "image": "https://images.genius.com/ad49154a5b2f0adfc4b65ed16063a88f.600x604x1.jpg", "title": "Your Mom’s In My Business", "lyrics": "[Intro]\nYeah! Tell your moms to mind her business\n\n[Hook - K-Solo  and Frankie Beverly]\nYour mom's in my business, she's in my business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\nYour mom's in our business, she's in our business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\n\n[Verse 1]\nWhen I first met your moms, I gave your mom respect\nBut now I see she knows me, I see that she suspects\nI'm some bad guy, I don't know why\nYou have to tell your mother lies about you and I\nBut when your first told me, she said that I was a no-no\nCause of my haircut and people call me Solo\nBefore the time you said, you really didn't care\nNow you tell me to change my name, or even cut my hair\nHow would you ever go become somebody's wife\nAnd at the age of 22 you let your mother run your life?\nMe, I'm not the type to tell your moms to get lost\nYell out loud to flip and get my point across\nSee, I think you should tell your moms to leave us two alone\nAnd stop reading our love letters and eavesdropping on the phone\n'Cause if you really liked me, you'd let your mommy know\nShe gotta mind her business \"Before I let go\"\n\n[Hook - K-Solo  and Frankie Beverly]\nYour mom's in my business, she's in my business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\nYour mom's in our business, she's in our business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\n\n[Verse 2]\nRemember your sister and her boyfriend Sam Seed?\nYour momma's the real reason why your sister lost her man\nHer and Sam went together, for a real long time\nBut Sam controlled her body while your mom controlled her mind\nNot saying she was hurt when your moms made 'em break up\nDeep down I could tell, though, your sister wanted to make up\nWith Sam, because she wanted to become his wife\nAnd now she can't do that because your mother runs her life\nYou baby, you do the same things, too\nYou always want to do the crazy things your mommy wants you to do\nLike when we went to the movie, she had to come along\nI went back and forth and forth and back for peanuts and popcorn\nShe took advantage, 'cause I was living fat\nI couldn't even watch the movie, she kept me running back\nFor something that she wanted somewhere else in the store\nI walked and got it all til the man said there's no more\nAnd when I got back to the car, she took her time to move over\nWhen I sat in the car, my movie was like over\nI was mad, hurt, I didn't want to talk\nDeep down I wanted you and your mommy both to walk\nI took you home anyway, like what the heck\n'Cause I was raised to treat people's mothers with respect\nBut when we got to your home, we wasn't left alone\nShe waited there in the car with us until I headed home\nYou called me on the phone, saying you were alone\nBut that's a lie because I heard your moms breathing on the phone\nAnd if you really like me, let your moms know\nShe should mind her business \"Before I let go\"\n\n[Hook - K-Solo  and Frankie Beverly]\nYour mom's in my business, she's in my business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\nYour mom's in our business, she's in our business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\n\n[Verse 3]\nWithout a doubt, me, like when I come to your house\nShe'll ask me crazy questions and start looking in my mouth\nHer friends start laughing and I feel just like a jerk\nI told 'em I don't know where my mom and dad work\nI really know where they work, but that's between them and me\nI can't be putting mom and dad's business in the street\n'Cause if I told her that my family both work for the state\nRight after that she would've asked me how much money do they make\nThen she'd go around the town, bragging and boasting\nTelling the neighborhood what my family's grossing\nYour moms, your moms, why is she so nosy?\nShe plays me like a game but I'm no ring-around-the-rosey\nI even seen your dad at the family barbeque\nHe said \"I don't see nothing wrong with my daugher seeing you\"\nBut it's your wife mister, she don't think that I'm charming\nShe thinks she's Mr. Whippit and she thinks I'll squeeze her Charmin\nI promise I won't do this to your daugher, calm man\n'Cause when I'm with girls, my reputation is not harming\nIf I'm not on tour, I'm working out at my house\nI'll pick your daugher up sometime, and I'll even take her out\nAnd every time I try to do this, I see without a doubt\nYour wife will follow me around like a cop on a stakeout\nAnd when I told the man that, I thought he would help me out\nTill he said \"I can't tell her nothing, she'll kick me out the house\"\nSee, I know you girls, I know you girls, I know you girls, I know you girls\nMothers love you, and they're concerned\nBut if you don't solve your own problems, then how can you learn?\nAnd guys, if you're in a relationship like this\nDon't be afraid to tell your girlfriend tell your moms to mind her business\nBut after me and you girl, I'd rather stay Solo\nBecause your moms can't mind her business, I'm a have to let you go\nBecause your mom is in my business\n\n[Hook - K-Solo  and Frankie Beverly]\nYour mom's in my business, she's in my business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\nYour mom's in our business, she's in our business\nCan't you see girl that your mom's trying to end this?\nYour mom's in our business\nNow tell your moms to mind her business before I let go\n\n[Outro]\nOut, 1990, K-Solo"}], "artist": "K-Solo"}