{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "Kappin’ On 4's", "year": null, "album": null, "lyrics": "Slab up...\nChip the ripper\n\n[Hook:]\nWe kappin(we kappin) on 4's (on 4's) [x4]\n\n[Verse:]\nI be swangin' n' be swervin'\nMy doors doing tricks\nYa already know what slab in dis bitch\nI'm a stack chips, shit, that is my damn name\nPull up slow, pull out dough\nYou broke? that's a damn shame\nI be kappin' on these hoes, got diamonds in my mouth\nKappin on mtv cribs, gotta baseball field in my damn house\nI pull out my strap, leave these niggas assed out\nPulled out my dang-a-lang made your sister pass out\nSee me swervin' through your hood, I don't give a fuck\nWhat time does the movie start? got 80 inch screen in my tahoe truck\nI'm all about a buck?\nSaid that on my last tape\nGettin paid but I ain't change I'm still black and my ass stank\nRidin on 4 ferris wheels 28 inches hold up listen\nStop n scoop up hoes\nWhen they get in I charge admission\nCheck my 77 cutty\nScreens fallin', paint drippin'\nMy inside big enough to have a livin' room n kitchen\nI pull up swang, now old folks complain\nCause my trunk got enough bang to make they oxygen tanks drain\nChip that's my name\nDoors I'm a swang em\nNiggas be hatin', I ain't gonna shoot, I'm a get some barb wire n hang em\n4 15's in the back of my 87 grand prix\nScreens on glow when I pull up slow these niggas can't stand me\nLet my trunk bang\nDrop top cutty ain't got no lid\nRoll through the park, swung on all the kids\nHold up, hold up, stop the beat\nLet me sip my drank\nWen I run outta goose I'm a get out my car & lick my paint\nDoors do the fool\nMy rims stop n' go\nCall up some gold digga' hoes wen they get 2 my house I'm a lock my door, BITCH!\nYes I'm from the slab\nYes I get that cash\nNo I'm not in love with a stipper show me them breasts & bounce that ass HOE!\nKappin' is a habit I'm not tryna break ho\nLet my screens fall on Ray Park and they saw 'em on Lake Shore\nBitch I stay throwed\nBitch I make dough\nI don't spit no god damn game, Hoes fuck when I say so\nWhat u mean fuck a hater... I want u 2 hate me\nCause as long as I got haters I know I that I make cheese\n\n[Hook:]\nWe kappin'(we kappin') on 4's(on 4's) [x8]"}]}