{"artist": "Iamsu!", "songs": [{"title": "As Far As It Goes", "lyrics": "[Verse 1: IamSu!]\nPut my trust in my brothers, listened to what my momma said\nMade my moves undercover, stayed away from what drama is\nAll the while we've been bubbling, hustling to bring them commas in\nSo many people coming, promising empty promises\n\n[Bridge: IamSu!]\nThese niggas be tryna' dress\nI be in designer shit\nCut that shit im not impressed\nLook at who you rhyming with\nAll my homies real as fuck\nAll your homies counterfeit\nLabel tryna' jerry yes\nBut we not allowing it\n\n[Verse 2: IamSu!]\nNeed a mill just to listen, so to spill my position\nI'm colder than whoever won't take my girl out to kiss her\nSo you think I care? Hell no. Might bend but dont break, elbow\nYa'll believe in these rappers, but its those that im after\nIm addicted to stunting buying kicks till im casper\nThat till im gone, ill outlast them\nEvery song is an eargasm, cause I open my mind\nMy words of your imagination\nSu baby!\n\n[Hook: IamSu!]\nTrying to do my thing, right off a dream\nHaters they try to hold but thank god I got wings\nSo this song is what I sing, putting on for my team\nPromise that I'mma get it, get it by any means\nI'mma follow this road as far as it goes\nI'mma follow this road as far as it goes\n\n[Verse 3: Hollywood Keefy]\nI asked the bay and the game what they gon' take me as\nThey see me as a mill but never let them break me fast\nStay prepared for repair so i got the right tools\nIts not about the truth we in the game where ice rules\nAnd these hoes choose all over status\nBut how the fuck we looking [?]\nWhen we search for the baddest\nInfatuated with the lights and all the women that's with it\nYou see these niggas rocking with you\nThen turn cold as a blizzard\nIts like, your real niggas\nAnd them other niggas\nAnd now them other niggas is just other niggas\nSo I stay lifted and try to show you the ways\nAnd I'm running on open ground but its feeling just like a maze\nMy brother is was what you was\nBut you turned into some shit we wasn't\nFelt like you was my fam but now you some bitches cousin\nSo I just spread my wings I'm going up like an airlift\nAnd its rare for me to not be on some epic shit\n\n[Hook]", "image": "https://images.genius.com/e0ccbfab4726287e48b0c9153185d893.500x500x1.jpg", "album": "Kilt", "year": null}]}