{"artist": "Papoose", "songs": [{"album": "The Nacirema Dream", "title": "Die Like a G", "image": "https://images.genius.com/d281c499b368d1c0cfbf223752dedd45.1000x1000x1.jpg", "lyrics": "[Intro]\nThe life of a G...\n\n[Hook]\nIf my death is anything like my life\nThen I'mma die like a G\nThrow your hammers up in the sky just for me\nI don't live in the Stuy, the Stuy live in me\nNigga what! Hit you up with the Mack\nNigga what! You ain't fuckin' with Pap\nSendin' shots at me, I'm bustin 'em back\nSo I ride around the town with the gun in my lap\n\n[Verse 1]\nAyo my bond is my life, my word is my bond\nYou pull the 2-5, I'mma pull the FoFo long\nNiggas can't stop my reign, my buzz too strong\nI was here when you came, I'll be here when you gone\nKeep talkin' like you tough when you're singin' ya song\nI blow ya head off, make the morgue sow it back on\nNiggas catch beef in the night, and slip in the dawn\nThat's why the most bodies get dropped in the early morn'\nWhen the body gets scooped up and shipped to the morgue\nThe killer go in the crib and pillow talk to his girl\nBaby mom say she gon' send him where he belong\nCall the cops that's what happens when the woman is scorned\nAt the end of most arguments somebody get warned\nAlways gotta be right, just admit when you wrong\nSay you gon' ride through the hood and blow your chromes\nBut you just bop through the hood and blow your horn\n\n[Hook]\nIf my death is anything like my life\nThen I'mma die like a G\nThrow your hammers up in the sky just for me\nI don't live in the Stuy, the Stuy live in me\nNigga what! Hit you up with the Mack\nNigga what! You ain't fuckin' with Pap\nSendin' shots at me, I'm bustin 'em back\nSo I ride around the town with the gun in my lap\n\n[Verse 2]\nFeel like I'm Tarzan, aw man, my girl Jane\nMy homies wild like the animals we all bang\nLookin' for this coward cause he owe me some small change\nHeard he in the gambling spot\nHow you gon' gamble while you owe me homie?\nI ran up in the card game with that long thing\nI'm puttin' dots on they heads while they playing poker\nI ain't playin' with ya'll lames\nMan I gave them niggas poker (polka) dots like Charmane\nSayin' they killers, man when they gon' start killin'\nWhen blood starts spillin' ya'll start sayin' ya'll chillin'\nLet them outta town niggas catch ya'll slippin'\nPump work on the block, took food outta ya'll kitchen\nFlossed in ya parties, sexed all of ya'll women\nYou runnin' round talkin' bout you ain't got no hard feelings\nYou ain't got no hard feelings cause you're really a broad\nThis nigga soft, I don't feel him if his feelings ain't hard\n\n[Hook]\nIf my death is anything like my life\nThen I'mma die like a G\nThrow your hammers up in the sky just for me\nI don't live in the Stuy, the Stuy live in me\nNigga what! Hit you up with the Mack\nNigga what! You ain't fuckin' with Pap\nSendin' shots at me, I'm bustin 'em back\nSo I ride around the town with the gun in my lap\n\n[Verse 3]\nCause snatch you sharks out the ocean, and watch you die\nTake you guppies out the fish tank and let you dry\nKill you piranhas at at the blink of an eye\nBut I ain't thinkin' bout you I got some bigger fish to fry\nCause when a nigga live the thug life and somebody hit 'em\nThe family always wanna blame the person who with 'em\nSo if you was with your homie and ya'll got hit up\nAnd he ain't make it and you make it then you better grip up\nNow it's more homicide, more bloodshed\nCause all they really wanna know is why you ain't dead\nA nigga follow my whip I ain't gon' scream and shout\nI'mma lead 'em to his death, that's what I'm about\nCall my homie on the cell, you chillin no doubt\nThese niggas followin' the whip, they must think I'm a slouch\nI'mma ride through the block, by the club house\nWhen you see the car behind me, air that shit out\n\n[Hook]\nIf my death is anything like my life\nThen I'mma die like a G\nThrow your hammers up in the sky just for me\nI don't live in the Stuy, the Stuy live in me\nNigga what! Hit you up with the Mack\nNigga what! You ain't fuckin' with Pap\nSendin' shots at me, I'm bustin 'em back\nSo I ride around the town with the gun in my lap", "year": "2013-03-26"}]}