{"songs": [{"year": null, "lyrics": "[B.o.B]\nYou know it’s a whole lot of talk about southern hospitality and shit. You know, true, true. It’s a lot of love down here, we got love for, you know, that’s why niggas like come down here. But um, you know, we don’t get no respect in this music bitch, we been on top for so motherfuckin’ long, we just been quite, you know down here, crankin’ that shit, niggas be hatin’ this shit, you know what I’m saying? But now, it’s the motherfuckin’ time, it’s the movement, we finna keep this shit on the top, nigga. I don’t give a fuck where you from, you from the south nigga, do this shit, rep your city, grind it out. Niggas don’t know how to grind, niggas be getting tired, niggas be taking their eyes off the ball. They niggas takin’ they position in jobs and then they want the bitch and shit. But I don’t give a fuck, DJ Smallz you with me nigga? Yeah, yeah, you know, you know, you know, Cloud 9 [?] One time for the East Side. But, you know, it’s a lot of Fear Fact that’s going on and shit, and Fear Fact, that’s you know, niggas scared, niggas, when niggas get scared they tend to hate a little bit, you know, but we brushed that oh no. You know what I’m talking about? But eh… I do this shit here for the Decatur, do this for the east side all day. I love the whole south though but Decatur that’s my home. And I rep that shit to the fullest. And you gotta remember nigga, y’all niggas that make it: Get back to your motherfuckin’ hood cause that’s the reason you are, you at where you at. I could be born nigga, if I was born in Beverly Hills or some shit, nigga I’d probably be a white boy, I’d probably be a skateboard dude or some shit, I’d probably be a rockstar shit. But now I’m from Decatur nigga, I’m from the East Side, gotta stay down for the hood, yeah, yeah, you know. Anyway let’s keep this shit rolling", "title": "Decatur", "album": "Cloud 9", "image": "https://images.genius.com/96f49a6c2a496c980bf06e29a9bc9f54.400x400x1.jpg"}], "artist": "B.o.B"}