{"artist": "Cam’ron", "songs": [{"title": "Hello", "album": "The Program", "year": "2017-11-11", "image": "https://images.genius.com/2d988f3cf7ed4e06f71fc90a8d5abc57.1000x1000x1.jpg", "lyrics": "[Intro: Cam'ron]\nHad to do this far my man, Murph\n\n[Intro: Don Q]\nDon\n\n[Intro: Cam'ron]\nKilla!\nHELLO!\nRip Murph!\n\n[Verse 1: Don Q]\nTalking to lead, I'm one of the last few\nHad to get my respect, it was past due\nThrough with my past, I just reminisce when I pass through\nMovin' them bags, tryin' to get 'em flipped 'til my stash grew\nShooters that blast over the nonsense when the cash blue\nAsk who? He was there when nobody actually cared\nReal shit, had to share his kicks for half of the year\nAnd now I take mine and I take his daughter shopping\nSame nigga pull up to your door with the .40 knockin'\nI got niggas quarter coppin', coke in the water, lockin'\nAll they ever knew was hustle, cause they never saw an option\nI'm hearin' the sneak dissin', I'm tryin' to ignore the gossip\nThird tape better be an earthquake before I drop it\nI hear the hoes ponderin', I got a cult followin'\nJoe Carroll, I throw arrows into your soul hollerin'\nI probably not the most known but I'm the most confident\nThe most relatable, no debatable, most dominant\nI'm in need of a blessin', I'm blowin' weed to the heavens\nCause in my dream I was destined to see me speedin' in 7s\nWhen you look in the mirror, nigga, and see your reflection\nIs you really or not? That's the easiest question\nI'm around OG's, that was sellin' keys out the Westin\nNever leave ya protection, and never speak off confessions\nY'all niggas getting lost, when they only need a direction\nFeel it when you look at his momma face, and see the aggression\nDON!\n\n[Hook: Cam'ron]\nHELLO\nAw man\nHarlem World\nHELLO\nHigh Bridge\nHELLO\nBronx, Queens\nHELLO\nBrooklyn\nHELLO\nStaten Island\nHELLO\nAw man\nMy bad ladies\nHELLO\nYou gettin' money?\nHELLO\nYou fuck with snitches?\nHELL No\nOk\nHELLO\nHELLO\nHELLO\nAw man\n\n[Verse 2: Cam'ron]\nHe know killers, y'all know Killa\nFast cars, speed boats, all sorts of villas\nBad girls, jewelry, drive-bys, chinchillas\nR-I-P to Mike but I'm the real Thriller\nI'm done with that though\nI ain't beefin' with the family man\nShit I'm still in the PJ's like candy man\nWith dudes sellin' whole halves of candy yams\nDespite that the garage look like Candy Land\nCandy painted, ain't nothin' about me tainted\nDrove every car, you name it, look homie, come get acquainted\nCan't change it or rearrange it, disclaimer because I'm heinous\nThe 9 will make you famous, blaow! That's for the plaintiff\nThe gun range no goggles, the targets they testin' nozzles\nThe bullets they on point, them points you call hollows\nIn the club we get the bottles, we leave it we hit the throttle\nThen pull up inside McDonald's with porn stars and models\nLook nigga you can't erase me\nDebate me, rape me, I'm Spacey\nThese bitches, they want my baby, nah baby, but you can taste me\nThe guns got no safety, in DC, for when they grazed me\nAnd I ain't been postin' lately, y'all would really hate me\nYeah homie, it's a blessin', I'm here to answer the questions\nI'm the OG Don Q was talkin' 'bout at the Westin\nYeah, yeah, baby let that molly rock\nNiggas suckas, I'ma start sellin' lollipops\n\n[Hook: Cam'ron]\nHELLO\nAw man\nShe sniffed a line\nHELLO\nDamn that ass fat\nHELLO\nDown south\nHELLO\nMidwest\nHELLO\nWest coast\nHELLO\nAw man\nHELLO\nYou gettin money?\nHELLO\nYou actin funny?\nHell no\nOk\nHELLO\nHELLO\nHELLO\nAw man"}]}