{"artist": "Philthy Rich", "songs": [{"album": "NERNL 4", "title": "Dame Fame", "image": "https://images.genius.com/a6a27f99dd8148cd8c60b17f0f15fa50.1000x1000x1.jpg", "lyrics": "[intro: Philthy Rich]\nIt's Philthy\nThis shit be crazy how these niggas smile in your face\nAct like they fuck with you, but they really don't\nIt's Philthy\n\n[Chorus: SYPH & Philthy Rich]\nWhoa, too much, nigga too much, nigga too much (think we forgot nigga?)\nWhoa whoa whoa whoa, lean by the truckload (I know your secrets pussy)\nThese niggas yellin' murder, murder, all you smell is gunsmoke (you made me expose you bitch)\nI don't know who to trust, no\nI came up, I came up, man I came up (Seminary, Funk or Die nigga)\nWhoa, whoa, whoa why they prayin' for my downfall? (uh-huh)\nToo much money rollin' in, I done lost count (it's Philthy nigga)\nI don't know who to trust, no (look, look)\n\n[Verse 1: Philthy Rich]\nIf Jody Bo was alive bitch (ayy rest in peace)\nKnow that nigga wouldn't fuck with you (you know he wouldn't)\nTold on a couple Richmond niggas (is that right?)\nNow the hood don't fuck with you (uh-uh)\nIn the hood selling cocaine (Seminary)\nI was never blinded by the fame (never)\nHad the shit before I had a name (it's Philthy ho)\nI ain't never offered you his chain (fuck outta here)\nYou done woke up a sleeping giant (you did)\nAsked me to keep your secret quiet (you did)\nYou ain't never in the hood though (never)\nYou be passing through or you sneaking by (pussy)\nReal FOD ENT (FOD)\nWe don't gangbang, no ENT (uh-uh)\nSeminary and Foothill (Seminary)\nRight in front of Als, tryna move a key (thirty-six)\nThe crazy part, I used to fuck with you (I used to)\nYou came home on some bitter shit (bitter bitch)\nYou called my phone when I was in Atlanta\nOut your own mouth, you told me that you snitched (I swear to God)\nYou took the stand, nigga you' a ho (nigga you a ho)\nThat ain't what Funk Or Die stand for (uh-uh)\nThought I was tryna take years from you\nShould've let the whole Acorn know (I should've nigga)\nIt's Philthy nigga\n\n[Chorus: SYPH & Philthy Rich]\nWhoa, too much, nigga too much, nigga too much (this nigga must be on dope)\nWhoa whoa whoa whoa, lean by the truckload (fuckin' with the wrong one)\nThese niggas yellin' murder, murder, all you smell is gunsmoke (huh?)\nI don't know who to trust, no (it's Philthy nigga, Funk or Die)\nI came up, I came up, man I came up (I did nigga)\nWhoa, whoa, whoa why they prayin' for my downfall? (I know you mad pussy)\nToo much money rollin' in, I done lost count (hatin' don't do shit nigga)\nI don't know who to trust, no (look, look)\n\n[Verse 2: Philthy Rich]\nMy biggest hater since the first day (he is)\nI shake something like an earthquake (I will)\nHe was in his feelings when he came home (oh I remember)\nThen he found out that he fuckin' Mae (broke nigga)\nBut no disrespect to her though (uh-uh)\nMe and her, it's all love though (it's all love)\nThis pussy nigga keep runnin' his mouth (pussy)\nI'ma fill it up with a slug though (it's Philthy)\nStop telling niggas you don't fuck with me (ayy do that)\nTell them niggas why you don't fuck with me (ayy tell 'em why)\nMad Mone and Mae stuck with me (you mad pussy)\n'Cause real niggas they fuck with me (salute)\nYou forfeited all that gangster shit (you did)\nWhen you took the stand, you lesser than a man (pussy)\nIn the kitchen bustin' down the grams (skrrt skrrt)\nMom's mad I'm fuckin' up her pans (she is)\nWho you think you really fuckin' with? (huh?)\nMy money right, we can go to war (SemCity MoneyMan)\nWe can't funk while you broke Stacey (uh-uh)\nIn the streets we can hold court (Funk or Die)\nWhat you gon' say? I'm gettin' extorted?\nAin't from the hood? bitch I heard it all (I done heard it all)\nWhen you came home, want me to put you on (you did)\nBut snitch niggas ain't meant to ball (uh-uh), this Philthy nigga\n\n[Chorus: SYPH & Philthy Rich]\nWhoa, too much, nigga too much, nigga too much (ayy I told that nigga keep my name out his mouth)\nWhoa whoa whoa whoa, lean by the truckload (ayy Fab, didn't I tell him? ayy Stone, you remember)\nThese niggas yellin' murder, murder, all you smell is gunsmoke (but he ain't listen though)\nI don't know who to trust, no (fuck him we ball, it's Philthy)\nI came up, I came up, man I came up (Funk or Die, we don't do no tellin')\nWhoa, whoa, whoa why they prayin' for my downfall? (uh-uh lil Stacey, we don't represent the same thing nigga)\nToo much money rollin' in, I done lost count (I come from the struggle bitch, play with me nigga)\nI don't know who to trust, no (it's Philthy ho, huh?)", "year": "2017-12-11"}]}