{"songs": [{"album": "The Power of a Woman", "image": "https://images.genius.com/17e4b3762f8018fd779a43b805912aee.399x400x1.jpg", "year": null, "title": "Ruthless Bitch", "lyrics": "[Intro:]\n\"Yo, I'm tired of everybody telling me\nWhat I can and can not do\nSo I'm not doing a grand finale\nAnd there'll be no special thanks on this track\nCause this is my trademark\nSo if you can't take what you're about to hear\nThen cover your ear and gimme some guitar\nNah, it's gotta be harder\nGimme me drums\nYeah!  Cause there's a time to be nice\nBut right now, it's time to be Ruthless!\"\n\n[Verse 1:]\nYo', girls, I can handle a mic, right? (Right!)\nSo why they all playing me like\nI can't hang when the name of game is retail\nThat's right, I'm a female\nPunk motherfuckers and I'm too strong\nTo let you stop me, I'll prove you wrong\nMale chauvinists who refuse to believe\nThat a girl like me can achieve\nStatus, the same as a man\nI'll be damned, let's make a Ruthless Jam\nGimme a coat so I can clear my throat\nCall this a sequel to 'Murder She Wrote'\nMore trouble for a devil on a level of a gangstress\nTo the boys in my band, I give thanks, this\nBeat is just what I need to get my point across\nI'm the female mob boss\nYou know my rep and I ain't half-stepping\nKick the rhythm as I stash my weapon\nCops are left and right\nThe label's under question cause we're too damn hype\nAnd outspoken so remaining anonymous\nIt is impossible the name it is synonymous\nWith Ruthless, who will you pick\nMy name is Tairrie, and the B is for bitch\n\n[Samples:]\n\"Black murderous, the bitch is Ruthless\"\n\"What the fuck is you doing now?\"\n\n[Verse 2:]\nI'm gonna tell you about a ho' I know name Linda\nNever with a groupie, get over so I'm fi'n ta\nDiss the hooker, you're just jealous\n'Cause I pimped all your so-called fellas\nI say to myself, it's time you get caught\nLinda can't pretend to be something she's not\nI operate with sex appeal\nYou're on the doctor's dick for a deal\nWhen it comes down to it\nYou're nothing but a prostitute\nKnocking boot\nAnd now you wanna come to my town\nThere's only one female on Comptown, tramp\nDon't think you stand a chance\nI'm fed up, so let's go head up\nI'll kick your ass and if that don't stop you\n(The Comptown crew will drop you)\n'Cause you ain't no rapper, and what do you look like\nRumor has it, you're a dyke\nBy now you must be 43\nTell me how you gonna get with me\nI'm young and beautiful, playing with the full deck\nIn full effect\nYou got no respect and your lyrics are corny\nWhoever told you that you could rap, they were horny\nAnd you were nothing more than a skeez\nPlease, get real, you'll never get record deal\nYou're Fatal Attraction, that shit is scary\nWho's gonna sign an ugly wannabe Tairrie? No one\nYou should have known better\n(If she steps to you?) Yeah, let her\nThen well see what the B is for\nI'll autograph the fan and pimp slap the whore\nShe ain't down, she looks like a clown\nAnd she's jocking every rapper and producer in town\nSo why, you ask, would I bother to do this?\nTell her girls... (The bitch is Ruthless!)\n\n[Samples:]\n\"There's plenty of that and much more\"\n\"It's about time one of you hear it\"\n\"Remember the old days when you could beat up a woman?\"\n\n[Verse 3:]\nNow when it comes to men, I got a one track mind\nStep to me and you just might find\nA female who stands her ground\nSo when provoked, I won't back down\nAll you had to do was love me\nBut instead you chose to shove me\n'Till death to us part for the rest of my life?\nNo, I won't be no battered wife\nTaken for granted 'cause you rock my world\nTake advantage, you're fucking with wrong girl, punk\nI don't care if you're drunk or sober\nPut your hands on me, it's over\n'Cause I don't play coy, not with a boyfriend\nBut I'll play you, just like a toy, friend\nThrow you away when I'm done\n'Cause a bitch is a bitch but I ain't the one\nTo be cheated on or beaten on\nI'm talking Burning Bed, enough said\nThe fire is dead, so there ain't no use\nDon't try to come back, you got no juice\nI want a real man to respect and love me\nNot a punk little sucker to push and shove me\nPlay it again, lemme say it again\nI'm well prepared when it comes to men\nYou see, nowadays, I rap with a vengeance\nI'm a new woman but this ain't revenge\nIt's putting the past on the shelf\n'Cause 'bitch' means 'being in total control of herself'\nI'm not your baby doll, you juiceless\nThe bitch is back and this bitch is Ruthless\n\n[Samples:]\n\"A crazed bitch with a gangster profanity pitch\"\n\"Take me to the next plateau\"\n\n[Verse 4: ]\nVerse four, I got a score to settle\nThis ain't high energy or heavy metal\nIt's rap, so when it comes to punk motherfuckers\nLemme tell you about a man and his band of suckers\nTwo tramps who think they can sing\nTried to rap when they thought it was a in thing\nCouldn't even write a good rhyme\n'Cause you ain't legit, you don't know the time\nTo answer to LL? Gimme a break\nNo heart from the start, which proves you're fake\nAnd nowadays, you 'Love to Bass'\n'Cause house is the latest craze\nSo you jump on the bandwagon, sell your soul\nWhat's next, rock-n-roll?\nYou got sexed\nSo how does it feel to slut your way to a deal\nI don't sell my body for money or a meal\nAnd the name I use is real\nWhat the fuck is Acacia?\nIt's a name of a tree\nLook up Tairrie B\nYou'll see the definition is Ruthless, rival, your enemy\nGet off my tip, you ain't no friend to me\nHow you feel, you look real sick, not sexy\nMore like anorexic (You on that diet called crack?)\nIt's either that or smack 'cause your body is wack\nPut a little meat on your bone\nPick up a fork and drop the microphone\nYou going down while I'm coming on Comptown\nWe sell sold gold, platinum bound\nAn underground sound guaranteed to succeed\n'Cause looks ain't all you need\nYou gotta have talent, you know, skill?\nYou can't reply on the birth control pill\nSo if you wanna get ill, I suggest you chill\nDon't attempt to diss, you know I will\nStep to ya' face to face\nIt doesn't matter the time and you can name the place\n(Word to the mother)\nTake a look at my cover\nI'm a Ruthless bitch, far from a lover\n\n[Samples:]\n\"B-I-T-C-H\"\n\"Something far from a lover\"\n\"What you want me to?\"\n\n[Verse 5:]\nI'm the artist, the hardest\nExecutive producer, writer, arranger\nSo don't be too sure\nThat I'll be played and give the credit away\nAnd let them call me a protégé\nI didn't come in like a sucker\nAnd I'm not going out like one motherfucker\nYeah, I speak my mind, don't tell me to shut up\nPlay me close homeboy (What up)\nIf your name ain't on it\nThen my record won't hit?\nIf you don't produce it, it ain't legit?\nThat's bullshit, you living like a sucker\nYou stuck up, suped up, sorry motherfucker\nA Ruthless attack is what's going down\nBut you ain't got nothing to do with Comptown\nI produce myself so I brag it\nGo back to wearing sequins, 'cause you look like a faggot\nWorld Class? You got no class\nSo when they said that you'd produce me, I said I'll pass\nAs for the Grammys, I'll put that on the shelf\nIt takes a punk motherfucker to play himself\nYour best shot was weak, I didn't need no stiches\nGet this straight, I ain't one of your bitches\nYou cartoon gangsta, I'm calling your bluff\nHitting a woman that makes you real tough\nI had enough of you flaunting your grip\nI'm no fan so get off of your own tip\n'Cause the music you make may come from the streets\nBut it sounds like Ultimate Breaks & Beats\nMy opinion is you ain't all that\nYou're a pussy, the definition: cat\nAnd that ain't no joke you think that it's funny?\nIntegrity is more important than money\nAnd either you got it or you don't, but I won't front\nI'm just here to stunt\nOne producer who said he'd produce this\nWith or without you, I'm Ruthless\n\n[Outro:]\n\"And there you have it, a Ruthless bitch\nNow ask yourself, are you that ignorant punk-ass fucked up overweight wannabe gangster?\nOr maybe you're that psycho, civil jocking Jerry Heller, washed-up over the hill, pushing 50 rap star tipping, ugly wack demo never gonna be nothing, hooker?\nYeah, you probably are\nI told you not to fuck with me.\""}], "artist": "Tairrie B"}