{"artist": "Post Malone", "songs": [{"album": null, "title": "No Reason (Version 2)", "image": "https://images.genius.com/fc7e20f4fe2f7dd19a877bb5cb1677bc.937x937x1.jpg", "lyrics": "[Intro: Kanye West]\nA hunnid years from now we gon' all be dead, all be dead\nAll be dead, so tonight, bitch, I might as well get head\nA hunnid years from now, we gon' all be dead, all be dead (boom)\nSo, tonight, I might as well get head\n\n[Verse 1: Kanye West]\nDon't ask about my daughter, don't ask about my family\nDon't ask about the manners, don't ask about the [?]\nDon't ask about the money, don't ask me how my [?] is\nDon't ask about a debt, like you finna help\nNigga, fuck you and yourself, I can tell it wasn't a deal\nAll positive vibes, hashtag fuck a bitch, God want it, want it back (click, boom)\n[?] ridin' through Calabasas, lookin' up the [?] with the ass\nNever good I know, bitch kinda want a man\nMore stuntin', why you niggas always mad? (ayo)\nApologize to Pablo, apologize to Pablo, apologize to Pablo\nWild nigga from the south, ayy, south, southside of Chicago, ugh (perfect)\nThem niggas, that's nigga, that nigga, tell me I'm that nigga, ugh (perfect)\nThem niggas, that's that, that nigga, tell me I'm that nigga, ugh (you)\n[?] gonna getcha, uh (you)\nOne day, karma gon' getcha, uh (you)\nI'm gonna [?] and I been sittin', uh (click, boom)\nWaitin' here, sittin' with the .45\nI [?] with the low life\nI been waitin' for this shit my whole life\nI been on a [?] with your Go-Ride\n\n[Bridge: Kanye West]\nHunnid years, though, we gon' all be dead, all be dead\nAll be dead, so tonight, I might as well get head\n\n[Pre-Chorus: Post Malone]\nI got a tan line, I wear my fuckin' Rollie so much\nLil' bitch, you think you somethin', but I find you in the gutter\nKinda want it, bought it with the money, oh look\nWhich girl you don't fuck, I'm gonna tell you how to fuck her\n\n[Chorus: Post Malone]\nCount a hunnid bands, watch it swerve on the street (oh-yeah)\nCount a hunnid bands, will I know? No, not me (oh-oh-oh-oh)\n\n[Verse 2: Post Malone]\nLil' mama gon' suck me up, hell no, 'cause we're on your season (oh-oh)\nNow I got shawty on my (haha)\nYeah, I left her for no reason\nLeon DeChino gon' fuck on your bitch\nI just don't remember nothing when I wake\nI just put forty-thousand on my wrist\nI just be like I'm a man on a mission\nEighty on, motherfucker, ayy\nI remember back in endless summer, ayy\nIt was 2012 while we in the summer\nYeah, when I lease that shit, don't matter\n\n[Pre-Chorus: Post Malone]\nGot a tan line, I wear my fuckin' Rollie so much\nLil' bitch, you think you somethin', but I find you in the gutter (oh-oh)\nKinda want it, bought it with the money, oh look\nWhich girl you don't fuck, I'm gonna tell you how to fuck her\n\n[Chorus: Post Malone]\nCount a hunnid bands, watch it swerve on the street (oh-oh-oh)\nCount a hunnid bands, will I know? No, not me (oh-oh-oh)\nCount a hunnid bands, watch it swerve on the street (oh-oh-oh)\nCount a hunnid bands, will I know? No, not me\n\n[Verse 3: Justin Bieber]\nAnd you talkin' that shit for no reason (and you talkin' that shit)\nWhen you know you comin' home this evenin' (when you know you comin' home)\nWhy you wanna come and play with my emotions?\nWhen you know you should be going through the motions\nWe don't got no time to waste, whoa-oa-oa\nThis is not the time or place, oh-oh-ohhh\nThis the shit that make you wanna wow (wow, wow)\nAnd I really think I'm on that king shit\nMake you wanna bow down (bow down)\nOoh, I'm feelin' like I lost it now\nGot me runnin' like a faucet now\nTell 'em there's a new boss in town\nGirl, I'm feelin' like I'm lost and found\n'Cause I'm so up and down\n'Cause I'm so up and down\nSo up and down\n\n[Pre-Chorus: Post Malone]\nGot a tan line, I wear my fuckin' Rollie so much\nLil' bitch, you think you somethin', but I find you in the gutter\nKinda want it, bought it with the money, oh look\nWhich girl you don't fuck, I'm gonna tell you how to fuck her\n\n[Chorus: Post Malone]\nCount a hunnid bands, watch it swerve on the street\nCount a hunnid bands, will I know? No, not me\nCount a hunnid bands, watch it swerve on the street\nCount a hunnid bands, will I know? No, not me\n\n[Outro: Post Malone]\nHey, ohh-ohh, oh, yeah\nHey, ohh-ohh, oh, yeah\nAnyone got a problem with me?\nYou the same one that doubted me\nWe done came up, don't matter to me\nYou the same one that doubted me", "year": null}]}