{"songs": [{"album": "Cole World: The Sideline Story", "year": "2011-09-27", "title": "Dollar and a Dream III", "image": "https://images.genius.com/3ac07121f2a2f8d9daeb3c8f66fdc787.505x505x1.jpg", "lyrics": "[Intro]\nYeah, hey, Cole world\n\n[Hook]\nHey, I gotta dollar and a dream, that's all a nigga got\nSo if it's 'bout that cream, then I'm all up in the spot\nI got a dollar and a dream, just a dollar and a dream\n\n[Verse 1]\nCole, walk with a nigga, I give you my pain\nSo much on my mind, I wonder how it fit in my brain\nScattered thoughts, dark secrets lead me to a blacker heart\nLife can't get any worse, Stevie with his glasses off\n'Cause I still don't see hope, lookin' for a quick fix\nWhen everyone I see is broke, get lost in weed smoke\nKnowin' it make it worse, thoughts roam uncontrollably\nBarely trustin' niggas, over a decade they been knowin' me\nShit, life at the bottom, nobody but God got em'\nThey say he wouldn't leave me, yet I'm fallin' like it's Autumn\nTell me, what do you do just when you're on your last dollar\nAnd the stress of this mess you in can make your ass holla?\nDo you fold, grow bitter and grow cold?\nNo longer fightin', now the only thing you grow is old\nOr do you flip that fuckin' dollar to a dream?\nWhether a scholar or a fiend, watch a pawn become a king\nCole!\n\n[Bridge]\nYoung nigga with his jeans low\nNice guy, just got a mean flow\nNever seen rich but he's seen poor\nMr. Dollar and a Dream in case she know\n\n[Hook]\nThat's all a nigga got\nSo if it's 'bout that cream, then I'm all up in the spot\nI got a dollar and a dream, just a dollar and a dream\n\n[Verse 2]\nYeah, armed and ready, you niggas strung out, you spaghetti\nYa paper, confetti, small time, ya'll on one, I'm on mine\nYou logged off 'cause I'm online, small talk from small minds\nI wanna buy the mall but there ain't shit in this small town\nThis where I get my dough\nMy niggas make sure the money right and then I rip the show\nI run the town they tried to call me underground\nI spun around like, you wish\nHomie my backpack Louis, now watch just how I do this\nI got the nerds rappin' hard shit, dummies rappin' smart shit\nMozart meets Humphrey Bogart with this from the heart shit\nPlay your part, life is but a dream for me\nI get a flash of nightmares when niggas scheme on me\nIt's hard to see my enemies, who infiltrated my team\nI take a step back and notice that things ain't what they seem\nThat's when a nigga refocus, yeah I turn on them high beams\nI got that red dot waitin', I'm wastin' your whole regime\nI wish a nigga would, boy you can't out-smart me\nI let you feel like you the shit, but boy you can't out-fart me\nYa never have it, I know you want what I got\nBut nigga you ain't me, but you are what I'm not\nAnd that's a phony ass, lonely ass, Cole is what you know me as\nBut we far from homies, if you know my mama, you know me\nIf ya don't then well I'm sorry, you should get to know Kay\nMan she been workin' too hard, I should send her a bouquet\nMy goal this year is a real one, gonna stack a million\nAnd as soon as I do, Mama that 9 to 5 is through\nAnd I know I ain't been callin', but I'm thinkin' 'bout you\nAnd all the shit that you been through\nMy girl and then my brother too\n'Cause this life gets hard on this road, yeah it's true\nI don't never tell you how much I be stressin', but I do\nBut I suck it up for who? my fans, and my mans\nWho probably never ever had this type of lifestyle in they plans\nHoppin' in and out of vans, on the buses, on the planes\nGettin' brain from a bitch and thinkin' \"Goddamn, what's her name?\"\nSometimes I just shake my head and tell myself this is a shame\nAnd then my other side kick in like, \"Bitch, don't be so fuckin' lame\"\nDang, what a life, another day, another night\nAt times this shit is all blurry, pray and hope that God heard me\nJust for those prayin' for me, man I know that y'all worry\nBut I ain't never failed and you can bet I never will\nCole!\n\n[Bridge]\nYoung nigga with his jeans low\nNice guy, just got a mean flow\nNever seen rich but he's seen poor\nMr. Dollar and a dream in case she ain't know\n\n[Hook]\nHey, I gotta dollar and a dream, that's all a nigga got\nSo if it's 'bout that cream, then I'm all up in the spot\nI got a dollar and a dream, just a dollar and a dream\n\n[Outro]\nHey, 'cause nigga that's life, and trust me I'm livin'\nLook what a nigga made out the shit that I was given\nLook what a nigga made out\nLook what a nigga made out\nGot a dollar and a dream\nThree"}], "artist": "J. Cole"}