{"songs": [{"image": "https://images.rapgenius.com/689bdfe446ec13119a08b269ed683a9a.1000x667x1.jpg", "album": "Soundcloud Releases", "title": "Tell Me Why", "lyrics": "[V.I.P.]\n[Intro]\nHello, black eye pea pea\n\n[Verse 1]\nEveryday I wake up I try to be a better man\nEveryday I wake up I come up with a better plan\nEveryday you wake up, he giving you another chance\nI think we need to wake up my city madness in the dance\nWho was there when I needed a hand? Where was you?\nFirst pull up your pants how you considered a man?\nWhy's it always AOB?\nIt ain't trickin' if you gotta get a JOB\nMy lady got someone a PHD\nI got the tips she want a hint, you can see-see me\nAnything possible look at BET\nThere's other ways than the streets to EAT\nCome on when it was cool to be considered a thug\nY'all lyrics worse then the drugs\nMiles traps the boys be our plug\nWhy you a squirrel when you serving the school?\nYou must be taught by OG Cool, The Street Goof Fool, Wisdom rules\nDon't care for the jewels, Why every cop gotta seem so cruel?\nScrach us out, I ain't speaking of pool\nShooting at us like we aim at a tool\nTarget practice, guess we the beer bottle, another dead body on a stoll. Why?\n\n[Hook]\nAs long as I've been living\nMy vision be -?\nThey want me in the system\nBut why they gotta do us like that?\nI was driving on the highway\nThey see me and have to flash me\nWhy? Oh why, they gotta do us like that?\nWhy they gotta do us like that? [x3]\nWhyy?\nWhy they gotta do us like that?\nI said why they gotta do us like that?\nWhy? Oh why, they gotta do us like that?\n\n[Damian Lillard]\nHey keep it real, why y’all loving me now?\nWhy they love the Dame face but ask me why I don’t smile?\nWhy when people time pass they still think they ahead of the crowd?\nWhen I made it why they take shots instead of a bow?\nWhy they never heard my knock at the door?\nWhy my family in a mansion but be knocked on the floor?\nWhy I’m circled by the rich but getting love by the poor?\nWhy they respect my hustle now but not the dudes by the store?\nWhy?\nWhy the world get its motion from money?\nWhy is Instagram getting folks indicted? Why we posing as dummies?\nWhy these people care to follow my tweets?\nWhy we ignore the call from God, turn around and take the call from the streets?\nWhy do weak think they can walk in my shoes?\nWhy people walk on egg shells to try to soften my mood?\nWhy I’m different from my peers? Why my cloth ain’t as cool?\nWhy is mothers losing kids just from when they walk into school?\nWhy a microscope follow my life?\nWhy these haters think I’m cocky when I’m lost in the lights?\nWhy my money bring attention from the broads that be nice?\nWhy we balling so hard and still we be going on strike?\nWhy my wardrobe get so much praise?\nWhy I’m always a trending topic? Why they loving my ways?\nWhy my life moving fast but I’m stuck in a daze?\nWhy we chase all the things that keep us stuck in the maze?\nWhy?\nWhy my neighborhood change for the worse?\nWhy dudes only on their best behavior so they can get time served?\nWhy we all want to be from the hood?\nWhy we can’t accept ourselves? Why these people always stretching the good?\nWhy I played hoop at three high schools?\nWhy they ain’t respect my game? Why they had me ranking behind dudes?\nWhy wasn’t Carolina having me scouted?\nWhy I lead the nation scoring just to hit the league and be doubted?\nWhy I get angry when I’m blessed to the max?\nWhy they measure my success by the checks that I stack?\nWhy we only do deeds when the cameras around?\nWhy I’m tired of everything when I got stamina now?\nWhy?\nWhy my autograph carrying weight?\nWhy a follow from my Twitter make ‘em carried away?\nWhy when I’m happy it be people trying to bury the day?\nWhy we wait til nothing left til we be ready to pray?\nWhy?\nWhy go to college to not get nothing from it?\nWhy we on these people’s campus and they swearing we run it?\nWhy I’m spending all this time busy surfing my phone?\nWhy we failing in the class but know every single word to the songs?\nWhy is people so fake with the fame?\nWhy they get so much surgery that it’s hard to put a face with a name?\nWhy love a life that ain’t loving you back?\nWhy I’m successful with the rock but feel I was destined to rap?\nWhy?", "year": "2015-07-27"}], "artist": "Dame D.O.L.L.A."}