{"songs": [{"image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg", "title": "1996 Freestyle", "album": null, "year": null, "lyrics": "[Verse 1: Nas]\n\nWhat up?\nEscobar season begins\nRepent your sins\nNine-Six\nTrackmasters\nCheck it\n\nSpark the lye with the eight-forty I fly\nPretty thug show no love its like when doves cry\nMaybe I'm just too demanding, parked the Land\nMark Buchanan, fuck a job I'mma die scramblin\nDigger gold, dig a bigger hole in ya soul\nQue Pasa, Pablo's throne cabron\nAt the airport the Mobb picked me up in a truck\nJewelry chunky like fuck never scared to get stuck\nSo whats the deal Papi?\nHeard the feds could of knocked me\nHad the cuban posse all up in my room and lobby\nNegotiating, my name holds weight, we motivatin'\nHustling, as if God was dancing with Satan\nThe Firm waitin', to get ajourned cause we facing\nDouble life, thuggin for life, you taste it\nThe white numbin ya toungue\nI bought it from Dominicans\nA suitcase of benjamins swung tight in his fingers\nHad the Firm gun slingers, hit the lights, grab the white\nMurder everything in site, and jet in the Bimmers\nNow im home with the phone screaner\nResting the stones in a jewelry cleaner\nCheckin my mail reading my supoena\nTo the witness standing, I got remanded\nLivin on the 4th building and can't stand it\nGotta fight my case from the inside\nNiggas telling, I felt it coming when my pockets started swelling\nBut thats the game for ya\nHid a stash to ya lawyers\nSupreme court, Queens New York will bore ya'\nSuited up, booted up, with the jail cut\nMillion dollar bail what?\nZ put up the house and I was out\nWord the Fuck Up\nTime to get the shit on son\nTryna trap a nigga\nIncarcerate me yo'\nCheck it tho, yo, yo\n\nIm gonna make it if I try, cross my heart hope to die\n(cross my heart hope to die)\nIm gonna make it if I try, cross my heart hope to die\n\nPraise the Lord, ive been scarred with hot water\nDays are shorter, next court dates around the corner\nMoney ain't the same, shit is outta order\nSince the days of Rich Porter\nSomething gotta give, I ain't trying to bid\nNow I run up in cribs, body shit, but no women no kids\nIn the Bridge where the murderers live\nI used to make a quarter million monthly\nI was ill until they sunk me\nKilled the snitch with the pump 3 shots\nBought a passport off a junkie\nThe Firm helped me flee out the country\nWord and I'm out, Pakastinian land\nChilling with my man Jungle\nThe commissioner Stout\nKilla B, what it is nigga firm biz"}], "artist": "Nas"}