{"songs": [{"title": "BIG", "lyrics": "[Intro]\nIt's that big drip\nZombie on the track\nI got a bunch of niggas in the studio\nThat's gang gang though (Facts)\nEverybody good over there, you heard? (It's RedLyfe)\nUh, uh, uh\n\n[Verse 1]\nNever been a hater (Never that)\nI just stick to my paper like a stapler\nYellowbone smoking purple, LA Lakers, uh\nAnd she give me pussy on the wake up\nDouble cup of carrot juice\nOh, that's my savage juice\nI just copped an Audemar\nOh, and a Patek too\nDripping in that Iceberg\nOh, in that Kappa too\nAyy bro, don't you cuff that ho\n'Cause I done had her too\nThey say that they packin', oh, we packin' too, uh\nRun up like what’s poppin' and what’s brackin' too? Uh\nSaid I would get rich, then made it happen too, uh\nTake a picture with your bitch and tag her too, uh\nSavage mode, uh\nRack it and roll, uh\nClappin' a ho, uh\nNow you can go, uh\nShe poppin' a bean, uh\nLickin' on me, uh\nOff-White, off night, cookies and cream\n\n[Chorus]\nOoh, ooh\nThat's that big drip (That's that big drip)\nBig wrist (Ooh)\nBig body, big whips (Ooh)\nBig Glocks (Ooh)\nBig guap, big notch (Ooh)\nBig goons (Ooh)\nSmall problems, big moves\n\n[Verse 2]\nOoh, uh, sauce it up\nAll this drip, I could fuck around and wash him up\nHellcat sound like Mufasa when I start it up\nThat’s a wide-body, bitch, it's hard to park it up, uh\nBust it like a baby leg, spark it up, ayy\nHomie, tuck your chain, it don't spark enough\n(Ayy, tuck that shit, man)\nHuh, ayy, uh, homie, tuck your chain, it don't spark enough\nLike what you doin'? Fuck this nigga doin', bro?\nThis nigga got cubic zirconia stones, man\nNigga really tryna stunt\nMy nigga, you a lil' nigga, you heard? You a lil' homie\nGet your money back\nDouble cup of Hennessy, we call it money-'yac (That Henny)\nSuWoo, where all of my bloodies at?\nI took her to the crib and I had fun with that\nNow come and get your mother back, I'm done with that\nYo, I just copped a pocket rocket, grr\nFor all you niggas pocket watching, ayy, uh\nWhy your Rollie tick-tick-tocking? Ayy, uh\nI fuck her during tax season, perfect timing\nI bagged your bitch in Fashion Nova, no designer, uh\nMan I like them tatted bitches, hi, Kehlani, uh\nI woke up in that pussy, her new name Bugatti, uh\nBitch, I got that drip, my new name Tsunami\n\n[Chorus]\nOoh, ooh\nThat's that big drip (That's that big drip)\nBig wrist (Ooh)\nBig body, big whips (Ooh)\nBig Glocks (Ooh)\nBig guap, big notch (Ooh)\nBig goons (Ooh)\nSmall problems, big moves\n\n[Outro]\nYeah, I'm Young M.A, but she call me papi, woo\n(She call me papi and I call her mami)\nYeah, I’m Young Ma, but she call me papi, tati\nZombie on the track", "album": "Herstory In The Making", "year": "2019-06-28", "image": "https://images.genius.com/5c06257b5ec4feaef75a96d05e9be637.1000x1000x1.jpg"}], "artist": "Young M.A"}