{"songs": [{"lyrics": "[Intro: Murs]\nHey stupid, you're listening to Bazooka tooth, dental cannons, molar pistols; shit like that\nThis is Murs, motherfucker, this is Aesop Rock, Ace Rizzle. Ya know what I'm saying? Check it out, like, Living Legends, Def Jux, if you don't know, now you're informed\nBe better prepared for the next time this type of shit goes down. Cause when it's happening and you're unaware you look like a complete asshole\n(Baddest motherfucker touching down on kick drums)\n\n[Hook: Aesop Rock]\nEvery leader dead and it's making you upset\nLa da de dah da da, La da de da da da dow dom\nSet, set, set...\nEvery hero dead and it's making you forget\nGet, get, get\nLa da de dah da da, La da de da da da dow dom\n\n[Verse 1]\nI'm in and out a pig channel serrated for hand feeders\nArmy of vicious kitchen patrol yam peelers\nThey sleep in barns and whisper loony conspiracy secrets\nIncreasing payroll awareness blind while a.w.o.l. went the leaders\nThe only mammal officially banned from food chain comp\nFor finishing for over 25 consecutive years on top is aggravated\nAlarmingly, the pulse don't bump right\nAnd he's up nights\nBumping over crunk and bug bites\nWho luck like this evening?\nStay electric mud blood jockeying for the footing\nMy last supper starts with a vinaigrette over pickled Muppet hearts while sheep tuck deep in the wood chipper\nFor the shepherd was a milk carton and scissors\nClammy hands make henna run on risky jenga tugs: you're all sweating, Hell I'm sweatin' too, just ain't nobody sweatin' you!\n(Holmes!)\nThe muck went abacus on labor perspirator official biz\nWhen auditioning demos by which to live\nNo whammies, Stop\nYour triple six game never chose me\nTrickery gets hokey\nPick up sticks and ponies\nYou've got mail, champ: blow me\nJust trooper with a question mark machine needy\nPointed at the heavens like a Bee Gee on some where the hell's my freebee?\nTo clamp war stupid\nNo landlords or super\nNo hands\nWater no ice cubes Rubik, no plans\nNo motor movement, no dance, no pyrotechnics to enhance\nNo chance\nToo many grown men call in sick over cramps\nI weigh in heavy on the jaded bitter subtracting the frontal gimmick\nI want to solve world hunger and fuck a pin-up\nI want to find a 21st century carbon crutch worthy of pedestal placement and shitty path walking to touch\n\n(Baddest motherfucker touching down on kick drums)\n\n[Hook]\nEvery leader dead and it's making you upset\nLa da de dah da da, La da de da da da dow dom\nSet, set, set...\n(drums drums drums drums\nBaddest motherfucker touching down on kick drums)\nEvery hero dead and it's making you forget\nGet, get, get\nLa da de dah da da, La da de da da da dow dom\n(drums drums drums drums drums)\n\n[Verse 2]\nAin't no time to sit and lift stones\nSo it's left to the dogs to find their way home\nAnd you grew up in a similar generation alone\nWith a fist full of humanoid models along the road\nBut a blank and you're ancient\nFuck if I can find a flesh and bone tour guide to edge me through the makeshift\nEvery little footprint’s faded and vacant\nNow I stomp through this motherfucker impatient\n\nFor the first time in a long line of dog fights\nLittle Lassie will not be returning home tonight\nThey’re saying someone everclear spiked the punchbowl of Christ but all I saw was six pits ripping throat box out her life\nLive lizard lung out a this ain’t Kansas cause\nWhere the lemmings run with scissors to the closest open jaws\nPause\nOpen the fucking door Hal, it’s your valid mistake\nI will not bow to a god that I can’t look in the face\nIt go C-4 tongue and a janky ankle\nHe still escort an Eeyore to the seafloor, thank you\nPlease curb your Egor\nAlto spas Alcatraz to the peace core\nAnti bleep. Anti sheep\nSword anti sheathed for corroded shoulders to lean toward\nShort ‘em, sort of report consecutive awkward moments like Gandhi and Hitler stuck in elevators broken\nOne could reach the ceiling panel boosted by the other, but suddenly suffocating doesn’t seem all that stubborn\nIs you with it? It’s brick Timb on eggshell percentages\nOnly mobile at but a trotter’s clip\nNo dial tone or walking stick. Fostered chickies peel back a placenta with broke posture for the daily dun da da’s done didn’t glow proper\nFrom the promised land abortion of keepers and bleeding orphans\nWhere only the megas creep outside the box to seize the fortress\nI and my crew seek an informal enforcement passage after receiving a timeline laced with tutor muter packages. Come on baby, act with us. The other activists, refusing to pour dummy accusations to the aqueducts\nThese are the days when the flotsam and the jetsam part ways trying to convince the players to fuck the game\nBut we don’t want to trouble you\nWe take no for an answer\nIf and only if enhanced with 'k' and 'w'\nWe’re only warning kitten paws who want escorting through the jungle zoo\nThis little industry will buckle you\n\n(Baddest motherfucker touching down on kick drums)\n\n[Hook]\nEvery leader dead and it's making you upset\nLa da de dah da da, La da de da da da dow dom\nSet, set, set...\n(drums drums drums drums\nBaddest motherfucker touching down on kick drums)\nEvery hero dead and it's making you forget\nGet, get, get\nLa da de dah da da, La da de da da da dow dom\n(drums drums drums drums drums)\n\n[Outro: Murs]\nYou know Aes Rock\nYou know you've been waiting like, how long?\nYou got flow, you're saying he was better back then\nI've heard this shit it's killing anything he's ever done\nSo shut the fuck up, love it like you know you want to\nJust don't be a little bitch\nLittle bitches get sniped in their mouth\nAnd that's how it happens every time\nYou keep listening because maybe you'll learn something, yeah\nBy the way Can Ox is not broken up, it's just a rumor", "title": "Kill the Messenger", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}