{"artist": "G Herbo", "songs": [{"title": "At The Light", "album": "Welcome To FazoLand", "year": "2014-02-17", "image": "https://images.genius.com/4af4495189941f1b86086adb14c093ca.300x300x1.jpg", "lyrics": "[Verse 1]\nSo much money keep coming, I get it like \"what I'ma do with that?\"\nBuy choppas and clips hold a hunnid, now what I'ma do with that?\nWonder who I'ma shoot with that\nRide through the 8 block and the Rugers clap\nCall up J.Dot, broad day face shot\nHollows make his face drop, knock his noodles back\nNow how true is that?\nYeah my niggas they doing that\nAll black, lets go do a hit\nHoodie on, they like \"who is that?\"\nWe at war, we got stupid shit\nTalking 50 shot macs with the cooling kit\nFazoland where I'm cooling at\nBodies drop, I don't got nothing to do with that\nAnd man it's crazy, that I ain't even made it, but these niggas hate me\nAnd I'm patient cuz I'm still in 1st place, but I ain't even racing\nI'm just sprinting to 100's and 50's and Beamers and Bentleys\nYea its with me, if you want it come get me\nI move with that semi\nDon't come near me, cause I'll act a fool with that semi\nIn that new SRT8 with a whole pint of drank and a tool in this hemi\nHeater right on my lap yea so I'm cool in this Hemi\nAnd when I stop at the light I make sure I grip tight on that pipe\n\n[Hook]\nI know niggas out for my life\nGotta look to my left and my right\nI'll be damned I get left at the light\nSummertime, I remember them nights\nI know niggas out for my life\nGotta look to my left and my right\nI'll be damned I get left at the light\nSummertime, I remember them nights\n\n[Verse 2]\nMe and Kobe off ACT with the sprite\nHe just left and they took his life\nWish the lord woulda just let him fight\nBut don't trip man its gon be aight\nCuz I got lil niggas tryna earn stripes\nI could write them a check for your life\nThey might walk up and check you tonight\n40 sneeze we gon' bless you tonight\nMask up broski, lets do it right\nCatch a crowd bring them choppas out\nAin't no shooting out the car, nah bro'nem hopping out\nYea, smash on sight fuck the cops we gon' pop it out\nAnd we stay in the field, block busting I'm popping out\nNO LIMIT's what's popping now\nCity love me, ain't nun else to talk about\nLabels all on my bumper now\nCall Mikk like \"bro, what they talking bout?\"\nIf they ain't talking them M's, ain't none else to talk about\nWait 'till my tape drop, watch the label start stalking now\n\n[Hook]\nI know niggas out for my life\nGotta look to my left and my right\nI'll be damned I get left at the light\nSummertime, I remember them nights\nI know niggas out for my life\nGotta look to my left and my right\nI'll be damned I get left at the light\nSummertime, I remember them nights"}]}