{"songs": [{"title": "Bandana", "lyrics": "[Jeezy Intro]\nYea\nYea\nGangsta grillz you bastards yea\n\n[Hook x 1]\nI said I pull up in that Bentley like phantom of the opera. We in the coupe strapped 2 deep, me and my partner. Try us if you want boy, you gon' need a doctor. So what you niggas want boy? Bandana on the Choppa!\n\n[Hook x 2]\nBandana on the Choppa, Bandana on the Choppa, Pull up in that Bentley like phantom of the opera\n\n[Jeezy]\nDo it like my uncle Bo Slick back in '86, How? First nigga talk slick he gettin' 86'ed, Fuck you worrying bout me go suck a baby dick, yea we know your whole crew soft as baby shit\n\nOne time for my GT got it washed up, two from the line get ya' Chris Boshed up, with this choppa in my hand bitch I'm like Lebron, had this mothafucka singing like it's Chaka Khan (?), Yea I'm know to keep the heat call me D. Wade, when them numbers super sweet I got D paid, when I said the Real is Back it's like they saw a ghost, (?to unload it we hit platinum and bought a bar of soap?)\n\n[Hook x 1]\nI said I pull up in that Bentley like phantom of the opera. We in the coupe strapped 2 deep, me and my partner. Try us if you want boy, you gon' need a doctor. So what you niggas want boy? Bandana on the Choppa!\n\n[Hook x 2]\nBandana on the Choppa, Bandana on the Choppa, Pull up in that Bentley like phantom of the opera\n\n[211]\nActive young ridda', bandana round the choppa, got a hundred in that shit shoot every nigga on your roster, loud by the pound got me smokin' like a rasta, flag to the right I'm just a gangbang MONSTA! Duece 11 get it rockin' like I'm lobster, organized crime I'm getting money like a mobsta, fuck around and take your baby mama hostage, whole 11 650 and yea that bitch topless, 100 miles an hour blowin' smoke up out the cockpit, ask me what it do I tell em' trying to make a block flip, go ahead and blow it on the bottle I'mma stack mine, and if a nigga got a problem, yea, flat line...\n\n[Hook x 1]\nI said I pull up in that Bentley like phantom of the opera. We in the coupe strapped 2 deep, me and my partner. Try us if you want boy, you gon' need a doctor. So what you niggas want boy? Bandana on the Choppa!\n\n[Hook x 4]\nBandana on the Choppa, Bandana on the Choppa, Pull up in that Bentley like phantom of the opera\n\n[Drama]\nGoose what up! Shout to Stackman, East side whats happenin", "album": "The Real Is Back 2", "year": null, "image": "https://images.genius.com/f7aa2025f7c2f0321ecc8d7af230c4d7.499x497x1.png"}], "artist": "Jeezy"}