{"artist": "Fat Joe", "songs": [{"year": "2010-07-27", "album": "The Darkside Vol. 1", "image": "https://images.genius.com/a346ed5d5bb8736594a9565557319edf.1000x1000x1.jpg", "lyrics": "[Intro: Fat Joe]\nYeah!\nThis is it y'all (Darkside), Darkside Vol. 1\nHope you enjoyed\nWe had to take you out classic status, you feel me?\nWe had to touch it (Darkside) - Yeah!\nSo I say\n\n[Chorus: Fat Joe (sample)]\nPeace God I'm gone, I'm gone, I'm on my way\nPeace God I'm gone, I'm gone, I'm on my way\nPeace God (peace y'all!) I'm gone, I'm gone, I'm on my way\nDarkside, Darkside, Darkside\n{*DJ Premier scratches over fourth line*}\n(\"Listen to the situation my son\")\n\n[Verse: Fat Joe]\nPremo on the beat, yeah I know it sounds different\nBut his man's just passed, yeah his soul's just risen\nCold, cold, world is the word that was given\nAs he see me fifteen with the burner out of prison\nGangster - fuck that, I'm GangStarr\nTell Nas hip-hop's dead now, my man's gone\nAs I rise to the top, knee-deep in the game I survived every shot\nBack to life like Thriller, back to reality\nFlipped the light scoop, got everybody mad at me\nUhh, don't let nobody put the battery\nCause those things'll go 'pop pop' through your anatomy\nI'm hungry nigga, I'll eat your flesh\nI'm a butcher, chainsaw through your spleen and chest\nThere's a darkside of Texas too, word to syndicate\nNo matter how intricate shit gets, the hit you get\nJoe Crack, yeah man on fire\nConversating with the devil, rocking diamond messiahs\nUhh, I seek the truth while the streets admire me\nKillers across the world say it's me they inspire to be\nFeds on my back from my ties to criminology\nCan't look back now, tomorrow's never promised B\nWhere I'm from, for president we voted Eric B\nJoe been crack way before my philosophy\nBanned from TV, BET won't play me\nStill we do it B.I.G., it's all Gravy\nIt's our reality, you call it crazy\nBut it's a darkside, it's what you made me\nNo more Mr. Nice Guy - pay me\nWhat you niggas owe before I come for your babies\n\"Listen to the situation my son\", so I say\n\n[Chorus: Fat Joe (sample)]\nPeace God I'm gone, I'm gone, I'm on my way\nPeace God I'm gone, I'm gone, I'm on my way\nPeace God (peace y'all!) I'm gone, I'm gone, I'm on my way\nDarkside, Darkside, Darkside\n{*DJ Premier scratches over fourth line*}\n(\"Listen to the situation my son\")\n\n[Outro: Fat Joe]\nYeah! Been in this game for a minute man - seen a lot of shit man\nShout out Forrest Projects man, Diggin in the Crates Crew\nWent to the Amateur Night at the Apollo, won four weeks in a row\nThat nigga Chris Lighty came and signed me\nNigga I had like ten cars\nMedallions down to my dick nigga, Dappa dan suits on - haha!\nSaved my life nigga\nI took a motherfucking pay cut to do this shit right here man\nAll these rapping niggas talkin about they dope boys, they real niggas man\nI don't know - I don't see these niggas, feel me?\nSo I wanted a lil' bit more than that underground shit\nHad that army fatigue, the Chuckers\nI signed a nigga by the name of Big Pun\nThat nigga went double plat' on niggas\nWe was at the Grammy's with motherfucking fo' fifths in our waist nigga\nHahahaha!\nSo you know Pun passed, I had to carry on tradition nigga\nDon Cartagena had to rise to the occasion\nAll by myself nigga!\nLinked up with the R., linked up with Ashanti\nThe rest was history nigga, platinum plaques man\nWe been rolling ever since man\nWe been bank rolling ever since man\nYou feel me? That Lean Back was number one song of the fucking decade\nCheck the fucking Billboard nigga! Shit!\nNiggas wanna sleep on Crack\nNiggas wanna front on Crack\nI said, \"Fuck y'all niggas, I'm going independent man!\"\nMake it Rain, three million iTunes sold man\nI don't give a fuck nigga!\nFight for my life, this is the resurrection nigga!\nHop out the motherfucking casket - brush the motherfucking dust\nOff my shoulders nigga!\nYeah, see what you don't understand is that I eat, sleep, drink music man\nNobody knows music like me man - this is what I do man!\nAll these miserable fucks man e'rybody got they fucking hand out\nE'rybody want you to just come, give 'em money\nGo across the world nigga, go earn\nCome back and give 'em money for free man\nTell them niggas get a life, get a job, suck a dick nigga\nIt's Crack bitch!\nWelcome to the Darkside - a.k.a. \"I Don't Give a Fuck Music\" nigga\nA.k.a. \"I Will Kill You Niggas Music\" - haha!\nSeen that nigga Puff surfing on the hood nigga\nYou killed that Harlem shit bruh - HA!\nYeah, Darkside nigga {*echoes*}\nAzariah I love you baby - that's my little Queen\nRyan what up? Junito what up?\nChu-Chu what up? John-John what up?\nGianni what up nigga? - HA! {*echoes*}\nLittle Joe rock on, Little Joe rest in peace\nBig Fred rest in peace\nGuru {*echoes*} rest in peace nigga\nNow I can officially say hip-hop is dead nigga\nCrack nigga", "title": "I’m Gone"}]}