{"songs": [{"title": "Fire in the Booth", "lyrics": "[Verse 1: Akala]\nYes, I grew up on the dole in a single parent family\nBeen through a little bit of tragedy\nYes I was around drugs and violence before the day that I started secondary\nAnd that’s part of it not half of it, get the picture, the rest ain’t necessary\nGrowing up, got a little caught up, but that ain’t even half of my life\nAlso given the knowledge of self\nThat is all we actually need to survive\nIf you saw me aged nine, reading Malcolm just fine\nTeachers still treated me stupid\nStudents that couldn’t speak English, they put me in groups with\nAnd the irony is some of the first man to give me schooling\nYou would call gangsters but I already explained, we know what the truth is\nThey used to say ‘Don’t be like me’\nYeah I got a name and dough on the street\nNight time comes, I can’t sleep\nAnd that’s the part that rappers don’t speak\nWe don’t hit the road cos we are thugs\nDon’t come out the womb, wanting to sell drugs\nIf we got the right guidance and love\nWould we fight people just like us?\nHow could I knock the hustle to get by?\nHow do you think I ate as a child?\nJudge no one, done many things wrong\nI just don’t boast about it songs\nBut listen to my older bars\nI was just as confused as you probably are\nBut you grow and you learn, travel and fuck up\nOne too many man you know get cut up\nOne too many man that could’ve been doctors\nEnd up spending their whole life boxed up\nYou learn, if you study\nIts all set out just to make them money\nNo cover, it’s all about getting poor people to fight with one another\nSo its logical that us killing our brothers, dissing our mothers\nIs right in line with the dominant philosophy of our time\nBut time is a cycle, not a line\nComes back around you regain your mind\nYou be ready for the energy I channel in my rhymes\nRemedy the pedigree, the jeopardy of mine\nWhen the world’s this fucked up, lethargy’s a crime\nWe can all fight with our brothers over crumbs\nFar harder to fight the one who makes guns\nWe can all talk shit and get two dollars\nFar harder to be the one who seeks knowledge\nIf we understood economics\nWe’d know money’s nothin’\nThink nothing of it\nMoney is a means to get wealth, not the wealth itself\nDon’t get confused, I’m far from broke\nAll that you see me do I own\nBut I won't hang what I make around my neck\nI know from where that the diamonds came\nBut I do quite literally own a library\nThat definitely costs more than your chain\nAnd businesses, and properties\nFar from starvin’, I eat quite properly\nAnd I don’t care, just said it for the kids\nWho need to know that you’re not broke to listen\nDon’t know an asset from a liability\nThey’ve never been shown or told the difference\nSo they don’t change situations\nRichest man in Britain is Asian\nThat’s significant, not coincidence\nAsian people build businesses\nNot by flossin', going out shoppin’\nGiving out their culture for everyone’s profit\nWho run’s Bollywood? Indian people\nWho owns our shit?\nSo we shake our arse and dance\nAs if racism just upped and vanished\nBut has it? No its right on course\nYou’re beaten so bad, you’re trained to ignore\nLet me not just make sweeping statements\nGimme a second, I’ll explain it\nFor small amounts of drug possession there’s more black people in jail in America than there is for rape and armed robbery and murder all put together\nYou can say they’re just locking up thugs\nImagine if they locked up every middle class kid that had ever held drugs\nOh that’s right, that’d be your kids!\nBigger than that what is going on with this\nPrison in America’s a private business\nThey get paid fifty-k per year per inmate by the State, just wait…\nAlso legally are allowed to use their prison inmates as slaves\nCheap slave labour, big corporations\nThey come out of jail, can’t get a job\nSo when we celebrate going to jail\nWe are literally celebrating enslavement\nAdd to that, that the hood that you’re livin’\nEngineered social condition that breeds crime by design\nWhere do you think you get your nine?\nYou can say that they’re just black\nBut I like to deal with facts\nIn the 1920s you would’ve found in America\nBlack Towns\nProspering centres of economics and education to make you proud\nBut some people couldn’t bear that the former slaves would not just lie down\nSo the KKK and other hate groups burnt those towns to the ground\nKillin hundreds\nIf it ain’t understood\nYou think you were always livin’ in the hood?\nShit it’s only been sixty years\nSince they hung blacks and burned em’\nAnd that was so cool\nThey were your pastors' picnic baskets\nEven gave kids the day off school\nTo go see a lynching; have a picnic\nIt’s fun to watch the little monkeys die\nThen people act a little dysfunctional\nYou wanna pretend that you don’t know why\nIf your colour means you can be killed\nAnd you’re powerless to get justice about it\nIs it difficult to figure out how you would then end up feelin’ about it?\nAnd that ain’t excuses\nJust dealing with the roots of abuses that make a reality\nWhere a generation of young men speak of ourselves as dirt casually\nThat’s America\nThis Britain\nSome things are similar\nSome different\nIn this country the first enslaved were the working class\nWhat’s changed?\nWorst jobs, worst conditions\nWorst taxed, look where you’re livin’\nYou go to the pub, Friday night\nYou will fight with a guy, don’t know what for\nBut won’t fight with a guy, suit and a tie\nWho sends your kids to die in a war\nThey don’t send the kids of the rich or politicians\nIt’s your kids, the poor British\nThat they send to go die in a foreign land\nFor these wars you don’t understand\nYeah they say that you’re British\nAnd that lovely patriotism they feed ya'\nBut in reality, you have more in common with immigrants\nThan with your leaders\nI know, both side of my family\nBlack and white are fed ghetto mentality\nReality in this system\nPoor people are dirt regardless of shade\nBut with that said\nLet’s not pretend that everything is the same\nWhen our grandparents came here to Britain\nIf you had a criminal record you couldn’t get in\nYet that ain’t protect them from all the stupid, stupid abuses they would be livin’\nKicked in the teeth, stabbed in the street\nMany times fired bombed our houses\nPut faeces through our letterbox\nAnd of course the cops did so much about it\nDaily, up to the eighties\nPeople spittin’ into my pram cos’ I was a coon baby\nBut of course, that has had no effect on why today we are crazy\nAnd none of this was for any good reason\nThey were just dark and breathing\nTo ease the guilt now for all of this treatment\nConstant stereotypes are needed\nSo if I celebrate how big that my dick is, bricks that I’m flippin’\nClips that I’m stickin’, chicks that I’m hittin’, I’m playing my position\nBut if I teach a kid to be a mathematician, messin’ with the schism\nHow they gonna fill a prison when materialism is nothing but a religion?\nWhat do you think we got now in Britain?\nJust like America, private prisons\nPrisons for profit!\nThat mean when your kids go jail people make money off it\nSo keep environments that breed crime\nBuild more jails at the same time\nMarket badness to the kids in the rhymes\nAs long as rich kids ain’t dying, it's fine!\nGet em’ to the point where some are so lost\nThey actually believe that if they don’t celebrate killin’ themselves off\nThat it’s because they’re soft\nWas Malcolm soft? Was Marley soft?\nTell me was Marcus Garvey soft?\nWell? Was Mohammed Ali soft? Nah, Nah I think not!\nBut they want us to think that the road is cool\nBeing on road is all we can do\nWe don’t control the wholesale productions\nWho benefits from us movin’ the food?\nOr thinking there’s no way out of road life\nBut Malcolm X used to hustle out on the roadside\nWhen Marcus Garvey organised more than six million people\nWith no Facebook or Twitter\nWhy is this something you cannot equal?\nShit!\nOne of my homeboys did a ten straight in the box in yard\nNow, what’s he doing? Passin’ his doctorate\nDon’t tell me that it’s too hard!\nWho trained you to believe that you’re inferior?\nSungbo Eredo in Nigeria are the remains of an ancient moat\nDug one-thousand years ago\nTwenty metres wide, seventy down\nRound the remains of an ancient town\nThat’s four-hundred square miles around\nFour-hundred square miles around\nPlease, please don’t believe me\nIt was a documentary on BBC\nBut we ain’t studyin’ history\nToo busy watching MTV\nAnd MTV said wear platinum\nNow everybody wanna go and wear platinum\nAnd MTV said pop magnums\nNow everybody wanna go and pop magnums\nIf MTV said drink prune juice\nYou would start hearing that in tunes soon\n\"Hey! Today I wore my Cartier\nIs it now more important what I got to say?\"\nOh and I drive a Mercedes by the way\nSo everybody listen to what I got to say\nHuh, does that make you all happy?\nAh but shit my head’s still nappy\nThink for myself, still some mad at me\nBut on the mic ain’t not one bad as me\nAll of this here’s good for the rhymes\nPut us in the same place at the same time\nAnd it’s clear to everybody that I’m out of my mind\nSome of these guys are runnin’ out of their rhymes\nClear to everybody that has got ears\nI’m the guy that they just might fear\nThey wanna get near but they can’t have a peer\nAh dear I’m hard liquor you’re just like beer\nFront on the kid for another five years\nCome to my shows and some cry tears\nIt mean that much to em’, it’s a movement!\nI don’t speak for myself but a unit\nBlack, white, man, woman, anyone that respects truth we put in\nDudes are like no dinner with just puddin’\nYeah you’re sweet but no substance puddin’\nYou could never ever be with a level on\nOur songs get outplayed out there in Lebanon\nWe speak for the people properly\nNot for the old fat guys in offices\nAnd the girls love him, it ain’t fair\nHe can’t even be bothered to comb his hair\nAnyway that’s enough kissin’ my own arse\nBack to the more important task of being so shower\nI got half the hood screaming “knowledge is power”\nAnd I ain’t saying that will change rap\nBut I do know this for a fact\nRight now there’s a youte on your block\nWith his hand on his cock and his face screwed up\nSwear he don’t care, don’t give a fuck\nThat he won’t let nobody call his bluff\nBut the words go in\nOpen up your chakra\nBecause once that’s happened there’s no going back\nOnce you start to see what is really happening\nWho the enemy you should be attackin’ is\nSo read, read, read!\nStuck on the block, read, read!\nSittin’ in the box, read, read!\nDon’t let them say what you can achieve\n'Cause when people are enslaved\nOne of the first things they do is stop them reading\n'Cause it is well understood that intelligent people will take their freedom\n'Cause if we knew our power we would understand that we can’t be held down\nIf we knew our power, we would not elevate not one of these clowns\nIf we knew our power, we wouldn’t get arrogant when we get two pennies\nIf we knew our power, we would see what everybody sees, that we’re rich already!\nBut never mind MCs go run for your mummy\nI’m hungry, I run for my tummy\nThat’s enough, back to worshipping money\nI’m off, back to the study!", "year": "2011-07-18", "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}