{"songs": [{"title": "Q-Ball", "image": "https://images.genius.com/8r8ajx2cbm92408bt8tkjbsdy.300x300x1.jpg", "lyrics": "Q Ball!\n\nSo what really happened nigga? I understand ain't nobody did shit\nAin't nobody did shit for my cousin\nWhere them niggas at that said they's put it all on the line?\n'cause nigga... only a child could empty a gun toward da sky\nI gotta know where niggas heads at, 'cause my cousin still ain't got no peace yet\nSo all you muthafuckas wanna know where I stand?\nNigga I stand right next to my cousin E Mill nigga, you know what I'm saying?\nAnd that's on the blocc nigga. However you wanna handle that shit nigga\n\n[Verse 1\nLook up in da sky! It's a muthafuckin slug!\nSome nigga done let one off and only my cousin shedding blood\nDat loccest muthafucka frum twenty ninth street throwin up his flag\nSum nigga got mad\nAnd went to da crib fo da 44 mag\nReturn to da set up and let my 'causezin have it\nDa nigga dat die for da Garden Blocc Gang, did time for da Garden Blocc\nAnd ended up stuck in a muthaf**kin casket, but I don't be givin a fuck\nI'm tappin up in yo program\nBefore you know it I'm creepin up on you in a licorice dar kblack drop top rohan\nWit a 12 gauge pump in da trunk and a clip full of funk and a fat purple cush blunt\nSo call it what u want\nI call it da fever of da FUNK HOUSE\nDumpin gauge shells in dat ass\nLeavin ya face down, chest down wit a gang of guts hangin out yo ass\nNigga, you know da process. They wanna kill me now\nI'm a dead man walkin till my funeral can you feel me now?\nAnd if I die, before yo second blasted\nDat's on da Garden I'ma rise up out my casket\n\n[Chorus]\nI'm liquer sicc and I just might lose control\nSo load yo clips, loccs, 'cause we ridin for my folks\n[x2]\n\n[Brotha Lynch]\nAnd I'm out in da 6-5, HARDTOP IMPALA lookin for dat 187\nThere he go! And I'm right behind him bustin wit my Mac-11\nStr8 bumper ta bumper 12 gauge pumpin was dat lil lex locstah\nGivin up his set and dumpin on niggas just like he supposed ta\nNigga dis is real deal. Shit, it's not about crip or blood\nIt's about payback, dat family luv\nSo nigga now fuck yo whole clique\nLike 24 deep they tryin ta kill me for my fuckin tapes\nDem baby rapes, so nigga get out my fuckin face\nIf I was really bangin niggas would know 'cause I'd have they whole set\nLookin like LA when da earthquake hit. Nigga, fuckin wit my tec\nI'm frum da Garden Blocc no matter what nobody say\nI'm makin my money not lettin dat bangin shit get in my way\nNiggas get mad, they wanna see da Lynch rippin\nI'm wearin blue yeah, but muthafucka, I ain't even trippin\nBut for my 'causezin Q Ball, Mr Docc & Six\nMy 'causezin Eclipse and two of my kids, nigga, fetch these clips\n\n[Chorus]\n\n[Brotha Lynch]\nThere ain't no fuckin way\nMy 'causezin gonna lay up in a casket wit no retaliation\nThere ain't no fuckin way\nDat muthafucka died for da Blocc, so let's heat dem muthafuckin Glocks\nThere ain't no fuckin way\nMy 'causezin gonna lay up in a casket wit no retaliation\nThere ain't no fuckin way\nDat muthafucka died for da Blocc, so let's heat dem muthafuckin Glocks\n\nYou know what I'm sayin? This time it ain't gon be shootin in da muthafuckin air nigga\nWe takin out bones you know. 'cause dat nigga woulda did it for us you know\nI gotta do what I gotta do, you know what I'm sayin?\nTried to sit up here and do my music thang you know?\nThen my 'causezin got rolled on you know?\nDem niggas frum da Garden don't do nuthin now, we all gon get rolled up\nLike a fat ass blunt nigga. So wassup?\nI'm puttin my life on da line for dis shit\nThey wanna kill me 'cause I'm rappin, you know what I'm sayin? Wassup niggas?\nDedicated to my 'causezin Q Ball. Rest In Peace nigga\nTo dem otha muthafuckas, fuck peace", "year": "1995-02-28", "album": "Season of Da Siccness"}], "artist": "Brotha Lynch Hung"}