{"songs": [{"year": "2008-11-04", "album": "The Renaissance", "image": "https://images.genius.com/5d721c8b6f6e8f0141dafa2547e2bd79.500x500x1.jpg", "title": "Shaka", "lyrics": "[Q-Tip]\nUh, ah, uh...\n\nMy brother Shaka would have wanted me to do it like this\nSo raise your glasses for the lost ones in your life...\n\nDilla Dawg and Master Wel would have wanted me, as well\nTo propel with the spirit of the mic...\n\nEven if you had one person with you and it's hard\nThey make it easy, celebrate them, let them know just who they are...\n\nBecause of these experiences I have some control\nOn the microphone, I'm bold elevating to the stars...\n\nHere's a demonstration, with the excellence\nReverse the pandemic that's filled with pestilence\nWho has his finger on the pulse of the b-boy?\nServing fiends with the stream of a d-boy\nWho's well connected, you must respect it\nI'm driven with the spirits mentioned in this record\nHopefully this serves as motivation\nThey never sayin that kind of sensation\nPut my stamp on it, the mic clamps on it\nMama I know, let me put lil' thamp on it\nBlade runnin through the day with agility\nStay gunnin, make way for possibilities\nIt's the capital Q, rap it'll do\nWhat I want it to, it's like tamin a shrew, uh\nLivin life, the Shakespearean proportions\nKnowin better, I've experienced distortions\nAnd through the in and outs, of life's revolvin doors\nI'mma see that, I'm still gettin more\nYeah I'm comin in, I'm gon' see my friends\nTo the top floor, it seems it never ends\nHeaven never ends, yeah it never ends\nIt be goin on, it's phenomenon\nLike a new born, or a Stevie song\nIt be going on, do ya feel it?\n(Do ya feel it? Do ya feel it?...)\nThe snare drum go...\n\nMy brother Shaka would've wanted me to say this to y'all\nDon't lose sight y'all without giving a fight...\n\nI'm channeling Weldon Irvine - Mr. Clean\nHe would've wanted me to say what I mean, and I mean give it right...\n\nDilla, havin you in my past has been a blast\nYou've inspired so many and forever will you last...\n\nAnd to my father, yo your spirit is drapin me\nNever escapin me, I'm happy that I had you in my past...\n\nUh, uh, let's go...\nA-let's go...\nLet's go...\nLet's go...uh..\nTka, uh...."}], "artist": "Q-Tip"}