{"artist": "Cashisclay", "songs": [{"title": "Halt die Fresse 06 Nr. 317 - Rap Sparring Spezial", "album": "Halt die Fresse - Staffel 6 ", "year": "2014-01-16", "image": "https://images.genius.com/86ea3c4a40301e6c380a9f22eb5216b9.1000x563x1.jpg", "lyrics": "[Strophe 1]\n\nErstmal geht ein Gruß an die Großen, das Urgestein, die Prominenz\nGestatten Cashisclay eure zukünftige Konkurrenz\nMan halt die Fresse, jeder kriegt was er verdient\nIch hätte mein Mic verkauft für's Ticket nach Berlin\nScheiß auf Schule ich hab durchgemacht\nNächtelang an Texten geackert, wurd nicht ernst genommen he'\nWer zuletzt lacht ihr Fucker!\nMan ich hab alles drauf gesetzt, mich in die Szene verliebt\nIn Themen vertieft und mich gesteigert denn ich leb' für Musik\nWas ist passiert? Ich habe den Schritt gemacht, mitgedacht\nIch habe gesteigert und so jetzt sofort alleine zu Aggro und Staiger aus dem Nichts geschafft\nIch brauchte nur auf Youtube zu battlen\nVerbrenn die Boof wenn ich rappe und sorg für jubelnde Hände\nSteh live vor hunderten Menschen\nIch brauch kein VBT, denn es is nur ne Frage der Zeit\nBis ich gebucht auf dem Splash bin\nJuice oder Backspin, Scheiße jeder will jetzt haben was ich hab'\nHDF mit nichtmal 20 Jahren alter, das geht ab!\n\n[Hook]\n\nDoch mir ist das eigentlich egal!\nIch bin auf Youtube bei paar Kindern bekannt\nAber so weit entfernt vom Star\nÜberhyped und nur mäßig talentiert\nIhr könnt das auch, trotzdem steh ich heute hier\nVerdammt ich hab von Anfang an nur Mucke gemacht\nWollte nie irgendwas erreichen man\nVielleicht ist das der Grund, dass es klappt\nHätte schon lange 'nen Vertrag in der Tasche\nDoch behaltet euer Geld und ich behalte mir den Spaß an der Sache\n\n[Strophe 2]\n\nUnd jeder redet von Erfolg\nDefiniert das an Youtube-Klicks oder Facebook-Likes\nDa wär ich ein motherfucking Star im Direktvergleich\nIch brauch' kein Representer, check das is actionreich\nHälst das Mic, weil ich im Battle Backpackrappern ihre Grenzen zeig'\nWas Hype? Langsam ficken diese Spinner mein Kopf\nFrüher ignoriert, jetzt ham' wir uns schon immer gemocht?\nIch brauch kein High-Society\nDas ist Kaliskaya Saufmaschina\nHausverbot in jeder zweiten Disco \"Cash is Opferschiene!\"\nDoppelte Arbeit noch immer kein Geld\nAber guck jetzt kommen die Penner an \"Tim, du bist der Beste man!\"\nNur weil ich jetzt rappen kann?\nSag ich wär nichts ohne Battles, sag dasselbe wie jeder\nIch mach es wie F zu dem R, wie Es zu dem tA, K.I.Z. und Kollegah\nMach es wie Hollywood Hank\nOder komm man ich mach es wie Boz oder Sorgenkind\nPrinz zu dem Pi oder Fard, wartet mal ab wo ich morgen bin\n2014 mein Jahr, was kommt noch? Mal es dir aus\nDas hier is Cashisclay, Hachiko, Aggro TV!\n\n[Hook 2x]"}]}