{"songs": [{"image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg", "title": "In the Store", "album": "Nellyville", "year": "2002-06-25", "lyrics": "[Cedric:] Yo yo yo yo, my man, yo\n[Clerk:] Yeah. What can I help you with?\n[Cedric:] Hey come on man you gotta say you got me on this one. Look...\n[Clerk:] What do you need? What do you need?\n[Cedric:] You got the new Nelly? You got that in? The Nellyville? You got that. Right?\n[Clerk:] What is that rap or something?\n[Cedric:] What?\n[Clerk:] I think we just sold out of it man\n[Cedric:] Sold out?! Come on bro this the 4th 5th store I've been to today, they all sold out!\n[Clerk:] We're all sold out bro\n[Cedric:] Come on man you gotta help a brother out, man I'm in a desperate situation here player!\n[Clerk interruptes:] Hey Man!\n[Clerk:] I'd love to help you my brother!\n[Cedric:] I got a nice little sexy little thing waitin' on me at the crib & all she wanna hear is Nelly, I'm tryin' to get it through your spell\n[Clerk:] I hear you!\n[Cedric interrupts:] What?\n[Clerk:] I hear you, you gotta get the mood goin' you know...\n[Cedric: laughin'] Yeah, that's what I'm tryin' to do, Pimp Juice!\n[Clerk:] Pimp Juice?!\n[Cedric:] Look man, let me... can you download it for me? Somethin'!\n[Clerk:] Sorry man, we can't do that here, sorry!\n[Cedric:] MP3? You can't...?\n[Clerk:] No, we can't, we can't MP3 it, sorry\n[Cedric:] Let me take one of your listenin' machines or somethin' & I'll bring it back to you tomorrow\n[Clerk:] Your fuckin' crazy? My boss would kill me man!\n[Cedric:] Look man, just check in the back, do whatever you gotta do\n[Clerk:] Hold on, let me s... let me see what I can do for you bro. Let me see...\n[Clerk:] Man this is the last one I got\n[Cedric:] For real? Alright! Cool wait...\n[Clerk:] The clean version, that's all I got, I found the clean version for you!\n[Cedric:] It's the clean version?\n[Clerk:] Nelly... you know the new one, Nellyville\n[Cedric:] It said there's no cussin' on it? None?\n[Clerk:] You want it?\n[Cedric:] That's all you got?\n[Clerk:] It's hip-hop!\n[Cedric: Sigh] Damn. Alright, alright give me that man. I just got to make it happen right now, I just gotta...\n[Clerk:] Alright but hurry up we got people waitin' in line here, they've been waitin' for a long time\n[Cedric:] Yeah, go ahead & give it to me\n[Clerk:] Good luck dawg!"}], "artist": "Nelly"}