{"artist": "Porta", "songs": [{"album": "Reset", "title": "Causa y efecto", "image": "https://images.genius.com/0786171922516cdb77f0f7ea0149854a.953x953x1.jpg", "lyrics": "Porta:\nTenemos que hablar, esto tiene que cambiar\nNo sé si soy yo el error pero es que ya nada es igual\nYa no hay respeto y sé que el nuestro es primordial\nDime, dime que sientes, es amor o cariño incondicional\n\nH0lynaight:\nNo es amor incondicional, no\nNo sé qué me pasa, siento que pierdo el tiempo\nTodo el dia encerrada en casa, sabes que te quiero\nPero necesito espacio, sola voy a mil por hora y\nTu me haces ir mas despacio\n\nPorta:\nMi sensacion es, que estas cansada, bah\nDime tus motivos, no tiene sentido nada\nYa y se que temes hacerme daño, pero me lo estas haciendo\nMintiendo y, prefiero perderte qe vivir este engaño\n\nH0lynaight:\nMira, que ya son unos cuantos años para\nEstas tonterias, para tus celos, tus manias\nLo siento si desconfias, si será que me apronte\nQue todos son de su condición, solo te digo\nQue estoy harta de esta situación\n\nPorta:\n¿Y tú que? joder, siempre crees que tienes la razón\nEstoy harto que tu puto orgullo gane al corazón\nSi te equivocas pues pides perdon\nQue no cuesta una mierda\nSiempre tengo que medir mis palabras\nPara que no te ofendas\n\nH0lynaight:\n¿Si? pues midelas ahora, porque tomo yo las riendas\nNo me vuelvas a hablar mal o no calmo mi reprimenda\nSi tan cabrona soy, sabes donde esta la salida\n¿No crees que tus exs no buscan solo ser tus amigas?\n\nH0lynaight y Porta:\nYa ni entiendo nuestras discusiones de críos (Joder!)\nSi lo dejamos tu piensa (¿en qué? ¿qué voy a perder?)\nTodo lo que somos y lo que podríamos ser\nSi esto no se arregla, no me volverás a ver\n\nYa ni entiendo nuestras discusiones de críos (Joder!)\nSi lo dejamos tu piensa (¿en qué? ¿qué voy a perder?)\nTodo lo que somos y lo que podríamos ser\nSi esto no se arregla, no me volverás a ver\n\nPorta:\nSe que crees que, el primer amor nunca se olvida\nYo olvide el primero, el segundo, el tercero es mi vida\nO al menos eso creía, sú, el tercero eres tú\nPero nos esta consumiendo la monotonía\n\nH0lynaight:\nSiempre haciendome puta psicología, o al menos eso creias\nÚltimamente me haces sentir tan vacía\nY no hay dia que no busque el método\nEl modo de superar esto, de hacerlo menos incomodo\n\nPorta:\nTe agobias por todo y siempre te he aguantado sin quejas\nTienes miedo, miedo de arrepentirte y ¿por eso no me dejas?\n¿Qué quieres un tiempo? no esperare a ver que sientes\nDecidete ahora a estar conmigo o sin mi para siempre\n\nH0lynaight:\nNo me des a elegir, tienes que ser mas paciente\nSabes que el fin de este cuento podría ser deprimente\nSaldrás perdiendo, dolor interno, vivo en un invierno\nNo entiendo por qué has dejado de ser tan tierno\n\nPorta:\nCreía que esto seria eterno pero\nEs un infierno, y tu eres tan fria\nY capaz de volver loco al mas cuerdo\nNo hay tia mas borde que tú\nTampoco mas compleja, y en lo nuestro se refleja\nAsi que cambia esa actitud\n\nH0lynaight y Porta:\nYa ni entiendo nuestras discusiones de críos (Joder!)\nSi lo dejamos tu piensa (¿en qué? ¿qué voy a perder?)\nTodo lo que somos y lo que podríamos ser\nSi esto no se arregla, no me volverás a ver\n\nYa ni entiendo nuestras discusiones de críos (Joder!)\nSi lo dejamos tu piensa (¿en qué? ¿qué voy a perder?)\nTodo lo que somos y lo que podríamos ser\nSi esto no se arregla, no me volverás a ver\n\nH0lynaight:\nEl problema eres tú, puede que yo sea insegura\nPero se seguro que eres inmaduro y yo\nSoy la que jura que esto va a acabar\nQue ya no puedo mas y sigo aquí\nMe pregunto dia tras dia que esperas de mí\n\nPorta:\nDe ti, ya no espero nada, confiar me cuesta\nCansado de que salgas con tus amigos de fiesta\nSi eres la que juras, jura que me has sido fiel y se sincera\nY dime, ¿quién es ese subnormal con el que tonteas?\n\nH0lynaight:\n¿Bromeas? siento que cada vez que lo niego me rebajo\nA veces pienso que es imposible caer mas bajo\n¿para que te callas las cosas si después\nLas hechas en cara? Estoy agobiada\nEste agua no esta tan clara\n\nPorta:\nSi al menos te interesaras por mis cosas\nSi a veces me escucharas, ademas tu también eres celosa\nOtra discusion que nada aporta\nVamos déjame, venga si tienes cojones corta\n\nH0lynaight:\nCualquier palabra se hace corta, ya\nNo pones atención porque mis lagrimas no importan\nNo quiero seguir discutiendo, hoy no\nMe arde el corazon, vivo en un\nLaberinto, no encuentro la solución\n\nPorta:\nEs una relación de amor y odio\nYa he pasado antes por esto\nY paso de vivir de nuevo este episodio\nPorque no me quedan fuerzas ni ganas como sabras\nPase lo que pase soy yo el que siempre te va detrás\n\nH0lynaight y Porta:\nYa ni entiendo nuestras discusiones de críos (Joder!)\nSi lo dejamos tu piensa (¿en qué? ¿qué voy a perder?)\nTodo lo que somos y lo que podríamos ser\nSi esto no se arregla, no me volverás a ver\n\nYa ni entiendo nuestras discusiones de críos (Joder!)\nSi lo dejamos tu piensa (¿en qué? ¿qué voy a perder?)\nTodo lo que somos y lo que podríamos ser\nSi esto no se arregla, no me volverás a ver", "year": "2012-05-07"}]}