{"songs": [{"image": "https://images.genius.com/4ca57e4ceb5f85f4c1d5b5fd347cab28.500x500x1.jpg", "year": "2008-07-08", "title": "Controller", "album": "Planet Squaria: The Square in the Circle", "lyrics": "(Intro)\nYou have been forwarded to Cyber World\nOne single voice mail\nPlease leave a message\nAfter the beep\n\n(Verse 1)\nI rented a new game today\nWanted to see if you wanted to come over and play\nNormally don't be around my way\nBut, if you havin' it bad you know where I stay\nBut, it's a first person shooter and I know your style\nAnd I ain't seen you on Live in awhile\nI still got that Mario you let me borrow though\nWell I need my Donkey Kong Country back like now\nAnd my Sega broke down so I can't play Sonic\nBeen kind of lonely in my house to be honest\nI had a copy of linens that I can't find\nAnd I play Mass Effect like five damn times\nSo, if you wanna get on Halo 3\nCall me back you know where I`ll be\nWear those Miss Pac-man shorts that I like\nHope that I`ll see you tonight\n\n(Hook)\nWill you come over?\nAnd bring your controller\nWe'll chill on the sofa\nAnd maybe get closer\nBut baby come over\nAnd bring your controller\nWe'll chill on the sofa\nAnd maybe get closer\nBut baby come over\n\n(Verse 2)\nIf we wake up next to each other tomorrow\nAnd you steal my heart like Grand Theft Auto\nMy Golden Knight game, I never let you play\nYou know what I might let you borrow\nJust the sight of you will make a brother press pause on Street Fighter 2\nWe interlink like a PSP before we go do our laundry at two\nWe never crash like Bandicoot\nExcept when you get mad when you get your ass handed to you\nAnd I swear that you is the next best thing\nWith how busy I get on wrestling\nSee I never wanna turn you off\nAnd I never wanna put you down\nAnd I would never ever trade you in\nYou're like my favorite video game, like damn!\n\n(Hook)\n\n(Bridge)\nI got the soda, yup, I got the sofa, bap, bring your controller\nAnd maybe something to crash in, yeah\nI got the soda, yup, I got the sofa, just, bring your controller\nWill you be my girlfriend?\nI got the soda, yup, I got the sofa, just, bring your controller\nAnd put your game face on you know it's sexy\nI got the soda, yup, I got the sofa, just, bring your controller\nAnd let me play with youuuu\n\n(Hook)\n\n(XV Talking)\n\n(Bridge with ad-libs)\nWould you kiss me if I do the Scorpion Finisher right?\nI told you I could, and I would\n\n(Hook)"}], "artist": "XV"}