{"artist": "50 Cent", "songs": [{"album": "5 (Murder By Numbers) ", "image": "https://images.genius.com/6db50cacd76aacc9343b0210025ba186.600x600x1.jpg", "title": "Money", "lyrics": "[Intro: 50 Cent]\nI'm on that bullshit\nI'm, I'm, back on that bullshit\nI'm on that bullshit\nI'm, I'm, back on that bullshit\n\n[Hook: 50 Cent]\nStartin to feel like there's nothin left to talk about but the, money, money\nBill collectors keep comin when a nigga fucked up, to get money, money\nNigga I don't give a fuck 'bout these hoes\nI'm focused on the money, MONEY (money) MONEY!\nLook, I don't wan' talk 'bout these hoes\nLet's talk about money, MONEY (money) MONEY!\n\n[50 Cent]\nIn high school I had coke and dope money\nI blew, now I'm sittin on Bugatti boat money\nI'm eatin, I get money, nigga I shit money\nIt smell like Benjamins, it boosts my adrenaline\nGo 'head fuck around, I got marksmen hit money\nYou fuckin with that EBT welfare WIC money\nWho wan' catch a fade? Fuck that! Catch a blade\nCatch a case, bail bond, I'm out the next day\nGot that gold (Hammer), gold (2 Legit) proper money\nTalkin 'bout private jet, heliport chopper money\nAnd a nigga still ridin with the chopper on me\nI don't trick, e'ry now and then I toss her money\nFuck, nut, get up, that's abortion money\nI'll kill if I have to, don't force me homie\nI get that schoolyard duct tape extortion money\nI hate when niggas act like bitches cause it costs me money\nWhat the fuck!\n\n[Hook]\n\n[50 Cent]\nI'm in London blowin pounds, Japan blowin yen\nIt's the methodical diabolical nigga with a grin\nMy stash look like a rainbow, my money is gay\nNowadays I'm just happy things are goin my way\nI'm straight, some say I got more than I need\nMucho dinero out in México, they growin my weed\nIt's amazing, I made it here on my own\nI got a frog, a dog with a solid gold bone\nAn accountant to count, the amount I spent\nWine cellar full of shit, we could all get bent\nI got it made, I got bridge truck money\nEuros range, you wan' borrow some from me?\nMy bank statements have you niggas like \"Damn!\"\nBitch I got more (francs) than a hot dog man\nGet married, pay for one bitch, I'll buy her bar food\nKids don't try this shit at home, you can't do the shit I do\nWhassup?\n\n[Hook]", "year": "2012-07-06"}]}