{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/necro.jpg", "title": "Fuck Commercial Rap", "album": null, "year": "2016-08-11", "lyrics": "(What you going to do?)\n*scratches*\n(What you going to do?)\n\n(Verse 1)\nI don't give a fuck if you're a big time rapper, ice'd up\nI don't like your face it'ill look better sliced up\nYou're a cock suck and disgrace to rap kid\nBaking a mockery of what G Rap did\nRakim, Krs One and Kane\nThe big four, wanna learn how to rap, study the game\nCommercial, used to be controversial\nNow it's all about dress rehershal\nAnd I don't get the best verse, in who's ill\nComing up in the nineties in the streets, could've got killed\nNow it's internet gangsters and cowards\nKeyboard warriors and tec companies with power\nI'm not sour, I'm down with technology\nPimp any way that you can, is my psychology\nSalute MC's with a career of fiteen years\nI'm all way out here, new jacks be aware\nLonegevity, let's see if you can last as long as me\nI'll give up at the first catastrophy\nEvery ones a dog when they're rolling deep\nAre you a thug all along, without your peeps?\nI doubt it\n\n(Chorus)\nYou don't beef you want peace\nYou don't want your teeth knocked out in the street\nI pull a Glock out and pop your face\nFUCK COMMERCIAL RAP!\n(What you going to do)\nYou don't beef you want peace\nYou don't want your teeth knocked out in the street\nI pull out the biscuit and get sadistic\nFUCK COMMERCIAL RAP!\n\n\n(Verse 2)\nMade connections\nDon't mean that you can rap good, you gotta win a fan's affection\nYou let a man's errection inserting your ass\nNew rappers are shitty versions of the past\nGet a surgeon to cut at your unoriginality\nYou're splurging at the bar, instead of buying reality\nReal T, your funs will diminish\nI'm real G, you better save up or you're finished\nI live what I rap\nSo when I say I put a shiv in your neck\nYou know it's a fact I get respect\nDipped in fashion\nCatch brains, while T-Pain's inover the strip was blasting\nEvery track has a purpose eventually\nFuck a bitch to death, rap choke her sexually\n\n(Chorus)\nYou don't beef you want peace\nYou don't want your teeth knocked out in the street\nI pull out the Glock and pop your face\nFUCK COMMERCIAL RAP!\n(What you going to do)\nYou don't beef you want peace\nYou don't want your teeth knocked out in the street\nI pull out the biscuit and get sadistic\nFUCK COMMERCIAL RAP!\n\nMugisha"}], "artist": "Necro"}