{"artist": "E-40", "songs": [{"title": "Born in the Struggle", "image": "https://images.genius.com/e41f1fde4271b1ed7210d9f495ef3cfc.700x700x1.jpg", "album": "Revenue Retrievin’: Overtime Shift", "year": "2011-03-29", "lyrics": "[Intro: Dr. Cornel West]\nAnd so then the question becomes: How do we try to educate and teach and exemplify in our own lives as older folk to young folk there are other ways of dealing with this? Then there's a large issue of crime. How do we go about fighting crime? And it's towards this preferential treatment between the poor and the rich, end up with prison disproportionate black, brown, working class poor brothers\n\n[Verse 1: E-40]\nI had to hand-wash my clothes, didn't have a washing machine or a dryer, UH\nMama used to have to hang her period panties out on a clothesline wire, UH\nThe vacuum broke, used the broom\nWe got company coming over this afternoon\nYou know our family like to gossip\nClean up your room, throw everything in the closet\nI like to talk to the old schoolers, O.G. playas\n'Cause they was my age - I ain't never been theirs\nI count on em for guidance, leadership and advice\n'Cause everything I'm goin' through they done been through twice\nOr three or four times, five, six, seven, eight\nWe can learn from they mistakes before it's too late\nCommunication is everything, conversation's abandoned\nPeople die every day because of misunderstandings\nThe highs and lows, the ups and downs\nPissy sidewalks, human shit on the ground\nThe ins and outs, whys and won'ts\nHistory repeats itself, opportunities don't\nSad true story, unintentionally, not on purpose\nOnly time I see my family's at a funeral service\nHer stomach keep hurting, but she didn't bother\n'Cause you and I both know that black folk don't like to go to the doctor\nOne thing about us, mayne, we creative\nAnd at the end of the day we all related\nThrough the slaves and the Indians and natives\nThey brought us here on a boat, whipped us and raped us\nScraps from a pig they gave us\nSo we cook pork chops, chitlins, ribs and bacon\nFucked around and got addicted swine, which wasn't supposed to be\n\n[Chorus: Mike Marshall]\nI was born in the struggle, ooh ooh ooh ooh ooh\nI was born in the struggle\nYeah, our life it gets harder, the youth, they die younger\nThe time we get's harder, it's just what we're used to\n\n[Verse 2]\nOOOUH!\nYou got a ride to school, I had to walk\nWe had Rent-a-Center furniture, yours was bought\nPaid for, your parents had more\nYou had a bed to yourself, I had to share mine with four\nSometimes I slept on the floor, that's probably why to this day\nSometime my back be sore, UGH, hard times\nWe was borderline poor, far from being the richest\nIf we didn't do our chores, we would get beat with switches\nBorn in the struggle where we all wanna bubble\nWhere it's hard to do good but easy to get in trouble\nCan't be soft as table butter, can't be no punk\nAnd every neighborhood be havin' their own internal funk\nBoarded up houses, unsafe sex\nTeenager at the bus stop smoking meth\nGood girl gone bad, weak-minded without a doubt\nHer parents didn't find out until her teeth fell out\nOil stains in the driveway, church on Sunday\nEvery time I go, seem like the preacher preaching to me\nPointing at me, looking at me\nHeaven or hell, mayne, which one it's gon' be?\n\n[Chorus: Mike Marshall]\nI was born in the struggle, ooh ooh ooh ooh ooh\n(I was born in the struggle, yet I was born a Black man)\nI was born in the struggle\nYeah, our life it gets harder, the youth, they die younger\nThe time we get's harder, it's just what we're used to\n\n[Bridge: Mike Marshall & (E-40)]\nOoh, sometimes we sit back and watch things go by\nLike that's the way they're supposed to be\nNo no\nThis ain't how it was meant to be\n(This ain't how it was meant to be, mayne)\nTurn around, look at your neighbor, ask somebody\n(How cold is it?)\nIt's cold, cold, cold out here\n(And what you talkin' 'bout?)\nAnd I'm talkin' 'bout the weather\n(Say it one more time, bruh)\nI said it's cold, cold, cold, cold out here\n(It's cold out here)\nAnd I'm talkin' 'bout the weather\n(What was you born in?)\n\n[Chorus: Mike Marshall]\nI was born in the struggle, ooh ooh ooh ooh ooh\n(Ooh, I was born, I was born, I was born, I was born, in the struggle)\nI was born in the struggle\nYeah, our life it gets harder, the youth, they die younger\nThe time we get's harder, it's just what we're used to\n\n[Interlude: E-40]\nDr. Cornel West, talk to 'em\n\n[Outro: Dr. Cornel West]\nYoung folk don't come out of the sky, they come out of families, they come out of neighborhoods, they come out of mass media influence and so forth, you see? So by the time a young person's six-years-old, how many commercials have they seen? How many killings have they seen? Been exposed to a very violent society"}]}