{"songs": [{"title": "Moment of Ambiguity", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Hook]\nThank God for granting me this moment of clarity\nThis moment of honesty\nThe world'll feel my truths\nAll through my Hard Knock Lifetime, A Gift and a Curse\nI gave you Volume after Volume of my work\nSo you can feel my truths\nI built the Dynasty by being one of the realest niggas out\nWay beyond a Reasonable Doubt\nY'all can't fill my shoes\nFrom my Blueprint beginning to that Black Album ending\nListen close, you'll hear what I'm about\nNigga, feel my truths\n\n[Verse 1]\nPop died, didn't cry, didn't know him that well\nBetween him doing heroin and me doing crack sales\nPut that in the eggshell, standing at the tabernacle\nRather the church, pretending to be hurt wouldn't work\nSo a smirk was all on my face\nLike, \"Damn, that man's face is just like my face\"\nSo pop, I forgive you for all the shit that I lived through\nIt wasn't all your fault, homie, you got caught\nInto the same game I fought, that Uncle Ray lost\nMy big brothers and so many others I saw\nI'm just glad we got to see each other\nTalk and re-meet each other\nSave a place in Heaven 'til the next time we meet forever!\n\n[Hook]\n\n[Verse 2]\nMusic business hate me ‘cause the industry ain't make me\nHustlers and boosters embrace me and the music I be making\nI dumbed down for my audience to double my dollars\nThey criticized me for it, yet they all yell \"holla\"\nIf skills sold, truth be told, I'd probably be lyrically Talib Kweli\nTruthfully I wanna rhyme like Common Sense\nBut I did 5 mill' – I ain't been rhyming like Common since\nWhen your cents got that much in common\nAnd you been hustling since your inception\nFuck perception! Go with what makes sense\nSince I know what I'm up against\nWe as rappers must decide what's most important\nAnd I can't help the poor if I'm one of them\nSo I got rich and gave back, to me that's the win/win\nSo next time you see the homie and his rims spin\nJust know my mind is working just like them (rims, that is)\n\n[Hook]\n\n[Verse 3]\nMy homie Sig' was on a tier where no tears should fall\n‘Cause he was on the block where no squares get off\nSee, in my inner circle, all we do is ball\n'Til we all got triangles on our wall\nAin't just rapping for the platinum, y'all record\nI recall, ‘cause I really been there before\nFour scores and seven years ago, prepared the flow\nPrepared for war, I should fear no man\nYou don't hear me though, these words ain't just 'pared to go\nIn one ear, out the other ear, no!\nYo, my balls and my word is alls I have\nWhat you gonna do to me, nigga? Scars will scab\nWhat, you gonna box me, homie? I can dodge a jab\nThree shots couldn't touch me, thank God for that\nI'm strong enough to carry Biggie Smalls on my back\nAnd the whole BK, nigga, holla back!\n\n[Hook]", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}