{"artist": "Will Smith", "songs": [{"year": "1999-11-16", "lyrics": "[Will Smith]\nUh, uh, uh\nWhat?\nWhoo! Ha-ha\nYeah mic check\nMic, mic, mic, mic, mic, mic, mic, mic\nAlright now let's go yo\n\n[Lil' Kim](Will)\nHere come the butter baby\n(I bring it smooth and hot)\nHere come the butter baby\n(Bringing it smooth and hot)\nHere come the butter baby\n(I bring it smooth and hot)\nWhat? What? What? What?\n\n[Will Smith]\nHere come the butter baby\nBringing it smooth and hot\nGot the staff from K-B\nSinging this groove a lot\nSo I got my spiral notebook\nDrink and pen\nAnd then abracadabra y'all, done it again\nMarried but I flirt a little\nSiking the ladies\nIn the videos I be bringing it like Mike in the 80s\nLevel of success based on my level of risk\nYou've been yelling for the lyricist\nThen reveling this\nOld school hip-hop a beat and a rhyme\nSome chapters and some verses, you seek and you find\nLook no further here I go, Big Will, Johnny Inferno\nFlame by hip-hop burns eternal\nAll aboard on my train to fame\nRappers hoping that it'd rain\nTrying to stop the game\nBut rain can't stop me\nI got a coat in the crib\nHey look y'all yellow bricks quit beefin' at the whiz, what?\n\n[Lil' Kim](Will)\nHere come the butter baby\n(I bring it smooth and hot)\nHere come the butter baby\n(Uh, bringing it smooth and hot)\nHere come the butter baby\n(I bring it smooth and hot)\nWhat? What? What? What?\n(Lil' Kim y'all what?)\n\n[Lil' Kim]\nLil' Kim, Big Will give a damn how y'all feel\nHate, but on the real, Big Will is seven mill\nIf I wasn't on top I'd have a lot less ends\nI'd most likely have a lot less friends\nYou know what I learned, let them keep talking\nUh-huh, pull up in an Azure and watch them keep walking\n[Will Smith]\nKim haters be making me wanna flip and react\n[Kim]\nNo-no-no, chill Will and let me do that (alright)\nHuh, I gotta eat can't get with broke cats\nYou know the queen like to be where the money at\nI'm the mother, y'all like adopted in this\nCall us Mr. and Mrs. Papadapolis\nWhen will y'all learn?\nY'all just interns\nYou gon' get what you earn, just wait your turn\nI rock telephones with the TV screens\nSo I can have real phone sex\nKnow what I mean?\n\n[Lil' Kim](Will)\nHere come the butter baby\n(I bring it smooth and hot)\nHere come the butter baby\n(Bringing it smooth and hot)\nHere come the butter baby\n(Yo I bring it smooth and hot)\nWhat? What? What? What?\n\n[Will Smith]\nIt's the fun king, I've been doing one thing\nRunning things for years, give me one swing\nAnd it's out of here, crack!\nOver the fence ladies and gents\nKeeping rappers impressed but depressed by my current events\n[Kim]\nYes Lord!\n[Will]\nBig Will swinging the best sword\nWhat'cha flexing for, don't be testing me boy\nMessing with me boy, you're stepping on the root of a daisy\nI have you're girl saying\n[Kim]\nWill why you do that to my baby?\nYo Will, what they looking stupid in the face for?\nWhat? I can't have rocks the size of a baseball\nTrust me when I cop I make sure mine cut glass\nNever spend my last, like a crack head for the blast\nY'all can kiss my ass acting like you know me\nYou ain't got a Rolley, take this one here you owe me\nAll in together now, wrists looking better now\nScrew greyhound bound, I'm getting cheddar now\n[Will]\nBurrrr! When she step up in the scene!\nWho! Ice gleam, y'all scream, \"Bow to the Queen!\"\nRing on her finger mad phat\nLeonardo DiCaprio saw it and caught a flashback\n*mouth noise*\nAll you rappers wanna snap, Jazzy Jeff got my back\n*mouth noise*\nLil' Kim bring it back, Lil' Kim press the rack\n[Lil' Kim]\nYeah I'm short and sexy, my love's divine\nMy name is QB and I blow your mind with the\n*mouth noise*\nWhen I step up, body lookin' hot\nAll the music just stop", "image": "https://images.genius.com/6d35ec81cf7a17dcc359661f467d19b0.899x899x1.jpg", "album": "Willennium", "title": "Da Butta"}]}