{"artist": "Bas", "songs": [{"lyrics": "[Intro: Jeremih]\nI won't let it out until you let me know if you love it\nAye, baby, I'mma take it low\n\n[Verse 1: Bas]\nI'm on my night job, my niggas riding my city understand us\nSee a hundred bandits, each put a hundred bands up\nThey can't call us bandits no more\nSame hood, same corner store\nBut them same old hoes ain't wearing panties no more\nI'm on my night job, slim waist with them fat thighs\nNever been baptized, but she soak me all in her holy water\nI'm one of five, she the only daughter—she ain't used to sharing\nI ain't used to caring, let's play truth or dare\n'Cause lately my lifestyle's like dynamite\nI'mma go lights out like Dyna might\nSmoke one, that I might—I'm on my night job\nAlways knew how to play these cards of mine\nFuck rap, we seen harder times\nJump back like Vinny Carter prime\nI'm on my—\n\n[Bridge: Jeremih]\nI won't let it out until you let me know if you love it\nAye, baby, I'ma take it low\n\n[Verse 2: J. Cole]\nI'm on my night job, y'all niggas jivin', I'm back up in position\nEarnhardt, I'mma catch some nigga slippin'\nBurn hard on a track and get to whippin'\nI'm on my night job, why is it always blacks that get detention?\nFor my nigga with the pass to get the flip in\nBoy, that trap is a accurate description\nI'm on my night job, finally got Bassy off the corner\n'010 niggas thought he was a goner\nHe ducked shots, now it's \"Bas we got a phoner\"\nI'm on my night job, flew the posse out to Rome and\nWon't tell you 'bout no Bo$$-Key-Yacht$, don't want 'em\nNigga, word to Selassie I, I'm zonin'\nI'm on my night job\n\n[Verse 3: Bas]\nGot old niggas tryna bite cause they can't capture\nThe feeling from days 'fore the game passed 'em\nNiggas out here lookin' like a bunch of Dame Dashes\nNicorette, that's patchwork\nThat ain't better than your last work\nCigarette, let the ash burn\nOmen said don't worry 'bout the last word\nI'ma hit the gas, swerve on 'em—Skrr!\n\n[Bridge: J. Cole]\nToo high to riot, that's my best excuse for being lazy\nBeing an artist, that's the best excuse for being crazy\nI've been so infatuated, went to Clark and graduated\nNow she on my face time and, my nigga, she just masturbated\n\n[Verse 4: J. Cole]\nFuck a album release party, I'm out in the streets, shawty\nHow many rappers I killed—counted at least forty\nNah, I ain't God, but shawty down on her knees for me\nI'm horny like that Coltrane album\nA Love Supreme, that's Cole fave album\nLately, I've been dancing like a Soul Train album\nLately, silly making songs talkin' 'bout how they hate me\nThey've been loving me this whole time\nMy only adversary was my own mind\nKilled my ego now I'm snappin' like it's '09\nWith a gold mine of inspiration for y'all\nFuck your co-sign, that nigga can't fuck with Cole neither\nDon't ask for a feature, we bring a whole liter of ether\nTo eat ya, we got heat for niggas, keep reachin'\nIf these bullets was heat seeking\nThey wouldn't even reach you niggas\nI'm on my...", "image": "https://images.rapgenius.com/99bf51c33d2bab8e79dcb55c6860b119.549x548x1.jpg", "year": "2015-12-04", "title": "Night Job", "album": "Too High to Riot"}]}