{"artist": "3rd Bass", "songs": [{"lyrics": "[MC Serch]\nKnowledge on the court, observin what is all around\nThe light goes up, my mic blows up, the silence is now sound\nHearin and fearin, the momentum of the stutter step\nShook to the left, because the brother slept\nCrept into his ego, so he caught a bad one\nSwitched my next flip, he thought he had some grip\nBut my grip, is when my fingers curl around the mic\nI know what it's like, a dog eat dog world\nBut I'm a carnivore, out on the parquet floor\nWhether ballin, or callin out a sucker who is lookin for\nStatic, me grab it every chance I get\nOne on one I'll never run and shoot the high off the net\nThis position isn't switchin, pitchin out a blind pass\nHindsight, my mind's right, time run through the hourglass\nSerch is my name, the game and my goal\n3rd Bass settin soul in the hole\n\nYo man, why don't you give me the pole man?\nWhy are you freezin me out?\nYo man, cause you can't play, you ain't got no handle\nGot your socks up to your knees like Michael Raines\n\n[Pete Nice]\nDrip liquid, pick up a park pill\nEnduce a hand over freeform with this skill\nSpills are spun, a crossover break slice\nSugar brother the pavement says\nSchemin' on suicide to play post I slash\nFirst step... I shook ya ass\nStep to wayside, ain't no weak side\nBassline I'm never givin, on the flipside\nGrass to a mic like a hand palm rubber\nRoll off a finger, you're gum, I rubbed ya\nSweep like a Knickerbocker, the 3rd stops ya\nAnd after dark, I play the part of boot knocker\nTwenty-four seven, always out to get some\nSlap her on the concrete, bleed til the hand's numb\nA way of life found, a rim stuck to a pole\nAn asphault jungle, soul in the hole\n\nYo man, I got next!\nNext? You ain't got next man\nYo go over there in the corner, with Michael Raines\nAnd take a couple of tokes of the pipes man\nYouknowhatI'msayin?\n\n[Serch]\nPoint is in effect, callin for a play out\nLay out the plan, but your scammin for a way out\nFigure of speech, spoken wise for a drum, three on one\nTchk! You know the outcome!\nPoint up the joints up, straight up for an uproar soarin\nThen you execute the score, then you fade away\nThis fade has been played\nGave the gift swift, you just got self-made\nExecute performance, the 3rd step upon this\nMe and Pete, complete, like sex endurance\nTip on the rim you reverse and rehearse\nCoachin but you're slouchin, you can't be first\nYou want the rock? But you don't got the handle\nI drop the French, cause Serch grilled your mantle\nFace intense, you're sellin your soul\nJust for the action of soul in the hole\n\n[Nice]\nPavement bounce off metal meets human flesh\nSlum onside stagnate you got next\nEach day evident, parks brothers throw down\nOne on one, it boils down to showdown\nSpins reverb, soothe he goes a rip slip\nBy his larceny, or petty theft\nSpectators move, lips into motion\nPop shit, get hit, the sewer then becomes an ocean\nWater runs, springs and I let it fly\nSlide a weak side, into vein\nTry to terminate silk textures, of the fingertips\nThree bases covered, as I dip\nDeeper into repoitoire, the Minister an innovator\nTake a sphere and a mic and I'll step later\nUnder lamps of the Serch, cold\nShootin lava in the soul in the hole", "image": "https://images.genius.com/ab41b3ae09cc27fdd7afaa66229d0bf5.500x500x1.jpg", "album": "The Cactus Album", "title": "Soul in the Hole", "year": "1989-11-14"}]}