{"songs": [{"image": "https://images.genius.com/94364b8d9e3e0628e8787523385615f5.500x500x1.jpg", "year": "2009-09-22", "title": "Nefarious Verses", "album": "The Unforgiven Volume 2: Assisted Suicide", "lyrics": "[Hook]\n\nThese are the thug songs\nIt was my destiny\nTo carry the curse\nIt was written so let it be\nThe nefarious verses\nThis is my legacy\nConsider it food for thought\nThis is my recipe\nThese are the thug songs\nHellish and heavenly\nI can see the light ahead of me\nMaybe I'll rest in peace\nThe nefarious verses\nThis is my legacy\nConsider it food for thought\nThis is my legacy\n\n[Verse 1]\n\nClose the eyes as I describe the picture and visualize the scene in your mind's eye\nAs I scribe the scripture\nAnd come with me\nAbsorb the words\nIts a metaphorical decapitation  and its sword to words\nLeave behind your politics, opinions, and commentary\nJust listen\nDoesn't require any religion\nLet go of your beliefs until you spiritually bare\nSo your preconception won't render your hearing in here\nNow that you're prepared\nI got a story to share\nAnd it's from a unique perspective - this story is rare\nI've seen the light\nI witnessed the glorious glare\nOf the truth and it was almost too much for me to bear\nOne day I asked myself\n'Is this the way I was meant to be'?\nI had an epiphany I was living in misery\nAn evil man more destructive and crazy\nI tried to fight the truculent thoughts but my mind depraved me\nIs this the way God designed me, made me?\nOr is that just an excuse in all truths they say\nSo many questions\nDon't know who to seek for answers\nShould I speak a preacher or a  necromancer\nI was standing on the brink of insanity\nWent on an introspective journey through my soul tryna find my humanity\nWasn't half the man I planned to be\nI wanted to know who taught me misanthropy - was it life or my family\nI wanted to know\nWhy couldn't my parents unite\nThey should raised me together taught me to be fair and do right\nAnd I wanted to know\nWhy my soul was prone to drama\nI was floating in darkness and I'm so far from over\nWhen I was young\nA figure stood at the foot of my bed\nAnd it vanished when I shook my head\nWas it a dream or a sign of all things to come?\nI'll find out on the day that God's kingdom comes\nBut right now...\n\n[Hook]\n\n[Verse 2]\n\nI was forced to contemplate\nIt was involuntary\nI couldn't stop thinking I was locked in solitary\nSurrounded by white walls\nSensually deprivated\nIt was like light pauls\nMentally devestating\nLike \"Cast Away\"\nI was stranded in my own brain\nStashed away\nCouldn't remember my own name\nIt lasted for days in the zone causing my own pain\nUp until that point in my life I hadn't known pain\nBut my identity\nI started to recollect\nRecalling my memory\nI started to retrospect\nA theme played in my mind - started to reminisce\nReview the instance when I discarded my innocence\nA delusional image was it a vision or fantasy?\nWas I losing my mind, losing my sanity?\nI called out to my creator\n\"Forgive me for all the lies\"\nAnd I asked but got no reply\nHow passionate was my cry\nIt flashed before my eyes\nI saw my creator\nIt was me\nI'm responsible for all my behavior\nMy thoughts clear\nBy walking through the flames I was purified\nIn the fire I've been doing for life\nI tried to kill the renaissance\nSo my soul was banged and bruised\nThrough the experience I gained the truth\nAnd in response I'm hoping I can change the views\nMy generation needs a voice of thugs bangs to you\nWho can explain the views\nIn all pain\nI've written this in plain English\nLike Sam Clements\nSo call me Dark Twain\nWritten to see\nFor all the young in the ghetto\nThug songs continue to be sung in the ghetto\nLet these preach in all the slums in the ghetto\nCause in the Bible\nJesus comes from the ghetto\nAnd I come from the ghetto\nSo I speak for the ghetto\nThese words and these tears\nMy soul beats for the ghetto\n\n[Hook]"}], "artist": "X-Raided"}