{"songs": [{"year": "2017-11-10", "album": "Engraved In The Game", "image": "https://images.genius.com/d2a4d928684e2efa403cd26a8dc80fa5.1000x1000x1.jpg", "title": "High", "lyrics": "[Verse 1]\nYou didn’t have ‘em back, that was all a lie\nI don’t trust no one, I'ma walk with my\nHead held high everywhere I go\nThat’s the Kerser yo, he’s got a murderous flow\nHave you heard of him bro? I don’t give a fuck\nGot enough fans now, I can live it up\nAnd you ever thought me to be one to care\nI have the judge suck me off in her underwear\nCame from the bottom and they copying, amazing\nSame when we got ‘em and we stopped ‘em engraving\nI don’t know what to with y’all\nI don’t listen to the rap, I get stupid bored\nSuper lord, I’m a king, in fact\nIf I end your career, we can’t bring it back\nSo I’m being quite lenient, please say thank you\n'Cause I got pride and my pride will break you\nEver heard of a Kers attack?\nWhen his enemies end up in hearses act\nI ain’t say too much, they call me king\nIf they need it sick then they call me in\nThat’s verse catch-up, I’m the man with this\nAnd I speak so sick, it’s cancerous\nIf I ask some shit, you answer it\nI’m a boss stay real, expand the shit\nCame a long way, man I always say that\nGotta say that 'cause that’s a straight fact\nWhere I go on a land that knows me?\nEverywhere I go, it’s a picture homie\nMan you’re the shit, you’re the sickest bro\nWe pumpin’ your shit all the time and I know near\nEvery word to you latest, oh yeah, thanks\nI appreciate it but I gotta go get high\n\n[Hook]\nI just got to get high\nHigh when I wake up, high when I sleep\nHigh every day that I’m able to breathe\nI just got to get high\nHigh when it’s midday, high when it’s night\nHigh every day, it’s a part of my life\nI just got to get high\nHigh when I wake up, high when I sleep\nHigh every day that I’m able to breathe\nI just got to get high\nHigh when it’s midday, high when it’s night\nHigh every day, it’s a part of my life\n\n[Verse 2]\nWhat you wanna hear? An untouchable flow?\nEvery time I hit the mic, I’m in a confortable zone\nStill puffin the 'dro, been around a while\nThe passion that I spit brings your frown to smiles\nSeen a bit of shit, never tried to remember\nHalf of the shit 'cause my mind in a blender\nGuess that’s the reason we all got a temper\nABK never known to surrender\nI ain’t mentioning that, you don’t need to know\nPut water on the seed and the weed will grow\nBut the seed was me and I blew up so mean\nDidn’t use water, it had to be codeine\nOh me, am I off me head?\nI didn’t right that shit, that’s what the doctor said\nWhat I meant to do, just lie to you?\nNo way fuck me, I'm high as too\nLets get back on the track where the rappin’ is fat\nAnd I’m smashing it lad since back of the cab\nThat single drive from Ingleburn\nStingy cunt wouldn’t risk a earn\nI mean risk a loss, he’d make his pay\nNo discounts for ABK\nI see fuck, man I miss the days\nWhat you miss about them getting pissed again?\nAll the shitty trains, that we used to jump\nI don’t know it’s weird, I just miss the stuff\nAnd I’ve had enough of this shit right here\nChinese whispers in my left right ear\nIf I left right here would you show me love?\nGot my middle finger up saying go get fucked\nOh the cunt, just let me fly\nIf you didn’t fuckin' know, I just wanna get high\n\n[Hook]\nI just got to get high\nHigh when I wake up, high when I sleep\nHigh every day that I’m able to breathe\nI just got to get high\nHigh when it’s midday, high when it’s night\nHigh every day, it’s a part of my life\nI just got to get high\nHigh when I wake up, high when I sleep\nHigh every day that I’m able to breathe\nI just got to get high\nHigh when it’s midday, high when it’s night\nHigh every day, it’s a part of my life\nI just got to get high\nI just got to get high"}], "artist": "Kerser"}