{"songs": [{"lyrics": "[Verse 1]\nI skunk the blood up as to numb the public interface\nBefore the anime corrodes I'm tryin' to fork the figure eights\nHogwash etiquette, truncate long haul leverage picket\nOutbuild auto-bricklayers with 10 guerrilla digits\nA to Don Darko, bark O beautiful piranha gossip\nCobwebs on the Kafka, choked up on Watcher logic\nWith a left-center field indicator gesture gently\nSmash when the 101-octane hemlock tea pumps chest to extremities\nAnd phenom limp it to the wicked recon\nProwler fist up with a Bowser twist vs. America's kooky coward clips\n(Pump breaks, cupcake) I melt through the father formula\nGoofus murked Gallant, the missing link was apparent\nDrugstore cowboy, hold floors and grudges\nFuck the Judy piece while Elroy burgle space cakes from the cupboard\nI could kill a cockroach with only Wallabees and rug burn\nPin 'em down and funnel up boric acid chuggers if stubborn\nMash jackals, hacks flash Bedazzlers\nCapture flags and crash test happy campers\nFor the typecast ponies grazing through the weekend\nRing alarms with bassy kicks that flip whips on the Major Deegon\nLeft out of dodge nauseous (I don't feel good)\nYo El, leave the keys to the Delorian with Lauren at the office\nI peak the 88 streak off with a fiery disposition\nAnd basic serotonin deficient symptoms\n\n[Hook]\nAlpha uno compute (Aesop)\nMotor mouth askew at the root (Rock)\nBrick house, huff, blew the roof\nPlease don't feed the bazooka tooth\nEvolution super fluke\nEvolution super fluke\nEvolution super fluke\nPlease, don't\n\n[Verse 2]\nWith a kiddy pool full of warm milk, Nyquil and powdered Ambien they found him, trying to drown sheep and count 'em\nThe rowers keep rowing. Pachyderm tranq dart blowgun pressed to the nape of the neck only spent 12 seconds frozen\nMarathon eye-opener most likely misinterpreted, 'cuz one bad night before the big briefing ain't breached the surface yet\nHoller dirt merchant... echo out Brooklyn, where the women are beautiful and the vagrants piss crooked\nThis is the sound of one man getting high with one hand in a forest with a tree falling alone... ya heard?\nCut rugs to it. Me and my leaky budget nickel-bribe the judges just as a beautiful goose egg motif's adorning the panel's judgment\n(Overnight Biggies) Overnight Biggies plunk quarters into an A & R Zoltar while the incubated fade collar pop folklore in effect\nNow they want to mitigate the gusto, that's like asking the cast of Watership Down to fuck slow\nHomogenized carnies\nVoodoo lullaby placebo collide zombies\nBlazing R&B sucker pop lolli fuck spoon futile cartoony maneuvers to soothe roosters\nDoctor I'm having headaches and pink slip's in my locker\nMy agita needs a walker. (Hey) It's better than Cats!\nSee a grown-ass-man decay to red worm food in house fly years while y'all stable, like all aspiring actors waiting tables\n\n[Hook]\n\n[Verse 3]\nSo I line 'em up and ask 'em flat... wanna de-worm the belly of this? Orphan bloodlust or timidity?\nSolidify. Widdle I Aes millipede uncivil. When Millie pulled the pistol that tore the vanilla sky across the middle\nA billion little crimson pinholes sweat on vintage quill venom developed by a fatal blues anthology\nCommunities on cue bury their ostrich beaks\nThought it was carnie mirrors 'til the cold morning stunk the stink of obsolete heroes\nHyena for the sci-fi, God barter \"non\" for hyphen\nPromo charted phobia specific violence like a 50 foot Bob Barker deployed to incinerate New York, which in a way's more scary than thermonuclear war\nI got my tongue down Karma's throat.\nHalf a dozen spy cams rigged up in blackmail science\nSwamp rats back off a destiny that fucks her clients hence the riots\nYou lose, she knew about the tapes and asked for my assistance to clip the biased\nLucky sevens buddy up for mass taxidermy\nSome burn facts and secure camo to past\nI'm open bodega with ankle anvil pre-shackled out, cancel hackers backwards 'til the death tarot and rains collabo\nHope's a broken arrow stabbing blind through the fog in the log cabin, which gathered and hasn't budged since 9/11\nGive him a couple close friends, a woman in his old bed while he waits. He'll hug it all with no plans to escape", "title": "Super fluke", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}