{"songs": [{"title": "WW3", "lyrics": "AKIR ft. Payshir - “WW3”\n[Emcee(s): AKIR and Payshir (AKA Paydaye)]\n[Producer(s): [?]]\n\n[Intro: AKIR]\nYeah.  We’re fighting wars overseas and we’re still losing soldiers at home.  Check\n\n[Verse 1: AKIR]\nSome nigga beat it up.  Shorty just like to freak and fuck\nAnd now she trying to give her fetus up for free.  Her weekend sucks\nIt would be easier.  So used to dudes leaving her\nChains of mind are keeping him, didn’t stress academia\nIt only made him cold with sickle cell anemia\nRunning through the streets like he was held by a demon’s clutch\nAnd now she’s pleading so her son don’t have to see the judge\nHe turn and freeze like three G’s, hoping he’s free to budge\nBut as he thinks it’s easing up, beefing and leaves the club\nSee the bugs increase the piece and release the snub\nCease to love, The Beast’ll come quick to eat the young\nThat’s right.  When a new seed is sprung, he never seen his son\nThat’s when the season’s done.  The streets is never easing up\nSee the stuff, believing up in TV and CDs and such\nAnother evil stuck to profit off a recent bluff\nProceeds to go and seize the bucks, weeded while he reads his stuff\nFeeding off, a scene is rough.  Goons’ll beat him up\nSadly, dreams are tough.  Respect is mostly seen with guns\nAnd so he let his cannon spit.  He couldn’t handle it\nThe loser trips—hit is damaging.  Here come the ambulance\n\n[Hook: AKIR] (x2)\nThis is World War 3.  I got to\nGet mine before they get me, go out in a blaze\nAnd make history.  This is World War 3\nPolitical games that make life risky.  Stick to my guns\nAnd move swiftly\n\n[Verse 2: Payshir (AKA Paydaye)]\nSaudi Arabian sand corruption.  Turmoil reach\nThe Holy Land, controlled by democratical plans\nTo overthrow government, breaking Allah’s covenant\nMissiles strike on Afghanistan, kill an innocent man\nMindstate is Shayṭān, spiritual ground breaking.  Make no\nMistake.  Your rhyme connecting my line like cable man\nDescendant of Abraham, Allah Don Arabian\nLick shots and rap more faster than taps from Savion\nMisconceptions form cancerous with these new gods\nI’ll use line to bruise—find another fake crew died\nIs true lies a form of honest deception?  I’ll magnify\nLife, bring dozen lyrics from Allah’s projections.  Here’s why\nI said it: brutal lyrics leave crowds with paramedics\nI’m forced to set it.  Niggas is false like prosthetics\nI’ll rock with it.  Deer Park flow black like HBO\nAfter dark, puffing the junk, reading schematics\nTo know the target, so I can rise above the demons\nIn the valley of the shadow of death, I'll stay gleaming\nThere’s a war going on outside.  We’ll drop bombs\nCheck us out on HIPHOPWARREPORT.COM\n\n[Hook: AKIR] (x2)\nThis is World War 3.  I got to\nGet mine before they get me, go out in a blaze\nAnd make history.  This is World War 3\nPolitical games that make life risky.  Stick to my guns\nAnd move swiftly", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}