{"artist": "Boogie", "songs": [{"album": "The Reach", "title": "Further", "year": "2015-06-24", "lyrics": "[Intro: News Reporter]\nIt was September 7th, when little Tiana Ricks was walking into a family party with her dad. Tiana lived in Long Beach with her mother. John this is a very sad story, we do know detectives\nThe little girl and her father had come to this house for a college send off. The 6 year old would have been dancing with her relatives at a get together Saturday night, but suspected gang member. Suddenly somebody drove by and opened fire on the home of\n\n[Verse 1]\nThis ain't ever been my birth wishes\nYou know the struggle got the worst wishes\nThe homie had a wife until my nigga got to striking\nAnd they wonder why I curve bitches\nThey tryna say i think wrong\nIf I don't make a hit, I ain't gon' never leave home\nThe homie got killed, it seems like everything gone\nThe cycle ain't broken and we forever need loans\nI'm tryna read on, this ain't just my story\nI'm tryna let 'em know your plot too\nI see a nigga kill a nigga but it's sick how we be trippin' when the cops do\nLike don't that seem backwards\nWords never written in these unseen chapters\nMappin' out the plan and ain't never seen an atlas\nStaying free my mind, knowing damn well we captured\nIt's all bad, stuck up in a heat, like everybody gotta vent\nWait, no, no really wait I mean the weight that's on your shoulders\nGive you strength\nStarted from the bricks, mama couldn't pay the rent\nDon't tell me bout a daddy, man that nigga full of shit\nThis god damn baggage, like nigga you a trip\nCould tell you foul by the scent, that's all bad\n\n[Hook]\nAnother nigga caught a murder, and that ain't never unheard of\nI keep reaching for the clouds and they just keep moving further\nAnd further and further\nThey told me not to fail and I just tell 'em I heard ya, I heard ya\nI keep reaching for the clouds and they just keep moving further\nAnd further and further\nI keep reaching for the clouds and they just keep moving further\n\n[Interlude]\nHe also has been grieving the death of the mother\nI'd like to see what the guy looks like\nGood morning Steve, good morning everyone, we're getting our first look at the suspect\nBet he's a gang member\nGo straight to that picture, just sent to us by the Sherrif's department\nYou won the bet because he is a gang member\n\n[Verse 2]\nJust the other day, I was talking to my nigga 'bout his cousin\nAnd he was telling me how they from different hoods, but at the end of the day still love him\nBut it's fuck him, can't trust him\nThe nigga still a enemy, they was damn close\nSee, back in elementary, it's taking all my energy to try to stay the enemy\nCause niggas out here frontin' like the nigga they pretend to be\nThat shit weak\nI was chilling with my kid, some dude banged on a nigga tryna front\nOn one hand I'm scared for my kid life, other hand show him he can't be no punk\nThat when my mind start jetting\nPride start setting, eyes start sweating\nI gotta get with it 'fore the lie start stretching\nYou know words don't matter, that's life's hard lesson\n\n[Hook]\nAnother nigga caught a murder, and that ain't never unheard of\nI keep reaching for the clouds and they just keep moving further\nAnd further and further\nThey told me not to fail and I just tell 'em I heard ya, I heard ya\nI keep reaching for the clouds and they just keep moving further\nAnd further and further\nI'm reaching for the clouds and they just keep moving further\n\n[Outro: News Reporter]\nHasn't given out a motive, as if there could be any rhyme or reason. Tiana didn't stand a chance, the bullet going right through her, and then hitting her father. We're told her last words were. Well she was asking if her daddy, if her daddy was okay", "image": "https://images.genius.com/329e9e692537ac6301adb12b1fef2ab9.300x300x1.jpg"}]}