{"songs": [{"lyrics": "[Verse 1]\nAs soon as I grab it, I eat it up like a savage\nAnd no one don't have it, I get it together like a marriage\nI see you know rappers, I'm on my Ps and Qs and carrots\nY'all don't understand well goddamn, don't y'all know my status?\nI'm flowin' the baddest, the baddest, I'm the baddest\nNo need to explain, my name the only thing that matters\nWhen suckers who bite me, they find I'm a bit much to swallow\nYou're thinkin' it's hollow, the rhythm is rough and r-rugged to follow\nIt hit you like bam biggity bam bam biggity bam\nThe kid is a wizard, I'm definitely destined to make 8 digits\nMet up with G Rap on the road to riches\nAs soon as I step up, will never remember\nWhatever I touch, whatever I touch you know I'm gonna injure\nThat nigga don't play, hey, that nigga'll slay\nSo wiggle away, hey, you gotta dig that nigga Jay\n\n[Hook]\nI'm the greatest MC, I'm the greatest MC in the world\nI'm the greatest MC, I'm the greatest MC in the world\n\n[Verse 2]\nI be thorough in every borough, my name be ringin'\nWith drug slingin' and doin' my thing and fuck that\nBoot-knockin' so lady be jockin', my money be flippin'\nI see you peekin' when I'm freakin', nigga stop rippin'\nI got the ideal skills for real\n6 digits before I had a deal, son chill\nWho's that? With a tip of the melodramatic the crew's back\nI [?] the way I dos that\nBetter at rippin' it, flowin', kickin' the fly shit\nFor [?] I'm givin' a bit of advice, slice\nDon't even try that shit\nI got skills 'til it's unreal\nBroken down, I'm speedin' it up to 180 thousand trillion mil'\nSo what it was said about a brotha bein' as nice as me\nY'all know that shit is dead, right? That shit is dead\nWhy ask why when the shit sound this fly?\n\n[Hook] x2\n\n[Verse 3]\nHere I come, ag-ga-ga-gain, I run up-up-up-in\nNiggas who don't do duckin', I will bu-buck and, fuck it I'm wild\nBudda-boo-boom-boom-bam\nWhat you niggas gonna do to the man?\nI see you brought your little crew, and?\nI'm still comin' with velocity, check it out\nJidday Idday Whiddy Ziddy, eh-heh!\nAnd any you clowns fuckin' around\nAin't none of you clowns stand your ground\nWith the crown prince of the underground\nSounds like I'm ready to catch wreck now, the heat's on\nSweat now, Jay Z's on, be gone to the next town\nPunks jump up to get beat down, check it out, check it out, check it out\nLadies be comin' [?] now\nThis kid got skills\nIt's a pity the way I'm rippin' rugged rhythm through the city\nLike da-da-da-da-da-da-da-da-da-di-di\nI got rhythm, I, hit 'em with rhythm, I\nHit 'em and split 'em, I did 'em, I get rid of them guys\nJ-A, baby, baby, please give me Ps\nBaby baby, with crazy ease\nWhile Jay Z get crazy cheese\nI take a break then I slay, never bring in my way\nI'm cuttin' your shit short, hey, alright\n\n[Hook] x2", "title": "Greatest MC", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}