{"songs": [{"year": null, "album": "Tell the World My Name", "image": "https://images.genius.com/13eeaa5fc1948dbfc3568cb96d5a1c08.400x400x1.jpg", "title": "Rockin’ For My Hometown", "lyrics": "I'm rockin' for the hometown\nC-I, C-I\nI'm rockin' for the hometown\nC-I, C-I\nI'm rockin' for my hometown\nC-I, C-I\nI'm rockin' for the hometown\n\nI'm from C-I L-I F-L-Y\nLike a B-I-R-D in the S-K-Y\nDon't T-R-Y to be [?]\nThese L-I-N-Es belong to M-I-N-E\nI'm make and they take, some rappers imitate​\nOK, my rhymes make parties sway\nPeople, I won't take any kind of losses\nI battle rappers and I use all resources\nLike household utensils, kitchen sinks\nSome will get bust so they can think or blink of any way to destroy me\nTry to unemploy me, I can't let no one stop me, I'm runnin' for the\nChampionship, rappin' ain't no game\nAfter N-K, Solo will retake what was mine, is mine, will stay mine\nAnd it's that way because my beat and my rhyme\nAre from Long Island, but in this society\nI never find a rapper who can stand by me\nWhere's the formula that makes Solo?\nA-X plus the B-Y plus C is zero\nI need nobody, I use no persuasion\nThe X and Y will satisfy my equation\nI'm gonna tell 'em that the new king has risen\nIt's time for y'all to make an independent decision\nI hear rappers of the world with self-taught talent\nWho get smacked with beats and lose composure and balance\nWhen I rhyme I eat more bass and [?] like a fiend\nI keep my balance (how?) like I'm rhymin' on a balance beam\nSo when you fall down, stay down, low down\nK-Solo is just rockin' for his hometown\n\nC-I, C-I\nI'm rockin' for the hometown\nC-I, C-I\nI'm rockin' for my hometown\nC-I, C-I\nI'm rockin' for the hometown\nC-I, C-I\nAnd that's my hometown\n\nI'm not new to this but this is my first jam\nAnd I'll be damned if I let a rapper take command\nOf my show, I know, he can't get my flow\nYo, this style is made for the Solo\nMy moms used to tell me that I'd be a broadcaster\nI said I'm Solo Mom and I rhyme much faster\nThey're runnin' hot 'cause they scared like\nSolo, chasing Freddy in his worst nightmare\nHoldin' the mic tight, 'cause when it's time to recite\nI say things to make a rapper wanna fight\nBut when I'm rockin', I'm shockin' never fallin' offbeat\nMakin' sure profits in my pocket will increase\nNo time for assumptions (what) or malfunctions (kick it)\nWe know this jam's not a [?] production\nBeats equipped, words and rhymes fit\nI change the tide while Biggie Smalls gets with the movement\n\nYo Biggie Smalls?\nWhat's up?\nYo, everything cool on the flex?\nYeah\nCool man, 'cause I'm gonna rip this\nDo that\n\nGet with my movement, my rap and flow is like a wheel hit\nRemember Solo and all my rap achievements\nMy rhyme's a source, some get lost\nThey throw the mic against brick walls and turn and toss\nI race 'em, chase 'em, catch 'em and bass 'em\nSmack 'em in the face like my girl outta place and\nHit 'em wit a rhyme watch a rapper drop\nThe man left a Nabisco in the Oreo box\nI entertain with gangsters, who take off all\nThe bodyguard's Bogard, the DJ's Biggie Smalls\nWe went with the flow, while I cranked up the sound\nTonight I dedicate this jam to my hometown\n\nC-I, C-I\nI'm rockin' for my hometown\nC-I, C-I\nI'm rockin' for the hometown\nC-I, C-I\nI'm rockin' for my hometown\nC-I, C-I\nAnd that's my hometown\n\nC-I, Central Islip word up\n[?] coolin' with EPMD, K-Solo in effect\nBrentwood, New York, yo we in here\nI'm rockin' for my hometown\n\n[scratch and cut]\nC-I, C-I"}], "artist": "K-Solo"}