{"songs": [{"title": "Interlude 3", "album": "MTV Unplugged 2.0", "year": null, "image": "https://images.genius.com/223n7ezbshqosz0dhiz8hrmkd.500x500x1.jpg", "lyrics": "I tell you, there are no big shots in reality, y'all\n\nWe're all in the same boat, dealing with the same issues, same problems, same stuff. Don't even buy it. All the perpetration... you know, all this... \"We don't have problems.\" That's a lie. That's a lie. I know that the enemy is doing the same thing to me that he's doing to everybody else. I just know now that the only way to get out is through confrontation. See, we always thought it was retreat, you know, run away. And I'm telling you, you got to confront it\n\nThis is a strange song because this song -- when this song was written, this is when everything sort of stopped. It was written a long time ago, but it was right before God just snatched me out of everything. And because I didn't understand... Initially it was written -- I'd written it about the whole Amadou Diallo situation, when it first happened. And I went to the studio, and I laid it down. And it was like, strong, for the first day. And then it just regressed everyday after that. And I said, \"What's going on? What's happening?\"\n\nAnd at the end of it there was a word that i used, \"rebel.\" And I guess was afraid. It was such a hot time in the city at that point, I was afraid that if I\nPut the record out, people would misunderstand what I meant by \"rebel\" and they'd just take it to the streets. So I was very intimidated and afraid. And before I knew it a whole host of things happened. Everything stopped after that. And the creativity stopped. Everything stopped. That's when I realized I had to understand what I was talking about before I could tell somebody else what I was talking about. And I had to be, you know, a living example\n\nIt's real crazy because I don't know what the press is saying because I don't listen to the press too much. But I know the view is that I'm emotionally unstable, which is reality. Like you aren't?\n\nI'm laughing because what I've realized I've become is one of those mad scientists who does the tests on themselves first, you see, to make sure that they work. And that's when you know, OK look, I got something that works. You know what I'm saying? I'm not gonna give you something that I haven't tested for myself. And you go through, and you're learning by way of experience, and you're making mistakes, and you're getting up\n\nA friend of mine once said to me, he said, Look, if we weren't supposed to turn around, why does a car have a steering wheel? Are we just supposed to crash into the wall? No, we're supposed to say, Listen, I was going the wrong way... Reverse!\n\nIn this particular song, now I realize that this song is about freedom. You see? We could look at one human being, but it's about the spirit of freedom being taken out, and how it's taken out in all of us\n\nThe song is called \"I Find It Hard to Say.\" Bear with me a little bit"}], "artist": "Lauryn Hill"}