{"songs": [{"image": "https://images.genius.com/b004781b362cd21da695699a9328946c.600x600x1.jpg", "year": "2019-06-21", "title": "Enter / Uncharted", "album": "The Dude with the Strap Back Dad Hat", "lyrics": "[Enter]\n\n[Intro]\nYeah!\nWin Money!\nKhovu!\nVizzy!\n\n[Chorus: Khovu]\nWelcome to the Enter! (Hey!) I was tryna get up (Yeah!)\nI done seen em' switch up (Yee!), Now I’m flame I'm lit up, yeah!\nFue como Candela! (Yeah!) Fue como Candela! (Candela!)\nFue como Candela! (Yeah!) Fue como Candela!\nI don't chase my liquor! (No!) Faucet how I drip up, (Drip!)\nWhen life gave me lemons (Yee!), and still I ain’t give up, no!\nFue como Candela! (Yeah!) Fue como Candela! (Candela!)\nFue como Candela! (Yeah!) Fue como Candela!\n\n[Bridge]\nTell the big guy I'm coming through\nNeed the big bills, big butts big boobs\nAll of these girls is on my crew\nAll of this world is oh so new!\nShe bust it down on every song\nWanna keep going, baby, carry on\nHits outta here, I'm Barry Bonds\nSo Gone I Might Need A Carry On!\n\n[Verse 1]\nWe rollin' together! Like we know we the tethered\nI go wit' the weather, you fold under pressure\nI go to the Mecca, get holy and better\nCome back wit' the fire! Fue Como Candela!\nMy Entrance Like Kane, man I walked all through the flames\nCame into the game made em' remember the name\nThis shit is insane, Mama don't think it’s her same, Child\nI figured the game out, just watch as it plays out!\nYo no te quiero, no habla de dinero\nI trip pull out the barrel, might flip Eddie Guerrero\nGet up wit’ all my niggas, a circle full of Winners\nTell em' that it’s dinner, Welcome To The Enter\n\n[Chorus: Khovu]\nWelcome to the Enter! (Hey!) I was tryna get up (Yeah!)\nI done seen em' switch up (Yee!), Now I'm flame I'm lit up, yeah!\nFue como Candela! (Yeah!) Fue como Candela! (Candela!)\nFue como Candela! (Yeah!) Fue como Candela!\nI don’t chase my liquor! (No!) Faucet how I drip up, (Drip!)\nWhen life gave me lemons (Yee!), and still I ain't give up, no!\nFue como Candela! (Yeah!) Fue como Candela! (Candela!)\nFue como Candela! (Yeah!) Fue como Candela!\n\n[Bridge]\nTell the big guy I'm coming through\nNeed the big bills, big butts big boobs\nAll of these girls is on my crew\nAll of this world is oh so new!\nShe bust it down on every song\nWanna keep going, baby, carry on\nHits outta here, I'm Barry Bonds\nSo Gone I Might Need A Carry On!\n\n[Outro]\nFue como candela\nFue como candela\nFue como candela\nFue como candela\n\n*Beat Change*\n\n[Uncharted]\n\n[Verse]\nAlive in the morning I wake and bake\nDrop the hook ann make em' take the bait\nOff the top, got atomic drops\nLike I'm Jake the Snake, no more takin' breaks\nCuz when I started, had a bigger heart and\nWent Uncharted you can call me Nathan Drake\nThe transformation that it made me make\nWhat a great escape, let me meditate\n(Woo!) Light up my J ya'll (yeah!) Flyin' prior to takeoff\nI thought I might take me a day off. I go higher like H.R\nInfrared on the Radar. I'm a take the shot, just say when\nI hit a block then get hella bars, turn the booth into the state pen\nTil' the crib look Amazin'\nBig enough to put a Maze in\nWit' 7 cars on the pavement\nAnd never makin' no payments\nDrinks on me at the River Vista\nSpinning dough like it's a pizza\nGettin' guap off a  pop feature\nThen I hit the block and just drop heaters\nNew homes, new whips, yuh!\nNew zones, new trips, yuh\nKnew me, know you didn't. No\nNew Phone, Who Dis? Woah\nBout to go places I never been\nBout to see things I would never think\nBout to live life I would never dream\nAll of these scenes that I never seen"}], "artist": "XV"}