{"songs": [{"year": "2018-05-04", "image": "https://images.genius.com/b6424d6ad1ab459f68bef7045b421240.1000x1000x1.jpg", "title": "Left Right", "album": "SIMI", "lyrics": "[Intro]\nHah, yeah\nDMac on the fuckin' track\nMmm, hah\n\n[Verse 1]\nSee how society makes us (makes us)\nWork us like a slave then they talk about pay cuts (pay cuts)\nYou gotta have a cape if you wanna come save us (word)\nThey cannot feel our pain 'cause them niggas they ain't us (they ain't us)\nThinkin' 'bout the days we was down bad and fucked up (fucked up)\nTryna make a play, tryna get our lil bucks up (our bucks up)\nNobody really fucked with a nigga (huh?)\nSee you gettin' money, try to fuck with a nigga (word)\nMan what's up with these niggas? (word)\nThey need to go to the pond if they lookin' for a duck, right? (yeah)\nYou had my son so you had to let me fuck right? (yeah, yeah yeah yeah yeah yeah)\nShit happened for a reason (reason)\nI dodge just like bob and weavin' (bob and weavin')\nMr. Telephone Man, man this shit boppin' season (boppin' season)\n\n[Chorus]\nBurn a nigga ass, I can't cook right (cook right)\nBefore you cross that street, you gotta look right, then a left right (right)\nI just hit this nigga with the left right (left right)\nNigga you a baby, 'fore you walk you gotta get your steps right (steps right)\nI don't like that bitch, I pushed her down the steps, right? (that's on my mama)\nGrape Street Crip, you know my flag is to the left, right? (crip, crip)\nYou talkin' 'bout some shootin', know they call me Steph, right? (swish)\nBeefin' with the block, must be on crystal meth, right? (huh?)\n\n[Verse 2]\nI don't really know, I just wanna know\nMy niggas bang the 8, call 'em Ocho, but not no Cinco\nI just hit five bitches in a row, hopped up like bingo (bingo)\nAll these bitches love my style, they love this Memphis lingo (mane)\nCruisin' in a limo, layin' back like it's limbo (yeah)\nIf I don't fuck with you (yeah), don't want you 'round, that shit simple (yeah yeah yeah)\n'Cause you see how they do a nigga (huh?)\nFuck with you 'cause it's beneficial (word)\nI can't love a ho (word), I let 'em blow me like some toilet tissue (word word word)\n\n[Chorus]\nBurn a nigga ass, I can't cook right (cook right)\nBefore you cross that street, you gotta look right, then a left right (right)\nI just hit this nigga with the left right (left right)\nNigga you a baby, 'fore you walk you gotta get your steps right (steps right)\nI don't like that bitch, I pushed her down the steps, right? (that's on my mama)\nGrape Street Crip, you know my flag is to the left, right? (crip, crip)\nYou talkin' 'bout some shootin', know they call me Steph, right? (swish)\nBeefin' with the block, must be on crystal meth, right? (huh?)"}], "artist": "BlocBoy JB"}