{"artist": "Playboi Carti", "songs": [{"album": null, "title": "Lie", "image": "https://images.genius.com/2464352e4c9d86516c4891b53ebc48a6.871x871x1.png", "lyrics": "[Intro]\n\nThis is a Dolan Beats production\n\n[Verse 1]\nBitches got tight when I got some ice\nMatter of fact, fuck, we ain't even tight\nLeft them in the dark, get yo' vision right\nFuckin' on his hoe, he wasn't hittin' right\nGrippin' on my shit, like, who I'm hittin' tonight?\nMargelia madman, baby, I'm the shit tonight\nCall up the man, tell him get the ticket right\n10 bands for Carti, baby, I ain't tryna lie\nI ain't ask for it, I was chosen right\nTwo doors on it, I ain't even try to drive\nI'm off the lean, I'm off the percs for real\nI'm off them drugs, I'm off them drugs for real\n\n[Chorus]\nI ain't even lie, I can't even drive\nI ain't even lie, I can't even drive\nI ain't even lie, I can't even drive\nI ain't even lie, I can't even drive\n\n[Verse 2]\nSee those girls inside, see these guns inside?\nBaby let's go ride, let's go ride or die\nLook me in my eye, you the shit tonight (Ok)\nLook me in my eye, you the shit tonight (Ok)\nEverything was on me\nEverything was on me\nPut everything on me\nShawty, shawty, you can come and lean on me\n\n[Chorus]\nI can't even lie\nI can't even drive, I can't even lie\nI can't even drive, I can't even drive\n\n[Secret Verse 3]\nBitches got tight when I got some ice\nNiggas got tight when I got some ice\nMatter of fact, fuck them niggas, we ain't even tight\nLeft that nigga in the dark, fix yo' vision right\nFuckin' on his bitch, he wasn't here right\nGrippin' on my shit, like, who the fuck I'm hittin' tonight?\nMargelia madman, baby, I'm the shit tonight\nCall the promoter get the ticket right\nTen bands for it, I'ma sit tonight\nI ain't ask for it, I was chosen right\nTwo doors on it, I ain't tryna drive\nTop off, open, see the girls inside\nSee the hoes inside\nSee the guns inside, baby, let's go ride\nLet's go ride or die, look me in my eye\nLook me in my eye, okay, baby, you the shit tonight\nWe gon' do this shit tonight, girl tonight\nLook me in my eye\nYou the shit tonight, tonight\nDo that shit tonight, okay\nLook me in my eye, do this shit tonight\n(Mumbling)\nOne more time", "year": "2017-11-29"}]}