{"songs": [{"year": "2016-03-24", "title": "Rock With You", "image": "https://images.genius.com/00616013651989ad3a4505647c485d68.640x640x1.jpg", "lyrics": "[Verse 1]\nFirst off, I'm a pimp\nAnd you know that\nSteady serving fools, young Novak\nMinding my biz, oh yeah\nSo many pictures I should have a shared Kodak, know that\nCare less about your girl with another guy\nEven more about your dude with another fool\nTryna throw it all down\nGet laid, get paid, yeah I'd do it all again, see you next time\nTend to yours, I'll tend to mine\nI don't care about yours or you're sharing mine\nIf your girl with a man, and you're with another girl, then I'd say it's your world, it's none of my business\n\n[Chorus]\nPlay it off girl\nI know your name\nDon't need anything to rock with you\nTake it off\nGo and misbehave\nDon't need anything to rock with you\nDon't need anything to rock with you, and you\n\n[Verse 2]\nStraight posting at the bar with a tall boy\nCome and get up in my face, start the wrong boy\nTalking 'bout last night when I wasn't in the city\nI was out in L.A. with two broads sitting pretty, yeah\nSpeaking of that, I'm dodging all the nonsense\nBuy your claims, your girl is gonna start shit\nIt's on the time to play the mediator\nCan't drop to the max, I'm a gladiator, gladiator\nSo before you make assumptions, jump in\nDo your research, I was busy with my consumption\nGirl got her fingers up in my face like what is this?\nI said, \"that's just none of my business.\"\n\n[Chorus]\nPlay it off girl\nI know your name\nDon't need anything to rock with you\n(I wanna rock with you)\nTake it off\nGo and misbehave\nDon't need anything to rock with you\nDon't need anything to rock with you, and you\n\n[Bridge]\nYeah, see how this all plays out? (plays out)\nIn the city with a love face down (oh yeah)\nI ain't looking for a ring like that\nJust a fling with a pretty little thing like that, ha\nCut the lies and the gossiping\nYou know you ain't gotta be a drama queen\nJust know that when I'm finished, that shit that shit's none of my business\n\n[Chorus]\nPlay it off girl\nI know your name\nDon't need anything to rock with you\nTake it off\nGo and misbehave\nDon't need anything to rock with you\nDon't need anything to rock with you, and you\nDon't need anything to rock with you\nDon't need anything to rock with you, and you\nDon't need anything to rock with you", "album": "The Long Way"}], "artist": "Sammy Adams"}