{"artist": "360", "songs": [{"album": "Please Be Seated 3", "year": "2016-02-22", "title": "Real Friends", "image": "https://images.genius.com/88c1e39a08ef59af4f7539446b1fc7a4.500x500x1.jpg", "lyrics": "[Verse]\nHave you ever not trusted yourself?\nOr wished that you were somebody else?\nLike you're barefoot running through hell?\nThere's nothing worse than a messy junkie with endless money\nEspecially one on an empty stomach that's getting hungry\nI seem good, but lately I've been better, trust me\nTears up on a steel frame and I'm getting rusty\nI'm from a good home, I'm knowing that my parents loved me\nBut it's like my dog's the only one who'll never judge me\nOne year clean, something that is hard to get\nI give it everything, I put my fucking heart in this\nYou wanna know the hardest bit I nearly can't admit?\n'Cause when I do I'm feeling like an narkie bitch\n'Cause when I'm seeing friends I used to party with\nI've had to cut ties 'cause I'm feeling like I can't resist\nWhen you get clean, it's not drugs you've parted with\nFriends and lifestyle are just as much a part of it\nSee I would love to catch up and have lunch\nBut when I see you, I just wanna rack up and that's fucked\nStop being angry and fucking mad\nAre you a loose end, because a true friend would understand\nNever force the progression of a soul\nGive me time, let me get it in control\nI'm doing well for someone that was never in control\nDoing well for someone that was never in control\nLet me get a hold on it and then we can evolve (Yeah)\nSee the devil on my shoulder's now embedded on my soul\nReal friends\n\n[Pre-Chorus]\nTell me you want the tickets when it's gametime\nEven to call your daughter on the FaceTime\nEven when we was young we used to make time\nNow we be way too fucked up to make time\n\n[Chorus]\nEver fucked with real friends\nI guess I get what I deserve, don't I?\nWord on the streets is they ain't heard from him\nI guess I get what I deserve, don't I?\nTalked down on my name, and throw dirt on him\nI guess I get what I deserve"}]}