{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/MV5BMTY0MDY3MjQxN15BMl5BanBnXkFtZTcwODQ2NzE1NA@@._V1._SY314_CR11,0,214,314_.jpg", "title": "Intelligence Meets Wisdom", "album": null, "year": "2015-06-28", "lyrics": "[Verse 1]\nOnce upon an element, a man named Intelligence questioned his own relevance\nWhile his new old friend Wisdom offered his benevolence\nYou could tell, It was evident, the two were a little hesitant\nBecause their respect and reverence for each other was obviously heaven sent\nThat's when Intelligence asked, well why do we hate?\nWisdoms rebuttal:\nWell why do we love?\nIntelligence wondered what will become of his fate\nWhile Wisdom just embraced each day just because\nNow Intelligence can prove how much he knows\nBut Wisdom shows how much he grows\nThough, Intelligence spends time searching for God\nWisdom sees that time, is merely a fraud\nOdd\nThey both chose while out on job, to put their pros, cons and pride aside\nWhy?\nBecause the power of rivals subsides if the powerful rivals died\nWisdom's crew was like, \"Ooh… Right, right!\"\nWhile Intelligence's entourage just sighed, \"Oh, my, my!\"\nSo is y'all 'bout it, 'bout it, or is you a ride or die\nBecause Wisdom knew only the true tried to be wise\nIntelligence replied, nigga you ain’t never lied!\nBut it was something about these guys, they will not ever sever ties\nAlone they could marvel but together they mesmerize\nMaterialized metomorphisis more opposites incorporated and attracted than they actually realized\nDifferences\nFor instance\nIntelligence was manmade, and Wisdom is a spirit\nIntelligence is loud, but the sound of Wisdom, must be silent to hear it\nIntelligence is witty and quick\nWhile Wisdom is peaceful and still\nIntelligence can be artificial\nWhen Wisdom is real\nDay and night, back and forth, they can debate turn for turn\nBut if you understand one without the other, further quandaries will forever burn\nBut for now this intelligent case is closed and the wise meeting of the minds is adjourned\nWhile the blind has been leading the blind with frivolous concerns, We find that the true third eye lies intertwined between two universes of no return\nInterned, these two terms will eternally be on good terms, in terms of the interim\nThe definitions have definitely and definitively been turned…\nIntelligence - the ability to learn\nWisdom - the ability to discern\nYour turn!"}], "artist": "Nick Cannon"}