{"songs": [{"title": "Flex", "album": "GetBackGang 2", "year": "2019-07-26", "image": "https://images.genius.com/ba69be12416de91a9038d42e6739d42b.728x728x1.jpg", "lyrics": "[Chorus]\nBack then a nigga ain't had nothin' (Nothin')\nWhen you hot, all them hoes want somethin'\nFlex (Flex, flex), get that check (Get that check)\nFlex (Flex, flex), might fuck up my TEC (Might fuck up my TEC)\nBack then a nigga ain't had nothin' (Nothin')\nWhen you hot, all them hoes want somethin'\nFlex (Flex, flex, flex, flex), get that check (Get that check)\nFlex (Flex), might fuck up that TEC (Might fuck up that TEC)\n\n[Verse]\nBack then a nigga ain't had none, boy, I come from nothin' (I come from nothin')\nHit a nigga in the head or the arm or the leg if he think we bluffin' (If he think we bluffin')\nDoubted me for the last time, well, lil' bitch, I'ma show you somethin' (I'ma show you somethin')\nI count about my long, no fake friends, no nothin' (No nothin')\nWhen the shit get tough, when the shit get rough, who gon' be there for you? (Who gon' be there for you?)\nWho gon' watch your back? I'm speakin' facts, who gon' be there for you? (Who gon' be there for you?)\nKill 'em, quick-fast in a hurry (In a hurry)\nDrop thirty on a nigga like Curry (Like Curry)\nIf you think I'm sweet, show no mercy (Show no mercy)\nHit a lick, I mighta been thirsty (Thirsty)\n'Cause, you know, back then a nigga ain't had nothin' (Nothin')\nBust some shells so we kept a nigga runnin' (Runnin')\nTurned nothin' to somethin' (To somethin')\nHit a nigga in the dice game for forty thou' like it ain't nothin'\n\n[Chorus]\nBack then a nigga ain't had nothin' (Nothin')\nWhen you hot, all them hoes want somethin'\nFlex (Flex, flex), get that check (Get that check)\nFlex (Flex, flex), might fuck up my TEC (Might fuck up my TEC)\nBack then a nigga ain't had nothin' (Nothin')\nWhen you hot, all them hoes want somethin'\nFlex (Flex, flex, flex, flex), get that check (Get that check)\nFlex (Flex), might fuck up that TEC (Might fuck up that TEC)"}], "artist": "Lil Reese"}