{"artist": "Cashisclay", "songs": [{"title": "Vs. Sly [8tel-Finale - JBB 2018]", "album": "JBB 2018", "year": "2018-07-15", "image": "https://images.genius.com/832dac58c268258ff8c9e3a798617b56.639x639x1.png", "lyrics": "[Intro]\n„Jetzt hör mir mal zu, du kleiner Huansohn. Also für eins muss ich mich bei dir an der Stelle hier mal bedanken, ne. Also wirklich, seit du dein Video am Hauptbahnhof gedreht hast und dat ja auch so ein bisschen viral gegangen ist, kein einziger Nafri mehr zu seh'n, weil da gibbet ja anscheinend nichts mehr zu vergewaltigen, was sich lohnt, ne. So, und jetzt viel Spaß mit der Runde, min Jung.“\n\n[Part 1]\nEy yo, SLY, komm mal runter von dei'm Höhenflug, du Schlampe\nNimm den Mund nicht zu voll, ich mein's wörtlich, wenn ich's sage\nDachte, als ich die Betonungen gehört hab', nur Blamage\nDie Nutte wird nicht aggressiv, die kriegt höchstens ihre Tage\nIch vermöbel' die Visage von der Fotze bis zum Traumaschaden\nUnd hab' anschließend nach wie vor nie eine Frau geschlagen\nHiernach wird der Haftrichter besucht\nWeil, was ich mit dir veranstalte, das richtet auch kein plastischer Chirurg, yeah\nDu strahlst mehr Testo aus als aggressive Rockerbanden\nSelbst das Pascha hat kein'n Job für maskuline Ostblockschlampen\nJetzt zerfickt der Leader, schreib mal lieber wieder Lieder\nBei dein'n Battleskills sieht man dich höchstens in der LIBA wieder\nMach dich nicht lächerlich, was für battlen, Bitch?\nDu spielst nicht raptechnisch, aber dafür optisch bei den Männern mit\nIch hab' fast schon Mitleid, tut so auszuseh'n nicht weh?\nTausch doch mit AyLien den Namen für die Authentizität\nDu Mars-Attacks-Statist, ist nicht kreativ das anzugreifen\nMir egal, ich könnte glatt auf deiner Stirn ein Album schreiben\nWag es nicht das anzuzweifeln\nDu könntest die Hälfte der Teilnehmer schlagen\nAber nicht im Battlen, sondern Schwanz vergleichen\n\n[Hook]\nHeute gibt es keinen Sieg für die Außenseiterin\nAuch wenn deine Freunde denken, dass ich frauenfeindlich bin\nYeah, fick diese Crackbitch\nIch hab' dich letztens auf zwei Promille in Köln geseh'n, du warst immer noch hässlich\nYeah, du willst ein Battle, ich will Kohle seh'n\nIch hab' nur was gegen Frau'n, die so ausseh'n, so ausseh'n\nDu denkst, du wirst mit Musik Großverdiener wie Kokaina\nAber nach dem Battle sieht die Nutte ihre Oma wieder\n\n[Part 2]\nIch schlage die Schlampe jetzt zielgerichtet ins Koma\nSLY, du Fotze, du und ich sind verschieden wie deine Oma\nEy, dein Nachruf auf Insta voll traurig und so\nDoch bei so 'ner Enkeltochter wär' ich auch lieber tot\nIch hab' SLY verarscht am Telefon, sie drohte mit 'ner Anzeige\nWenn ich davon Ausschnitte ins Video nehm' und angreife\nGlaubt mir, dass ich mich bei solchen Drohungen nur langweile\nUnd das ist er das „Wärm-up, Wärm-up“, das heißt Warm-up, du Flachpfeife\nSchon wieder 'ne Transe, die auf Rapper macht\nIch dachte, nach Kay hätten die Leute sowas erstmal satt\nPech gehabt, SLY, die Sensation bleibt aus\nDer Deutsche kommt in Russland weiter und schickt die Nutte zu ihrer Oma rauf\nIch bin nicht wie Richjer, aber du dafür ein bisschen wie ich\nWeil's bei uns beiden keine Frauen in den Videos gibt\nDu willst gefickt werden, wir sind hier nicht bei Wünsch dir was, du Schwein\nMit deinen Instafotos werden Sexsüchtige geheilt\n\n[Hook]\nHeute gibt es keinen Sieg für die Außenseiterin\nAuch wenn deine Freunde denken, dass ich frauenfeindlich bin\nYeah, fick diese Crackbitch\nIch hab' dich letztens auf zwei Promille in Köln geseh'n, du warst immer noch hässlich\nYeah, du willst ein Battle, ich will Kohle seh'n\nIch hab' nur was gegen Frau'n, die so ausseh'n, so ausseh'n\nDu denkst, du wirst mit Musik Großverdiener wie Kokaina\nAber nach dem Battle sieht die Nutte ihre Oma wieder\n\n[Interlude: Anruf]\n„Du musst doch jetzt als nächstes dann wahrscheinlich gegen den Cashisclay battlen oder?“\n„Ja, wahrscheinlich, wenn Julien nicht am Turnierplan was ändert, aber das glaube ich nicht.“\n„Meinst du, du hast da 'ne Chance?“\n„Ja, gut, ich werd' mal mein Bestes geben, aber ich mein', Cashis ist halt schon ein härterer Gegner als Richjer, sagen's wir mal so.“\n\n[Part 3]\nDas hier ist ein Battlerapturnier, kein Poetryslam\nAber Musikalität oder Flow ist dir fremd\nDie Betonungen fremdscham, denk dran\nDu sprichst mit dem Besten meiner City, daran wird sich nichts ändern\nOb mit Venom-Video oder Zeptah-Hook\nFür was auch immer du dieses mal wieder Schwänze lutschst\nHalt die Fresse, guck, es gibt für dich kein Weiterkommen\nFür dich ist so wie für jeden anderen hier gegen Cashis Schluss\nSie sagen, die Quali war top\nDich ich bringe so wie immer nach dem Achtel nur Schrott\nDeine Runde ist wie wenn man sich mit Handschuhen boxt\nAber meine Runde ist wie 'ne Gun an dei'm Kopf (boom, boom, boom, boom)\nIch zerficke alle deine Wannabe-Passagen mit 'nem Flow, der keinen Zweifel daran lässt, wer in dem Rapturnier der Sieger ist\nUnd das gilt nicht für dich, sondern für jeden der behauptet, er besiegt mich\nFick auf alle Teilnehmer, guck, ich feature nicht und habe mit dem Rest nix zu tun\nBattlen heißt Blut fließt, dreckige Moves\nIch disse mit Familie und baller' wieder Doubletimer back to the roots\nMir egal, wer was erzählt\nIch bin bereit jedem zu zeigen, dass es anders geht\nDu featurest jeden Schwanz für eine Hand voll Fame\nAber ich zerficke jeden, Ein-Mann-Armee\n\n[Bridge]\nEs tut mir fast schon leid dich zu hassen\nUnd so oberflächlich weiterzumachen\nÜber sowas soll man eigentlich nicht lachen\nBah, aber SLY, was ist das denn?\n\n[Hook 2]\nHeute gibt es keinen Sieg für die Außenseiterin\nAuch wenn deine Freunde denken, dass ich frauenfeindlich bin\nYeah, check, Runde zwei, JBB Part vier\nJeder Zweite hat anscheinend ein Problem mit mir\nAlle Teilnehmer Pisser, keine Gegner hier\nIch soll bitte was, was, gegen wen verlier'n?\nDu willst ein Battle, ich will Kohle seh'n\nIch hab' nur was gegen Frau'n, die so ausseh'n, so ausseh'n\nJeder, der will, Mann, ich suche den Streit aus Prinzip\nUnd ich werde dieses Battle nicht verlier'n\nWeil ich flow' wie ein Gott und spitte wie auf Speed\nIch bin nicht arrogant, nur der beste Rapper im Turnier, was?"}]}