{"songs": [{"album": "Fuck the Money", "image": "https://images.genius.com/23223285f9cac119c15336b3e08cd741.498x498x1.jpg", "year": null, "title": "Gratitude", "lyrics": "[Intro: Randy Pausch]\nAnd you will need to find your passion. Many of you have already done it, many of you will later, many of you may take to your thirties or forties, but don't give up on finding it. Right, because then all you are doing is waiting for the reaper. Find your passion and follow it. And if there is anything I have learned in my life, you will not find that passion in things. And you will not find that passion in money. Because the more things and the more money you have, the more you will just look around and use that as the metric — and there will always be someone with more\n\n[Verse]\nWho I be is the super MC, run up on a group of MCs\nRappin' all rudimentary, like stupid MD\nHead of Valley girls full of jealousy\nBut I see through the envy\nI be shootin' for the stars, never shootin' the breeze\nWhen you chase what you want, you run past what you need\nHear the call of the Lord, start fallin' to your knees\nAnd the families be immortal like the dew on the leaves\nYup, every rhyme got a reason\nYou need me like your mama need Jesus\nMurder rap from the words that I rap\nTreatin' rappers like celebrity news, got 'em leakin'\nMalcolm said I may complain so the deep shit\nIs spoon fed to you with the flow if you're peepin'\nSo wavy with the flow, got 'em seasick\nAcquirin' miles, wanna know what's the secret\nThey all devil worship except the reverend\nYou keep makin' that excuse but remember this\nYou feel better 'bout your own failure\nWhen you think success is based on Illuminati membership\nFuck the money, that's my new fuckin' attitude\nThis the Earth, wind and fire, this gratitude\nWhether in paradise or ghetto avenues\nI stay inspired by my longitude and latitude\nRecordin' in the rainforest in Puerto Rico\nClimbin' up the Dunn's River Falls in Ocho Rios\nJoey made this beat in the Trump Tower\nFire like gunpowder, finna light it up cause the blunt's sour\nRevolutionary People's Party\nEvolutionary, we so godly\nStill at the strip club with Nico\nWhen he pull his hair back, we call him Nico Suave\nWe the people's champ like my top of the year tour\nFrom K Valentine to jessica Care moore\nNico Is to fuckin' with Cory Mo\nGQ, Rapsody to Hi-Lo\nThis the good ship [?], Jamla the damn squad\nColors of the color to toast in the dancehall\nThey call me the solution to problem I can't solve\nSo get off that bullshit and get on your damn job\nGet on your job, nigga\nGet on your job, nigga\nGet on your job, nigga\nCome on\nWe be workin' damn hard\nWe pullin' the damn cards like you're puttin' your hands up\nWe're stand up individuals\nFuck respectability, we ain't pullin' our pants up\nWe plugged in the lamppost, never duckin' no damn folks\nWe ain't bucking  like Sambo's, to fuck with our damn clothes\nHoes fascinated by the fashion statement\nYet you masqueradin' as a rap crusader\nI know you a hater, player\nI'm concentrated on the facts and data\nThat-a-way I've been my favorite\n'Til there's no debatin' who's the greatest rapper\nAlways ready for the battle, no fear factor\nRIP PH, we shed a tear after hearin' that we lost a gladiator\nWhat a real rapper\nSpittin' bars in the cypher in the hereafter\nI'm in artist mode\nWriter then before, I'm a writer at the core\nBut let me get it off on stage and I prove\nThat I'm tighter than a moor, invite him to the war\nThe truth about trust is\nWe motivated by the rewards, no one's above this\nSo by that logic we're monsters in the makin'\nAnd seekin' justice is really self-preservation and\nYou don't trust what you can't see?\nYou don't trust what you can't touch?\nThen how do you explain love?\nYou don't trust what you can't see?\nYou don't trust what you can't touch?\nThen how do you explain love?\n\n[Outro]\n\nQuem quis me ferir\nFicou assim\nNão aprendeu perdoar (...)"}], "artist": "Talib Kweli"}