{"artist": "YG", "songs": [{"image": "https://images.genius.com/59064082da48f1c48bf96d62c598b6c3.1000x1000x1.jpg", "year": "2018-08-03", "album": "STAY DANGEROUS", "lyrics": "[Verse 1]\nAs I look in the mirror, takin' this fucking selfie\nI'm tired of helpin' niggas, who gonna help me?\nIf I ain't bringin' home that bag, how we gonna eat?\nWhat type of species is that? A fucking leech\nI need help myself, I gotta call myself\nCan't lean on nobody else, I gotta fall on myself\nSelf, self, self, self, self, self\nThis all I got but all I hear is help (help)\nSince a youngin' I been getting used to sex, money, and guns\nBitches wanna fuck who they want because I been number one\nUse me for the dick because they love fuckin' a blood\nHer ex was a Crip she fuckin' me just because\nTequila I drink, the deeper I think, 'bout people I meet\nSlow down on the drink, bitch I'm from the street\nYou on the outside lookin' in, tell me what you see (shh)\nYou look on and rich as fuck to me\n\n[Chorus]\nNow it's deeper than rap, deeper than rap, deeper than rap\nThis shit get deeper than rap, deeper than rap, deeper than rap (ohh)\nThis shit be deeper than rap, deeper than rap, deeper than rap (ohh)\nThis shit get deeper than rap, deeper than rap, deeper than rap\nThis shit get deep\n\n[Verse 2]\nAyy, what you know about the homie fucking on the homie bitch\nAnd we all from the same clique, that ain't no homie shit\nAyy but I'm a real homie to the homies (to the homies)\nI'm passin' out choppers and big .40's\nYou say you a street nigga, you gotta be on some street shit\n'Cause soon as you stop, niggas gonna try to sneak diss\nBut fuck that, that's why I keep the heat tucked by the seat bitch\nTo my last day, I'm forever on some Tree shit\nGang bang politics, turn me into a politician\nThe way I move boss shit now, niggas think I'm actin' different\nCome to me you better come correct\nDon't come to me mixin' up stories like you DJ Skrillex\nI'm trippin', I got anxiety, mental problems\nI don't like that rap nigga, I told the homies that rob him\nInstead of Box Stanley, fuck it, I don't give a fuck\nYou judgin' me on one verse, in real life I'm sicker, bruh\n\n[Chorus]\nNow it's deeper than rap, deeper than rap, deeper than rap\nThis shit get deeper than rap, deeper than rap, deeper than rap (ohh)\nThis shit be deeper than rap, deeper than rap, deeper than rap (ohh)\nThis shit get deeper than rap, deeper than rap, deeper than rap\nThis shit get deep\n\n[Verse 3]\nI got a daughter now\nI'm, barely around\nAhh, that shit fuck with me\nShe gonna understand 'cause I'm gettin' money\nDid I choose this life? Shit, I don't know\nBut fuck it, it's life now, and it's just how it goes\nPut her in a good school, make sure she in honor roll\nWhat you gonna do when you on tour?\nBring her to the safest shows\nI'm dangerous, I know I live by the gang code\nI'm dangerous, I know I'm in love with stank hoes\nWhen I say stank hoes, I don't mean stank\nI mean the ones that fuck the first date, dick all in they face\nTold my granny I don't know if I'm really Christian, I really did\nJust don't know whose story to believe, the Muslims, yours, or his\nThey told me to talk to a therapist and I did\nBut that don't change the crazy shit I do, did, and lived\n\n[Chorus]\nNow it's deeper than rap, deeper than rap, deeper than rap\nThis shit get deeper than rap, deeper than rap, deeper than rap (ohh)\nThis shit be deeper than rap, deeper than rap, deeper than rap (ohh)\nThis shit get deeper than rap, deeper than rap, deeper than rap\nThis shit get deep", "title": "DEEPER THAN RAP"}]}