{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\nGet up and get with it\nThe beat at hand has been perfectly fitted\nFor the occasion, Kane's invasion\nI'll invade, get paid in full\nInstead of talking all that bull\nI'll just invent and present an original\nIdealistic concept that'll keep you on step\n(Ain't it funky?) Yep\n\n[Verse 2]\nJust turn up the record player and pay attention\nTo the words I'm about to mention\nI'm like a scientist this is my invention\nTo climb, my rhyme will be inching and inching\nTo the very tip top with my style of Hip Hop\nAny rapper in my path will only get dropped\nSo, don't even try to go\nMy rhymes are impact with a Tyson blow\nBut I'm like Shaft, so cool that you feel a draught\nOr like Superfly, I live in Do Or Die\nI'll give your girl the kiss of death just like a vampire\nStomp out emcees just like a campfire\nThen after disposing of everyone else\nBig Daddy Kane'll go for self\nAs I announce rhymes to make the party bounce\nAnd when I'm finished, pass me the 40 ounce\nBut before I grab my brew\nThis is something funky from me to you, hit it\n\n[Verse 3]\nAh, let's see what's next on the menu\nAnother section to continue and then you\nBecome captivated, fascinated, elevated\nYou grade it high-graded because the Kane made it\nImperial material, done complete\nThat's the reason why none of y'all can compete\nSo come one, come two, come a hundred or a thousand\nIt really doesn't matter, cause I'mma be housing\nMany, plenty, any\nNo I don't despise or resent them\nIt's just really momentum\nFor me to grab the mic and get into my own thing\nControl a whole crowd like Martin Luther King\nMake the ladies say (Ow!) and fellas say (Ho!)\nIn harmony they all'll say (Go! Go! Go!)\nBegging for more, an encore\nYou'll have to raise your arms even if you ain't sure\nYou never know how I'm gonna kick it\nI may get live, I may get wild, I may get ill or I may just chill\nUntil the time comes forth\nFor me to grab the mic and just cold go off\nAnd get funky\n\n[Verse 4]\nNow this message goes to whom it may concern\nPreferably speaking, emcees that need to learn\nSo I'll enlighten you, knowledge and brighten you\nPay close attention so that you can get it right and do\nProper procedures needed to be done\nKnow what I'm saying, my son?\nCause if I have to release a masterpiece\nIf you ain't with it, may you rest in peace\nTo come off hard is the moral of the story\nMe coming off? Mandatory\nSo when it's time to kick funky four in a fair\nLike the Jackson 5, I'll be there\nWith something funky", "image": "https://s3.amazonaws.com/rapgenius/1321503841_BDK%20fade.jpg", "year": null, "title": "Somethin’ Funky", "album": null}]}