{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C Pt. 3", "title": "My Angel", "image": "https://images.genius.com/65ddd77ff59df02b544ca7aecbd742a1.500x442x1.jpg", "lyrics": "Oh, baby I'm talking to you\nU-u-uh, yeah\nI would buy anything you sell, follow you to hell\nYou got me actin' over in myself\nDon't drop me, cause I'm in the palm of your hand\nMy boys laughed at me, I don't even care\nHow may it sound\nI'm just being real, well\nI'ma speak from the heart\nI'ma be sincere\nYou seem to be the type I could love for life\nI'm tryna found out for myself\nSee if I'm right baby\nYou're killin em close\nYou'd be dressing your ass off\nHair and your nails looking fresh from salon\nYou ain't got to be on TV or magazines\nFrom my POV (point of view), you're a star to me\nCan I, may I get your autograph\nOr perhaps you could put your number under your name\nAnd give the young man a chance to prove you\nWorth a young woman such as yourself\nIf I'm deserved it?\n\nOh, girl\nAren't you the baby I can't get enough of?\nYou my angel, yeah\nThug angel!\nOh girl, oh\nI can't get enough of you\nCome here baby (I need you), yeah\nThug angel!\n\nThere goes my baby, my lady, my heart beat\nShe the blur circulating\nDo my thing, she the torch in my brain\nIt go lavish trap for so long to obtain\n'Cause yo dope, she mine\nIf I want her kit, got to treat her everyday as if\nWe just met, and she treat me the same\nSmile on her face when I walk\nInside the room, nothing else matters\nEveryday silouhettes, the only living colors\nIs me and my bitch\nCome here, give me kiss and your real hug too\nThey jealous, they tell us to get a room\nBut everyways I'm loveless, and I swear\nWe could make love right here\nGet my soft candy, I unwrap you\nAnd then pop it in, the flavour everlasting\n\nOh, girl\nAren't you the baby I can't get enough of?\nYou my angel, yeah\nThug angel!\nOh girl, oh\nCome here\nI can't get enough of you\nCome here baby (I need you), yeah\nThug angel!\n\nMy baby like a simple bass, to give her happiness\nShe not into all of that, she ain't into all of this\nI think we found the rest\nAnd growing all together is in our future\nLove chow, waw, orgy, gorgeous\nFlawless\nShe's all that I'm wanting when I'm boring\nTo my thugs, when we hang out in the clubs\nCause I turned down all thet upper brothers\nBut, to her I'm the best thing\nSince sex is been here\nShe cry when I'm in it, 'cause\nIt feels so good, like ball beauty\nI doubt that you ever found another like mine\nAnd I'll never ours\nSo if we split, then we both had a loss\nYour my soft candy , I unwrap you\nAnd then pop it in, the flavour long lasting\n\nOh, girl\nAren't you the baby I can't get enough of?\nYou my angel, yeah\nThug angel!\nOh girl, oh\nCome here\nI can't get enough of you\nCome here baby (I need you), yeah\nThug angel!", "year": "2012-07-03"}]}