{"songs": [{"year": "2015-08-12", "album": null, "image": "https://images.genius.com/3c3672abff2c3301c36f7c2e56d58683.500x500x1.jpg", "title": "Feels", "lyrics": "[Intro]\n\nEh. Lord. Knowledge. Nigga. Eh. Stress. Stress\n\n[Hook]\n\nI'm working hard\nI'm sacrificing my life, I'm sacrificing my mind\nI'm sacrificing my sanity but, most importantly, I'm sacrificing my time\nBoy, I feel fine. I feel like I am a king\nHonestly, I can't complain\nEven with faith that's the size of a grain and some salt I will still move a mountain and do what I want\n\n\nI assault the beat with my rhyme, my rhyme\nYou would kinda feel me one time, one time\nIf I gave you something realer would you comprehend the feeling and emotion that I put in my line, my line\n\nI assault the beat with my rhyme, my rhyme\nYou would kinda feel me one time, one time\nIf I gave you something realer would you comprehend the feeling and emotion that I put in my line, my line\n\n[Verse 1: K.A.A.N]\nI'm a catastrophic and catatonic as I degenerate\nI alleviate for the leniency of the listener\nMisinterpreted my cadence for continuity, I engineer with ingenuity\nMy flow should really supersede the sea I seen with promiscuity\nA positive solution for pollution of the purity\nI personally purge a verse, immerse the words\nI learn the work, assert the search, a SERP, a nurse, I suffer curse, it hurts to heave or have a hearse\nI'm taking what I wanted and I bet I do, you never knew\nI'm useless n' a necrophiliac the way I kill a fuck, a trick\nA hypochondriac, I stay away from people, though I'm isolated, but I like it to do love with the craft\nI created different realities\nAll that's on my head is the sanity\nI'm very terrified of living by myself and the struggle seems to pursue me\nSo I'm peeking around the corner\nI'm in the corridor of life\nThe definition of an artist that was falling for the light\nI'm insecure and lacking confidence\nI can't put up a fight\nI mean I must of missed the opportunity, constantly lost\nAnd extension of my aggression was never meant to affect my sense\nThis stupid lecture is the lessons that I have learned\nAs they living inside the legend of my alleged hypotheses, the pharoahcies\nI put the hieroglyphic on the wall n' when I wrote it I made sure that it was legible for you, so my legacy was the truth, GODDAM\n\n[Hook]\n\nI'm sacrificing my life, I'm sacrificing my mind\nI'm sacrificing my sanity but, most importantly, I'm sacrificing my time\nBoy, I feel fine. I feel like I am a king\nHonestly, I can't complain\nEven with faith that's the size of a grain and some salt I could still move a mountain and do what I want\n\nI assault the beat with my rhyme, my rhyme\nYou would kinda feel me one time, one time\nIf I gave you something realer would you comprehend the feeling and emotion that I put in my line, my line\nI assault the beat with my rhyme, my rhyme\nYou would kinda feel me one time, one time\nIf I gave you something realer would you comprehend the feeling and emotion that I put in my line\n\nI wanna do a lot of drugs, and I just wanna do a lot of drugs\nThat I feel like I can't take no more, no more\nI'm incapable of feeling any love\nI've been living at the bottom n' I do not give a fuck\n\nI wanna do a lot of drugs, and I just wanna do a lot of drugs\nThat I feel like I can't take no more, no more\nI'm incapable of feeling any love\nI've been living at the bottom n' I do not give a fuck\nI wanna do a lot of drugs\n\n[Verse 2: K.A.A.N]\n\nHit the page with the passion that I'm possessing\nThe peasant prints with depressing\nI'm pessimistic but very connected to positivity\nIncidentally, immaculate, maximize all my efforts\nAll focus with no procrastination\nAmazing I'm lacing soliloquies with the formula\nFinally feeling better, not feeding you negativity\nDetrimental assumption, I summon some of the power\nAnd sanction the serendipity, pay attention when listening, The summit I'm envisioning is beautiful and, most importantly, I'm porously giving you knowledge\nThe polish for a deposit, possible fan of fortune, a fortune it wouldn't, wasn't\nAnd I'm working to no avail n' it tells a tale of truant that fell in love with the music\nI'm usually aggressive to make sure I get my point across, I hope I didn't waste all my time aside a fantasy\nConsider me, your losing my reality's delusional\nLORD\n\n[Hook]\n\nI'm sacrificing my life, I'm sacrificing my mind\nI'm sacrificing my sanity but, most importantly, I'm sacrificing my time\nBoy, I feel fine. I feel like I am a king\nHonestly, I can't complain\nEven with faith that's the size of a grain and some salt I could still move a mountain and do what I want\n\nI assault the beat with my rhyme, my rhyme\nYou will try to feel me one time, one time\nIf I gave you something realer would you comprehend the feeling and emotion that I put in my line, my line\nI assault the beat with my rhyme, my rhyme\nYou will try to feel me one time, one time\nIf I gave you something realer would you comprehend the feeling and emotion that I put in my line\n\nI wanna do a lot of drugs, and I just wanna do a lot of drugs\nThat I feel like I can't take no more, no more\nI'm incapable of feeling any love\nI've been living at the bottom n' I do not give a fuck\n\nI wanna do a lot of drugs, and I just wanna do a lot of drugs\nThat I feel like I can't take no more, no more\nI'm incapable of feeling any love\nI've been living at the bottom n' I do not give a fuck\nI wanna do a lot of drugs\nFuck\n\nThis shit is stress. A lot of fucking stress. A lot of time on this shit. And a whole lot of stress. That's it. God bless. Bitch"}], "artist": "K.A.A.N."}