{"artist": "Angel Haze", "songs": [{"title": "17, Spaceship", "image": "https://images.genius.com/5be152015519be507a6e26d1760ae9fd.405x405x1.jpg", "album": null, "lyrics": "Uh and then these bitches thought they had me\nI’m already It and you ain’t even have to tag me\nShit, and its depressing cause’ my swag mean\nYou a bum and I be dressing like a drag queen\nGet it? you know a dress? a drag queen\nAnd my chain got more cuts then a bad seam\nMy nigga nice, me and him be like a tag team\nPlus we keep it jumping til its squeaking like a bad spring\nAngel fucking Haze tell them niggas check they casting\nJolie bitches no I ain’t about the acting\nI’m above the line numerating like a fraction\nBut the whole game is what I’m steadily impacting\nAnd, I keep it realer then the rest of you\nSo when I’m introduced I be like hello I’m the best to you\nAnd I am the number that is left to two\nI can’t wait no longer tell them bitches this is overdue\n\nI was taught to want it and I did (and I did did)\nNow I’m steady stacking fucking chips (getting dip dip)\nAll these other loose leaf bitches getting ripped (ripped)\nI am running every body til’ they quit cause\nI was taught to want it and I did (and I did did)\nNow I’m steady stacking fucking chips (getting dip dip)\nAll these other loose leaf bitches getting ripped (ripped)\nI am running every fucking body til’ they quit, (quit)\n\nNo one on the corner got swagger like us\nAngel Haze Flyer then the magic school bus\nTell Ms. fickle I said wassup?\nTell my niggas I said they up\nI don’t be tripping not giving a fuck\nI’m putting you down and living it up\nBut angel fucking haze be the name don’t forget it ho\nI think I’m insane, I’m deranged, I am difficult, They won’t let me loose like I was chained to a fence befo’ and If they say I ain’t good Then they lame they just cynical\nEverybody critics tho\nBoy I got that bender flow\nPinned up paper you could tell them I’m the cynafold, bitch\nPlease just do not copy my penmen ship\nAnd I stay in first you would swear that I invented it\nAnd they sell me vintage shit\nYo flow like a sinking ship\nListen to the hook my money stacking like a pringle chip\nDolla’ bill swag boy I’m always on my single shit\nYours glaucoma, blurry, you can’t see me bitch\n\nI was taught to want it and I did (and I did did)\nNow I’m steady stacking fucking chips (getting dip dip)\nAll these other loose leaf bitches getting ripped (ripped)\nI am running every fucking body til’ they quit\nI was taught to want it and I did (and I did did)\nNow I’m steady stacking fucking chips (getting dip dip)\nAll these other loose leaf bitches getting ripped (ripped)\nI am running every fucking body til' they quit (quit)", "year": null}]}