{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/9fac28e630adcddbc99a0a31174dd1cb.600x600x1.jpg", "title": "Mexican Border", "year": "1997-07-01", "album": "When HELL.A. Freezes Over", "lyrics": "[Intro Dialogue: Kid Frost]\nYeah.......Ruthless-Relativity\n497 Somebody got shot\n\n[Verse One: Kid Frost]\nWhen I was a kid no one gave a fuck about me\nHad to get my shit cause my parents use to doubt me\nGot my first job working for the man\nWho picked me off the corner, see I got my first grand\nAnd now I'm straight banking and paying all the bills\nMy mama said \"Who the fuck did you have to kill?\"\nIt ain't even like that, I'm slick as a Fox\nI keep my gat hidden in Nike shoe box\nUnderneath my bed the cash kept flowing\nI gotta make sure my neighborhood keeps snowing\nMy daddy use to say that \"I was no good\"\nBut If I didn't do it then somebody else would\nAnd so I sell it by the pound and even provide the key\nIf somebody's gotta pay then It's gotta to be me\nSo when I hed south muthafucka' cause I owe a\nPayment that came in from Sinaloa\n(Now I'm...)\n\n[Chorus: Kid Frost]\nI'm headdin' down to the Mexican Border\nHeading down to the Mexican Border\nHeading down to the Mexican Border\nI'm headin' down, headin' down\nHeadin' down to the Mexican Border\nHeadin' down to the Mexican Border\nHeadin' down to the Mexican Border\nI'm heading down to the Mexican Border\n\n[Verse Two: Kid Frost]\nI've got the good shit that couldn't be bought\nI'm rollin' up a five with a truck full of funk\nMy Home is on the corner like tricks in a hat\n32 pounds it's like bricks in the back\nI'm watchin' my speed limit let the chevrolet slide\nGotta keep it cool rolling through Ocean Side\nThen I see this pig rolling up on my ass\nI let up on the gas, I was going kinda fast\nNow I see the red light about to get beat\nMan, I felt like my nut sack sankin' to the seat\nI gave her my I.D plus my registration\nAnd I gave her the place to my got damn station\nAnd give me the keys so I can open up the trunk\nMan fuck that shit, now it's one dead punk\n(hahaha)\n\n(Police=P)(Kid Frost=K)\n(P)Hey beaner you wanna step\n(K: What?) out the fucking car?\n(K)Man,Fuck you...haha\n(P)No.No!\n(K: Yeah! That's right!)\n\n[Chorus]\n\n[Man]\nHe's gotta reputation\nHe's got a young bride\nHe's going to leave this town wishing he was wive\nOr of ever even been born\n\n[Verse Three: Kid Frost]\nI'm a mean muthafucka' and I want it\nIf I see something I don't got then I want it\nAnd so I hide by the bush by the stop light\nA yo some my say that it's not right\nBut What am I to do?\nGet a job homie, check it\nYou got 6 felenies on your record\nMan, you think pack tails ever gonna wan't me?\nThe tatoos on my arm are going to haunt me\nI'm loading up my click in my (????????)\nAnd some poor fulls about to get jacked\nI'm waiting for the right one, creeping through the white one\nLooking for the tools and that stupid it's street dumb\nAnd then I see the little Rob looking reluctant\nI put the gun on his head and now I gotta cut him\nI went to pick up some clothes from my homeboy's house\nI hit a five on a state five going South and now I'm...\n\n[Chorus]"}]}