{"artist": "Watsky", "songs": [{"year": "2011-08-01", "lyrics": "[Hook: Watsky]\nI got a new kind sexy\nI'm working on a recipe for rich\nAnd exotic combinations of some fresh kinds of sexy\nA new kind of sexy\n\n[Verse 1: Watsky]\nMy face is like the California government\nIn terms of how it tends to budget what it's covered in\nHair follicles are public school doors\nEvery day I open up a new pore\nAnd close two more\nBut it's improper now to comment on what's risen\nBecause pimples pop up commoner than prisons\nIt's all blackheads-- no justice now\nBut they get overcrowded and I bust em out\nI'm like Pop! Pop! motherfucker, I'm a bad man\nAnd some day my skin'll crack like the Badlands\nLike my dad's is\nBut if that's all, I don't give a rat's balls\nI'll wear them like they're badges\nDamn a boyscout\nThey're manscout patches\nBecause I'm endowed, and how! Dammit\nAnd I know my body makes you want to hang out bad\nThe way my skin is cleaner than a Shamwow ad\nAnd someday you'll see my stubble from the Hubble\nOn my mama on the double I'mma look like Barney Rubble\n\n[Verse 2: Intuition]\nYo, I'm something like a Harry and the Henderson's\nNotice every time my knuckles be married to the pen again\nCause follicles be flying out my wide pores\nDouble standard cause I love my body hair but mind yours, girl\nI'm grizzly-esque, you bet he thinks the Yetis wonder \"Is he blessed?\"\nMy shoulder hair sheen like a solar flare\nI'm a polar bear seeking out a bowl of Nair\nWas he fuzzy from his childhood or early days?\nEvery time I cook I guzzle up a dozen curly strays (yucky)\nMy tweezers stay plucking\nYour girly gets to floss her teeth every time she's, well\nKissing on my lower regions\nThe reason that I keep hair's cause it's good for colder seasons\nBut in the summer time I'm the asshole\nSun bathing at the beach, belly like an afro\nI got a plan laid for my next bland date\nTell the boring breezy wait I forgot to manscape\n\n[Hook 2: Watsky]\nBut for now\nI got a new kind sexy\nI'm working on a theory of a new\nAnd experimental blend of different rare kinds of sexy\nA new kind of sexy\n\n[Verse 3: Dumbfounded]\nI got a couple regrettable tattoos\nBut you can't see them when I wear a black suit\nGot drunk off of Jagers out in Vegas last June\nAnd them water parks kids yell \"Look at that douche\"\nYou know saying 'if looks could kill'?\nWell my style is harmless, I shop at GoodWill\nEnd of hipster, swap me hood feel\nFour strip Adidas but that shit look real\nCall me a fashionista, skinny dude\nGive me food, cash or VISA\nA freeloader who reeks of weed odor\nTrying to get the freaks to scream like Ricola\nOne chick for me and one chick for Watsky\nHe love them older women that be screaming out \"Yatzy!\"\nTopsy-turfy, I'm not so pervy\nCompared to Intuition, well like them girlies\nWe like them brown, Puerto Rican, or Haitian\nA new kind of sexy is sweeping the nation\n\n[Verse 4: Watsky]\nI'm impatient but\nYesterday I bought a pullup bar\nI made plans to go jog down the boulevard\nI changed my culinary choices from full of starch\nTo full of shit\nIt's a total farce\nI haven't run a lap in years\nBut I'll crack a beer\nAnd run the poker table like a fucking racketeer\nBoom shakalack-fuck\nLet's have a potluck\nI got a hot buck burning a hole in my pocket\nSo let's hit the tac-truck\nJock's suck\nJust throw everything we got in the wok\nAnd let's grub till it looks like we're knocked up\n\n[Hook]\n\nJT brought sexy back, but it's a cheap one\nSo I brought that sexy back for a refund\nA new sexy's begun", "image": "https://images.genius.com/c29f84b2362a2e43218c9c9f8eb13126.500x500x1.jpg", "album": "A New Kind of Sexy", "title": "A New Kind of Sexy"}]}