{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/26672344f4e3fd9fde5f37a6b25b7dd8.1000x563x1.jpg", "year": "2019-01-31", "album": null, "lyrics": "[Into]\nCatfish Billy!\nMWA Bitch!\nLow-fashion slum\nMr. Don Corleone!\n\n[Verse]\nOne drop or a knot from this boss\nYou might get rocked with the fist or shot what you stuck in the cross\nHairs of a semi-au-to through your nach-o\nSee I gave a fuck once, now I do not though\nHello, hello, I, lit up like a yellow light\nLike a young Jesco White, on a mellow-yellow high\nChip a tooth when that pebble flies, back at that Chevy wheel\nSeen the world through the Devil's eyes, he dared me to make a deal\nI decline, king of mine, that's a waste of time\nGive me a break, spit on the snake, let 'em taste the lines\nCowboy boots scaled like a plate of dimes\nBlack suede pressed dress to create a grime\nYou let your fangs hang, haters can't do a dang thang\nBut complain, comment and shame, claiming to gang-bang\nThat same bitch that you double-tapping to bang came\nTo my show like Su-Sussudio and show me brain games\nSee visionaries ain't got no problem with execution\nI just wake up like a prophet and hop up and fucking do it\nNo logical explanation on how I drop my music\nI just find a socket, plug it in pocket and lock into it\nOh, what a wonderful feeling\nGotta take a minute and do some breathing\nAin't take a day off work since I went and took Cleveland, looking for a reason\nLooking for a tie, looking for a suit\nThat Rock and Roll Hall-of-Fame is due\nOverdue, but the road is loosie\nWhen you invade it's no-one's clue\nNo one knows, where it goes\nWhere you've been or what to do\nBut that's me in a nutshell bro\nGoing nuts, deja-vu\nOh what a dream, row your boats\nSow your oats, all with the beans\nAin't no gas, kid lets rock, buy with the bot, not with the lean\nIn my coat when I fucking pop, like a mushroom in the morning gleam\nAfter a rain, in the spring, Michael Wayne, yeah-that's me\nGot it locked, that is key\nGot it hot in the C-\nO-U-N-T-R-Y, Catfish in your sore eyes\nIf you want that four-five, come on in the doors-wide\nSo deep that said your-tribe, welcome to the north side\nLook up in the back, that Heisenberg hat, pork pie\nStick you to that Get Buck, Three-6  is our war cry\nKids are playing Fortnite, I was playing short-sight\nDidn't see tomorrow, I just wanted one more bite\nSo I started stealing, chopping parts under the porch light\nI just wanted better than what Mamma could afford, why?\nCause I am a son of a bitch! Hard as you ever saw\nShut up and  duck or get hit, with this here pepper y'all\nHuddle-up with your fucked clique, and hit some methanol\nSuck a dick, sucka suck shit, all through an effin' straw\nNaw he didn't-oh, yes the fuck I did!\nNow take these words, stay woke, and tattoo both eye lids\nY'all bitches sleeping on me? I need my own Hilton\nI come with cots for you bots, go take a nap in the den\nWhile I master a plan with the mastering Mathers again\nSlum-Shady, I'm plumb-crazy and laughing again\nBut when that trash in the atmosphere like a ravenous wind\nWhen I pass in that black Cadillac, with Travis and em'\nYeah, and its so much fun going at it again\nI just might need to sing a bit, go get some practice and then\nSo let me clear my throat, let me see if I hear the notes\nI hear the notes, now look in your black mirror and strike a pose\n\n[Outro]\nAin't it good to be famous?\nEverybody knows your name\nBut you can't walk around here shameless\n90% of y'all so lame\n\nTrunk Muzik 3...", "title": "Jesco White (Freestyle)"}]}