{"songs": [{"year": "2016-12-23", "image": "https://images.genius.com/7709e3a794225475c19cbd280b83e12a.571x571x1.jpg", "title": "Der Koenichstheyn", "album": null, "lyrics": "Yeah! Yeah, ah!\n\n[Part 1: Kollegah]\nGestatten, Koenichstheyn! (Hi!) Ich werd’ von zigtausend Fans gestalkt\nDenn Comicnerds halten mich für Das Ding aus Fantastic Four\nWenn er den Kanisterquadratkopf erblickt\nDann ist mancher Schwarzkopf am wimmern und hardcore am zittern\nSelbst ’n Schlagstock zerbricht dran\nEy, mein Schädel lässt sogar Stahlrohre, Barhocker und Marmor zersplittern!\nDoch so grobschlächtig der Körper, so filigran der Geist\nIch schneid’ nachts um drei noch Liveblogs in minimaler Zeit\nStell sie auf YouTube drauf, währenddessen relaxt\nDer faule Rest der Crew und raucht in der Tourbuslounge\nIhr geht shoppen in Düsseldorf? Doch nicht Alexander Koenichstheyn!\nDenn teure Preise zu bezahlen, sieht Alex an der Kö nicht ein (ne ne!)\nDenn jede Kohle, die mir meine Show abschmeißt\nWird gespart, bis es für ’nen vernünftigen Tonmann reicht\nAlso geht auf YouTube/Koenichsklasse, checkt den Sender\nWeil ich dafür Klick Geld kriege wie Adam Sandler\nMittwoch, 21 Uhr - beste Livequalität\nSchalt mal ein wenn’s heißt: „Was ist in der Seife von Fred?“\nHeh, mysteriös, aber die Show ist echt superkrass\nObwohl der Ton nie läuft wie Kroos aufm Fußballplatz\nSickes Entertainment und ich trainier’ die Beine nicht\nDenn ich drück mich seit der Bosstrafo vorm Fitnesscentertraining\nAlso passt schon so\n„Ey, Jungs, ko- ... wollt ihr ma’ kurz reinkommen, noch ’ne Hook machen für den Steinbeißer? Kommt mal kurz rein!“\n\n[Hook: Seyed, Koree, DJ Arow]\nKoenichstheyn, Koenichstheyn, Koenichstheyn\nKoenichstheyn, Koenichstheyn, Koenichstheyn\nKoenichstheyn, Koenichstheyn (Koenichstheyn!), Koenichstheyn (was los, Digga?)\nKoenichstheyn (ja!), Koenichstheyn, Koenichstheyn"}], "artist": "Kollegah"}