{"songs": [{"album": "Starr", "image": "https://images.genius.com/afd9e2d6ff56ef83bc10765790f483b4.450x447x1.jpg", "year": null, "title": "I Don’t Need You", "lyrics": "[Intro]\nSee me and my Annie got a understanding that's so good. That an misunderstanding in this is understood. You finding me?\n\n[Chorus: TeeFlii]\nGirl, I don't need you\nI don't need you\nNo, I don't\nA little bit just won't do\nA little bit just won't do\nI don't need you\nNo, no, no, I don't need you\nI don't need you\nI don't need you\nNo, I don't need you\n\n[Verse 1: TeeFlii]\nYou causing stress, shit is a mess\nI really thought you loved me, but you really don't love me\nI'm watching your actions, but they ain't the right actions\nYou won't catch me outside it\nGirl, I do it just how a thug supposed to do it\n\n[Pre-Chorus]\nBut you playing these games like a Playstation 4\nAll my annies get along\nThey know right from wrong\nYou better stop acting dumb, recognize what you got\nCause, I, I\n\n[Chorus]\n\n[Verse 2: TeeFlii]\nYou causing drama\nGot two baby mamas that already cause me drama\nYou can't be [?]\nBut I'm like fuck it, life ain't never been fair\nThat's right, I trust my niggas way more than I trust you bitches\nI thought that you loved me, but you loved me in a wrong way\n\n[Pre-Chorus]\nBut you playing these games like a Playstation 4\n[?]\nThere ain't no right from wrong\nYou better stop acting dumb and recognize I've seen your face\nCause, I, I\n\n[Chorus]\n\n[Verse 3: Dom Kennedy](TreeFlii)\nLearn how to cook first then try to tell me how to do my job\nI've been here every night\nFor the last five years with the car or a bike\nStart getting nice\nI just wanna stay out of trouble\nYou can't always be humble\nMan, I'm just trying to carry the rock\nAnd niggas wanna see me fumble and it's hard getting old\nCause now I look at homes and stuff\nAnd I don't wanna be on the phone this much\nOh yeah, I'm sure, this might be the fifth tour\nReally ain't home too much\nI'm on niggas like a bus pass for the hate that they must have\nThirty thou in the duf bag, girl with a plump ass\nSmell the weed when we come past\nCar service when we come past, I don't need you\n(Go ahead tell motherfuckers what have you done)\nNever have, never will\nSee me switch lanes in a Benz for real\nShould have a movie like the Man of Steel\nOr have a movie like Fade to Black\nGet your homegirl, she a fan for real\n[?] two chickens how it's supposed to go\nThey had to get down on their hands and heel\n\n[Chorus]"}], "artist": "TeeFlii"}