{"songs": [{"image": "https://images.genius.com/51ffe6afd99678e61b52396c4cf6818b.500x500x1.jpg", "year": null, "title": "Macaframa", "album": "The Unforgiven Vol. 1", "lyrics": "Next song is Macaframa\nYeah... for yall uneducated ass bitches (fuck you hoes)\nYeah, yeah, yeah, foever hatin on a nigga thats havin thangs\nNigga, these type of situations on lockdown, were da real love at?\nYeah, yeah....\n\nAin't no love for them hoes an I'm knowin\nBitches only jocking X-Raided cause I be flowin\nThats why Im showin 'em love and affection\nIn they silky sections my erections\nSpitten milky secretions in they directions\nWhen you in they presence, they say you king\nBut when you ain't around they clown like you a peasant\nFuck givin the bitches presents\nDiamond rings and things of that nature get you pussy fo sho\nThat ho'll date ya and inflate your ego\nBut they got you hero zero fo show for all your actions\nYou went to jail wit no bail an now ain't nothin cracking\nBet back when you was free you thought you had a solid female\nBut now you can't even get a visit an' gotta beg for mail\nMovin lika a snail when you tryin to get her to handle somethin\nAnd late at night she got cum drippin out her bellybutton\nThat good for nothin bitch is useless for a convict\nI'm nuttin up on hoez, nigga fuck that cum shit\nHer cousins on my nuts like a little squirrel\nAn I wouldve been to mack her if she wasn't a little girl\nBut about two months from now that little girl gon turn 18\nThe number one draft pick on my home team\n\nChorus 2x:\nIm that gansta you answer to\nWhen I say bitch jump then thats whatcha do\nIm a fast talkin convict, blowin yo mind\nIm workin macaframalama even if im in da slamma\n\nIt dont take much to keep yo man happy doing eight months\nBut it ain't no contact visits so you can't touch\nAn county time ain't no joke\nIn Sacramento this shit will have you mental\nCause you can't smoke\nYou be stressed out\nHopin that you get yo case\nThree strikes tryin to wipe out my whole race\nNow here comes yo wife since you done got your time\nSaying that she can't hang; bitch is you out yo mind?\nShe got everything you own\nVehicle, clothes, even yo home\nNot a penny on yo' books cause tha bitch is gone\nThey send you to the branch then from there\nOut to tracy\nAnd one of the homies hooked you up with\nThis bitch Stacy\nShes white, overweight with bi-focals\nBut she's sending letters wit money orders through the postal\nYou dedicated to love an married her quick to hit that ass\nOn the first conjugal visit she had you cummin hella fast\nYou lost your pretty bitch but you gained a ugly soldier\nMove over bacon, its time fo sizzleen to take over\nCause doing time, it's all about support\nAn the bitch is to come an let you make her pussy for it, tell em short\n\nChorus\n\nNow this is fo the homies that got them Nike wearing hoes\nPonytails in they hair sportin other bitches clothes\nRuggish, thuggish, raggedy like a Muppet the type that\nWakes up in the mornin' put on some sweats an be like fuck it\nNigga don't lie, you know I just detailed yo baby's mama\nThe type of bitch that's even quicker than me to start some drama\nLike a comma, puttin pauses in yo sentences\nY'all can't even get along irreconcilable differences\nThat bitch is famous from so many nameless dicks\nThat penetrated and she's gameless\nThat's how you know shes never been with Raided\nShe's aimless, where is you headed? Bitch is you knowin?\nGettin on my nerves like my bunkie when hes snorin\nHe needed to leave or get rid of her immediately at this moment\nAn shake her like Jordan does a basketball opponent\nIf you ever fall or take a loss\nNigga that bitch is gone that lil leech will find another nigga to lean on\nShe's a forty ounce swigga, weed smoker\nNeedin to get that shit up\nHer beer belly overlapping, needin to do some sit-ups\nShes lazy as can be and'll never make no progress\nSo shake that ho that's all I can suggest, nigga\nX-raided locc\n\nDott Dogg:\nYeah, how do you bitches out there like that? Funky ass hoez!\nGood for nothin, runnin out on a motherfucker when times get hard\nPunk ass bitch!\nYeah, Dott Dogg said that, sorry ass beatch! [X-Raided: Beatch!]\nTo all you hoes that fit that description\n[You know why? Cause I'm workin macaframalama\nEven if I'm in the slamma. Beatch!]\n\nI'm that gansta you answer to\nWhen I say bitch jump then thats whatcha do\nIm a fast talkin convict, blowin yo mind\nIm workin macaframalama even if I'm in da slamma"}], "artist": "X-Raided"}