{"artist": "Plies", "songs": [{"album": "You Need People Like Me", "title": "Boosie", "image": "https://images.genius.com/28641bf892d763964abd0acf97f99f8d.500x500x1.jpg", "lyrics": "[Intro]\nAyy Boosie, I know you probably asleep my nigga\nI been thinking about you dawg\nI thought I'd holla at you my nigga\n\n[Verse 1]\nIt's one in the morning Friday night all of my niggas in the club Instead of ballin with some bitches I'd rather show love\nI'd rather send kites to the niggas that the world done snubbed\nThat's why I make music for the niggas that the rich won't hug\nAnything can come out a nigga mouth, but the real in his blood\nI make mistakes everyday so how can I judge?\nWhen a nigga can't be you my nigga, that's when they hate you the worst\nReal pain, and fake tears, I seen it at church\nWhen you want the world to love you then that's when it hurt\nWishing bad on a real nigga, I never seen it work\nIn the dictionary love last but hate come first\nBefore I wrote this shit my nigga I prayed for you first\n\n[Chorus]\nWonder if the kids you bought bikes for wrote you a letter\nWonder if the niggas you did a song with, have you heard from them niggas?\nI wonder how many of your dogs done came by and visit ya\nWonder if the crackas you made millions even chopped it up with ya\nWonder if the hoes you used to fuck, even sent ya some pictures\nWonder if the niggas you called yo dawgs eitha for ya or against ya?\nYa whole situation done taught me alot my nigga\nWhen you winnin niggahs hate ya; when ya down they against ya\n\n[Verse 2]\nIt ain't a judge or prosecutor more powerful than god\nWhatever you do my nigga don't let em take what's in your heart\nDoing day for day and depending on niggas can be hard\nBelieve in you and keep your faith cause that's what's smart\nYour mommy and your kids are the ones that love you from the start\nThey've seen the system break cliques and tear em apart\nStaying prayed up my nigga is more important than a charge That's what real niggas do they pass it to god\nThe streets a muthafucka my nigga cause they switch and they change\nIt's hard for niggas to stay out here when there's pussies in the game\nA nigga running with ya done flipped and go to spraying ya name\nThe crackas never know shit niggas put em on ya game\n\n[Chorus]\nWonder if the kids you bought bikes for wrote you a letter\nWonder if the niggas you did a song with, have you heard from them niggas?\nI wonder how many of your dogs done came by and visit ya\nWonder if the crackas you made millions even chopped it up with ya\nWonder if the hoes you used to fuck, even sent ya some pictures\nWonder if the niggas you called yo dawgs eitha for ya or against ya?\nYa whole situation done taught me alot my nigga\nWhen you winnin niggahs hate ya; when ya down they against ya\n\n[Verse 3]\nIn life my nigga all us slip and we fall\nBut that's the time to find out who really yo dawgs\nCause all these pussy niggas jump in when it's time to ball\nBut them ain't the same niggas that show up when it's time for war\nAnd when the money gone my nigga so is the jewelry man Sometime he takes us through some shit to show us our friends\nAnd most people they for self including your kin\nMy grandma always used to tell me with god you win\nPut yo trust in a higher power and not in man\nCause when you fucking round with niggas it all depends\nBut a nigga lied to you before he gone lie to you again\nIn life my nigga love is what last in the end\n\n[Chorus]\nWonder if the kids you bought bikes for wrote you a letter\nWonder if the niggas you did a song with, have you heard from them niggas?\nI wonder how many of your dogs even came by and visit ya\nWonder if the crackas you made millions done chopped it up with ya\nWonder if the hoes you used to fuck, even sent ya some pictures\nWonder if the niggas you called yo dawgs eitha for ya or against ya?\nYa whole situation done taught me alot my nigga\nWhen you winnin niggahs hate ya; when ya down they against ya\n\n[Outro]\nFrom me to you lil homie\nNot only do I pray for you my nigga\nI pray for every real nigga who locked up and tied down right now homie\nWhen I said it'd never change with me it never changed with me\nI'll never forget you nigga\nWhen I say I salute it, I salute it\nAll my gangstas, all my real niggas", "year": "2010-09-03"}]}