{"songs": [{"year": null, "image": "https://images.genius.com/a822e5595fc1eee33d5cbbfa1ae70b68.500x500x1.jpg", "title": "Hands Up", "album": "Rapper’s Delight", "lyrics": "[Rapper Big Pooh]\nUh, uh, punks jump up then get beat down\nTurn that track up, bang my sound\nNiggas ask why I walk around with a frown\nCause I ain't a muh'fuckin clown\nPay me in pounds, get bread, US fed\nLove making heads turn off some shit I said\nCode red, ring the alarm, standing in the eye of the storm\nI exhibit miraculous calm\nMy miraculous charm keep me chilled with a dime at my arm\nThoroughbred like I'm running a farm\nWho fucking with I? Who want it with him?\nI bring it to your crew, then your next of kin\nHall of J. run tight like we Mexicans\nOn the search for the Wiz like you made of tin\nRoc C is on, Chaundon is nice\nRapper Pooh bout to make niggas pay the price\n\n[Hook: Rapper Big Pooh] + (Chaundon)\nIf you're rocking with the homie Big Pooh\nAnd the whole Hall of Justus crew\nIf you're rocking with the homie Roc C\nOr my West coast family\nIf you're rocking with my man Chaundon\nThe Back Twist got it going on\nTo everybody, put your hands up (hands up)\nNow everybody get your hands up (hands up)\n\n[Roc C]\nMy reality penitentiary casualties, protect my family\nNever live in the fantasies, Mister Ceremony\nPrepare for the testimony, known for having weapons on me\nWomen call him Macaroni, Pooh we'll try to tell 'em homie\nHome known as Killa Cali, listen to Makaveli\nDead bodies in the alley, never dumb down\nCome round get gunned down\nStill Hip Hop but you still get shot\nRoc not your average individual\nMore of a criminal, don't speak subliminals\nDisco ball fall down on your physical\nCondition critical, maximize, never minimal\nA soldier to a general is like fucking with Mike\nWhen he was in his pinnacle\nPuff medical, lyrical green visuals\nSensual seductors blow cock like that window do\nAlpha Team get 'em or we'll get the other half of you\n\n[Hook]\n\n[Chaundon]\nAiyyo, I am that nigga, make niggas sick\nWhite chicks love me and my big nigga dick\nChaundon the Back Twist, hoes know the moniker\nMoney, power and respect's what I rock it for\nNo need to rehearse, y'all niggas is wack\nYou should all Auto-Tune your verse\nStep back little dude, listen\nIf you ain't getting money now then you not professional\nI do this on the regular\nYou are like A-cup titties fronting like you bigger in a Wonderbra\nDamn y'all, is this where it's going?\nIf wack's the new nice then I need to stop flowing\nCause I can turn the radio on and randomly pick\nTen rappers on the playlist who ain't shit\nHuh, and I don't care about none of your Grammies\nYou main scale, you be dealing with trannies\n\n[Hook]"}], "artist": "Rapper Big Pooh"}