{"artist": "Vast Aire", "songs": [{"title": "Tippin’ Dominoes (RJD2 Remix)", "year": null, "lyrics": "[Hook: repeat 2X]\nThe same motion, that moves the hip\nHas the same efect on dominoes when tipped\nI got two forty-five cents embedded\nAnd I won't hesitate to leave your crew shredded\n\n[Verse]\nThe name, is Vas Kramer\nWe been rhymin' since playn' hopscotch on top of the earth's surface\nIf you can't perform a sentence you're worthless\nPut your hands up in the back, if you heard this\nYo hipster throw a scratch\nTo cover my phsyical you need six feet of tape like IMAX\nSo you can get the clear picture\nI'm old school with new thoughts and open wounds, pour salt!\nCan Ox is dirtier than a mudslide\nAnd if you get caught, you might die\nLet's let the sky decide\nThe speed is still right\nAfter the Titans colide\nFreestyles caught in my head\nStarch in my head\nLeave you with shreds\nYou wanna contest a dread\nIt's magnetic\nLike live poets metal hands on top of my nuts that's pathetic\nIf you heard it, then I said it\nWhen it rains it pours don't wet it\nMan, you know what I'm saying?\n\n[Hook]\n\n[Verse]\nThere's only a billion prophocies, one of them's gotta set it\nAnd only two MC's, and one of them's beheaded\nNow you leaving the cypher retarded\nAs if you got caught, it's something you started\nClean this shit up! Like whatchamacallit\nI see the sea just parted\nAnd Air Vast just called it\nMan, you ain't half as tight\nI can bend any substance, that's metal nightlight\nI can break any rule that's slavery type\nI'm awful, we take no shit, that's the form we like\nAdam's fam\nYou wanna fight styles, we got t-shirts that say we cut hands\nSon we'll take both of 'em, the first time\nSo you can't play even play the wind chime\nOr the piano, jazz or classical\nI'm Vast Aire I might rip out your clavicle\nPsh, then it's over\nIt's like that, I'm in the air, with Jehovah\nOr in a, Range Rover\nOr maybe in the sky holding onto the tail of a star nova\nCrazy? I breathe on the mic if you lazy", "album": "Embedded Studios Presents: The Bedford Files", "image": "https://images.genius.com/0b12e19bc354d8c5b48f536dcaa3d7d4.617x620x1.jpg"}]}