{"artist": "YG", "songs": [{"image": "https://images.genius.com/46b3a8826081b1d6675c55e03a09a50e.672x672x1.jpg", "year": "2014-12-15", "album": "Blame It On the Streets", "lyrics": "[Intro: Jay 305]\nDon't blame my mama\nBlame it on the streets\nDon't blame my liquor\nBlame it on the streets\n\n[Verse 1: Jay 305]\nShootouts in broad daylight, South Central zoo life\nYoung nigga goin' hard, hustle all night\nMama prayin', tellin' God I don't live right\nFuck right, go left, catch a damn strike\nFelonies can't go to police\nProbation catchin' cases, prayin' on my (static)\nLord, why they got me out this way?\nLord, I gotta buy another AK\nFresh out, I need money in the worst way\nGet a job, Hell nah, call my homie Ike\nTold me, \"Pull up, I'ma get you right\"\nDiamond chain, gold ring, now I'm sittin' right\nLike biz, bad bitch, real boss tie\nTook a chance, now I'm ballin' off the street life\nIt's just in me, my nigga\nDon't blame me, blame the ghetto, that's where I'm livin', my nigga\n\n[Hook: Jay 305]\nDon't blame my mama\nBlame it on the streets\nDon't blame my liquor\nBlame it on the streets\nDon't blame my mama\nBlame it on the streets\nDon't blame my homies\nBlame it on the streets\n\n[Verse 2: YG]\nAye I'm a West Side, Tree Top gang member\nDon't blame it on my mama, don't blame it on me\nYo those fades I done took, peoples' safes I done took\nAnd if I caught up with this shit, I'm gettin' booked\nOh, oh no, I don't wanna go to jail\nBut if I got to I swear to God I won't tell\nHit the bounty nigga, you ain't gotta take no fade for me\nPhone call, [?], nigga I can spread for weeks\nMy pops mad at me, my mama all worried\nSo she bail me out, typical black male story\nHer friends wasn't supportin' cause they know I'm in the streets\nI told her, \"Don't blame it on my mama, blame it on me\"\nI got Piru [?], where I'm from, that's regular\nI don't do enemies and I don't talk on a cell\nAnd mama asked why I sag and talk with so many Bs\nNo questions, mama, blame it on the streets\n\n[Hook: Jay 305]\nDon't blame my mama\nBlame it on the streets\nDon't blame my liquor\nBlame it on the streets\nDon't blame my mama\nBlame it on the streets\nDon't blame my homies\nBlame it on the streets\n\n[Outro: Jay 305]\nWhat's happenin'? West Side, Jay 305, I'm demanding respect. You got a problem with that, I 'on't know what to say. Blame it on the streets. Niggas like me only come once in a lifetime, nigga. So while you in the mothafuckin' presence of a  gangsta, nigga, you better bow down and walk off", "title": "Blame It On the Streets"}]}