{"songs": [{"year": "2017-07-19", "album": null, "image": "https://images.rapgenius.com/5e64677831b6775d34bf583697962241.500x500x1.jpg", "title": "All Day (2 Chainz Version)", "lyrics": "[Intro: Kanye West & (Theophilus London)]\nAll day, nigga\n(Dance, ayy, ayy ayy ayy)\n\n[Chorus: Kanye West]\nAll day, nigga\nHow long you niggas ball? All day, nigga\nHow much time you spent at the mall? All day, nigga\nHow many runners do you got on call? All day, nigga (swish, swish)\nHow long they keep you in court? All day, nigga\nTake you to get this fly? All day, nigga\nTell your P.O. how-how long you been high? All day, nigga\nYou already know I'm straight from the Chi, all day, nigga\nSouth, south side! All day, nigga\n\n[Verse 1: Kanye West]\nThis Ye, nigga\nShoppin' for the winter and it's just May, nigga\nBall so hard, man, this shit cray, nigga\nAnd you ain't gettin' money 'less you got eight figures\nFor that Jesus piece, man, I've been saved, nigga\nJust talked to Farrakhan, that's sensei, nigga\nTold him I've been on ten since the 10th grade, nigga\nGot a middle finger longer than Dikembe, my nigga, uh\nI don't let 'em play with me\nI don't let 'em talk to me no kind of way\nUh, they better watch what they say to me\nNiggas still gettin' popped on the day to day\nYeah, I still got the hundred with the small face, nigga\nMight spend 50 racks on my off day, nigga\nYou a fake Denzel like the Allstate nigga\nIf you run into me, better have Allstate with yah\nYou a Rico Suave nigga\nRide 'round listen to Sade, nigga\nIf you ain't with us, you in our way, nigga\nYou an actor, you should be on Broadway, nigga\nCause you do shit the broad way, nigga\nYour bitch got a ass, but my broad way thicker\nLate for the class, in the hallway, nigga\nYeah, the dropout at it as always nigga, as always\nAll day, nigga\n\n[Refrain: Allan Kingdom]\nI took a young sweet breath, and I reached into my Earth\nGave him what I had left\nAt that moment I dispersed\nAt that moment I dispersed\n\n[Chorus: Kanye West]\nAll day, nigga\nHow-h-how long you ball? All day, nigga\nHow much time you spent at the mall? All day, nigga\nHow long it take you to get this fly, fly? All day, nigga\nTell your P.O. how-how long you been high, high? All day, nigga\nPour some Hen out for my niggas that died, all day, nigga\nAnd I keep a bad bitch on the passenger side, all day, nigga\nAnd you already know that a nigga from the Chi, all day, nigga\nSouth, south, south side, side! All day, nigga\n\n[Verse 2: Kanye West]\nI could do this all day, boy\nYou know I wanna get down (yeah)\nLike a light skinned slave, boy\nWe in the mothafuckin' house! (ayy)\nDon't really matter what I make, boy\nYou know I still go wild\nThey need that Ye in the streets, boy\nThere's been a mothafuckin' drought\n24/7, 365 days, everybody gettin' paid\nPeople lookin' at me like I'm worth both MJs\nMade the release date a police date\nPeople sayin', \"Ye, Ye, take it easy\"\n20 Gs for the Yeezys off of eBay\nNiggas do the most and they ain't done shit\nOnly way I can sum it up, sumbitch\n\n[Bridge: Theophilius London & Kanye West]\nSo won't you dance? ayy, ayy ayy ayy\nAll day, nigga\n\n[Guitar Interlude: Paul McCartney]\nWhistling\n\n[Interlude: Kanye West]\nAll day, nigga\n\n[Refrain: Allan Kingdom]\nI took a young sweet breath, and I reached into my Earth\nGave him what I had left\nAt that moment I dispersed\nAt that moment I dispersed\n\n[Verse 3: 2 Chainz]\nHotter than a blowtorch\nBank account just had a growth spurt\nIf my partna' goes up, I can play whole court\nAll we used to do is eat cold cuts, yeah\nAll day, nigga\nUsed to sell yay out the hallway, nigga (hallway)\nGunshots rang in the broad day, nigga (broad day)\nI like it when my shrimp is sautéed, nigga (sautéed)\nAll day, nigga\nI said you can play this shit like all day, nigga (all day)\nPlayin' no games, no arcade, nigga\nBeen doin' this shit since a bald fade, nigga (nigga)\nNigga, dreadlock rasta\nGot a lot of dimes in my goddang roster\nPut Forgiattos on a red Lamborghini\nNow that mothafucka lookin' like a goddang lobster (whooh)\nAll day, nigga\nSmoke me a joint then them eyes red, nigga\nPlease don't make me fuckin' irate, nigga\nIf swag was a sport then I'd race niggas, vrrrrrm\nFuck it, I'll annihilate niggas\nCame here to violate niggas\nViolence, most valuable player\nAll these checks in the mail\nI could check the mailbox all day, nigga\n\n[Outro: Kanye West]\nGet low, alright\nAll day, nigga\nGet low, alright\nAll day, nigga\nGet low, alright\nAll day, nigga\nGet low, alright\nAll day, nigga\nSouth, south, south side, side!\nAll day, nigga"}], "artist": "Kanye West"}