{"songs": [{"year": null, "image": "https://images.genius.com/073ae5b8b5d21a472eb45384f0a38241.500x500x1.jpg", "title": "100 Thou Off Beats", "album": "See Me On Top II", "lyrics": "[Intro:]\nWhat's the motherfuckin' deal baby? KRIT, DJ Folk, See Me On Top man. What's the motherfuckin' deal baby? KRIT, DJ Folk, See Me On Top man. Behind the scenes nigga, I'm a new breed of rapper, two mixtapes in two months. Who the fuck toppin' that man? Mississippi, well connected to the A nigga, holla at me\n\n[Verse 1:]\nI hit the scene and tote a whole fuckin' stripper pole\nI'm on the corner sellin' (?) like a mini mall\nTell these niggas either get rich or die tryin'\nThe CD's sound like shit, so we ain't buyin'\nTold these niggas better get they fuckin' stacks up\n(?) canary yellow on the fuckin' Lac truck\nGo to Georgia and get love in the A\nThey know the Killer K, I make it here today\nI been real, been down, since I left the womb\nGot it for the low so they don't fuck with you\nWhite T, Air 1's on my fuckin' feet\nAthlete of the year, trap star of the week\nWhere the Hemi at? I ran a lot of streets\nI'm like a butcher nigga, I serve a lot of beef\nI got swagger like Jimmy and that's real\nDJ Folk and BK, hey that's (?)\n\n[Hook: x2]\nI went from no name nigga to the next thing blowing up\nK-R-I-T I'm the best thing going\nWhen it comes to the streets\nWatch me get 100,000 off some motherfuckin' beats\n\n[Verse 2:]\nOkay, I told them niggas better see me on top\nThe industry is fucked man, they need me on top\nI'm from that Magnolia state, I bring it back\nFirst album I drop, seeing platinum plaques\nI'm official nigga, certified, the price is right\nThe K next to blow bitch, that's the facts of life\nIf your family matter, watch what you say to Folk\nI make a ho sit down like (?)\nI seen boys stand up and get knocked down\nI seen OG's run from that choppa sound\nDo your own thing K, that's what D said\n(?) a bakery nigga, so I'mma make bread\nI got that fresh shit boy, hey I bet they love it\nThe haters gonna hate, but I bet they dug it\nI'm like a secret that these niggas lock up in they closet\nBut in reality they know the K the fuckin' hottest\n\n[Hook: x2]"}], "artist": "Big K.R.I.T."}