{"artist": "Ice-T", "songs": [{"title": "Killers", "lyrics": "A man took an ad on T.V\nTo enroll in the police academy\nHe's very talented, outstanding proof\nFrom his clean-cut apperance to the shine on his boots\nWhen it comes to graduation, he's number one\nAn expert with a rifle and also a gun\nThree weeks on the beat and his weak nerves crack\nAnd fires four warning shots into a kid's back\n\nKillers! These are the killers\nKillers! The coldhearted killers\nKillers! Bloodthirsty killers\nKillers! Beware of the killers\n\nA young girl marries an older man\nWith more money than you can understand\nHe smothers her with pearls and jewelry\nAnd they both seemed as happy as they could be\nBut three months later, she's sad but content\nSeems he had an unexpected accident\nThe girl said he would be hard to forget\nAs the papers interviewed her while she flew his jet\n\nKillers! These are the killers\nKillers! She was the killer\nKillers! The coldhearted killers\nKillers! Beware of the killers\n\nIt's time for all to work together for peace\n'Cause everybody's doomed if the killings don't cease\nStreet homicide, war, it's all the same\n'Cause murder is murder by any name\n\nAn young man loses his only job\nToo proud to hustle, too honest to rob\nHe goes to tell his family and his wife\nBut an argument breaks out, she grabs a knife\nTempers escalate to a total rage\nShots burst out from a loaded twelve-gauge\nThey call it mass murder, suicide\nBut somebody tell me why the kids had to die\n\nKillers! these are the killers\nKillers! the coldhearted killers\nKillers! bloodthirsty killers\nKillers! beware of the killers\n\nVietnam vet, home from the war\nCan't get a job in a candy store\nUnemployment hurts and he's living proof\nSo to take out his frustration, he climbs on the roof\nHe shows no pity as victims are shot\nThe only thing to stop him are the bullets from SWAT\nTen people died on a sunny day\nBut tell me who taught him how to shoot that way?\n\nKillers! These are the killers\nKillers! You know the killers\nKillers! Beware of the killers\nKillers! Are you a killer?\n\nIt's time for all to work together for peace\n'Cause everybody's doomed if the killings don't cease\nStreet homicide, war, it's all the same\n'Cause murder is murder by any name\n\nA known criminal is sentenced to death\nNow the legal system controls his last breath\nHe tries to fight execution with petitions and pleas\nAnd a pardon from the governor is all he needs\nHe cries out for mercy but nothing's spared\nAnd on his day of termination, he's strapped in a chair\nHigh voltage fills his body in a house-like jail\nAnd all of the people of vengeance grail\n\nAre you a killer? a cold-hearted killer\nA killer! a bloodthirsty killer\nA killer! a merciless killer\nA killer! a killer!  A killer!\n\nGeorgie-Porgie-Pudding-and-pie\nCouldn't get a girl, let me tell you all why\nHe tried to be down like all the rest\nHad curls in his hair, gold on his chest\nHe rolled around town in a Coup-de-ville\nBut he had no money, he was broke as hell\nLadies love money and he needed more\nSo he tried to steal something out a liquor store\nBut before Georgie-Porgie could get away\nThe man pulled out his gun and blew him away\n\nHe was a killer! A coldhearted killer\nA killer! Are you a killer?\nA killer! A merciless killer\nA killer! Beware of the killers\n\nIt's time for all to work together for peace\n'Cause everybody's doomed if the killings don't cease\nStreet homicide, war, it's all the same\n'Cause murder is murder by any name\n\nPoliticians plot for power each and every day\nWe are all just puppets in the games they play\nThey manipulate the message to attain their goals\nAnd for simple re-election they will sell their souls\nNuclear supremacy is the ultimate thrill\nSo our tax we pay is paid for overkill\nB-1 bombers, super weapons, rockets in the sky\nWhile we all pray to God the missiles never fly\n\nKillers! These are the killers\nKillers! They are the killers\nKillers! Are you a killer?\nKillers! Don't be a killer\n\nIt's time for all to work together for peace\n'Cause everybody's doomed if the killings don't cease\nStreet homicide, war, it's all the same\n'Cause murder is murder by any name", "image": "https://images.genius.com/fcf0e6af950241f8321cc9f2b94c1c72.550x566x1.jpg", "album": "The Classic Collection", "year": null}]}