{"songs": [{"year": "2017-04-14", "album": "DAMN.", "image": "https://images.genius.com/d25e7043f51c2de6acaf6c39caa60da2.1000x1000x1.jpg", "title": "ELEMENT.", "lyrics": "[Intro: Kid Capri & Kendrick Lamar]\nNew Kung Fu Kenny\nAin't nobody prayin' for me\nY'all know, what happens on Earth stays on Earth\nHere we go!\nI don't give a fuck, I don't give a fuck\nI don't give a, I don't give a, I don't give a fuck\n\n[Verse 1]\nI'm willin' to die for this shit\nI done cried for this shit, might take a life for this shit\nPut the Bible down and go eye for an eye for this shit\nD-O-T my enemy, won't catch a vibe for this shit, ayy\nI been stomped out in front of my mama\nMy daddy commissary made it to commas\nBitch, all my grandmas dead\nSo ain't nobody prayin' for me, I'm on your head, ayy\nThirty millions later, know the feds watchin'\nAuntie on my Telegram like, \"Be cautious!\"\nI be hangin' out at Tam's, I be on Stockton\nI don't do it for the 'Gram, I do it for Compton\nI'm willin' to die for this shit, nigga\nI'll take your fuckin' life for this shit, nigga\nWe ain't goin' back to broke, family sellin' dope\nThat's why you maney-ass rap niggas better know\n\n[Chorus]\nIf I gotta slap a pussy-ass nigga, I'ma make it look sexy\nIf I gotta go hard on a bitch, I'ma make it look sexy\nI pull up, hop out, air out, made it look sexy\nThey won't take me out my element\nNah, take me out my element\n\n[Verse 2]\nI'm allergic to a bitch nigga, ayy\nAn imaginary rich nigga, ayy\nSeven figures ho, that's slimmer than my bitch figure, ayy\nGoin' digital and physical on all y'all, ayy\nBunch of criminals and money in my phone calls, ayy\nWe okay, we let the A1 fly\nRelocate, jump on the same G5\nCheckin' for me heavy 'cause I go yeah, I go yeah\nThey never been ready, yeah, I know yeah, know yeah\n100K spread across the floor, 'cross the floor, yeah\nNone of y'all fuckin' with the flow yeah, the flow yeah\nYears in the makin', and don't y'all mistake it\nI got 'em by a landslide, we talkin' about races\nYou know this'll never be a tie, just look at they laces\nYou know careers take off, just gotta be patient\nMr. One through Five, that's the only logic\nFake my death, go to Cuba, that's the only option\n\n[Chorus]\nIf I gotta slap a pussy-ass nigga, I'ma make it look sexy\nIf I gotta go hard on a bitch, I'ma make it look sexy\nI pull up, hop out, air out, made it look sexy\nThey won't take me out my element\nNah, take me out my element\n\n[Bridge]\nDamned if I do, if I don't (Yuh)\nGoddamn us all if you won't (Yuh)\nDamn, damn, damn, it's a goddamn shame\nYou ain't front in line, get out the goddamn way\n\n[Verse 3]\nNiggas thought they wasn't gonna see me, huh?\nNiggas thought that K-Dot real life\nWas the same life they see on TV, huh?\nNiggas wanna flex on me and be in L.A. for free, huh?\nNext time they hit the 10 freeway, we need a receipt, huh?\n'Cause most of y'all ain't real, most of y'all gon' squeal\nMost of y'all just envy, but jealousy get you killed\nMost of y'all throw rocks and try to hide your hand\nJust say his name and I promise that you'll see Candyman\nBecause it's all in your eyes, most of y'all tell lies\nMost of y'all don't fade, most of y'all been advised\nLast LP I tried to lift the black artists\nBut it's a difference 'tween black artists and wack artists\n\n[Chorus: Kendrick Lamar & Kid Capri]\nIf I gotta slap a pussy-ass nigga, I'ma make it look sexy\nIt's the one and only, the world's greatest, the Kid Capri\nIf I gotta go hard on a bitch, I'ma make it look sexy\nI pull up, hop out, air out, made it look sexy\nThey won't take me out my element\nNah, take me out my element"}], "artist": "Kendrick Lamar"}