{"artist": "Paul Wall", "songs": [{"album": "Slab God", "title": "Chose Me", "image": "https://images.genius.com/d40aeb295e45c5213c729d2a253188af.300x300x1.jpg", "lyrics": "[Verse 1: Paul Wall]\nShe told me I'm the fliest, I don't disagree\nSwiss made, rich footwear made from Sicily\nCome around me talkin' down, bro you missin' me\nWant a meal ticket, playa hatin' ain't the recipe\nWhy hate cause you saw me in an eye 8\nYa bitch was lookin at me, you was lookin' eyerate\nNow you searchin' for my flaws like spygate\nInvestigatin' why I got food on my plate\nDon't mistake me for a mauge, no I ain't\nStraight up outta texas, only real ones in my state\nYou got a side bitch? Bro, I got side cake\nGive a fuck about a bopper, no I can't\nWhy you hatin' on a playa? check ya hoe, mane\nTalkin' down, droppin' salt, you got no game\nAnd all that pillow talk shows you are soo lame\nStartin' all this drama for some fame, man ya bitch chose me\n\n[Hook: Paul Wall]\nYa bitch chose me, ya bitch chose me\nYa bitch chose me\nYou know the rules to the game, man\nYa bitch chose me, ya bitch chose me\nYa bitch chose me\nYou know the rules to the game, man\nYa bitch chose me\n\n[Verse 2: Snoop Dogg]\nBad mothafucka with a set of gators on my feet\nCatalytic drippin' wet, color of that picture peach\nMink coat on my back like a cat\nBlack panther, as serious as cancers\nRidin' like a dancer, answer the question\nSuggestion, I'm pressin' the issue\nSoft as a tissue, miss you, miss me?\nBaby, wanna kiss me, but we gettin' bubbly\nDippin' and duckin', bobbin' and weavin'\nAchievin' my dream and cold and\nAbout your bitch; she fien and schemin'\nShe wanna be down, wanna be 'round\nNeed the cost to be the boss, she in the lost and frown\nAnd now that she sees the light, I pimp like\nFillmore Slim with a dap of dynamite, aight?\nYou know how they hoes gonna be, they on me\nMuthafucka, ya bitch chose me\n\n[Hook: Paul Wall]\nYa bitch chose me, ya bitch chose me\nYa bitch chose me\nYou know the rules to the game, man\nYa bitch chose me, ya bitch chose me\nYa bitch chose me\nYou know the rules to the game, man\nYa bitch chose me\n\n\n[Verse 3: Berner]\nI got a bitch in (?), 1500 for the handjob\nI pick her up at 6 while them other bitches fag off\nI'm in the H town, I'm ridin' with the Slab God\nDrop me off your treasures homie, once I get this pack off\nBitches love this California mouth piece\nShe sai (?), she wanna know 'bout me\nShe in my IG DMs, bitches shove me money like \"Daddy, let me in\"\nBut I'm picky when it comes to sellin' pussy\nIt's a 50 thousand dollar fee to fuck with me\nAnd na, I don't rock gators with 5 thousand flavors\nNo more ads on the internet\nMy bitches get 60 grand to go on a business trip\nPimps catchin' feelings lookin' weak\nOh, you mad at me, homie? Ya bitch chose me\n\n[Hook: Paul Wall]\nYa bitch chose me, ya bitch chose me\nYa bitch chose me\nYou know the rules to the game, man\nYa bitch chose me, ya bitch chose me\nYa bitch chose me\nYou know the rules to the game, man\nYa bitch chose me", "year": null}]}