{"artist": "Andre Nickatina", "songs": [{"title": "9 To 5", "album": "Khan! The Me Generation", "year": "2010-04-20", "image": "https://images.genius.com/a40bfc48fac301c14baf8ed031c3f584.600x600x1.jpg", "lyrics": "[Too $hort:]\nI ain't neva had a job (Bitch)\nBeen hustlin' my whole life\nBut I always wondered...\nIf you ain't gotta car...\nCan you still car pool or do you gotta catch the bus?\nShit ain't right baby\nFrontin' on a player\nI told you once neva talk down on a playa bitch\nWe from the bay, what the fuck you expect?\nYeah\nWe gonna let you know the truth\n\n[Andre Nickatina:]\nBitch you got a 9 to 5 and you don't even drive\nTalkin' down a playboy that be kickin' it live\nBitch you got a 9 to 5\nYa you fine but your ass always need a ride\nBitch you got a 9 to 5\nWake up early get your ass in that bus line\nBitch you got a 9 to 5\nAnd these are playboy times\n\nSee we can kick it like a field goal\nAnd you can tell the way I dress freak I'm straight outta Fill'Moe\nI talk shit like a real pro\nMan on the casino\nTell me that I'm fresh ho\nI drive by like a drive by\nFreak hit me with a text got mad I didn't reply\nI dip fast down the skyline\nAnd you can say I swim fast if you knew a zodiac sign\nI wear suits and boots and gold cufflinks\nYou ain't feelin' me? Then tell me what your girl think\nI put a vision that will spit on H.D\nThen I give a receipt man for the pay fee\nNow it's way past two\nI say \"Whatcha gonna do? Are you goin' with her?\"\nShe said \"I'm comin' wit you\"\nAnd yeah you can check my purse\nBut at seven I gotta go to work\n\nBitch you got a 9 to 5 and you don't even drive\nTalkin' down a playboy that be kickin' it live\nBitch you got a 9 to 5\nYa you fine but your ass always need a ride\nBitch you got a 9 to 5\nWake up early get your ass in that bus line\nBitch you got a 9 to 5\nAnd these are playboy times\n\nYa think it's funny Imma warn ya\nI been standin' on the corner of Polk and California\nWhen the cops drive by they get every fly guy with a female all up in the ride\nI drive cars that look like spaceships\nI hit Broadway like I'm Joe Namath\nI'm all in your ear just like a cell phone baby or a Blue Tooth\nGive me all your big loot\nMy number is 4-1-5 check it 5-5-5\nFifty five, fifty five\nYou a dime\nAnd now click your heels like Dorothy\nAnd duck down freak from the authority\nYou make more money than the majority\nI'm lookin' at my calendar you're goin' on tour with me\nI think you could straight absorb me\nAnd she didn't hesitate to open up the door for me\n\nBitch you got a 9 to 5 and you don't even drive\nTalkin' down a playboy that be kickin' it live\nBitch you got a 9 to 5\nYa you fine but your ass always need a ride\nBitch you got a 9 to 5\nWake up early get your ass in that bus line\nBitch you got a 9 to 5\nAnd these are playboy times\n\nI'm on a legendary crime spree\nAnd I stick to all the rules of the game that designed me\nYou can hit the clubs and be a broke bitch\nMan all that work bitch eatin on tuna fish\nI flash cash when I ride like a bike gang\nI throw a turnout all on a flight mane\nThis freak is straight outta sight mane\nMake money to the early light mane\nI go shopping like a budget don't apply to me\nAnd when I spend I'm like a Menace II Society\nI like that style, what's the variety?\nCheck in the back, baby please don't lie to me\nGimme all the colors you can brang out\nCuz Imma be where all the girls hang out\nDiamond chains on the playboys bang out\nYou might like to be where we make it rain out\n\nBitch you got a 9 to 5 and you don't even drive\nTalkin' down a playboy that be kickin' it live\nBitch you got a 9 to 5\nYa you fine but your ass always need a ride\nBitch you got a 9 to 5\nWake up early get your ass in that bus line\nBitch you got a 9 to 5\nAnd these are playboy times"}]}