{"songs": [{"year": null, "image": "https://images.genius.com/343c2c53c7b1f818cf50919e00643c0a.428x428x1.jpg", "title": "Freestyle (feat. Drake, Baby, Drake & Baby)", "album": null, "lyrics": "(feat. Jay-Z)\n\nYeah y'all this Jay-Z, coolin out with the Funk Flex\n60 Minutes of Funk, volume two, how we do\nMotherfucker... yeah you don't stop\nYou won't quit, Jay-Z drop shit like this\nAiyyo, my records sell cause I was born to do it\nKick that Willie shit well, cause I'm really gonna do it\nThe voice of the hustlers, who else gon do it?\nMost niggas is locked or in the box with embalming fluid\nThat's how I get it locked when I come through in the V\nYou rap niggas on the radio don't do it for me\nInsert the removable face, place the CD\nYour Prince, cause you rap dudes don't make sense\nTalk about bitten lines\nNigga I did ery bit of crime that I writ in mine\nRan so much coke, I could shit a dime\nAnd this is way back when, way before your bullshit was signed\nTryin to indirectly, effect me, directly\nCareful what you wish for, Jigga get raw\nNigga I'm straight gutta, let me remind you\nAct like you, out of your mind, I put your mind out of you\nI do anything when I put my mind to it\nA whole lot more when I put the nine to it\nI flow shit blow shit smash shit tow shit\nOn some sho' shit hose it down totally and you knows this man\nKeep niggas in awe with the old shit\nNo shit, and I don't give a fuck who you go get\nI fold shit like poker, smack em around\nOn some Joe Schmoe shit, I back your whole click down what?\nFrito Lay rappers I slay for play, tell me\nWho in your circle could fuck around with Jay?\nNo mo' shit, Cristals get dough shit\nShoot my pistals on the reg, I'm on some double-fo' shit\nBout to drop a jewel and make po-po sick\nI only the respect feds, beat cops know shit\nI'm pro slick, the dopest nigga to your brain, the comatose shit\nCause after all, what's my name, oh shit!\n\nYeah Funk Flex and uh, we don't stop\nY'all wanna rhyme like me, wanna dime like me\nEvery Tom Dick and Harry wanna ride my mami\nDrink Cristal, play diamonds in his wristal\nSell fish scale, y'all niggas love this style\nWannabe players, Jay-Z's offic-ial\nBeen through out, I could tell you what to do and how to do it\nFoundation is layed, we can take this to the top babygirl\nIf you're not afraid, the world is watchin\nMost certainly, clowns wanna get up in your drawers\nThink they hurtin me, ha hah\nI keep you ill and traced out, tennis brace style\nCartier watch my diamond face style\nCrib on the coast, marble floors laced out\nChase you upstairs singing 'Let's Play House'\nDrop a seed in her, little life to breathe in her\nWanna boy so to be sure, I OD'd in her\nHis days are laced in Caesar Leguars\nAll the chicks jealous at the baby showers\nBeatch!\n\nHow we do, Funk Flex, yeah\nBrooklyn...\n\n[fades into How About Some Hardcore by M.O.P.]"}], "artist": "Birdman"}