{"artist": "King T", "songs": [{"image": "https://images.genius.com/4ecadf00855c55fe49bd112852218051.704x704x1.jpg", "title": "A Hoe B-4 Tha Homie", "year": "1993-01-26", "album": "Tha Triflin’ Album", "lyrics": "Yo nigga, let's go scoop up some of these hoes at the 'Paradise', man\nHey man, ah - I'm engaged now, man\nWhat?\nI'm engaged\nTo that bitch?\nAw man, don't be talkin about my woman like that\nOh, now you're gon' trip on me\nWait, wait, hold up, hold up\n\n[ VERSE 1: King Tee ]\nHow you gon' go and put a hoe before me?\nWhen I'm the one that helped your broke ass on the streets\n'Damn, I'm starvin, what you got to eat?\nI'm short, I need a place to sleep'\nOh, but amnesia, that damn skeezer\nMade you forget who was down witcha\nI thought birds of a feather flock together\nAnd don't a damn thing change but the weather\nBut now I know the real, I guess I had it all wrong\nWe used to hit the Ides until the shit was all gone\nWhere was she when you needed niggas off your ass\nAnd who'd you come to get to go blast?\nNot that once-a-month-bleedin, always on her knees\nSuckin every Tom, Dick and Harry like a berry\nI seen her with a trick at the Motel 6\nAnd you still tryin to get that bitch afro fixed\nShe got you by the nuts, playin' with your wiener\nWrapped around her finger when the last time you seen her\nWell, when you do, bust her lip\nAnd if you don't, you'se a bitch\nSo sit down when you piss, muthafucka\n\n(It's a shame, but it ain't no thang to me) --] Deadly Threat\n\n[ VERSE 2: Deadly Threat ]\nThe bitch got you gone, talkin on a phone\nTellin muthafuckas when you see me, it's on\nBut little do he know that she a zero\nAnd I'm still her favorite superhero\nSee, I got the 411 on a hoe\nJust like I was tellin you before\nYou're just a piece of the mission\nGuess where her lips been?\nI told you don't be kissin, but you don't listen\n[ King Tee ]\nYeah, Jaws (Jaws) Jaws the only hoe I ever saw\nThat could suck a basketball through a straw\nShe don't like niggas with Nissan trucks\nUnless they got the monster bumps\n[ Deadly Threat]\nThat's right, honey bunny's money-hungry\nAnd she'll frame ya, she's out to getcha\nGet the picture, cause the bitch'll\nTake you for a long-ass ride like the hitcher\nSo don't be surprised if they find you in a ditch\nWith your guts hangin out lookin like Top Ramen\nAnd when I see the bitch, I'm bombin\nCause she's a false tenderoni, plus tossed bologna\nAnd she ain't your hoe, she's a hoe\nDon't put a hoe before the homie\n\n(A yo bitch, you better tell em) --] Ice Cube\n\n[ VERSE 3: Ice Cube ]\nWho's wearin the pants, who's wearin the pants, nigga?\nIf you ask me, I think that her dick is bigger\nThan your little dick, and I'm tellin you, Jay\nThe bitch got you locked down like Pelican's Bay\nNow I told you if you fuck with the hoe\nShe's guaranteed to have you trippin\nAnd me and you set-trippin\nI told my muthafuckin crew\nTo kidnap the hoe, and they came back with you\n[ King Tee ]\nI can't fade a nigga that's bitch-made\nKool-Aid pumpin, tell a bitch somethin\nShe'll have your ass cookin dinner\nWhile she's lettin every nigga in her hood run up in her\n[ Ice Cube ]\nGot you runnin like Bruce Jenner, and the hoe be\nPussy-whippin your ass like Toby\nNow you act like you don't know me\nOnly a mark'll put a ho before the homies\n\n[DJ Pooh]\nOne of these muthafucka's different\nYeah\nTell me a secret\nNot just any secret\nJust answer one question for me, baby:\nDo you love me?\nI love you\nVery, very, very, very much\nBaby\nCan I come pick you up and take you shoppin?\nSpend all my money...\nSoon as I get home from work\nI love you\nI love you\n\n[King Tee: Don't put a hoe before the homie]"}]}