{"artist": "Valete", "songs": [{"title": "Skinheads", "year": null, "lyrics": "[Intro]\n[Sr Lourenço]\n– Podes entrar !\n[Vítor]\n– Boa Tarde Sr Lourenço\n[Sr Lourenço]\n– Boa tarde Vítor. Podes sentar ! Senta-te!\n[Vítor]\n– Com Licença\n[Sr Lourenço]\n– Ora bem, é o seguinte... Tu sabes que o Lúcio saiu da empresa, e é nossa política promover sempre alguém do departamento para os cargos de chefia, não é preciso dizer–te porquê , tu já sabes não é?\n[Vítor]\n– Hum hum\n[Sr Lourenço]\n– Bom, és o mais antigo do departamento, e temos aqui relatórios que nos indicam que és o mais competente, o que tem mais destreza a desempenhar as funções, o mais disciplinado, raramente faltas, e por isso, é normal que sejas tu o escolhido para assumir o cargo de director\n[Vítor]\n– Ohhh !!! ok\n[Sr Lourenço]\n- Então diz-me lá! Quanto é que tu ganhas?\n[Vítor]\n– 1540 euros\n[Sr Lourenço]\n– Ok .Vais ficar com o salário do Lúcio , que era de mais ou menos 7000 euros\n[Vítor]\n- Bom, bom!\n[Sr Lourenço]\n– No final deste trimestre vamos fazer uma reunião corrente da administração e vamos oficializar a tua nomeação ok?\n[Vítor]\n- ok\n[Sr Lourenço]\n- Vais ser o primeiro diretor negro desta empresa pah, vais ser o Obama do departamento comercial ahh\n[Vitor e Sr Lourenço]\n– (Risos)\n[Sr Lourenço]\n– Parabéns. Vá comemorar homem!\n\n[Verso 1]\nA noticia já se espalhou por toda a empresa\nAgora todos tratam-te como se fosses realeza\nA Ju, agora sem pedires traz-te sempre um cafezinho\nA Diana larga um sorrizinho sempre que te apanha sozinho\nO Nuno agora quer conversa a toda a hora\nFala do tempo, da hora, conta histórias do vizinho\nAgora todos adulam-te, bajulam-te não te largam\nAfagam–te com elogios quase que te embriagam\nVais ser o diretor , precisas duma ganda dama\nA Diana é ganda filé, dizem que na cama é profana\nEla é, a loira boa que na empresa todos cobiçam\nEnfeitiçam-se por ela quando a vêm toda soberana\nQuerias convidá-la pa’ sair, nem foi preciso\nEla antecipou-se , galaste logo o panorama\nJantar tipo novela, em casa dela , à luz de velas\nDepois bafos de marijuana até caírem na cama\nDez maratonas de mestre deixaste-lhe em coma\nNa xona dela só deste negritude e testosterona\nNo dia seguinte já era oficial\nO acordo é bilateral vocês dois são um casal\nQuase que te esqueceste que tu tinhas namorada\nA Yola , a tua crioula, a tua neguinha, a tua amada\nNem quiseste saber, acabaste com Yola por telefone\nDeixaste-a incrédula, chocada, transtornada\nSem remorsos , tu agora és diretor\nA desfilar com tua loira e com o teu ar de superior\nDiana convidou-te pa’ conheceres os pais\n2 cotas cordeais que moravam nos Olivais\nOs cotas eram eleitores do PNR\nMas eles adoraram-te e foram mais que bestiais\n\n[Sr Cardoso (Pai de Diana)]\n– A minha filha é como a minha esposa , basta levares assim com jeitinho, que ela fica logo mansinha\n[Sr Cardoso, Vítor, Sra Cardoso]\n– (Risos)\n[Diana]\n- Oh pai, pare lá com isso!\n\n[Verso 2]\nO Ney o Djey, o Lameira e o Carvalho\nÀ sexta feira vão sempre apanhar-te no trabalho\nSempre que ‘tão juntos é aquele descontrolo\nEufóricos e enérgicos a falar em crioulo\nSempre expansivos como os jovens negros\nCom aquele apego de africanos nativos\nDepois do trabalho vão até ao bar do Francisco\nComer uns mariscos pa’ depois cair na disco\nE tu convidas sempre Diana pa’ essas noitadas\nMas ela responde sempre que ‘tá enjoada ou fatigada\nE tu ‘tás farto\n\n[Vítor]\n– Que é que se passa?\n[Diana]\n- Vítor, é assim, tens que perceber uma cena. Tens que perceber que a tua vida mudou. A sério Vítor a tua vida mudou, tu lutaste muito pa’ chegar até aqui. Epa, os teus amigos todos a virem-te buscar ao trabalho, todos mal vestidos, a falar crioulo, parecem um bando. Opah a sério, por amor de Deus !\n[Vítor]\n– O quê!? ‘Tás te a passar!?\n[Diana]\n- Olha das duas uma, tens que perceber uma cena! Ou continuas a ser o puto do bairro que anda nas tascas e frequenta discotecas chungas com os amigos, ou começas a comportar-te como alguém que vai ser director comercial de uma grande empresa percebes? Opah a sério, oh Vítor, A tua vida mudou!\n\n[Verso 3]\nUm administrador levou te pa’ um fim de semana em Alcoitão\nNuma vivenda quase mansão, tipo casa de sultão\nPiscina principesca, paisagem pitoresca\nDeu uma festa gigantesca , só com pessoal do cifrão\nAinda jogas-te golf, com todo aquele povo\nFim de semana de grande acção, a viver vida de barão\nUm acionista da empresa levou-te até Calcutá\nPa’ um hotel SPA glamoroso, do melhor que há\nParecia miragem, banhos e massagens\nCom mulheres de alta linhagem a prestarem-te vassalagem\nAgora sempre enfiado nesse mundo abastado\nTodo empinado pareces outra personagem\nQuando os teus manos convidam-te pa’ saíres à night\nTu negas não vais, e vais a festas da socialite\nQuando ‘tás com eles já nem falas em crioulo\nCriticas o que eles são, chamas os teus bros de parolos\n\n[Vítor]\n– Não , não, não meu , não vou falar crioulo, nigga não vou falar crioulo, não estou em Cabo Verde man, um gajo ‘tá em Portugal fala português!\n[Ney]\n– Nah mentira! A bô gajo crê ben da pa dodu?E sta dodo nha manu\n[Djey]\n- A bô mos!? A bô bu ca sta sabi nãu, bu ca ta fala criolo?\n[Vítor]\n– Portugal – português!\n\n[Verso 4]\nFaltam poucas semanas pa’ assumires o cargo de diretor\nJá se sente o esplendor do teu ânimo no teu interior\nJá tratas os teus colegas de forma diferente\nTodo prepotente, já te achas omnipotente\nA queres ser dominante, semblante pedante\nEstilo reinante já armando em tenente\nSempre com pose de gala como um cagão\nAté já andas e já falas à patrão\nJá pensas na casa e no carro que vais comprar\nNas férias que vais gozar na vida de ostentação\nAgora ris-te das chances que te negaram\nTrabalhos que te recusaram quando tinhas o melhor currículo\nRis-te do atendimento repartições públicas\nXenofobia rústica, de funcionários ridículos\nRis-te de quando foste à disco e foste barrado\nE de quando perseguido em shoppings e supermercados\n\n[Pedro]\n- Eu acho que o Vítor é a pessoa mais indicada para o cargo, isso parece racismo!\n[Sr Lourenço]\n- Isso não tem nada a ver com racismo Pedro! O director comercial tem que ir reuniões, tem que interagir com os nossos clientes, com os nossos parceiros e tudo tem importância!\n[Pedro]\n- Pois claro eu sei\n[Sr Lourenço]\n- Tudo tem importância!\n[Pedro]\n- Sim ninguém disse o contrário\n[Sr Lourenço]\n- Se eu tiver uma mulher como directora, estou a dar uma imagem à empresa. Estou a transmitir uma mensagem para a sociedade e estou a introduzir no departamento um modelo de chefia, um modelo comportamental e cultural...Se eu tiver um negro é a mesma coisa. As pessoas agem, reagem e interagem de forma diferente consoante o género, a raça e a idade das pessoas!\n[Pedro]\n- Claro\n[Sr Lourenço]\n- É assim, é psicologia!\n[Pedro]\n- Pronto\n[Sr Lourenço]\n- Resumindo, isto não é uma questão racial. Vamos abrir uma excepção na nossa política de contratação e vamos chamar alguém de fora para assumir o cargo de director comercial. Tenho dito!", "album": null, "image": "https://images.genius.com/1ec9a704e065eb4f5b2125cdfb6cd195.429x429x1.jpg"}]}