{"songs": [{"year": "2005-06-28", "image": "https://images.genius.com/989cba8a29e0880306781855e77f4a35.500x491x1.jpg", "title": "I Need a Friend", "album": "Hannicap Circus", "lyrics": "[INTRO]\nFuckin do this..\n{crash}\nFuck it!\n\n[Verse 1:]\n\"Susan! Make sure the door's locked!\"\nToo late, bitch, I done pulled the fuckin Glock\nHit you in the face with a mop and tied you up with socks\n\"Dial 9-1-1!\"\nBitch, I am a fuckin cop!\nI'm not a cop, I'm a fuckin' lieutenant\nFor the last two months, I been suspended\nSuspended, cause I love to shoot\nMale prostitutes\nI love to catch them walkin down Santa Monica Boulevard\nPut a nine to them, catch em off guard\nAny time of the day, I walk up to them and steal em\nGod hate fags, sent me here to kill em\nDon't reach for the phone, don't call for help\nI know you hate me, I fuckin hate myself\nI need someone to talk to, I'm glad you listen\nCause ten minutes from now\nI'll be in prison\n\n[Hook:]\nI need, someone, to listen to meee...\n(I'm fucking crazy)\nI need, someone, who cares about meee...\n(my wife is a slut)\nI need, a friend, I need, a friend\nI need, a friend, I need, a friend\n\n[Verse 2:]\n\"Aaaah!\" Shut up, bitch, before I shoot you\nThis fuckin' nine will fuckin' execute you\nYou're probably wonderin' why I'm in your house\nIt's a long story, just help me out\nSee, the story is that I'm a rapper that's tryna make it\nNow I'm a rapist, that's tryna take it\nYou like my chain? Bitch, don't break it\nMy mother gave it to me, it's kinda sacred\nI used to be a Catholic priest, now I'm livin' on the streets\nWanted for touchin' my little niece\nIt Started off, with my niece kissin' me\nW-where the fuck you goin', bitch? Listen to me\nAnd please believe she started with me first\nI didn't know she was a virgin and her booty hole would hurt\nStop starin' at the phone, you can't make a call\nI got your ass cheeks, nailed to the wall\nAnd I'm finally glad that the truth came out\nThis is the part where it ends, I blow my brains out {gun fires}\n\n[Hook]\n\n{gun fires}"}], "artist": "Bizarre"}