{"songs": [{"album": "Identity Crisis", "image": "https://images.genius.com/48c0cb108f652a1188a862412a81d930.640x640x1.jpg", "year": "2009-05-26", "title": "Identity 1: We Fell", "lyrics": "And they heard the sound of the LORD God walking in the garden in the cool of the day, and the man and his wife hid themselves from the presence of the LORD God among the trees of the garden. But the LORD God called to the man, and said to him, \"Where are you?\"\nHis story, meant to be the story\nHistory recorded at the start of every story\nChrist lost the culture, all for His glory\nTo display his power, now fast forward\nLet us make men in our likeness and in our image\nFor his glory, but through sin things got distorted\nI get the point when I watch Mory Poravich\nI am not the father, man, I have no control of this\nFlash black, front side of the tempting\nPicture the same cool breeze, sun dipped in\nThe service led is over, spittin' venom showed 'em\nEve flip flopped like some Japanese zorith\nAdam followed suit too, like he had four of these\nHands weeped we fold Satan backdoors these\nIdentity fades, it exceeds poorly\nNot lost, but stained at the cross for His glory\n\"So when the woman saw that the tree was good for food, and that it was a delight to the eyes, and that the tree was to be desired to make one wise, she took of its fruit and ate, and she also gave some to her husband who was with her, and he ate.\"\nWith fear and shame, mankind was overtaken\nEyes open wide and they saw they both were naked\nTraumatized they flee the scene like a driver that's been drinkin'\nSo in leaves as they leave, try and hide amongst the trees\nCuz they hear God comin' and like sinners they start runnin'\nAlready they confused and how they see God is blury\nFeel compel in the runners if they gonna get done in\nWith ease God speaks as he strolls through the breeze\nSeeking man out Asking him \"Where are You?\"\nCuz mankind is lost and his vision got marred too\nThe results of it all, the fall of mankind\nGod cursed the serpent plus the man in his pride\nPicture of the here and now, why people can't hear and now\nRejected by their sin and overwhelmed with the here and now\nCreated to be in His image, better showin' his glory\nReflectin' to the world 'til the end of His story"}], "artist": "Tedashii"}