{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/3f118b1526e105ef182b63cff9f08524.1000x998x1.jpg", "title": "Drama", "year": "2009-10-16", "album": "Elizabeth", "lyrics": "[Verse 1: Killah Priest]\nThe journey, peninsulas, states of a cruel emperor\nPay your tax or axes from the Knights Templar\nThe Anglo-Saxon of rapping, for me it gets extraneous\nMen to trust, put your ear to my paper while my pen discuss\nThe silent fall of a righteous kingdom, the cries of freedom\nThe scare speech of the boy king, would the crowd receive 'em?\nThe nervous Senator, would the people believe 'em?\nThe government getting dressed ready to deceive 'em\nThe lost and found, let us bury treasures in the ground\nEmpires sack, behead 'em with the crown\nThe Wilson sisters all of 'em drowned\nThe picture shows the image of a man leaving the swamp towards an old Church\nThat said, where ghost ones haunt\nThe kid writing his lyrics guided by spirits\nGod like appearance in armor, so light ya ganja\nThe persona of the music is horror\nWhen I write it's an honor, it conjures drama...\n\nIt conjures drama... (echo)\nDrama... (echo)\nIt's drama... (echo)\n\n[Verse 2: Killah Priest]\nI came back to where rap was first persecuted\nMade merciless music, more ruthless with murderers influence\nBut with a smooth kick, that  a church boy can groove with\nSo light up the L's, I build thunder in the skies over Hell\nAnd the oceans for the lost souls to go in\nWhen a hot coals take over their skin\nThe Omen's approaching, one Savior, one slogan\nOne prayer, one potion\nI'm in his layer, the slayer, here comes this goatman\nWhat type of life is this for a made star?\nMy A&R wishes to see me in the graveyard\nThe president of rap music put me in his radar\nHire goons to start shooting, but I'm a quasar\nPriest is smarter, if we kill him, he'll just be a martyr\nMy leg kneel, better take words aligning my chakras\nTried to get me like Michael Jackson\nA disciple of rapping, lyrics spin and slide\nWe'll walk a psycho with passion\nComma, contrast, Contra, dondra\nDrugs, llamas, tundra, it's drama...\n\nIt's drama... (echo)\n\n[Verse 3: Killah Priest]\nThe beast within eat at my skin\nCome out of my flesh, break through my neck\nBut what? The beast has something lurking in him\nIt searches through his limbs, it tears through his fur\nIt glances at the Earth, but what lies inside of it is something worst\nIt comes out of his hooves then runs in the woods\nHolding his stomach cuz his lungs feel full\nThan it howls like the wolves it burst open\nHere comes the shogun, I saw the piece to show men\nHe's golden, deep, speaks words exploding\nBlack ho's are born, wind-pool's form\nMeteor storms, Mars grows corn\nMonster man throw blows than grows horns\nMy words are tetrahydrocannabinol\nYour brain's the sword, I plant in you all\nChew feel the mouth like cannon balls\nI shoot at ya insanity walls\nAll ya vanity, humanity falls\nIt's just some thoughts for the marijuana\nJust some payback for your comma\nA shell to protect your armor\nI just call it drama....\n\nDrama... (echo)\nIt's drama... (echo)\nI just call it drama\nDrama... (echo)\nI write drama\nWhat made 'em write like this?\nIt's drama... (echo)\nWhat made 'em make beats like this?\nWhat makes 'em rock like this?\nI hold the mic like this! What!?!\nIt's drama... (echo)\nFrom the 2 - 0 - 0 - 1\nPriest!"}]}