{"artist": "C-Rayz Walz", "songs": [{"title": "Flip Philips & Chan from Japan", "album": "Off the Radar: Exclusive Lacerations", "year": "2003-09-25", "image": "https://images.genius.com/45bc71d58be69256a0b5f9c5f3abc51d.1000x1000x1.jpg", "lyrics": "[Intro: Flip Philips and C-Rayz Walz]\n[Flip Philips]\nSo I’m gonna take that from you.  So, 87.9 FM, WBAR, Barnard College Radio.  Umm, formerly Triad Radio.  Now it’s, uh, Flip Philips and Chan from Japan.  Shout out to [?].  Shout out to T-Ruckus coming up next work.  Shout out to End of the Weak.  MCs that are coming through next week as well.  I want to, um, introduce, um, C-Rayz Walz and 4th Pyramid.  4th Pyramid.  And we going to C-Rayz Walz who has no shoes on.  C-Rayz, you crazy, dog.  Where I could a C-Rayz Walz t-shirt?\n[C-Rayz Walz]\nY’all have never seen or [?].  I’m with my man 4th Pyramid (4th Pyramid on the cut).  We about to bring you our A-game and freeze this room.  You know what I’m saying?  So, yo, we’ve just been wiling with these headphones and shit.  [?].  This beat...\n\n[Verse 1: C-Rayz Walz]\nOh, high and dumb\nDon’t slip, but think about blasting off\nI wash my balls with your facewash cloth\nI’m dirty, grimy, been in the studio all week\nReminding myself I’ve got to write this song to match the beat\nI forget to brush my teeth\nIf you look at me smile, you could see a spinach leaf\nI’ll kick your cat, piss on your lawn\nSlap the shit out your dog and bite your moms\nBeginning at your pops’ foot\nThey come outside like I just took their pocketbook\nIn my underwear with my penis hanging out\nDrinking the Guinness stout, ready to get punched in my mouth\nThe police is too shook—they’ll never knock me out of my spot\nIt’s like Nelly to KRS—watch\nThese rhymes come out to clock\nI’m a good Ken Sport.  The DJ is [?]\nFlip off this click clack, big Benjamin Banneker watch\nHit you with the time and the shine like shots\nBursting nine life with the jigabytes and watch—I’m dirty\nDigging out my butt and give you a pound like\n“Yo, you trying to tell me that I’m nice?”\nPlus I’m sarcastic when I’m telling the truth\nAyyo, we two pairs of baddies coming to you\n\n[Verse 2: 4th Pyramid]\nAyyo, I’m like the homeless bastard\nKnown to overthrow, knowing disasters\nChrome to plaster.  Smack you in the face for no reason\nFlow beating.  See me, man?  I live in no seasons\nThe sun, the moon, the star, the tune\nThe man that’ll go to the bar and get drunk\nHigh and dumb like I was not able to home, trying to run\nYou on the fry.  Try and find wealth from the T Dot, the weed spot\nSee me in my underwear and Reeboks\nDoing absolutely nothing\nBut rapping\n\n[Verse 3: C-Rayz Walz and 4th Pyramid]\nA glutton eating over and over again\nI want my sandwich bigger than my pen\nAnd if the mic is cracking, I’m trying to sell you that\nGo to the GNC and see what’s cracking\nTell the titans who clashing\nAnd watch me sell ‘em rap.  I’m open\nFood-mashing, brood-bashing\nYour bar.  Asking a star\nTo buy a CD.  See me at double-D 19\nRhyme fiend.  Oh, my mind’s green\nIn front of Fat Beats, she’s like, “Yo, your flow’s fire.  Thanks”\nI’m say, “Ma, I don’t deal with chicks who eat Papaya Frank’s”\nPapaya Frank’s?  I’m, like, higher ranked\nWanna come down and see me?  Believe me\nI come out of bottles and smoke like the genie\nGoing outside, hitting the bong\nPiss in your dog face just ‘cause you my next-door neighbor\nMe and my girl ain’t getting along\nWe’re getting along\nI got you girl on her four knees, licking her thong\n‘Cause I’m disgusting filth\nTrust in MILF?  Me never\nNon-dairy, non-hairy\nOn the highway, leaving the block, driving like something’s killed\nY’all softer than shy guys with a sunken suit\nYou need to be something built\nIn a tank of asbestos with a humping quilt\nOh, man\nBut I’m not the Scottish\nPyramid man the moon to rock ish\nLike, “Oh my Lord, who got the hot ish?”  It’s\nKen Sport.  Coming through, my pen short\nIt’s not for long\nKnown to snuff a cop\nPiss in his pocket, snuffing him in his chin and\nShow him the Glock like, “What, bitch?  You owe me reparations”\nPut 41 through your back for fronting.  I’m dirty\nDirty.  Never fuck a chick with herpes\nYou heard me?\nPyramid spitting on Mars absurdly\nGot them looking back at me like, “Yo, you heard me?”\nYou heard he?  I’m like, “Word, G”\nI still try to kiss your moms even though she got herpes\nI’m tougher than your whole family.  Your whole generation pussy\nAnd none of y’all could hurt me or herb me\nHerb meat, you wanna come try and smack me, attack rapidly?\nArt of war.  What is it we argue for?\nI rock at war\nOf course I’m coming through without a [?]\nYou heard me?  I hope it’s that B Real ‘cause these Cypress Hills\nOf skills that’ll make me have to get blunted off krills\nBefore you finally admit you heard C\n“Insane in the Brain,” playing with membranes in my mind\nSo I make sure that you turn back your twine and intertwine\nWeave and wind, see the mind\nSee, this is why I’m about to eat that shit\nStop looking at my dick unless you ready to be the dick\nWith the rug, man, I will cock-slap you\nRock, rap to, got to ask you\nGet off me, police officer.  I will piss in your mother’s coffee\nYo, I will put my dick in your tea\nOn some tai chi shit\nOh my Lord, high beam me, see me spit\n“Angel and The Preacher”\n15 G’s on the CD—that’s what I wrote"}]}