{"songs": [{"title": "Professional Rapper", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro: Lil Dicky & Juanita]\nHello, how can I help you?\nHi, my name’s Dave Burd. Uh, I have an appointment today\nIt’s probably under \"Lil Dicky\", actually. I’m a… I’m a rapper, so…\nOkay, and who are you here to see?\nUh, Snoop Dogg? Says here \"Snoop D-O-G-G\"\nOh, yeah. He’s right down the hall. First door to your right\nGive him a knock and he should be right with you\nThanks. It’s uh, this door right here, right?\nMm-hmm\nThank you\n\n[Verse 1: Lil Dicky & Snoop Dogg]\nGrab a seat\nThanks, I’m Dave, very nice to meet\nDave, what it do? You can call me Dogg\nLet me just check your sheet\nNo problem, sir, let me just say\nI’m a big fan of the shit that y’all make\nI can’t lie, I been thinking about this all day\nAll good, there’s a reason that we called, Dave, let me start with your background, where you come from?\nSure, I was undergrad down there in Richmond\nBefore that\nOh, you talking 'bout my hometown?\nYeah\nI was born out of Philly grew up in a little silly old town called Cheltenham\nIt was in the suburbs, upper-middle wealth around\nSo real shit you ain’t never had to struggle for much\nI wouldn’t say it like that, we just had a different kind of trap\nElaborate\nWell I ain’t never had a tool, but I had to be the man at school\nLike I was doing shit I had to do so when I finished undergrad, I’m cool and I can get whatever job I wanted\nBut the job you wanted wasn’t all that bumping\nYeah, and I saw it quick all the flaws that be coming when you grow up like that\nWhen you been racing them rats, you ain’t been making them raps\nBoo-hoo what a hardship\nHow you paid to get the rap shit started?\nMan, my Bar Mitzvah money\nBut don’t diss me buddy, I wasn’t one of them youngins up on the block who had nothing to lose\nI must’ve wanted this a lot, I had something to choose\nHa, look at that, I can say there’s something to prove up in your ass\nYeah, I guess\nThat’s enough of the past, what makes you want to do rap?\nOh my God, it’s the best\nBitches let me draw up on their breasts\nLiterally, I can reinvent myself, I get a forum to project myself\nIt’s never boring, every morning I wake up and try to best myself\nI never got to be suppressed or stealthy to express myself\nIt’s kinda healthy\nCool, now let me put you through a couple hypotheticals\nSure\nIn a club and a couple niggas threaten you\nUh, I wouldn’t do shit\nAnd I don’t even get what that got to do with this?\nShut the fuck up, rap's like life\nIf you wanna do this, then you won’t get far acting like a little bitch\nNah, that’s my niche!\nDon’t get offended by this, but that’s the market y’all missed\nThat’s the target I’ll hit\nAnd that’s the heart of my pitch\nI wanna do this whole thing different\n\n[Bridge: Lil Dicky & Snoop Dogg]\nWhat the fuck you mean you wanna do the whole thing different?\nUh, you know, I-I think, like, you know\nTraditionally people have been doing the job, uh, you know, the same kind of way for a long time\nBut traditionally speaking, this shit works, right?\nNah, like, I get that, but I-I just think like, you know\nYou don’t know if it could be working even better\nAnd I think you should look at me as an opportunity to find that out\nI don’t mean any disrespect by that\nI’m just saying I have a different background\nLike a different perspective way of looking at things than your typical applicant\n\n[Verse 2: Lil Dicky & Snoop Dogg]\nSo what are your biggest strengths?\nWell my flow is crazy, I can switch that amazing\nFor example, I can be like ain’t nobody fucking with Lil Dicky\nWhen he get up on that shit and spit it sick and ridiculous\nRipping this shit like it’s never been did and the rhythm is never predictable\n'Cause I can switch it, deliver this shit in whatever cadence you bitches prefer\nAll right, all right, I get it\nTop of that, lyrically I’m pretty damn clever (Go)\nGot a long bottom bitch, call the ho Neville (Whoa)\nAnd I blow it from the jump, Derrick Rose knee (Oh)\nYou can say I’m pretty smart how I know better\nAnd y’all been winning like Pistorius, it’s no feat\nBro, I can go on and on\nI’m taking over and they mad like father-in-laws\nOkay enough of the punchline, that ain’t showing me you different than the other guys\nWell I don’t know if they can run it like that\nBut ain’t nobody else doing funny type rap\nWhat’s that?\nWell I can tell a story about my morning\nWatching Boy Meets World and jerking off to Topanga Lawrence\nLike the 14 year old Topanga\nOh this shit like a joke to you? I don’t get it\nNah it ain’t like that I just happen to be a nutty abundantly funny type of individual\nLike, as a guy, so when I get up on the mic I ain’t finna just lie\nReal recognize real, right?\nYeah, I guess... so what you tryna do\nFive years from now, tell me 'bout the dude\nWell, I don’t care about the money\nLike, it’s the respect that I’m wanting\nHonestly, I just want to be one of the greats\nWhere they gotta bring your boy up every debate\nI don’t wanna leave the game the same\nIn a nutshell, what’s your legacy?\nWell, I wanna be the dude that came in and made the stand-up rap\nPut the random rap in demand like that for the people that was anti-rap\nYet, the fans of rap start to recognize that anti-rap\nIs ironically one of the real brands of rap left\nThat shit sound pretty damn complex\nI guess, I wanna be the best\nI just wanna do it my way\nAnd turn the whole game sideways\nAnd show people you ain’t gotta be resigned to the highway\nYou can make a path while these motherfuckers drive straight\nI ain’t mad at that\nWell thanks, man, that’s my plan of my attack\nJust let me in and I’ma rap the plaques\nAnd I ain’t about to win them back to back\nI’m 'bout to win them like it’s back to back to back to back to back\n'Til I stop rapping\nYou ain’t even sold a damn album yet, true\nThat’s a lot of talk from a wily vet\nLet alone a young rook nigga\nYou misread me\nNah this ain’t a book nigga\nWell that’s one of my flaws, I’m too competitive dawg\nNo, you just fucking repetitive dawg\nI get it, you trying to be better than all, but you ain’t shit until cheddar's involved\nI get that I gotta prove myself\nNo shit you ain’t done shit\nThink about that though\nOnly doing this a couple of years\nOne tape and I’m like this?\nThis shit is aight for your first shit\nBut you don’t know if it’s your worst shit\nYou don’t think finding out would be worth it?\nIt might be, it might not\nBut I’ma put your ass to work, kid\n\n[Bridge: Lil Dicky & Snoop Dogg]\nWait, like, like I have the job? Like really?\nWell one more thing, let me see if you could put a hook together\nWhat would you do for the hook for this song?\nUh, you want me to make a hook up right now?\nDo I look like the type of nigga that like repeating himself?\nAll right, uh, okay\nMan do the hook!\n\n[Chorus: Lil Dicky & Snoop Dogg]\nI’m 'bout to be professional\nHomie, I’m professional\nUh, maybe like a low voice type thing?\nNigga, that shit is garbage man\nWell, you know, I feel like there might have been some upside to it\nBut I’m not good at thinking of things on the spot like that\nDon’t y’all normally like outsource for that kind of thing sometimes?\nSometimes, but you know, that was some next level Dogg shit right there\nYeah, you know, I’m just way better when I get to think things through\nHave my like that dual screen action that type of thing\nWhatever man, you tryna smoke a blunt?\nRight now?\nYeah\nSure\n\n[Outro: Lil Dicky, Snoop Dogg & Juanita]\nDope. Juanita, bring some weed in here, please. Thank you\nYou got it, Snoop. I’ll be right there\nThanks, Juanita. Super nice woman\nNigga, why does everything you say sound so soft?\nUh, I really don’t wanna be spoken to like that, so…\nPfft, yeah, whatever. Thanks\nHey, I got y’all y’all weed\nDamn, that’s some great looking weed. It’s just so early\nCan I get you guys anything else while I’m here? Coffee? Tea? Head? Bottled water?\nD-Did you just say head?\nYeah. You ain’t never got no head before?\nI mean… Just feels like… A lot, right now\nOkay\nBut what kind of tea do you guys have?\nWe got mint, raspberry, Earl Grey, English Breakfast...\nActually, I’ll take head\nI knew your little dirty ass wanted some head"}], "artist": "Lil Dicky"}