{"artist": "B.G. Knocc Out", "songs": [{"album": "Eazy-E’s Protege", "title": "N My Prime", "lyrics": "[Intro]\nYo E, it's Knocc Out homie\nDamn, I ain't seen you like this one, nigga\nFuck, damn man, shit\nI just want you to let y- *flatline sound*\nOh fuck, E! E! Man what the fuck\nEy nurse! Nurse! Oh shit! Oh shit!\nMotherfucking nigga, man (shit)\nI just want you to let you know homie I love you, man\nWill carry your legacy nigga, I'ma keep you alive\nNo matter what! I got you! I got you homie\nIt's all Compton, I got you\n\n[Verse 1]\nI was in the studio with E the day his lungs collapsed\n9 days later he died, I said I'm done with rap\nBack in the hood, banging with my gungster clap\nMoving work, doing dirt and having fun with that\nTill they put me on the charge and now I'm facing the (j)ail\nCounty jail main line, now I'm pacing a sale\nGoing back and forth to court till I got convicted\nTen years with 85 mins man this shit is ridiculous\nCorking his main line, I'm thinking it's game time\nGot school real quick so I think with the same mind\nThe gang violence and riots have got me fed up\nBut through it all stand tall so I walk with my head up\nThinking back when I was whiling putting hammers to jaws\nNow I'm in the prison mosque, I'm handling law\nDoesn't matter where y'all, the highest pop rapper rock star\nKeep God first cause only he is Akbar\n\n[Chorus]\nWho can make the hoes go crazy at a show? (ME)\nWho was never ever scared to beef with the Row? (ME)\nWho was still in school but traveling getting dough? (ME)\nBarely in my prime and y'all saying I'm OG? (Hell nah)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life), I'm a BG (for life)\n\n[Verse 2]\nWhen my big homie went out, he didn't deserve it\nTryna say he died of AIDS but Easy was cold murdered\nI filtered all the bullshit with my third iris\nFull blown AIDS but Tomica ain't got the virus (hmm?)\nOn his deathbed a lawyer was hired\nA few days prior Jerry Heller was fired\nSee I'm guided by God, you can't suck at me\nCan't put it altogether but I smell a bunch of fuckery\nNo ones in immortal 'cause we all got a day\nAnd if there is a price then we all gotta pay\nIt's funny when you think, I think y'all got a way\nI just pray you go to hell and that's all I gotta say\nI'm from the same city from the same pedigree\nNever will his name die I'ma carry his legacy\nThe very reason while I'm stomping on the track\nAnd the very first to do it, he put Compton on the map (Yeah)\n\n[Chorus]\nWho can make the hoes go crazy at a show? (ME)\nWho was never ever scared to beef with the Row? (ME)\nWho was still in school but traveling getting dough? (ME)\nBarely in my prime and y'all saying I'm OG? (Hell nah)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life), I'm a BG (for life)\n\n[Verse 3]\nI love city bread, original west side\nI am the Compton, with big ears to Bed-Stuy\nA place would sock a, motherfuckers end up dead why?\n'Cause they want beef so we be letting that lead fly\nEven with all the corruption and daily casualties\nYou gotta admit it my city's got personality\nPhilly had Doc J, we got Doc Dre\nIf you still ain't convinced check Tayshaun Prince\nAlma said it's whiley, a Brandon Jennings\nLike Venus and Serena came from humble beginnings\nNot to mention all the spitters with these daily mics\nTiny Lister and Anderson, Leslie Sykes\nMayor Omare looking duggie with his suit on\nStafon Johnson on the court getting his swoop on\nTry to do good even though we do wrong\nRappers claiming they hood, who you think put you on?\n\n[Chorus]\nWho can make the hoes go crazy at a show? (ME)\nWho was never ever scared to beef with the Row? (ME)\nWho was still in school but traveling getting dough? (ME)\nBarely in my prime and y'all saying I'm OG? (Hell nah)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life) Ol' BG (for life)\nI'm a BG (for life), I'm a BG (for life)", "image": "https://images.rapgenius.com/fe0de3059aaf02131706ef9c8902e493.800x800x1.jpg", "year": "1995-06-02"}]}