{"songs": [{"image": "https://images.genius.com/b18964ef5b69e49e31ce590e8ed6ecd5.1000x1000x1.jpg", "lyrics": "[Intro: CUFBOYS & CUFBOYS' Mom]\nSo what's your opinion on Ugly God, mom? A lot of people have wanted me to do that\nThi-This two videos we just saw?\nYeah\nOh, good luck to him, because whatever he made off that is not gonna be, no\nThanks Ugly God, thanks Ugly God, thanks Ugly God, thanks Ugly God\nWhat you mean?\nHe's not gonna make any more. That was terrible\nHahaha\nI mean, I'm pretty open-minded, so I like some of these people. I think they have a future. This guy. Number one, he's not that attractive. Number two, he's not! I mean, he's just not that attractive! And then all is he wants to sing about is dumb stuff, almost like, bo-. I don't know how to even say it, he's singing like pornographic stuff, and who just wants to see I mean, I guess if he has an audience for it, good luck. I would never listen to that. And I'm, I mean I like to..\nSo it's a no? Final opinion on Ugly God?\nOh yeah, no, no, no, no, no, no, no, no. No, no, no. No, no, no. He's one of the worst you have shown me\nThanks Ugly God, thanks Ugly God, thanks Ugly God, thanks Ugly God, thanks Ugly God\n\n[Verse]\nI spent that check on my neck\nI got yo bitch drippin', she wet (Drip)\nNigga, please don't disrespect\nMy niggas, they grippin' them TECs (Pew pew pew)\nI pull up and pick up that check\nI go to yo crib, put my dick in yo sister\nYo bitch on my line, I pull up and I drill her\nDon't D.M. me, nigga, don't hit me on Twitter\nDamn, I am the G.O.A.T, admit it (Yeah)\nI fuck on yo bitch 'cause she with it\nThese niggas so broke, I don't get it (The fuck?)\nI need me a milli', let's get it (Ayy)\nI always say I need a milli' (Ayy)\nI probably won't stop 'til I cop me a milli' (Ayy)\nWhen I touch a milli', I'll cop me a Bentley (Ayy)\nSo let me stack up 'cause my pockets look empty\nYou niggas and bitches irrelevant\nI need me that check, I pay hella rent\nMy pockets thicker than a elephant\nI do this rap shit for the hell of it\n2016, bitch I coulda been President\nBitch I'm the shit, I came up and it's evident\nDon't call me brother, no we are not relatives\nYou niggas are snakes, yuh (Snakes)\nThese bitches is fake, yuh (Fake)\nI see that you hate, yuh (Bitch)\nI count up this cake, yuh (I run up that cash)\nYou savin' these hoes, lil' nigga (The fuck?)\nI cannot relate, yuh (Cannot relate)\nBut get you a cape, yuh (Yuh)\nSay hey to my tape, yuh, bitch\n\n[Outro]\nThanks Ugly God, thanks Ugly God, thanks Ugly God, thanks Ugly God", "title": "Welcome to the Booty Tape", "year": "2017-08-04", "album": "The Booty Tape"}], "artist": "Ugly God"}