{"songs": [{"image": "https://images.genius.com/d51e86578df25f696ad430beed4f0415.500x500x1.jpg", "year": "2008-11-01", "title": "A Raisin In The Sun", "album": "40 Days & 40 Nights", "lyrics": "[Verse One]:\nLook\nWhat happens to a dream deferred?\nDoes it dry up and go away like leaves and herbs?\nHis mother says the meanest words\n\"Why you trying to write a script nigga?\nYou know you'll never leave this curb.\"\nWhen your own mother's nothing to you\nYou got nothing to lose\nAnd it's sad that she's a customer too\nWhy you dealing what you dealing with is something to prove\nTo a lot cause this block ain't a comfortable view\nBut he sits there in his chair with nothing to do\nWith an idle mind going idol wild out in his room\nHe had a pretty good plan he was trying to pursue\nSave the dough for a camera in a box with his shoes\nHis mom came in his room for his stash found the dough\nTook it took the corner make her ass overdose\nNow where should he go?\nThe ending always feels like the beginning of the road\nBut I know\n\n[Hook]\nI'mma keep going cause I think that I'm the one\nAnd I'mma be more than just a raisin in the sun\nI know, I know, I know, I know\nYeah I know, I know, I know, I know\n\n[Verse Two]:\nOn an uncomfortable couch in a meeting room\nWaiting for an A&R that I should be seeing soon\nThe assistant starts to lead me to him\nI swear dude was who storm? I was already seeing through him\nI won't say the exact label that I was up in\nI'll just say that they are no longer running\nBumping, Complex, Boy From Kansas thumping\nHe ain't paying attention, adrenaline is jumping\nBringing up artists to me that I think are nothing\nNodding his head, eyes red, I think this nigga's fronting\nAll of my pride is sunken all of my swag is gone\nHe acting like I'm nothing, he ain't feeling the songs\nAt that point I could leave it alone\nI should be packing my bags, I should be headed back home\nThat's when you think about the choice that you making\nAnd I said, \"This is one voice you ain't taking.\"\nThe raisin\n\n[Hook](x2)"}], "artist": "XV"}