{"artist": "B-Legit", "songs": [{"album": "Hempin’ Ain’t Easy", "title": "Rap Star", "lyrics": "[B-Legit]\nTrue worldwide player, got the game on lock\nSpendin' money, flippin' drops like I still slang rocks\nStill hit the blocks, light blunts when I swerve\nI do the speed limit cause I'm twisted and perved\nHoes got the nerve, to turn they head and switch\nLike they didn't see me comin' in that big black 6'\nBitch please, I hit the horn when I pass\nGot the homie out the window tryin' to rub on yo' ass\nNow peep the S-Class, Rolex Platinum\nAnd now you wanna come with the question askin'\nDo I ballplay? Yeah I play for the Jets\nHillside, with money like Kevin Garnett\nNow can I get it wet? She say it's drippin' with juice\nAnd what I gotta do to ride the V-1-deuce?\nSit yo' ass on my leather, and rub on my wood\nSee we got notches in Cali, plus that pussy be good\n\n[Hook]\nBitch I'm a motherfuckin' rap star\nGorilla milk, B-La blunts and the caviar\nBitch I'm a motherfuckin' rap star\nGorilla milk, B-La blunts and the caviar\n\n[Lil' Bruce]\nI tell a bitch I ain't got no motherfuckin' money and laugh like it's funny\nPoppin' my Movado, sittin' low in a Eldorado, sippin' on a bottle\nPimp drunk 'til the sun come up, sleep behind Denny's on Sunset\nSweatin' bitches about my money cause the album ain't done yet\nBitch I'm a motherfuckin' rap star, get the fuck away from my car\nAnd hell nah you can't hit this weed, bitch walk 'til your ankles bleed\nPut the paper in my pocket please, she love the way I pop my P's\nI love the way she knock them G's like slangin' rocks in '83\nI'm a pimp slash rapper like my cousin Mac the Most, slap a ho like me\nAnd never talk for free, nigga can't you see?\nIt's for the money and the fame, and I see my money comin'\nWith the vice on her ass in her high heels comin' around the corner runnin'\nI ain't trippin', I'm so cool, I'll pop the trunk of the Northstar\nAnd the bitch jump in and I'll sip my gin and smash off like a rap star\n(Bitch I'm a motherfuckin' rap star, Lil' Bruce in a '99 Northstar)\n\n[Hook] - X 2\nBitch I'm a motherfuckin' rap star\nGorilla milk, B-La blunts and the caviar\nBitch I'm a motherfuckin' rap star\nGorilla milk, B-La blunts and the caviar\n\n[B-Legit]\nBitch I'm a turf boy, we don't fuck at the house\nI'm to the cover suites, to put this dick in your mouth\nI'm on my paper route, can you contribute to that?\nAnd if not, can you send your homegirl for a sack?\nThe \"Highest Niggas In The Industry\", Smoke-A-Lot with Yuk'\nBossalini, you see me, I gives a fuck\nStick 'em til they stuck, when the crap game starts\nI was told to have money, have heart\nI'm puttin' houses on the hill worth a million or more\nMarble on the floor with the french wood doors\nI flipped a old school, and still slang that\nGot the guns in the trunk, you don't want no funk\nI'm on a money mission, slangin' verse for verse\nSome premeditated and the others rehearsed\nI got the thirst, so bring it on like Sprite\nAnd we can make some shit tonight, beotch\n\n[Hook] - X 2\nBitch I'm a motherfuckin' rap star\nGorilla milk, B-La blunts and the caviar\nBitch I'm a motherfuckin' rap star\nGorilla milk, B-La blunts and the caviar", "image": "https://images.genius.com/8c2ee1e85ca6b68c98af71fcc87d2721.594x594x1.jpg", "year": "2000-07-25"}]}