{"songs": [{"year": "2007-02-13", "image": "https://images.genius.com/60504aa162f172d99eba2d28b67bb243.549x549x1.jpg", "title": "Bring it On", "album": "And Justus For All (Hosted by Mick Boogie)", "lyrics": "[Rapper Big Pooh]\nYeah...muh'fuckin Rapper..\nH-O-J..\"Soldiers of Fortune\" coming soon..\nYou muh'fuckas still think this shit's sweet\nHeh - uh..\n\nYou silly niggas must got it confused, thinkin I'm gon move\nOr readjust my stance I got nuttin to lose\nMuh'fuckas think they better cause they frontin with jewels\nLook a lil' green nigga, tell me where's your blues (OW!)\nI'm bad news; preach sermon minus the pews\nYou listenin close checkin for clues\nI'm lookin for cues, eight-bar corner pocket Cash Rules\nYou don't wan' it wit me, dude\nI bring back two for everyone that you lay\nYou're now standin on sankin ground and them boys don't play (nope)\nRevolutionary like 'Shea, bitches gettin funky\nOn Pooh cause I said, \"Not today\"\nWon't break neck or go outta my way\nNever one to bite tounge, won't regret when I say, \"I'm the best\"\nKeep fam close to the vest, attack rap like a full court press\nPress pause, on mediocre niggas spit spark, showin flaws\nYour shit don't burn like ours, I'm military pressin these bars\nI saw your life flashin not closing cars\nI'm talkin bout your broad, nigga pannies and bras\nPay homage when you in a presence of stars.. and here we are\n\nShout out to Cleveland...\nShout out to Mick Boogie...\nThe whole state of Ohio...\nShout out to Sandusky...\nThat's for my nigga DJ Flash...\nYeah.. Shout out to Ray Cash...\nHe puttin Cleveland back on the map y'all..\nCHEA!\n\n[Ray Cash]\nI got it from here Pooh, damn (OW!)\nYou see the world is made up of the half the have-nots (nots)\nMe and my niggas from the other half of the haves\nSeein life through the eyes of a ol time\nWhen my rhymes was reminder where all these other niggas'll still hustle\nThey need muzzles, dog they woof the heart\nFigure I'll let 'em live, now later I whoop 'em hard\nY'all I swear to God, God I swear to D\nSome niggas G, but other niggas don't compare to me\nThey ain't my pedigree, we ain't the same breed\nWe have nothing in common, not even the weed\nSee this shit that I'm smokin, not even seed\nTake a hit of this and mybe you could be just where I be\nUntil then , you niggas know they gang I claim\nRecognize Bill St. Gang (do the damn thang!)\nChea! It's no place like home, I return wit'out Toto (wit'out Toto)\nHad to turn away when Tony killed Minolo (uh)\nIf you remembered the beef then you should remember the speech:\nLive life like a boss, a man dies on his feet\nFrom the cradle to the grave where my regrets I should suffer\nFrom now until then, I murder for my Little Brother\nSo, bring it on if you think you could hang\nBut if not then let me do my thang, yeah..\n\nMount, high, as, a mutha-fuckin, kite, holla\nRay, Will, chill, Mick, Boogie\nLil', Brutha, Ray, Cash, OW!"}], "artist": "Rapper Big Pooh"}