{"artist": "Post Malone", "songs": [{"album": "beerbongs & bentleys", "title": "​​rockstar", "image": "https://images.genius.com/a73b0787a1c05fcbb7ef0e92128ab8f0.1000x1000x1.jpg", "lyrics": "[Intro: Post Malone]\nHahahahaha\nTank God\nAyy, ayy\n\n[Chorus: Post Malone]\nI've been fuckin' hoes and poppin' pillies\nMan, I feel just like a rockstar (Star, ayy, ayy)\nAll my brothers got that gas\nAnd they always be smokin' like a Rasta ('Sta)\nFuckin' with me, call up on a Uzi\nAnd show up, man, them the shottas ('Tas)\nWhen my homies pull up on your block\nThey make that thing go grrra-ta-ta-ta (Ta, pow, pow, pow, ayy, ayy)\n\n[Verse 1: Post Malone]\nSwitch my whip, came back in black\nI'm startin' sayin': \"Rest in peace to Bon Scott\" (Scott, ayy)\nClose that door, we blowin' smoke\nShe ask me light a fire like I'm Morrison ('Son, ayy)\nAct a fool on stage\nProlly leave my fuckin' show in a cop car (Car, ayy)\nShit was legendary\nThrew a TV out the window of the Montage\nCocaine on the table, liquor pourin', don't give a damn\nDude, your girlfriend is a groupie, she just tryna get in\nSayin', \"I'm with the band\" (Ayy, ayy)\nNow she actin' outta pocket, tryna grab up on my pants\nHundred bitches in my trailer say they ain't got a man\nAnd they all brought a friend (Yeah, ayy, ayy, ayy)\n\n[Chorus: Post Malone]\nI've been fuckin' hoes and poppin' pillies\nMan, I feel just like a rockstar (Star, ayy, ayy)\nAll my brothers got that gas\nAnd they always be smokin' like a Rasta ('Sta)\nFuckin' with me, call up on a Uzi\nAnd show up, man, them the shottas ('Tas)\nWhen my homies pull up on your block\nThey make that thing go grrra-ta-ta-ta (Ta, pow, pow, pow)\n\n[Verse 2: 21 Savage]\nI've been in the Hills fuckin' superstars\nFeelin' like a popstar (21, 21, 21)\nDrankin' Henny, bad bitches jumpin' in the pool\nAnd they ain't got on no bra (Bra)\nHit her from the back, pullin' on her tracks\nAnd now she screamin' out, \"¡No más!\" (Yeah, yeah, yeah)\nThey like, \"Savage, why you got a 12 car garage\nAnd you only got six cars?\" (21)\nI ain't with the cakin', how you kiss that? (Kiss that?)\nYour wifey say I'm lookin' like a whole snack (Big snack)\nGreen hundreds in my safe, I got old racks (Old racks)\nL.A. bitches always askin', \"Where the coke at?\" (21, 21)\nLivin' like a rockstar, smash out on a cop car\nSweeter than a Pop-Tart, you know you are not hard\nI done made the hot chart, 'member I used to trap hard\nLivin' like a rockstar, I'm livin' like a rockstar (Ayy)\n\n[Chorus: Post Malone & 21 Savage]\nI've been fuckin' hoes and poppin' pillies\nMan, I feel just like a rockstar (Star, ayy, ayy)\nAll my brothers got that gas\nAnd they always be smokin' like a Rasta ('Sta, yeah, yeah, yeah, yeah)\nFuckin' with me, call up on a Uzi\nAnd show up, man, them the shottas ('Tas)\nWhen my homies pull up on your block\nThey make that thing go grrra-ta-ta-ta (Ta, grrra-ta-ta-ta-ta)\n\n[Outro: Post Malone]\nStar, star, rockstar, rockstar, star\nRockstar\nRockstar, feel just like a rock–\nRockstar\nRockstar\nRockstar\nFeel just like a...", "year": "2017-09-15"}]}