{"songs": [{"album": "4 Your Eyez Only", "year": "2016-12-09", "title": "4 Your Eyez Only", "image": "https://images.genius.com/e8867c7f0c8a290e03aaa2fbc804fdbf.600x600x1.jpg", "lyrics": "[Intro: J. Cole]\nYeah (For your eyes)\nFor your eyes only (For your eyes)\nFor your eyes only, for your eyes only\n(For your eyes, for your eyes)\nFor your eyes only\n\n[Verse 1: J. Cole]\nHey, niggas be dying on the daily\nIt seems my dreams faded for far too long\nThe consequences deadly\nCan't visualize myself as nothing but a criminal\nControl the block, serving up rocks and stay subliminal\n'Cause young niggas is hardheaded, they letting off\nFull of adrenaline, ignorant to what death can cause\nAin't no coming back, family dressed in black\nPlus it's hot now, the cops outside, it's hard to flip a pack\nAnd my daughter gotta eat, her mama be stressing me\nLike I ain't the one who put them Jays on her feet\nLike I ain't out in the field like that\nI might be low for the moment but I will bounce back\nDespite the charges, back to the wall, I fight regardless\nScreaming, \"Fuck the law,\" my life is lawless\nThat's what you call it, ain't got to be no psychic\nTo see this is like the farthest thing from heaven\nThis is hell and I don't mean that hyperbolic\nI try to find employment even if it's wiping toilets\nBut these felonies be making life the hardest\nResisting the temptation to run up and swipe a wallet\nOr run up on your yard, snatch your daughter bike and pawn it\nThat's why I write this sonnet\nIf the pressure get too much for me to take and I break\nPlay this tape for my daughter and let her know my life is on it\n(For your eyes) Let her know my life is on it\n(For your eyes) For your eyes only\n\n[Hook: J. Cole]\nFor your eyes, do you understand?\nFor your eyes, do you understand me?\nFor your eyes, do you understand?\nFor your eyes, do you understand me?\nFor your eyes, do you understand?\nFor your eyes, do you understand me?\nFor your eyes, do you understand?\nFor your eyes only\n\n[Verse 2: J. Cole]\nYou probably grown now so this song'll hit you\nIf you hearing this, unfortunately means\nThat I'm no longer with you in the physical\nNot even sure if I believe in God but because you still alive\nHe got me praying that the spiritual is real\nSo I can be a part of you still, my pops was killed too\nSo I know how part of you feels\nMaybe you hate me, maybe you miss me, maybe you spite me\nLife goes in cycles, maybe you'll date a nigga just like me\nI hope not, I'm tired of dope spots\nAnd fiends that smoke rocks\nI've seen far too many niggas' hopes rot\nI'm writing this because me and the devil had a dance\nNow I see death around the corner, 'pologizing in advance\nDon't know if I ever had a chance\nAt a glance, I'm a failure\nAddicted to pushing paraphernalia\nBut Daddy had dreams once, my eyes had a gleam once\nInnocence disappeared by the age of eight years\nMy Pops shot up, drug-related, mama addicted\nSo Granny raised me in projects where thugs was hanging\nBlood was staining the concrete\nOlder niggas I loved talked like they was above\nMaintaining a timesheet, that's slow money\nPicked up the family business by the age of 13\nSix years later was handed sentence\n'Round the same time is when you came in this world\nMe and your mama thinking:\n\"What the fuck we naming this girl?\"\nI told her \"Nina,\" the prettiest name that I could think of\nFor the prettiest thing my eyes had ever seen, I was 19\nTook me two felonies to see the trap\nThis crooked-ass system set for me\nAnd now I fear it's too late for me to ever be\nThe one that set examples that was never set for me\nI'm living fast, but not fast enough\n'Cause karma keeps on catching up to me\nAnd if my past becomes the death of me\nI hope you understand\n\n[Hook: J. Cole]\nFor your eyes, do you understand?\nFor your eyes, do you understand me?\nFor your eyes, do you understand?\nFor your eyes, do you understand me?\nFor your eyes, do you understand?\nFor your eyes, do you understand me?\nFor your eyes, do you understand?\nFor your eyes only\n\n[Verse 3: J. Cole]\nIt's several ways I could've went out, too many to count\nWas it the trigger happy crackers that the badges give clout?\nWas it the young niggas, blasting frustrated\n'Cause the cash running out?\nNiggas don't know how to act in a drought\nSee, baby girl, I realized\nMy definition of a real nigga was skewed\nMy views misshaped by new mixtapes\nThat confirmed the shit I learned in the streets was true\nThat real niggas don't speak when they beef with you\nThey just pull up on your street, let the heat achoo\nAnd if a real nigga hungry, he gon' eat your food\nI was a fool, spent all my time ducking school, ducking cops\nDucking rules, hugging blocks that don't love you\nI pray you find a nigga with goals and point of views\nMuch broader than the corner, if not it's gon' corner you\nInto a box, where your son don't even know his pops\nAnd the cyclical nature of doing time continues\nMy worst fear is one day that you come home from school\nAnd see your father face while hearing 'bout tragedy on news\nI got the strangest feeling your daddy gonna lose his life soon\nAnd sadly if you're listening now it must mean it's true\nBut maybe there's a chance that it's not\nAnd this album remains locked\nIn a hard drive like valuable jewels\nAnd I can teach you this in person\nLike I'm teaching you to tie your own shoes\nI love you and I hope to God I don't lose you\nFor your eyes only\n\n[Hook: CharGaux & J. Cole]\nFor your eyes, for your eyes only\nFor your eyes, for your eyes only\nFor your eyes, do you understand?\nFor your eyes only\n\n[Verse 4: J. Cole]\nOne day your daddy called me, told me he had a funny feeling\nWhat he'd been dealing with lately, he wasn't telling\nI tried to pick his brains, still he wasn't revealing\nBut I could feel the sense of panic in his voice\nAnd it was chilling, he said:\n\"Jermaine, I knew you since we was children\nI never asked for nothing, when times was hard\nI never had discussions with you, begging you to help me\nI dealt with the repercussions of my actions\nI know you tried to steer me 'way from that shit\nBut that shit was in my blood, you know my life\nI know your momma, nigga, send my love\nIn case I never get a chance to speak again\nI won't forget the weekends spent sleeping at your crib\nThat's the way I wished my family lived\nBut my granny crib was in the 'jects\"\nI had to interject like:\n\"Nigga, what you talking 'bout? Fuck is you getting at?\"\nHe said, \"Listen, I got no time to dive into descriptions\nBut I been having premonitions\nJust call it visions from the other side\nI got a feeling I won't see tomorrow\nLike the time I'm living on is borrowed\nWith that said, the only thing I'm proud to say, I was a father\nWrite my story down, and if I pass\nGo play it for my daughter when she ready\"\nAnd so I'm leaving you this record, for your eyes only\nDon't you ever scratch or disrespect it\nThis perspective is a real one, another lost 'Ville son\nI dedicate these words to you and all the other children\nAffected by the mass incarceration in this nation\nThat sent your pops to prison when he needed education\nSometimes I think that segregation would've done us better\nAlthough I know that means that I would never\nBe brought into this world 'cause my daddy was so thrilled\nWhen he found him a white girl to take back to Jonesboro\nWith lil' Zach and Cole World, barely one years old\nNow it's 30 years later, making sure this story's told\nGirl, your daddy was a real nigga, not 'cause he was cold\nNot because he was the first\nTo get some pussy 12 years old\nNot because he used to come through\nIn the Caddy on some vogues\nNot because he went from bagging up\nThem grams to serving O's\nNah, your daddy was a real nigga, not 'cause he was hard\nNot because he lived a life of crime and sat behind some bars\nNot because he screamed, \"Fuck the law\"\nAlthough that was true\nYour daddy was a real nigga 'cause he loved you\nFor your eyes only"}], "artist": "J. Cole"}