{"songs": [{"year": null, "image": "https://images.genius.com/1b31ad67295bb0511098a70dac4665f9.700x700x1.jpg", "title": "Message From Poet", "album": "Rewind: Deja Screw", "lyrics": "\"Hello please record a message after the tone\"\n\n[Intro: Poet]\nYo, what's the deal, yo whattup Primo, man\nAll these niggas man poppin shit, and shit\nAll these niggas is rich\nNobody wanna die, nobody really wanna kill eachother\nAnybody just need to fall back, aha\nCause everybody payin'\nEverybody just need to fall back and do them\n\"Yeah y'all, come on!\"\n\n[Poet]\nAiiyo Summerjam live, Jigga goin' at Nas\nYo...what's goin' on with these guys?\nNext thing you know, Nas goin' at Jay\n+Ether+ to the dome tried to blow him away\nMotherfuckers wanna make it to some Queensbridge - Marcy shit\nBelieve me, New York, we don't wanna spark this shit\nWe still rebuildin', these women and children\nThe whole shit will turn to Ground Zero if we start illin'\nLook at Foxy and Kim, what's wrong with them\nBoth of them platinum, used to be bitches\nNow they wanna give each other stitches, damn\nIs that how it is, when niggas get riches\nYou got 50 with Ja, 50 with Jay\n50 with anybody that get in 50 way\nG-Unit, Jadakiss and Beanie\nThat's a ill one believe me\nThey should take it to T.V\nCam'ron and Esco who got the best flow\nDMX whoa goin' at ya little bro'\nAnd the whole Roc-A-Fella wanna get at Jaz-O\nEminem, come on now that's a no-no\nDisrespectin' your moms we don't play that shit yo\nEven as a crack fiend mama, black queen mama\nYou learned 2Pac and that's the king of drama\nDr. Dre should've told ya\nBut he to busy goin' at Jermaine Dupri to show ya\nBut Blaq Poet pull a trigger\nWe know you nice, forget you white just rep it right nigga\nI look over at the westside\nI see Snoop, Suge, Xzibit 'bout to collide\nAnd make some real nigga wanna cry\nIt's like niggas forgot about Pac and B-I\nThe only way to settle this; battle it out\n106 & Park and leave the gat at the house\nIf not ain't no more to be yappin about\nGet back to makin' your joints cause that's what rap is about\nYo that shit is weak and all y'all niggas know it\nYou can keep it on to lead it cause it's just A Message From Poet\nSAY WHAT\nThat shit is weak and all y'all niggas know it\nYou can keep it or delete it, it's just A Message From Poet\n\"Yeah y'all come on!\""}], "artist": "Blaq Poet"}