{"artist": "Drake", "songs": [{"year": "2014-06-01", "album": "NBA 2K16 Soundtrack", "image": "https://images.rapgenius.com/714d02980ef0059d06507a45d5f0b645.600x600x1.jpg", "title": "0 to 100 / The Catch Up", "lyrics": "[Produced by Boi-1da, Frank Dukes, Noah \"40\" Shebib, & Nineteen85]\n\n[Part I: 0 to 100]\n\n[Verse 1]\nFuck bein' on some chill shit\nWe go 0 to 100, nigga, real quick\nThey be on that rap-to-pay-the-bill shit\nAnd I don't feel that shit, not even a little bit\nOh Lord, know yourself, know your worth, nigga\nMy actions been louder than my words, nigga\nHow you so high, but still so down to Earth, nigga?\nIf niggas wanna do it, we can do it on they turf, nigga\nOh Lord, I'm the rookie and the vet\nShoutout to the bitches out here holdin' down the set\nAll up in my phone, lookin' at pictures from the other night\nShe gon' be upset if she keep scrollin' to the left, dawg\nShe gon' see some shit that she don't wanna see\nShe ain't ready for it\nIf I ain't the greatest then I'm headed for it\nThat mean I'm way up (way up)\nYeah, the 6 ain't friendly but that's where I lay up\nThis shit a mothafuckin' lay up\nI been Steph Curry with the shot\nBeen cookin' with the sauce, Chef Curry with the pot, boy\n360 with the wrist, boy\nWho the fuck them niggas is, boy?\nOVO, man, we really with the shits, boy\nYeah, really with the shits\nI should prolly sign to Hit-Boy 'cause I got all the hits, boy\nFuck all that \"Drake, you gotta chill\" shit\nI be on my Lil Mouse drill shit\nFuck all that rap-to-pay-your-bill shit\nYeah, I'm on some Raptors-pay-my-bills shit\nAll up on TV, I thought it'd make me richer\nWasn't payin' me enough, I needed somethin' quicker\nSo now I'm all in Niko's basement puttin' work in on the phones\nEither that or drive to Money Mart to make the pickups\nMan, it's 2008, I'm tryna paint the picture\nComeback Season in the works and now I'm thinkin' bigger\nI got 40 in the studio, every night, late night\nGotta watch that shit, don't want to make him sicker\nThat's my nigga\nOh Lord, got a whole lot to show for it\nI mean we can really get it, we can go for it\nI'm just here for the bucks and the billis, nigga\nDon't make me kill one of the GOATs for it\nI run this shit, they like, \"Go Forrest\nRun Forrest, run Forrest, go Forrest\"\nYeah, I mean you already wrote for us\nDamn, nigga, what's one more quote for us?\nOh Lord, who else soundin' like this?\nThey ain't make me what I am, they just found me like this\nI was ready... fuck that, I've been ready\nSince my dad used to tell me\nHe was comin' to the house to get me\nHe ain't show up\nValuable lesson, man, I had to grow up\nThat's why I never ask for help\nI'll do it for you niggas and do it for myself\n\n[Outro]\nI go 0 to 100, nigga, real quick\nReal quick, whole squad on that real shit\n0 to 100, nigga, real quick\nReal quick, real fuckin' quick, nigga\n0 to 100, nigga, real quick\nReal quick, whole squad on that real shit\n0 to 100, nigga, real quick\nReal quick, real fuckin' quick, nigga\n\n[Part II: The Catch Up]\n\n[Bridge]\nWhole squad on that real shit\nWhole squad on that real shit\nWhole squad on that real shit, yeah\n\n[Verse 2]\nThe other night\nLavish Lee told me that I'm all these people listen to\nShe said they love me unconditional\nImagine how it feel to watch another nigga at the top\nYou know that if you wasn't you, you would be dissin' you, dawg\nDamn, okay, from that perspective\nI see what you're talkin' 'bout, no way to soften that\n'Cause me, I was tryna find out where I lost 'em at\nBut maybe I ain't lose 'em at all\nMaybe I keep movin' forward and they're just stagnant\nThey ain't movin' at all\nBut when they need a favor, who do they call?\nMaybe I'm searchin' for the problems\nAskin' what was said and who was involved\nToo focused on people's feedback and provin' 'em wrong\nThey say the shoe can always fit, no matter whose foot it's on\nThese days feel like I'm squeezin' in 'em\nWhoever wore 'em before just wasn't thinkin' big enough\nI'm 'bout to leave 'em with 'em\n'Cause if I run in the game in these, man, the seams are splittin'\nNo pun intended but they're smellin' defeat in the air\nHeaded where nobody took it, who meetin' me there?\nThey tell him that he's talkin' crazy but he doesn't care\nBein' humble don't work as well as bein' aware\nListen up, boy, you're better off eavesdroppin'\nWe already got spring 2015 poppin'\nPND droppin', Reps-up P droppin'\nMajid Jordan droppin', OB droppin', not to mention me droppin'\nFeel like we paid the refs off, man, we fixed the game\nMe and Noel been at it before Twitter names\nYeah, been on the move like the lease is up\nAnd I can't even name one person that's keepin' up\nDamn, fuck how it was in the past tense\nAsk yourself, how do we match up now?\n'Cause I'm only 27 and I'm only gettin' better\nIf I haven't passed you yet, watch me catch up now, for real\n\n[Outro: James Blake]\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up\nCould it be the way that I'll catch up"}]}