{"artist": "Wiley", "songs": [{"year": "2015-05-05", "lyrics": "Yeah, I'm back with BMO Field part 2\nMan kill freestyles every year, blud, bars that are new\nGuaranteed vibes in the place whenever I pass through\nI can do grime when I like, I ain't gotta ask you\nYou think you run the scene but I think I do\nQualifying rounds, I already know I'm through\nIf I start at 10 then I wanna be done by 2\nKeep that dough flowing nice, me, that's what I do\nLaugh out loud, everybody's taking sides\nMan dem chatting 'bout sides ain't got no sides\nKeep chatting shit till the man drags you out your ride\nCome to the ends and you leave ends without your ride\nListen, where would some man be without my style?\nI ain't got a clue but I know this, big up my style\nFrom day one, that style's been wicked and wild\nKnow that I had this locked from man was a child\nI stand up here and not in a pile\nWhat I'm wearing ain't out for a while\nMan have been bussing gums all the while\nYou can ask Danny Weed now, all the style\nWhich kind of [?]? All the kinds\nWhich type of trainer? All the types\nWhich designer label? All the lines\nWhich type of logo? All the signs\nTried join in with the murking\nBut none of that hype ain't working\nSorry to say you're stuck in an air pocket\nSo your steering wheel is not turning\nI've said it before, I wanna quit\nWhen the balance in my bank weren't shit\nYou know why? Cause the place we were living in\nSee a don doing well, don't mind killing it\nThat's why I'm killing it\nMan get a crew and don't know who to bring in it\nNew song, I've got everybody killing it\nCan't have a spitter debate without Will in it\nIf I'm being honest, I wanna go and rave\nIn a rave that's got no chill in it\nEverybody rocking with a straight copied style\nNone of you are living it\nI switch an MC off like data roaming\nI don't wanna talk on the phone, cause today I'm zoning\nMy don is a nutter, you can't control him\nMy don is on tings so it's hard to hold him\nCheck 1, 2, 3, then I'm outchea\nLike in the 80s when dad had a pouch\nAnd a [?]\nFeet up like leather couch here\nMan work harder, never been a sloucher\nYou can't stand bout here\nAll of the dogs dem outchea\nOutchea [?]\n[?] run your mout here\nThought it was sweet like Tic Tacs\nTill I realised it was sour like limes\nCause my dons have got a brainpower like mine\nBut to be on the same page, we have to align\nHave to remind everybody we're the grime kings\nSo it's not a ting, going back to the vibe of the radio\nPractice, we was on the radio, active\nWe keep it up to the time like\n[?] I'mma do that\nOnly sick tunes for the fans [?] ball bat\nWhat'd you call this and what'd you call that?\nTo be honest with you, bro, I'm fed up of all that\nIt's grime now, the time's now\nNo, you ain't gotta be signed now\nDo it independent, ride out\nHave a great career and sign out\nNew Huarache, them joints look fly\nWhere'd you get them? I wanna buy\nPlease tell me and don't lie\nOn the Nike Air pie chart blud, my percentage is high\nNew Huarache, them joints look fly\nWhere'd you get them? I wanna buy\nPlease tell me and don't lie\nOn the Nike Air pie chart blud, my percentage is high", "image": "https://images.genius.com/da5172b04f89f0048c646e85e4f332ef.549x549x1.jpg", "album": null, "title": "BMO Field 2"}]}