{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/654caba7c794fe0ca96931118286b131.514x514x1.jpg", "title": "God On Our Side", "lyrics": "It's a movie and the whole world is viewing it\nAnd the popcorn is dreams torn, but we're always chewing it\nThe set design is by God but the costumes by the devil\nAnd the screenplay is adapted from a book that's embezzled\n\nThis is where I grew up\nThis is where I grew proud\nThis is where neighbors never say music is too loud\nThis is where the streets have no name, but they have history\nThis is loss is victory\n\nOh my name it ain't nothing; my age it means less\nThe country I come from could be like the rest\nI was taught and brought up there, laws to abide\nAnd the land that I live in has God on its side\n\nI was young; I grew. I could tie my shoe\nI was blind, but I knew that I would always see blue\nBlue seas I see through on the bottom I'll meet you\nAnd when we come up for a breath would you mind if I kiss you?\n\nChildhood came up for the kiss, but it slips its pain in with mist\nAnd the sunny skies came and I missed it\nVanished and when swept\nLanded we slept in the arms of convenience, blanket obedience\n\nNow to some of the Americans\nWar had its day\nAnd the Civil War too was soon laid away\nAnd the names of our warlords\nI was made to memorize\nWith guns in their hands, they said\nGod's on their side\n\nI had an undying wish to keep from dying\nI had an untimely hitch keep me from climbing\nBut I climbed a hitch itself and I tried flying\nI had an uprising in my soul\nThe left was fight in the right\nAnd the right was fight in the light\nAnd the light was blind in the night\nAnd the night woke up in tears\nWhen my fingers went to wipe them\nThey became a poem but to write then\nThey would have to speak tears in another language\nThat would take years\n\nSo now as I'm leavin'\nI'm weary as Hell\nThe confusion I'm feelin'\nAin't no tongue can tell\nThe words fill my head\nAnd fall to the floor\nIf God's on our side then would you ever need war?"}], "artist": "K’naan"}