{"songs": [{"year": "2011-07-02", "album": "Section.80", "image": "https://images.genius.com/1f3cde1d04f886d4d4eb88a2c26a4e4d.1000x1000x1.jpg", "title": "Ab-Soul’s Outro", "lyrics": "[Verse 1: Ab-Soul & Alori Joh]\nWhat's your life about? Enlighten me\nIs you gon' live on your knees or die on your feet?\nIt's fire in the street, fire in my Swisher\nFire in between the two legs of your lil' sister\nJust get a sip of this elixir\nBefore they crop us out of the picture\nI've never seen a crop circle\nBut I've seen cops circle the block\nI puff squares, but I swear, one day, I'ma stop\nMy nerves itch\nOn the brink of my career\nWhile my peers struggle for employment\nCan you hear these screams?\n(Uncle Sam ain't no kin to me) One, two\nThree four grams and a fifth of Hennessy\nA bad bitch, fuck the penitentiary\nSection 80s babies, blame Ronald Reagan\nWe raising hell, hell (Oh)\nLord forbid, the homie got wet, so we trying to soak it in\nThe president is black, but you can't vote for skin\nYou vote for the better man\nCome to our show, you can see the diversity\nUnify the people, they gon' peep it universally\nWe might not change the world\nBut we gon' manipulate it, I hope you participatin'\nAyo, Dot, won't you let these cats know?\nWe knew we'd be here, like, back in 04'\nStarted HiiiPower because our generation needed a generator\nIn a system meant to disintegrate us (Ooh!)\nAnd all we do is assist them\nWe're not victors, we're victims\nThe bigger picture isn't developed yet\nLike, what if Keisha was celibate?\nOr what if Tammy came across a real man\nWho didn't play games like children?\nMy nigga cheated on his girlfriend\nWith his girlfriend's girlfriend, let the world end\nAnd everybody tripping off 2012\nAnd the extraterrestrial presence as well\n(Odd Future's aight) But our future is not\nThat martial law shit drop, we gon' all get got\nSo keep that question mark on your face\nEat your fast food, use your fluoride toothpaste\nHide your feelings from the public, work your lil' nine to five\nDon't forget to pay your tithes and thank God you're alive\nHiiiPower\nAnd on another note\nWe focused like the Hubble Telescope\nSoul!\n\n[Chorus: Kendrick Lamar & Alori Joh]\nLife is a traffic jam, life is a traffic jam\nLife is a traffic jam\nLife is a traffic jam, life is a traffic jam\nLife is a traffic jam, life is a traffic jam\nI'm ready to go, ready to go\nLife is a traffic jam, life is a traffic jam\nReady to go, ready to go\nLife is a traffic jam\nLife...\n\n[Verse 2: Kendrick Lamar & Ab-Soul]\nI wrote this because I was ordered to\nPeople say I speak for generation Y\nWhy lie, I do, Section 80\nYour son will play me if the radio won't\nDaughters that just turn 1 'til 21 listen to Kendrick\nFor instance:\nWhat's your life about? Enlighten me\nIs you gon' live on your knees or die on your feet?\nTake out that student loan, and pay off your college degree\nAnd do exactly what you see on TV\nTrue story!\nHmm\nCan you repeat that for me, Soul?\nWhat's your life about? Enlighten me\nIs you gon' live on your knees or die on your feet?\nIs you gon' plead the fifth or sound the horn?\nThe time is now, my child, come on\nSee, a lot of y'all don't understand Kendrick Lamar\nBecause you wonder how I could talk about money, hoes, clothes, God, and history all in the same sentence\nYou know what all the things have in common?\nOnly half of the truth, if you tell it\nSee I spent 23 years on the earth searching for answers\n'Til one day I realized I had to come up with my own\nI'm not on the outside looking in\nI'm not on the inside looking out\nI'm in the dead fucking center, looking around\nYou ever seen a newborn baby kill a grown man?\nThat's an analogy for the way the world make me react\nMy innocence been dead\nSo, the next time I talk about money, hoes, clothes, God, and history all in the same sentence\nJust know I meant it, and you felt it\n'Cause you too are searching for answers\nI'm not the next pop star, I'm not the next socially-aware rapper\nI am a human motherfucking being over dope-ass instrumentation\nKendrick Lamar!\nNow fuck 'em up, Terrace!\n(Soul!)\n\n[Instrumental Solo: Terrace Martin]\n\n[Outro: Kendrick Lamar]\nI watch this fire that we’re gathered around\nAnd see that it burns similar to the fire that’s inside you\nSection.80\nSection.80 babies\nA generation of bliss and disobedience\nKnow they can't control us\nKnow they can't control you\nKnow they can't control us\nBut we can control each other\nWe build our own world\nIf you don't leave with nothing else tonight\nYou will leave with knowing yourself\nYou will leave knowing that you represent something that's bigger than all of us\nOur family\nHeart, honor, and respect\nThis is you\nThis is me\nAnd we are HiiiPower\n\n[Produced by Terrace Martin]"}], "artist": "Kendrick Lamar"}