{"artist": "G-Dep", "songs": [{"title": "I Want The World To See", "album": "Child of the Ghetto", "year": "2001-11-20", "image": "https://images.genius.com/bddcce4afa23dd703cfaf4bd2ea9dfe7.300x300x1.jpg", "lyrics": "[G.Dep speaking]\nYeah uha I get it\nYo yo come here man\nI wanna show you something\nCome here for a minute\nYou see that?\nNah nah come here everybody\nYeah yo look yo\n\n[Joe Hooker singing]\nI want the world to see\n\n[Verse 1: G.Dep]\nG is for the game and don't need explain\nThey know that you don't need brain\nBut you should know these thangs\nCan't rap so he sang right when the police came\nCats like us though go for the Gusto\nNever too much yo fuck no\nTry to open up where the coconuts grow\nSharks poking up slow soaking up dough\nYou can look where you want but you scoping us though\nNot so nothing but flow you must know\nLot of y'all look but you'll never touch pro\nAnd touch those crush cold niggas last hope\nYou can call me choice cat witta hot voice\nGrade A top choice in a drop Royce\nSeizing your crew you got to be reasonable\nI fuck around to be the reason you through\n\n[Joe Hooker singing]\nX4\nI want the world to see\n\n[Verse 2: G.Dep]\nYou don’t think that? You on time huh?\nCause in the streets you never know where you can wind up\nNiggas acting kinda funny when I signed up\nAnd I don't know if it's the money or the wine truck\nBut I know their time's up rhyme what time up got up\nSling it to the conselour how she gone guide us?\nAnd I don’t wanna stop\nIf these niggas wanna shop then a gun will pop there it go\nI play dirty in J-30's with their birdy\nThis ain't the old Lakers and nigga you ain't Worthy\nI pop Cris wit hot chicks who rock whips\nHottest shit since hot grits and stock tips\nYour cat spit just cause he's got lips\nTrying hit 26 rich and prosperous\nWhen reality sets thought you had the salary set\nNow here is your reality check\n\n[Joe Hooker singing]\nX4\nI want the world to see\n\n[Verse 3: G.Dep]\nI'm in the big things jets wit the big wings\nNo kid things y'all niggas is siblings\nI pop things you can feel them hot things\nWhen the Glock rings come through and you dropping\nIt's a pay thing you could tell by the grey ring\nMy play thing named May Ling from Beijing\nI break things timeless like paintings\nSit your five dollar ass down before I make change\nGotta put yo gats down before I take aim\nSpit what you need speed of a freight train, strange?\nNever seen a great reign?\nSon charted now look what you done started\nI pop heavy rock steady drop heavy\nCopped Mase and Teddy still you not ready\nWhen it all goes down real as the world be round\nI'll be here world renowned"}]}