{"artist": "Phyno", "songs": [{"album": "The Playmaker", "title": "Best Rapper", "image": "https://images.genius.com/7275bdbf1d619857d076869465935b1c.644x644x1.jpg", "lyrics": "PENTHAUZE\n\nIt’s Major Bangz\n\n[Intro]\nHei ho hei ho hei ho\nHei ho hei ho\nKuo pa, Udo gba shoe\nUdo gba shoe, udo gba shoe\nKuo pa, Udo gba shoe\nUdo gba shoe, udo gba shoe\n\n[Verse 1: Phyno]\nYa! Man on fire kama buzi bovi\nAnd am flaming everywhere even ma na jersey\nAdim big ma still ndi ibe m n’asi na adim lucky\nE mee m ya over and over ngwa gwa mu kee ife irozi\nHold on\nAll this niggas pray i run down am on time\nHa adi afudi mu Am a ghost boy (ghost boy)\nThe boy awa go see am along gone with the long gun\nYou know you messing with the wrong toy\n\nI tell them i don’t wanna be the best rapper\nAm just happy am recognized I flow proper\nDad said be the best in what you do and\nSince rapping is what I do, then fuck it am his best rapper\n\n[Verse 2: Phyno]\nNdi anya ufu na acho igbanye m kapusu\nHa sii na atego m bido tawa m nye ha efe kaha taru tu\nMana ha amaro na way nwoke jii a hustle kazi nku\nNwoke nwere ohere kpo puo the ohere kam kporo ntu\nRespect to the great but ain’t nobody fuckin' with me\nE gbuli go m the game maka n na egbu ya definitely\nNwanne e seti go m the standard na a rock every countdown\nMana i juo ha ga asi gi na Phyno a worth tu lo ya\nTell that shii to the birds\nHapu okwu i dey yarn knowledge\nNa e school umu aka a ka mu e nwere college\nAsi na mmadu bu chukwu ha ka ezigago m village\nAm destined to shine ka etere m shoe polish\n\nHa tinyere their 1’s\nI put my 2’s on it\nAnd okwu daharia, i put my goons on it\nE bum the game na my hand ha akpo ya hand luggage\nMa na ndi bu nke kari rim na acho igba m shortage (ku pu)\n\n[Hook]\nMy fans say that am the best rapper\nBut am just happy am recognized i flow proper\nI don’t even get a time for this competition\nLegendary - I am the definition\nHeh! Nwa nka na enye ha heart attack\nWith onuma 50 ka sign m to say the aftermath\nO mu dere ede o mu dere ha ncha bu copy cat\nSend half forever my nig*ah that’s not enough to die\n\n[Verse 3: Phyno]\nFreeze! Nigga please take it easy\nE che na ife anyi na esi bu beans\nOdi kwanu easy?\nI ma na ugwu anyi riri di high odikwa risky\nNow am getting high on this flow odim tipsy\nAm a beast with the flow let it be known\nHa amaro ka m si buru the game mee ya my own\nAny beat m meturu aka nwanne nnapu ya soul\nKill every feature am on the boy on a roll, but damn!\n\n[Hook]\nI don’t wanna be the best rapper\nAdim okay ha ekwenyego that i flow proper\nBut fuck you if you thinking you the best rapper\nEgwuregwu m na eyi ha ujo ka obu zi fear factor\nIts high time that i show these boys that am on a new chapter\nTime anyi ga ama who is real and who is a cool doctor\nRespect to every niggah hustling for their green pasture\nIts real life and you’re the only *** to get dough oh\nI just wanna sell shows all the pretty ladies screaming hello\n\n[Outro]\nYeah, Just know that I speak from the heart\nNdi iro na agba izu ka ha do mu part\nMana maru na ife nile m kwuru na egwu abu a fact\nNowadays people step on you and wait for you to react\nBut I keep telling them hear them please don’t real my high\nWhat you smoke can’t make me high\nWho you fuck can't make me com\nWhat you twist can’t make me turn\nWhat you flame can’t make me burn\nNigga am not done\n\nI no ebe i na acho world wide stage\nE lose oh the local stage still won't to be called international\nAmam na eziokwu na afu ufu don’t take this personal\nYou can learn from this nwa your chances di optional\nMa osiro gi na obi nwa hold your applause (Better hold that)\nGimme the money hold your award (Better hold that)\nI just wanna see my future be assured\nNow I did more and my music banging abroad\nBut ama do the most\nPicked up my culture sold it from coast to coast\nUmu afo kwum na azu gimme love overdose\nThis is a simple math\nIt’s a game of it and I’ve been doing that\nOne album akpo m a legend i’ve been moving fast\nOma ako mu ka fada okwa mu na akaru ha mass\n\nMen nu siri m nwanne never you joke with your last card\nMan of the year after the year nigga\nIchota m nga ebunye kwa gi akpo na trail nigga\nJust ma ru na doing this is not the thing nigga\nWord from this thing nigga.. Ish!", "year": null}]}