{"artist": "Boondox", "songs": [{"album": "The Harvest", "title": "Lake Of Fire", "year": "2006-07-11", "lyrics": "Heaven help me cause I'm burning inside. (Burning Inside)\nReflections of the flames are burning my eyes. (Burning My Eyes)\nI can't even comprehend begin to describe. (Begin To Describe)\nWater set on fire and it lights up the sky. (Lights Up The Sky)\nThey say it burns sometimes, Lights up the sky\nThey say it burns sometimes, No one knows why\nThe water gets so hot it boils up under the moon\nCould this be a gate to hell one has to assume\n\nThe lake of (FIRE)\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go\n\nPlease forgive me I know not what I do. (Know Not What I Do)\nHypnotized by fire and I just cannot move. (Just Cannot Move)\nIs my soul forever damned could it be true? (Could It Be True)\nPulled into the grips of hell by flames burning blue. (By Flames Burning Blue)\nThey say it burns sometimes, Lights up the sky\nThey say it burns sometimes, No one knows why\nIt can get so dark out here you can't see your hand. (Can't See Your Hand)\nThe Fire on the lake nobody dare understands\n\nThe lake of (FIRE)\nFire on the water don't burn my soul. Fire on the water won't let me go\n\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go\n\nAnd when the morning comes. (And when the morning comes)\nIt's like it never happened. (It's like it never happened)\nCause it's a new day. (Cause it's a new day)\nIt's a brand new day. (It's a brand new day)\nAnd when the morning comes. (And when the morning comes)\nIt's like it never happened. (It's like it never happened)\nCause it's a new day. (It's a new day)\nIt's a brand new day. (It's a brand new day)\n\nI was sitting on the bank looking right in the flames. Heard these demons screaming at me\nThey keep calling my name. Am I alive? Am I dead? Tell me what's the situation?\nCould what I'm staring at become my final destination? I don't know what it is but it's pullin me in\nAm I Condemned to this lake for all of my sins? Or\nIs it just a trick being played on my mind?\nEyes burned by fire now I'm forever blind\n\nThe lake of (FIRE)\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go\nFire on the water don't burn my soul. Fire on the water won't let me go", "image": "https://images.genius.com/9bc5140eadd19250a34c88748f1ddafa.500x500x1.jpg"}]}