{"artist": "Professor Green", "songs": [{"album": "Alive Till I’m Dead", "title": "Where Do We Go?", "image": "https://images.genius.com/03dd13269b9289e452bde3eb7d1a6577.1000x1000x1.jpg", "lyrics": "[Verse 1]\nRemember when it started, I tried to hold back, I didn't wanna get too into it, nor get too intimate\nTried to back off, but that back off? She's gorgeous!\nFive foot four an' three quarters, half Italian, half Japanese\nAn' she can make cars crash in them jeans\nBut she's so much more than a body, she's perfect\nI knew it'd hurt but it was worth it, for when it was working weren't nothing like it, and to be honest its as in love as I've been ever\nI never felt a love like this before, so why is it I feel so insecure?\nFuck it, I'm taking the dive, nor more linking I'm making you mine, but..\n\n[Hook: Shereen Shabana]\nWhere do we go? Where do we go? Where do we go from here?\nWhere do we go? Where do we go? Where do we go from here?\n\n[Verse 2]\nIts been a couple of months we've grown so tight so quick. I might just let you in, see I'm quite closed off\nI got a lotta pain inside s'why I get high till I doze off, but I can change in time, at least I hope so\nCause it feels so right when I hold you, I wanna get inside I wanna know you, there's so much of it I wanna show you\nAn' though I'm scared to, I'm prepared to\nTrust you as long you shared to, lucked up, both loved up, but little did we know we were both fucked up\nThe more open we were, the more vulnerable, which after a while weren't fun at all\nIt got deep and proceeded to change, I needed you an' you needed your space, what a waste\n\n[Hook]\n\n[Verse 3]\nI had a heart to love, but both my parents left me, an' I found it hard to trust\nMade it hard for us, we used to argue an' fuss a lot, always wondered when it was gonna stop\nThere were so many good times, so many bad I couldn't hazard a guess what you remember me as\nI was hard work, you were hard work too. You self harmed, it broke my heart in two\nNearly had a yout', that shit still gets to me, said goodbye to a kid we didn't get to see\nSo much that we didn't get to see, thought we were forever, but it wasn't meant to be\nOr was it meant to be an' messed it up?\nIt's nothing but a what if.. Cause I got a girl an' you got a man but I'm wondering what if?..\n\n[Hook]", "year": null}]}