{"songs": [{"year": "2017-05-28", "album": "YouTube Promotion Tracks", "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Dreams Last", "lyrics": "[Hook: Tone Jonez]\nI want to go to a place where dreams will last forever\nDreams will last forever more\nI want to go to a place where dreams will last forever\nDreams will last forever more\n\n[Verse 1: Kerser]\nMassive blunt rolled, I'm about to light it up\nJust let me be the highest one\nI don't listen to no wack shit\nShe in bikinis doin' backflips\nIn the presence of a king, high\nThey get excited shit it's hard for them to think right\nI'm on my live life, jet ski with the fridge type\nMatching Gucci shit I ain't never leaving this life\nStyle anyways\nSwag I'm running million leaps and bounds from an alley way\nWhere I started or that bridge that crossed the M-5\nThat's Campbelltown learn about it I'm the test, I\nProved it could be done with every thing up in your way\nIf you can't respect that, man come on, you're stuck in hate\nThey tried to drag my name through the mud, it didn't work\nI was warned that's what they do when you be sitting first, it's Kers\n\n[Hook: Tone Jonez]\nI want to go to a place where dreams will last forever\nDreams will last forever more\nI want to go to a place where dreams will last forever\nDreams will last forever more\n\n[Verse 2: Kerser]\nI broke records, are they ever going to bring that up?\nSitting with like fifty cunts\nI don't even know you\nWho let you in my showroom?\nThe purple mixed and\nNow I'm on a mission, lay down competition\nEffortless, I'm winning, ain't care 'bout what they thinking\nMy jewellery has 'em blinking, I'm living in a weekend\nWhich proves I'm winning and I'm living how I'm supposed to\nJoints are different when you light 'em down the coast, true\nIt's my rap dream, that shit be my energiser\nI'm still spending money I made off The Nebulizer\nWhat the point in dreaming when your dream is your life?\nStill paranoid, if you search my jeans, you'll find a knife\nBut we staying positive\nI'm party and I knock some shit\nI still got that side in me that I have with my three lines\nThat battle shit will die in me, it's Kers you want to be like\nYou're jealous hurt, they want me dead in the dirt\nLet me chill for a second, who said second? I'm first\nIt's Kers\n\n[Hook: Tone Jonez (Kerser)]\nI want to go to a place where dreams will last forever\nDreams will last forever more (I'm making dreams last)\nI want to go to a place where dreams will last forever (That 225 shit)\nDreams will last forever more\nI want to go to a place where dreams will last forever\nDreams will last forever more\nI want to go to a place where dreams will last forever\nDreams will last forever more\nDreams will last forever more"}], "artist": "Kerser"}