{"songs": [{"image": "https://images.genius.com/e2ff502068eaa8fe29f8949d454546f6.500x500x1.jpg", "title": "Cross Me", "album": "Realer", "year": "2018-12-20", "lyrics": "[Intro: YoungBoy Never Broke Again]\nCan I see that lighter? Thank you, um\nDo you think, um, I can make them, like\nFeel me on this song, like, without saying too much?\nI kept on begging you to stay\nI couldn't hold on, so please forgive me, I wasn't strong\nI take my lick and I move on\nFuck them niggas for life, the way they did me wrong\n\n[Chorus: YoungBoy Never Broke Again]\nI was blind when they crossed me (Yeah)\nI was blind when they crossed me (I was blind)\nI was blind when they crossed me (Oh I)\nI was blind when they crossed me\n\n[Verse 1: YoungBoy Never Broke Again]\nI could put this shit on everything\nI had came out the back door\nFor this shit, man, I was struggling for so long\nPray every day, protect myself, and tote that fucking pole\nI mind my business, I'm not like these niggas or these hoes\nBeen deceived, I don’t know nothin' but throw them B's\nI tell lil' shorty come be on the winning team, please\nI told that bitch she best believe\nI told that boy it's 4K Trey, I tote that beam\nOh, how the fuck you do me wrong?\nLeft me for a nigga that wasn't worth it like me\nI put in work to be with you, he ain't deserve it like me\nI was low-key in a coupe, they put the word out on me\n\n[Chorus: YoungBoy Never Broke Again & Plies]\nI was blind when they crossed me\nI was blind when they crossed me\nI was blind when they crossed me\nI was blind when they crossed me\nI was blind when they crossed me (I was blind)\nI was blind when they crossed me (Yeah, ayy, YB)\nI was blind when they crossed me (This a Plies check-in, bro)\nI was blind when they crossed me (Know this shit took cash to drop)\n\n[Verse 2: Plies]\nI been used by niggas, I been used by bitches\nOne thing I ain't never do was get in my feelings\nMost of these niggas never been in no trenches\nNone of these hoes, don't put in my business\nI don't need no nigga, I don't need no bitch\n'Cause if I get locked up they ain't gon' send me shit\nGot a bag, I'll put it on your head, lil' bitch\nY'all broke ass niggas can't tell me shit\nL-O-V-E, that ain't me\nM-O-N-E-Y, that's me\nI don't trust y'all niggas far as I can see\nMost y'all hoes fuckin' more than me\nCan't fuck with everybody what I learned in these streets\nNiggas only show up when it's time to eat\nJump in that water, better hope you can swim\n'Cause I'm tellin' you, lil' nigga, I'm playing for keeps\nMost of you broke hoes ain't got shit\nWant me to fuck, gotta pay for this dick\nOnly love I'm showing is to my fam\nTryna stay rich, give a fuck 'bout no 'Gram\nI got gold now, ten mill' a month\nWant me to save you, ho? I ain't the one\nYB, YB, run it up\nMost you fuck niggas talk too much\n\n[Chorus: YoungBoy Never Broke Again]\nI was blind when they crossed me (Yeah)\nI was blind when they crossed me (I was blind)\nI was blind when they crossed me (Oh I)\nI was blind when they crossed me\n\n[Verse 3: Lil Baby]\nI'm in that 'Vette again (Slatt), I just went top speed\nI should've knew they would cross me\nThey sit around, talk about me\nWe carry Dracos that chop trees (Yeah)\nI get that bag and I put it up 'cause I know ain't shit free (Nah)\nWe was in love, I came and pulled up, I know she miss me\nShe ride that dick like a ten-speed\nI'm with the gang, I can't switch teams\nNo more handcuffs, I wear APs\nTake off my watch, let my wrist breathe\nWe been gettin' money and we been thuggin' since we was young boys\nNow look at me, I just bought a foreign, the same one as YoungBoy\nGo to my shows when I'm drunk, boy\nMy youngins, they shoot-out for fun\nA convicted felon, I'm keeping my gun\nIt's just how we livin', we come from the slums\nNow when the police pull up, we don't run\nYoung rich nigga, do what we want\nPrivate jet so I'm sittin' in the front, yeah\nHow could you cross me? How could you cross me?\nHow could you cross me? How could you cross me?\nHow could you cross me? How could you cross me?\nHow could you cross me? How could you cross me?\n\n[Chorus: YoungBoy Never Broke Again]\nI was blind when they crossed me\nI was blind when they crossed me\nI was blind when they crossed me\nI was blind when they crossed me\nI was blind when they crossed me (I was blind)\nI was blind when they crossed me (Yeah)\nI was blind when they crossed me (Oh, oh, oh, oh, oh)\nI was blind when they crossed me (When they crossed me)"}], "artist": "YoungBoy Never Broke Again"}