{"artist": "Prince Po", "songs": [{"album": "The Slickness", "title": "Bump Bump", "image": "https://images.genius.com/fe46039456792fc615fe5e21c88ae79d.300x300x1.jpg", "lyrics": "[Intro: Raekwon (Prince Po)]\nTime to establish, you know how it's going down (Yeah) Word up\nWhat up Prince Po, what up baby? (Yeah)\nShallah Raekwon, Lex Diamond, let's get it to 'em\n\n[Hook: Prince Po (Raekwon) {both}]\n{Aiyo, come through} Come on\nYou know we do it big girl, don't front front\n(Get dipped, tell your friends, we got the bump bump)\nThe what? (the bump bump)\nThe what? (the bump bump)\nThe what? (the bump bump)\nThe what? (the bump bump) what\n{Come through} We get it crackin' dog, don't front front, yeah\n{Givin' hummin' in the Benz} (We got the) {bump bump}\nThe what? (the bump bump)\nThe what? (the bump bump)\nThe what? (the bump bump)\nThe what? (the bump bump)\n\n[Prince Po]\nIts a wrap slick, still on point, like a cactus\nIt's that new Prince Po shit, get at this\nMami's love to mack this, breakers do back flips\nWe buggin' in the club, in the cut like cat piss\nIt's hood love, baby, give my sounds to blackness\nEight kids are under the mattress, for survival tactics\nMa, don't try to ride with no practice\nHit up til you heat up skeet, and your body collapses\nGirl, I can't help it, I'm nasty\nPut in a lot of work, so my hands stay ashy\nStack and cop, houses to land, machines is classy\nDiamonds is hollerin', and sayin' you got some greens to pass me, so\n\n[Hook]\n\n[Raekwon]\nWord to my Nike Airs, I been reved years ago\nHow many years a nigga done blessed, here's the flow\nWord up, magazine, chrome gats, all in my backs\nSo many live niggas, all day high niggas and grown bats\nPlay the hood, stay in the hood\nDisplay mad '88, gettin' weight, Rae and them good\nPlay the rooftop, black caught her, quarter in my pocket\nHit the booth up, blow like shorty got a rocket\nSo much talent to spray, me, I never leave\nStand there, get my money, let fam breath\nConnect like opposites, blow like tropical weed\nHit Hawaii up, fuckin' in the cockpits\n\n[Hook]\n\n[Prince Po]\nFried chicken, ghetto funk, mic control\nYoung thelonious monk, still ice cold\nTeen and meanin' the collard greens, stomp through the jungle\nLambs shakin' they amps, catch up if you want to\nGot you on the lean, like wits, murk you through Queens\nDippin' in between your lanes, like we crumbs, in the seats seems\nYou ride with pros, Rae and Po, straight ho's, meet in Paris for shows\nFunked dub it like a dunk from Shaq, down low\nNasty habits, Prince Po, Madlib, beg for blows\nStraight gully like the seventy's, heavy for sure\nAiyo 'Lib, they small fries, we Big Macs to go\nAdrenaline pumpin', we got it jumpin' dog, it's nothin'\nCarnivores, man huntin', once we start dumpin' the duke\nFor the love of your life, stop frontin'\nMight hit up your click tonight, we havin' a little somethin', so\n\n[Hook]\n\n[Outro: Raekwon]\nYa'll know how it go down, y'all know how it go down\nLex Diamond, Prince Po (you know what I'm sayin?)\nWe the illest niggas, yo (you tell a wack rapper, that, youknowhatimsayin\nWord up, you knowhatimsayin? Watch them Uncle Peaches ass niggas, you\nKnowhatimsayin?)\nChuck Berry haircut ass niggas out there, yo, word", "year": null}]}