{"songs": [{"title": "Boogeyman Boat", "album": "Birthday Mix 3", "year": "2018-08-23", "image": "https://images.genius.com/1bc99e1de2c6d4741216fe9aa7045b8f.500x500x1.jpg", "lyrics": "[Intro]\nYou know what the fuck I'm on (bih!)\nWoah, yeah (mhm), woah, woah, woah\nWoah, woah, woah, woah, woah, woah (gang! let me hear it)\nWoah, woah, woah, woah, woah, woah (come get it)\n(Polo boy shawty on the track so I am killing it)\nWoah, woah, woah, woah, woah, woah, woah, woah\n(uh, yeah, fuck with me)\n\n[Verse 1: Lil Yachty]\nYeah, told ya lil' boy, yeah I said it (said it)\nRun up on boat, you'll regret it (regret it)\nRead that on Reddit (Reddit)\nTake that lil' chain yeah I got it (got it!), hee\nGive that shit to K$upreme (okay)\nWalkin around with a beam (boom! boom!)\nBoogeyman boat snatching 'em (gang!)\nGang, gang, gang with a MAC-10 (gang, gang, uh!)\nTake her to the room gotta text me (yeah, yeah, uh!)\nNigga talking down better speak up (hoo!)\nGet his ass shot like a vaccine (ooh, ooh, ohh, sheesh, go ahead)\nRichest monkey in the zoo (alright!)\nPussy wet like stew (yeah!)\nHit her one time she a bugaboo (ooh)\nFlew the bitch in, left her at the W (W)\nGo get some, talk to another dude (W, W)\nYoung nigga rich as he ever been (ooh)\nMight cop a crib in the Netherlands\nGang! gang! gang! (you rich)\nStay with that 30 round thing (boom)\nAll off the hip, let it hang\nAll in the back, neck to the chain (skrt, skrt)\n18 years old bought my mama a range (skrt)\n19 years old bought my mama Porsche (I did that)\n20 years old tryna go cop a Bentley (yeah)\nMight be the youngest flexer of the century (damn)\nCome to my crib, the roof got the sentries\nSqueeze on the trigger till that bitch is empty (fa! fa! fa!)\nKeep it in mind the ammo clip is lengthy (yeah)\nCome through the gate, I dare 'ya ass to tempt me (hoo!)\n\n[Verse 2: K$upreme]\nShe got a kid, I'm a motherfucker\nThese niggas funny like Chris Tucker (funny nigga)\nBaby blue G wag sit high like a trucker (damn)\nMy brother came in with a stick, he a slugger (brrr!)\nGlock on my hip let it burn like I'm Usher (brah!)\nFuck from the back, I'ma crush her (sheesh)\nPetty boy catch 'em like mustard (ooh)\nI'm with the wifey, I bought em some clusters (ice)\nI play that bitch like I'm at Dave & Buster's (hah!)\nHellcat drive-by and you hearin' the muffler"}], "artist": "Lil Yachty"}