{"songs": [{"title": "Can I Have A Napkin?", "image": "https://images.genius.com/14da381769975ec5c53bf1de0edb7baa.500x500x1.jpg", "lyrics": "VERSE1\nCan I have a napkin?\nI eat his insides out nobody knew what happened\nI ran down the avenue, all red like Mack 10\nJailhouse shank tickle nigga he died laughin\nBlue dickies bloodied up always keep em saggin\nHead trauma, you couldn't even fix it up wit aspirin\nAs if\nNiggas wanna eat but I eat ask em\nNigga you wanna certified dope record cash em\nThats why I'm STRANGE on that ass I gotta passion\nOnly reason I spit like this nigga I drink acid\nModern day Ca$his Roy Jones Mayweather\nYou couldn't tell me nothin bout sicc nigga we stay together\nSleep in the same bed runnin through the same bread\nStill spittin fire if you know the rap games dead GRRR\nI eat spaghetti intestines so I don't give a fuck about your funny ass tactics\nAnd I don't wanna run up in your stomach\nPEPTO\nAll you other horrorcore rappers\nKLEPTO\nRun up in em\nCut em in the mother fuckin neck though\nNo more rappin no need to use the techno\nMy rhymes like lead bullets leavin your set wet though\nI challenge you motherfuckers ima broke nigga so lets go\nTech N9ne Sacramento cannibal I eat\nBreath stink like human meat got pieces in my teeth\nCan I Get A Toothpick?\nOverdose on 24 pills that way you guilty motherfuckers know what the truth is\nNiggas think they know me they callin me a OG\nFuck all your sympathy nigga you can die slowly\nPoisonous get your boys in this I take em by the dozen\nNigga I get devious that was my little cousin\nNigga im just sick in the head you thought I wasn't?\nI'll make a nigga drink my piss guzzle n love it!\n\n[Hook]\nI might just eat your brains to see what's in your soul\nIm high drunk wet angry\nThey gone have to capture me im cookin em up in a factory\nNigga ya dead now\nNigga ya dead now\n\n[Verse 2]\nCan I have a napkin? blood on my hands last night guess what happened\nI beat the murder like casey anthony, saw grass cuttin' all ass and thats the meat\nAnd if I ever show up at you church, dicc out, ready to flirt, kicced out\nI will see dead people in the church, this house\nNow known as the murder scene, lyrical leader of the rest ya you heard of me\nIll put your brains in a basket and take em to ya grandma house in a cup of acid\nHe dont have to get bloody buddy, bitch drink this acid\nIm goin' to the car and comin bacc with a blacc plastic\nAs if horrorcore rappers want it with me\nIve been eatin' human meat since you been succin mamas titty\nSpeakin' of, seven help me rip these bitches speakers up\nYoure invited to my mind come on we can grub\n\n[Hook]\nI might just eat your brains to see what's in your soul\nIm high drunk wet angry\nThey gone have to capture me im cookin em up in a factory\nNigga ya dead now\nNigga ya dead now\n\n[Verse3]\nExcuse me, can I have a napkin?\nI'm drippin' like a vampire when he ain't rappin'\nNigga you a damn liar I'mma get to snappin'\nThey swell, cranium like a eggshell craccin'\nHey well thats how it goes all the time\nYou know spiderman he gotta put it in a rhyme\nI eat rappers up, I admit, I eat swine\nWith a little squeeze from the lemon and lime\nMe I hate women all the time (i really mean) exes\nDream about\nLeavin em in the back of the lexus\nCut throat legs spreaded open like Texas\nRazor blade pussy lips nigga she died gaspin\nMurder without a motive its ya boy I gotta passion\nN I be puffin on that kush like Ashton, Sebastion\nYou dont wanna fuck around gattin\nMusic either I gotta couple of them fat ones", "year": "2013-02-05", "album": "Mannibalector"}], "artist": "Brotha Lynch Hung"}