{"artist": "Cadet", "songs": [{"title": "Instagram Girls", "album": "The Commitment 2", "year": "2017-05-26", "image": "https://images.genius.com/5820d2dba0549dbc477fc37bf62ae455.1000x1000x1.jpg", "lyrics": "[Intro: Cadet]\nAll these Instagram girls man\nThese models, they just keep popping up man\nMan's gotta be honest with them for a sec, you feel me?\n\n[Chorus: Konan]\nThey see the real from the fake\nDo you want something real or a couple great takes?\nYeah, you look good on your page\nAll these Instagram girls man, I don't know what to say\nI hope that I find one, I pray that she ain't one of them\nYeah, you look real good on your page\nToo many Instagram girls man, Instagram made\n\n[Verse 1: Cadet]\nAight, I guess that's my fault\nTrue say I said 'wagwan' (Yeah)\nAnd 'cause I showed interest from the start\nI guess that puts me on a chasing path (True)\nAnd now I've gotta prove that I'm worth your time\nGot man chasing you girl, that's fine\nBut I'm a big man and I know my worth\nSo it's gotta be a bit of give and take sometime\nBut don't worry baby, I know the ropes\nReal shit, I know, I know (I know)\nLook I've been here before (I have)\nI know how to play my role (I do)\nYou know I make the calls and I put in effort\nAnd if I don't then I don't care\nBut your effort is to receive effort\nAnd somehow I guess that's fair\nBut that attitude there man, I swerve more\nThat shit man, it hits my nerve core\nHow you feel entitled to respect\nBut the average yout's gotta earn yours\nAnd let's just say I took you out sometime\nI don't mind paying for you girl, that's fine\nBut, if you don't even reach for your purse, shit feels like I'm paying for your time\nAnd yeah I know that you can get a man\n'Cause you're beautiful and that's what he said\nBut he said that shit to the whole of Instagram\nDon't let that shit get to your head\nYou see attention, but the wrong intention\nSee your ego shouldn't even get to you\nAnd just 'cause bare man are tryna fuck you\nIt don't mean that bare man are tryna respect you\n\n[Chorus: Konan]\nThey see the real from the fake\nDo you want something real or a couple great takes?\nYeah, you look good on your page\nAll these Instagram girls man, I don't know what to say\nI hope that I find one\nI pray that she ain't one of them\nYeah, you look real good on your page\nToo many Instagram girls man, Instagram made\n\n[Verse 2: Cadet]\nBut yeah man, I know what you go do (What?)\nImpress that girl with a Nobu\nBut really your money's Nandos\nBut it's cool do what you gon' do\nBut when you go brahk and you can't keep it up, wanna do a Nandos or a home food?\nShe'll say 'you ain't even making the effort, you used to take me to Nobu'\nSo why the fuck are you fronting bro?\nWhy the fuck are you stunting (Yeah)\nSo yeah you can do the Cinderella ting\nBut remember that ride turns into a pumpkin\nYou ain't even gotta take my advice (No)\nAnd you ain't gotta take what I say in (Yep)\nYeah man, they can treat you like a queen (Yeah)\nBut you're 'too nice' to treat me like a king (Pssh)\nSo I'm meant to feel so lucky around you, girl you know that's a myth\nSo many guys have gassed you, between game and real talk you can't tell the difference\nA thousand guys say you're beautiful, but you know they just wanna throw you dick\nSo now when I say you're beautiful, you're looking at me like I'm chatting shit\nYeah man I know how you think, I know how you see things (True)\nSex with you and if the time's right then it's right, for you, if he earns it then he beats it\nLike it's some kind of points system and you wonder after he beats why he's leaving? (Why)\nBut if you treat it like an achievement, man will buzz after they achieve it\nYou feel me?\n\n[Chorus: Konan]\nThey see the real from the fake\nDo you want something real or a couple great takes?\nYeah, you look good on your page\nAll these Instagram girls man, I don't know what to say\nI hope that I find one\nI pray that she ain't one of them\nYeah, you look real good on your page\nToo many Instagram girls man, Instagram made\nThey see the real from the fake\nDo you want something real or a couple great takes?\nYeah, you look good on your page\nAll these Instagram girls man, I don't know what to say\nI hope that I find one\nI pray that she ain't one of them\nYeah, you look real good on your page\nToo many Instagram girls man, Instagram made"}]}