{"artist": "C-Rayz Walz", "songs": [{"title": "New York", "album": "The Dropping: Colonic Progression", "year": "2006-12-09", "image": "https://images.genius.com/6b25ad51eed6c2fabb94a09773ba6ca1.700x700x1.jpg", "lyrics": "C-Rayz Walz ft. Swave Sevah and Double A.B. - \"New York\"\n[Emcee(s): Swave Sevah, Double A.B., and C-Rayz Walz]\n[Producer(s): Dub Sonata]\n[Scratches: DJ JS-1]\n\n[Intro: Samples with Scratches by DJ JS-1]\n\"Out in New York, the same shit is going on\" - Sample from Nas - \"One Love\" (x4)\n\n[Interlude 1: Swave Sevah and (C-Rayz Walz)]\nYeah, yeah, Swave Sevah, you heard?  (Dub Sonata) Yeah, A.B., you heard?  (C-Rayz) Yeah, NYC, you heard?  (Hah) Yeah, where I’m from, yo.  (Where I’m from, yo) Where you from, yo? (Where you from, yo?) Yeah, where we’re from, yo.  (Where we’re from, yo) Yo, yo\n\n[Verse 1: Swave Sevah]\nSpeak with hood predicate (What’s up, yo?).  I’m an inner-city delegate (Yup)\nGhetto fabulous, School of Hard Knock graduate (Do it honest)\nCall him “Marauder,” walk the streets with a bop\nPrefer a revolver—don’t jam, easy to pop (Pop, pop, pop, pop)\nSix shots, keep concealed.  If the beef’s revealed (Who want it?)\nThe flame from it is gonna help some beef get grilled (Ill!)\nChill.  I’m being too violent.  But understand\nDawg, it’s not me.  It’s my environment (Not me), place I\nReside in (Word), area I was born and raised (Right here)\nWhere we roll dice and put the winners all on haze\nWhere we keep Privilège Henny in a plastic cup and make\nExamples out of herb niggas acting tough (Say it!)\nThat’s what’s up.  You tell me when you’ve had enough (You had enough?)\nSo I can get back to bag it up.  I’m a hustler, yo\nSwave Sevah, I do war things (Yup).  Trying\nTo keep my head above water like New Orleans\n(Come and) Walk with me down the streets where I’m from\nYo, see how I’m living, come visit my slums (Come on)\nWhere some of the toughest niggas done passed away (Yup)\nAnd we gon’ see if your bitch ass last a day (Bitch), pussy\n\n[Hook: All] (x2)\nNew York grimy, New York gully\nNew York sheisty, New York hungry\nNew York rejects, New York hustlers\nNew York criminals, New York customers\n\n[Verse 2: Double A.B.]\nI’m stuck in New York, open up the New York Times\nSee who’s the new victims to New York crimes (Damn)\nMake me want to cop a new four-five\nAbout the size of them two large guys from Booyah Tribe\nSo if we play a game of “Who’s More Live?”\nI’ma have a big surprise for you small fries (That’s right)\nY’all ain’t men.  Y’all some Ru Paul guys\nTrying to tuck your dick, make your two balls high, fucker\nWatch out dealing with Dylan Tucker\nHere’s an eight of trees.  Maggot, give me fifty like a drill instructor\nFilibuster filling busters with hot lead\nI ain’t talking guns—I’ll stick a pencil through a cop’s head\nStab him in the heart with a sharp pen, dead him\nWhen I click the little button part on the knife’s sharp end\nI hock phlegm at these rappers in the top ten\n‘Cause I ain’t feeling rappers since KRS and Rakim\n\n[Hook: All] (x2)\nNew York grimy, New York gully\nNew York sheisty, New York hungry\nNew York rejects, New York hustlers\nNew York criminals, New York customers\n\n[Bridge 1: Double A.B.]\n(In New York) They’re popping chains and hopping trains\n(In New York) Hustlers run the blocks with things\n(In New York) We got junkies and prostitutes\n(In New York) Itchy-trigger-finger cops who shoot\n\n[Verse 3: C-Rayz Walz]\nLive from New York on Saturday Night.  Sunday morning’s for fools\nThe streets of New York, where every G Rap like it’s Kool\n(Grimy) Catch me on the ave thinking differently, even though\nThe scenery clash (Gully), heavy machinery blast\nFools steal fiendery stash (Sheisty)\nCentral bookings.  In Central, look and get splashed (Hungry)\nFor money, (Rejects) on my ass\nCats wearing bugs, dogs smoking roaches approaching the ave\n(Hustlers, criminals) One and the same\nSon of a gun—when it’s on, I go get my pops and aim\nOne for the customers, two for the crack high off the notes\nNew York rap smugglers—that’s supplying the dope\nThe Big Apple.  Words that don’t go for flavor tackle or clap you\nEven bitches hold a torch like that Statue\nLiberty’s ill, my city is real.  You’ll still get\nBusy and build.  Too gritty and witty to chill\nCome, walk with me down the streets where I’m from\nYo, see how I’m living, coming visit my slum\nWhere some of the richest pimps had their bitches laid\nAnd we gon’ see if your trick ass last a day\n\n[Hook: All] (x2)\nNew York grimy, New York gully\nNew York sheisty, New York hungry\nNew York rejects, New York hustlers\nNew York criminals, New York customers"}]}