{"songs": [{"image": "https://images.genius.com/8ab5eeecff25b17cb0aada47b6f1cc02.600x600x1.jpg", "lyrics": "Yo I'm fallin through the ice\nYeah haha hypnotic molecules\nAs molly fuels these college fools\nAnd in my brain the lava cools\nAnd if it rains then ill be cool\nLike i just pulled a golden champagne bottle on some ice\nSalvador Dali tools\nBlind lovers hard truths\nBlood bubble clouds in a sky\nColored chartreuse\nRaegen era babies slangin handmade crack\nFlippin cakes writin songs\nCall it pancake rap\n\nThey hate me as the pancake rapper\nI made a half a million dollars bein the pancake rapper\nYou little pancake rappers tryin to diss me\nWhen you've never even met me and I still give you a handshake after\n\nI'm just movin' tryin' to squeeze a cup of juice\nFrom out the Revolution never losin ever\nNever loosen pressure, keep squeezin\nKeep dreamin' the sweet sea breeze is only comin\nFor those drummin for those hummin without cheap reasons\nThe president is black, a second term, you gotta problem with it?\nFuck you, let it burn\nMan someone that never grows is just someone that never learns\nYou shoulda dumped your blunt ashes instead you kept an urn\n\nIt's hard to earn. I'm goin' back in\n\nYo my wife is pregnant I got a son that's comin' soon\nAnd I'm excited to explain the rain, the thunder and the moon\nBut I''m just frightened of the pain the blame the suffering the spoon\nOf heroin that made dr. dre's son tumble to the tombs\nSo I'm guessin' the way to teach him health is life's essence\nIs never make my presence be a present\nAnd I can't be there every single second\nBut I'll bless him with the weaponry\nTo think, to guess, to search, to dream, to question everything\n\nQuestion everything, question the world until you feel convinced\nQuestion all your neighbors, if they bother you then build a fence\nQuestion every woman, every hooker, every village wench\nAnd if you get no answers it don't matter boy, you still the prince\n\nAnd if they question you just throw an honest answer at 'em\nMy words are oozing with the visuals of ansel adams\nI'm like a cancer atom, I'm like a marijuana plant on Saturn\nAs I vandalize your brain with frantic patterns\nI got another factoid to spit:\nEvery time I see these little swag boys and shit\nI find a stack of tabloids to rip\nThen I kneel in my backyard PRAYIN FOR AN ASTEROID TO HIT\nJust hit. Like you're Pacquiao punchin Cotto, just hit\nLike you're trainin with Cus D'amato, just hit\nWhen I adjust the motto, follow the buck that bought a bottle\nCoulda fucked a model (what?)\n\nNo no no no that's wrong. You got it backwards\n\nI'm just movin' tryin' to squeeze a cup of juice\nFrom out the Revolution never losin ever\nNever loosen pressure, keep squeezin\nKeep dreamin' the sweet sea breeze is only comin\nFor those drummin for those hummin without cheap reasons\nThe president is black, a second term, you gotta problem with it?\nFuck you, let it burn\nMan someone that never grows is just someone that never learns\nYou shoulda dumped your blunt ashes out, but instead you kept an urn\n\nLike that\n\nI'm gettin' money\nHey hey\nWe get that forty hours every week money [x4]\n\nY'all want a third verse?\n\nI'm like a hominid takin psilocybin mushrooms\nCreatin' language, I'm rappin' from a place of anguish\nHigh roller, bitch! I bank roll Vegas\nIt's industrial poison like all the rainbow agents\nThis ain't homophobic man but fuck your homo prada coat\nI would rather put you in a fuckin go go plata choke\nI would rather be your bitch or give you the drawls\nI'd rather do a song with Nicki Minaj (agggh) BARF\n\nIt's the crazy eyed killa\nLarry david aged scotch 85 swiller\nSo give these new leather shoes a spit shine for dad\nMac Lethal's back and this time he's mad\n\nI'm just movin' tryin' to squeeze a cup of juice\nFrom out the Revolution never losin ever\nNever loosen pressure, keep squeezin\nKeep dreamin' the sweet sea breeze is only comin\nFor those drummin for those hummin without cheap reasons\nThe president is black, a second term, you gotta problem with it?\nFuck you, let it burn\nMan someone that never grows is just someone that never learns\nYou shoulda dumped your blunt ashes out, instead you kept an urn\nLIKE THAT\n\n(We back)", "year": "2013-09-03", "album": "Postcards From Kansas City", "title": "Marijuana Plants On Saturn"}], "artist": "Mac Lethal"}