{"songs": [{"title": "GetBackMood, Pt. 2", "album": "GetBackGang 2", "year": "2019-07-26", "image": "https://images.genius.com/ba69be12416de91a9038d42e6739d42b.728x728x1.jpg", "lyrics": "[Intro]\nGet you together\n'Gether\nGon' get you together\n\n[Verse]\nI get on your ass, who the fuck gon' stop me? (Who gon' stop me?)\nBitch, my pockets fat, yeah they extra stocky (Extra stocky)\nAll these bitches on me, yeah they steady watchin' (Steady watchin')\nAll these niggas in here, yeah they steady watchin' (Steady watchin')\nBut we keep Glocks, we ain't worried, we ain't stoppin' (Nah)\nBut we keep Glocks, we ain't worried, they keep watchin' (Watchin')\nHe said he gon' try me, what's the hold up, then what's stoppin' him? (What's stoppin' 'em?)\nThese niggas be police, I don't trust these niggas for nothin' (For nothin')\nAll of a sudden, now these niggas talkin' bout \"We cousins\" (We cousins)\nI fucked that bitch, I left her sittin' out on her cousin (Her cousin)\nI fucked that bitch, I almost forgot to put on a rubber (A rubber)\nI don't fuck with you, I don't fuck with your kind, you ain't on nothin' (Nothin')\nI fuck with niggas who just like me in the streets, they thuggin' (They thuggin')\nTried to give him a little soft, put him on his feet, but he don't know how to hustle (Hustle)\nHe ain't got no hustle, tell they ass get you, they rush you (Rush you)\nBig four-five gon' touch you (Touch you)\nI heard they ass talk, and I'ma hush 'em (Hush)\nPressure, everyday it's pressure (Pressure)\nGet on your ass, ain't no let up (Let up)\nPut your ass on that schedule (Schedule)\nWe gon' get you together (Together)\nCatch him, stretch him (Stretch him), in any weather (Weather)\nTalkin' bout Glocks (Glocks), lil' nigga we got several (Several)\nSince she brought her friend (Friend), I'ma try to fuck them together (Together)\nGroups of hoes, I done hit 'bout several (Several)\nFuck that club, they ain't let me bring the metal (Metal)\nHe actin' crazy, like we ain't gon' get his ass together (Together)\nThese police ass niggas'll have you goin' federal (Federal)\nThe niggas you grew up with, tellin' on each other (Other)\nWhere you from? Throw it up, show 'em how you comin'\nWhere we from, we get Get Back, it ain't nothin'\n\n[Outro]\nWe gon' get you together\nWe gon' get you together\nWe gon' get you together (We gon' get you)\nWe gon' get you together\nI just been on some gang shit lately\nMatter fact, I just been on some-\nOn some Lamron shit, on some Normal backwards shit\nI been on some, I just been on some Normal backwards shit\nWe gon' get you, we gon' get you, we gon' get you together"}], "artist": "Lil Reese"}