{"songs": [{"title": "Beast Comin", "lyrics": "AKIR ft. Karniege and [?] - “Beast Comin”\n[Emcee(s): Karniege, [?], and AKIR]\n[Producer(s): [?]]\n\n[Verse 1: Karniege]\n(Woo-woo!) Sounds like The Beast coming\nBulletproof crooks, hundreds corrupted\nPull over the car.  Rodney King concussion\nGive ‘em drugs and guns.  In the hood, they love it\nSounds like the concept is constantly crushing\nBrutal basslines, drums so seductive\nRhyme for the beats, on their last dime for bugging\nFighting and fussing, cussing and wondering\nHow to pay bills?  When the next meal coming?\nHow to stay chill when the next bill comes in?\nLife got you stressed, you can’t even function\nYouth ready to spaz out, want to break something\nAt that point, I’d rather make nothing\nTurn into something, cash hundreds\nStack bundles of that money\nBesides peace of mind, that’s what we wanting\nNo more drama.  Listen to the songstress\nMary Jane every day—our pain alarming\nEvery rain in the game thunderstorming\nFlashfloods end the party\n\n[Verse 2: [?]]\nHeard a lot of people mad knowing [?]’s the chosen\nThe chemicals I spit’ll cause face erosion\nAnd I ain’t gonna stop ‘til some bones is broken\nOr fling projectiles like the U.S. Open\nI’m smart, fam.  Everything I script is potent\nCareer good—I ain’t got to live in the moment\nSub-zero cold—yes, artic frozen\nI linked up with Karniege, a prophetic omen\nOur flows take oath, and you running with roaches\nStay in your lane, dog—ain’t a fan of encroachment\nEven though I’m good, know a loser be hoping\nA frame get injured and shirts be soaking\nHaters on my diznick stop the quoting\nBust in somebody face raw without the Trojan\nYeah, I’ll be on some funny shit.  What is you smoking?\nThe three you hear here be the perfect components\nMy lyrical sword sharpening the opponents\nBut I ain’t know I hurt y’all.  I was just flowing\nSpent your last days lost, knowing you zoning\nAnd couldn’t make the call like your phone was roaming\n\n[Verse 3: AKIR]\nYo, yo\nLoco, my motives are focused on quotients that grow\nTo a bonus.  Buyer to owner, snakes lie, bite in the open\nThinking it’s fly, try it, like it, and clone it, never\nMake it and, so, the hate makes ‘em want to oppose us\nPosers vandalizing a poster of a brother that’s\nA little bit closer to what’s supposed to be life\nSee his wife in a Porsche rose or cocoa-white.  Body showers\nTight—sold your right to succumb to the same plight\nStreetlights blue and white, Sig knife strife\nHumanite black model chick.  In her sticks, no more rights\nHolding tight her chest, that has her over like\nHarassed by the cops on a motorbike.  Plus, be coming\nOver like the wrath of a poltergeist.  Focus sight\nOut the hood but he still knows the fight.  Sick of being\nSo polite.  Slight oversight, balls of fist up\nWith all his might, fall and strike, screaming as he throws a right", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}