{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Production by Big Daddy Kane]\n\n\"I was born..\"\n\n[Verse 1: Big Daddy Kane]\nA black man from the motherland\nSpeakin a language today most people don't understand\nWhere no one could bother me\n'Cause I had freedom, justice, and equality\nBut then one day it was tooken away\nAnd I was shipped to the U.S.A\nA young brother made into a slave\nTo harvest the midlands and clean the chittlins\nGiven a new name, new religion\nNo freedom to vote, not even to make a decision\nI saw my peoples, sold raped and took out\nThe rest of that stuff that Alex Haley talks about\nThey said I'm not from Asia I'm from Africa\nAnd all the blacks there now are just scavengers\nThat's the way my mind was poisoned\nTo believe that in America blacks are inferior\nA weak mind and a body of swine\nOnly adds up to being - deaf, dumb and blind\nIlliterate to who where what and why\nSo I ask myself: who am I?\n\n\"I was born..\"\n\n[Verse 2: Big Daddy Kane]\nA native New Yorker on the streets\nKnown for rockin rhymes to real rough beats\nThat I found in the attic, noisy with static\nA sound that made me a Hip-Hop fanatic\nI made a few songs that sold OK\nNever top 20 or plenty airplay\nI came out hardcore, flexin cock diesel\nSaw a little cash and pop goes the weasel\nI had to make that change and rearrange\nMy whole rap format, no hardcore rap\nSo now all the pop charts I rule\nOver New Kids on the Block and Paula Abdul, huh\nI thought I made it, then my song faded\nAnd none of the black stations ever have played it\nI tried to blame it on MTV\nAnd say, \"Damn, they cold played me for Young MC\"\nBut when you get down to it, I'm the real blame\nBecause I wanted the fame\nMoney is not only the root of all evil\nIt's also the destruction of black people, so\nConjunction junction, what's your function?\nBeing a scout or sellin out?\nLook in the mirror at yourself, eye to eye\nAnd say: who am I?\n\n[Verse 3: Gamilah Shabazz]\nA solid change, have to rearrange this strange\nFeelin I'm feelin, so appealin'\nI am having to deal with\nTime to forget the myth of bein black and a woman\nCan't get ahead, walkin on a thread, a tightrope\nCan't cope, don't be a dope, have a little bit of hope\nRunnin' your scope on affairs\nYou have to be aware, don't flare up\nLet your cup runneth over\nI'm not Irish, don't need a donut to fill up my dish\nNor two mango wish to wish on a star, they're so far\nAnyway I'm thinkin about today, not tomorrow\nI'm not a follower of anyone\nMy time has come, it's already here\nMy message is clear\nLike the women of long ago, I am also here\nAlso to show, I have the courage\nHave the strength, I'm for equal opportunity\nNo matter the life, length of time\nShow me a sign, should I rely on a\nSubliminal message, should I question\nWhat would seem to be, life's told me?\nYes indeed, so let me speak\n\n[Big Daddy Kane]\nAnd that's comin from the daughter of Malcolm X\nSo black women put it in your texts\nSo you can never let, opportunity pass you by\nOr even ask yourself, who am I?", "image": "https://images.genius.com/9018e5e448f4d08b6115d24de00e8af0.1000x1000x1.jpg", "year": "1990-10-30", "title": "Who Am I", "album": "Taste of Chocolate"}]}