{"songs": [{"album": "King", "image": "https://images.genius.com/757a45da6a6e4106770d36a71b9d8b5b.300x300x1.jpg", "year": "2006-03-28", "title": "Bankhead", "lyrics": "[Intro]\nWestside nigga\nHey\n\n[Hook x2: T.I.]\nI got my .44 and my dro\nAnd my Chevy on twenty-fours, and my ho\nNow where am I 'posed to go?\n\n[Verse 1: T.I.]\nSee me riding in a Chevy, .44 on the seat\nWith a quarter O of blow, gettin' loaded wit C\nNo tag, no license, trunk loaded with D\nRiding Fulton Indy, where we normally be\nThey pull us over, you think I'm stopping, you must be fucking with me\nIf they don't want to die tonight, they best stop fucking with me\nI'mma pull over in bowen home my cousin and B\nAnd they gon' hide me in they home while they looking for me\n\n[Verse 2: Big Kuntry King]\nHey, we the neighborhood superstars\nCouple Chevys, pulling hard\nThousand dollars worth of dimes in the trap with rockstars\nWe putting fear in cowards' hearts when they see us on the block\nSwerving in the deuce and quarter, busting shots just because\nThe hell I care about getting caught, I'm making bail by twelve o'clock\nBack in the spot with the same bomb-serving drops\nI pull a ho in Bangkok, dropped her off at Tip's spot\nI'm burning rubber, fuck the cops, another day on my block\n\n[Hook x2: T.I.]\n\n[Verse 3: Mac Boney]\nI'm Cadillac daddy, pulled up on some hoes from old Natty\nI said I'm Pimp Squad, ho, what's happening\nWestside get them panties, snap\nShe asked me, can I do the Laffy Taffy?\nI said I do to make the pussy happy\nLet's get a room over on Virginia\nStep inside a suite and then continue\nYou're in for a little fender bender\nBaby, just remember, make it quick\nThese niggas kind of know me, I'm the shit\n\n[Verse 4: C-Rod]\nI'm in a bubble kush Chevy, well at least that's what it smells like\nHit the gas, blue fire blowing out the tailpipe\nTailpipe, that's all these hoes wanna lick for the night\nI treat 'em like Tina, beat that pussy and you call me Ike\nThat's right, monster ride sitting on the twenty-eights\nIt sound like a stadium, you would've thought the Braves played\nThe engine running like Vick, with the Falcons on the hood\nMr., Mr. Westside, yeah you know they in my hood\n\n[Hook x2: T.I.]\n\n[Verse 5: AK]\nAin't no telling where I'm going, 'less I'm stepping out\nSippin on the high life, windows up, in the clouds\nOpen up the console, that's where I got my gun\nRight next to that, get that bag and roll another one\nI got the vitamins, make a freak fuck all night\nHoes know, killers on the Westside earn stripes\nMake that money turn bright, just look at my piece and my grill\nSwerving off Church Street, the pimp God gave me skills\n\n[Verse 6: Young Dro]\nI was born up in Bankhead, y'all remember me\nWay back in '83, T.I. stayed up the street from me\nJust cause I'm from Bankhead, niggas having beef with me\nHalf never seen a G in a cap in my Beamer V\nTen screens falling, my Chevy watching Lean On Me\nRiding down Simpson, 'bout to waste my purple lean on me\nPurple linen clean on me, the whole zone three on me\nWaffle House Charger, yellow-black, I got a bee on me\n\n[Hook x2: T.I.]"}], "artist": "T.I."}