{"songs": [{"year": null, "image": "https://images.genius.com/8062a33587b792934f034e421b701e0c.600x597x1.jpg", "title": "Better Now", "album": "Hard To Hit", "lyrics": "{Big Mike:}\nIt's been a 8 year spread and 4 baby mamas\nStill ain't found no wife, all I found was drama\nPast dwellin, was it that or was it just us?\nLove, was it that or was it just lust?\nFucked once, made love about a thousand times\nBought a crib, and all you could say was that the bitch was mine\nSelfish thoughts, knew you was lookin for a backdo'\nThink I'm kickin bullshit? I'm kickin fact, hoe\nFell for a pretty face, thick hips and bitty waist\nSpent my time with you and all it gave me was a shitty taste\nPlayed a game of chase from my town to yo hood\nRunnin back and forward thinkin it was all good\nI shoulda left you there, pretty face and sandy hair\nGave you the world and couldn't recognize a man that cared\nDick sucks with intentions just to get me sprung\nWas it a game when you laid there swallowed my cum?\nI was something dumb thinkin you were there for me\nPlayed the game with both of my hands and never cared for me\nBut everybody plays the fool once or twice\nAll it did was make me stronger, bitch, ain't nothin nice\n\n[Chorus]\n\tIt's better that I find out now, rather than later\n\tIt's better that I make a clean break with all my paper\n\tIt's better that I find another chick to take your place\n\tIt's best that you get your bitch-ass up out my face\n\n{MC Breed:}\nMet her when she was 19, brand-new\nAnd she only went out in tight jeans, and could dance too\nBurgers and fries, bout 30 lives, told to her\nGame, sold to her, plus everybody knew her\nWhat the business? Except I got kids for a witness\nAnd you let her make a come-up like survival of the fittest\nYou a sucker for a pretty face, smile and a pussy\nYou a clown runnin round actin wild like a rookie\nI know you know she got somebody else on the side\nCame through with you while she was rollin in his ride\nYou know the rules, your bitch chose him, now keep your cool\nA sucker for pleasure is just a full-grown fool\nNow tell the truth, she's somethin you see walk around - woof\nHad you done swooped and went and bought her ass a coupe\nJust a nigga with a brown nose, the town knows\nStill come around swear he clown those\nIt's better that you find out\n\n[Chorus]\n\n{Devin:}\nI wish I woulda known you was a crazy bitch\nBefore goin over to your house and layin some dick\nI thought it wasn't nothin but a mutual nut\nWe fuck, I get mine, you get yours, we get up\nBut before I can get to my crib you hit my hip\nStill ready to fuck with the smell of dick on your lips\nI started thinkin with my dickhead, man, that big red\nPushy-ass pussy, it's big and it's bushy\nCouldn't help but to backdo' that ass again and again\nNut after nut, shit was cool, but then, you look, friends\nStarted dippin, trippin and callin my house\nWith my gal sittin by me lookin all in my mouth\nI say: \"Hey!\", and cough, but she know I'm tryina play it off\n\"What's up, nigga? - Bitch, when I see ya I'ma kill ya!\"\nIt's better that I find another freak to take your place\nOne who won't have me dealin with a domestic case\n\n[Chorus]"}], "artist": "Big Mike"}