{"artist": "AZ", "songs": [{"title": "Da Jux", "image": "https://images.genius.com/4e9dd018e3879d531fc30a75253a8982.600x600x1.jpg", "album": "Legacy", "lyrics": "As the sun rise I wake in my apartment\nThink how many banks I could take out a 100 large in\nFor my day is started I walk in the closet\nPop a tag, grab a garbage bag to split my cigars in\nF's in the carpet go with my Fendi garment\nWatchin’ Game Time, who had 50, that was Harden\nThrowin' gang signs, gettin' busy at the garden\nShorty Facetime, real pretty, and she dark skinned\nThey lost a margin, a big cut\nCaught slimin’ at the pick up\nWonder why he ain't pick up\nThey found five in his pick up\nWhere you at? Let's get up\nNeed to know where that coke go\nAnd was it the boys? Was it the niggas we both know?\nI'm like oh no, load six in the .44\nGrab me the 12 gage, hit it right in low coat\nThey low though at a loft in Soho\nTell 'em we want it back, pay double the [?]\n\n[AZ:]\nI ain't with that, we can rap when I get back\nGather the click clacks, call on who to go kidnap\nSnatch a six pack, get low and just sit back\nWe never panic, we got mechanics to fix that\nThis that real shit, gotta let niggas kill shit\nMake 'em feel it, let 'em know that it’s still lit\nDesigner lace, them pretty Porsches in our ace\nThe city’s nauseous, they see the fortress as high stakes\nAnnihilate, violation, they out of place\nAccommodate, take whatever out of the safe\nIt's the game though, back and forth, the same old\nFriend or foe, we at the end of the rainbow\nSay it ain’t so, not a talk on my thing show\nI been about it since British walkers and Kangos\nIn a Range Rove, holler back when I change clothes\nSo we can creep on the streets and let these lames know\n\n[Vado:]\nSo that's the angle? I try time with cables\nMake 'em lie on the table then put the iron in his naval\nWhat's the time they gave you? We at the diner on Maple\nKnow my slimes is able, a bunch of lions and bengals\nTired of serachin’, ridin' around conversion\nOn my mind's the urge to see slime in person\nI can't wait, what's the plan ay? Let's go with plan A\nMeet up with gang day, headshots soon as we handshake\nIt's simple, play like you cripple wearin' a trench coat\nSee me talkin', speed up the walkin', and let the fifth go\nKeep it movin', pass up the tool, and that's when you get ghost\nStart manoeuvrin', later we coolin' and have her big toast\nIt's the lifestyle just follow lead\nSo take it off or die in ring, Apollo Creed\nIt's 'bout survival, you lift the rifle, you gotta squeeze\nOn the Bible, could win the title if you got a team\nNah mean? Vado", "year": null}]}