{"songs": [{"image": "https://images.genius.com/0c2b6ab5b12521682ccf377202642c09.600x600x1.jpg", "album": "XXX", "title": "EWNESW", "lyrics": "[Verse 1]\nI was born one day before Saint Pat\nI guess a nigga miss luck just like that\nHenry Ford, not even one mile from Motown\nExplains all the soul that you hear in my sound\nA ten minute ride to Linwood, I begun\nMy mama first son, look what I just become\nA weedhead with words more potent than what I'm smoking\nThis ain't no Reggie caught the plane ride from Oakland\nI used to play with pistols in crackhouses\nSkipping school just to fuck bitches on dirty couches, abandoned houses\nFind one with the lights on it\nLandlord came pulled the hook, now it's locks on it\nMoney? I'm plotting on it; I put the block on it\nI'm gonna get it, four deep, no shocks on it\nWe sit low, rep the D 'cause it's all I know\nAnd my name rings bells in any hood you go\n\n[Hook]\nYou're from the East Side? (East Side, East Side)\nYou're from the West Side? (West Side, West Side)\nYou're from the North End? (North End, North End)\nIs you from South West? (South West, South West)\nYou're from the East Side? (East Side, East Side)\nYou're from the West Side? (West Side, West Side)\nYou're from the North End? (North End, North End)\nIs you from South West? (South West, South West)\n\n[Verse 2]\nAround first grade, we move to the East Side\nWas like throwing rocks at a beehive\nA lot of niggas gone over something unimportant\nThat it ain't worth mentioning 'cause it's unfortunate\nLike stick a fork in it, where's the enforcement?\nWalking off the grass just to sit on niggas porches\nPassing round 40's, brown paper bags\nRolling up a swisher while this rat freak a black\nIt ain't about nothing, but let me hold something\nAte a lunchable for dinner, nigga I ain't fronting\nCaught the bus to East land, just to walk around it\nAin't buy nothing nigga, just walked around it\nLooked at some hoes, I ain't even holler\n'Cause I'm broke as fuck and they is all about a dollar\nI'm living in the city where the weak get swallowed\nBelly of the beast, we don't care about tomorrow\nI'm living in the city where the weak get swallowed\nBelly of the beast, we don't care about tomorrow\n\n[Hook]\nYou're from the East Side? (East Side, East Side)\nYou're from the West Side? (West Side, West Side)\nYou're from the North End? (North End, North End)\nIs you from South West? (South West, South West)\nYou're from the East Side? (East Side, East Side)\nYou're from the West Side? (West Side, West Side)\nYou're from the North End? (North End, North End)\nIs you from South West? (South West, South West)", "year": "2011-08-15"}], "artist": "Danny Brown"}