{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/86239d3de00e4660583da44a02ffa821.820x546x1.jpg", "title": "Gangsta", "year": null, "album": null, "lyrics": "[Intro]\nAll points in the region related gangsterish\nServing dark dishes of true pimp horror\nWarriors stormy nights on leathery wings\nSexy sirens in dreams of king Stephen killer mike\nMad stalking midnight\n\n[Chorus: repeat 2X]\nWestside riders keep it (gangsta)\nSouthside hustlers keep it (gangsta)\nEastside killers keep it (gangsta)\nNorthside monsters keep it (gangsta)\n\n[Killer Mike]\nSee I in the V.I. staggerin and weed eyed\nStumbling and laughin rollin in with 'kast 'nem\nCold weather bubble goose 4-5er mashin\nFrom G.A. to L.A. Force 1's be my fashion\nDisrespect my space I'll push yo fuckin back in\nSpit in your face and hand your faggot ass a napkin\nEverything you did mu'fucka we done done done\nRan streets took over traps carry gun gun\nI'm from a hood full of junkies and pastor sons\nWe don't give a fuck how hard you come we don't run\nOur moms ain't raise no faggot ain't nothing queer nigga\nWe don't give a fuck blood'll smear right here nigga\n\n[Chorus]\n\n[Killer Mike]\nShit\nThem killers in the cut they conspiring they conniving\nAin't no fifth for them niggas them niggas shit we ride with\nThem fur coat and champagne suckers better hide when\nThey peep a team of gully motherfuckers bout to slide in\nThese bullets leave you shakin like that dance from N.Y. and\nI put that on my children and my young nephew Ty and\nAnd my nigga Kimjohn years away from frying\nHe send me letters telling me how grown men be crying\nWhen they surrounded by rapists with lustful eyes in\nThe belly of the beast where they don't let no light in\nRed velvet robbin crews totin lead pipes in\nTo your suburban home throwin on kids and wife and\nYou go spaghetti when these killers strike like lightning\nNiggas go spaghetti when these killers strike like lightning\n\n[Chorus]\n\n[Killer Mike]\nShit\nWe don't give a fuck bout who your homeboy friends is\nWe don't give a fuck bout what series your benz is\nAll we gives a shit about is up all night trappin white\nCop that yay weigh it right till lay lay equals glass pipe\nMy side of town don't act right\nEvery damn day is fight night\nThese motherfuckers don't act ok\nThese motherfuckers just spray they k\nDown the block over rocks hot 4-5's be coughin\nMothers who couldn't afford shoes and socks\nThey purchase coffins\n\nYou scared motherfucker you scared (rich nigga)\nYou scared motherfucker you scared (bitch nigga)\nYou scared motherfucker you scared (snitch nigga)\nYou scared motherfucker you scared (trick nigga)\n\n[Chorus] - 2X\n\n[Talking]\nAll those who oppose higher glory beware\nFor candelit crypt comes open and monsters see\nTwo big rested vamps doin the snake-dog dance"}]}