{"artist": "Big Ed", "songs": [{"lyrics": "Chorus:  [Big Ed]  (Mo B. Dick)\n\nFuck who you wanna fuck (Fuck who you wanna fuck)\nAt the Fuckfest\nSuck who you wanna suck at the Fuckfest\nEat who you wanna eat (Eat who you wanna eat)\nAt the Fuckfest\nCan't go meat to meat at the Fuckfest\nFuck who you wanna fuck (Fuck who you wanna fuck)\nAt the Fuckfest\nSuck who you wanna suck at the Fuckfest\nEat who you wanna eat (Eat who you wanna eat)\nAt the Fuckfest\nCan't go meat to meat\n\n[Big Ed]\nMy homegirl Chyna called me at 11:07\nSays she has a treat for that will make me feel like heaven\nI ain't trippin' cause her ass is tight\nPlus it's been a day and a half since I laid the pipe\nShe got big titties, big ass, thick thighs\nWork it so good it'll make a grown man cry\nChocolate, flexible, plus a scorpio\nShe loves it from the back and she can ride the bucking bronco\nHow 'bout that there?\nHung up the phone and my dick beat me outta the chair\nShaved, showered, got dressed up in the BM\nGot the gat for haters, Jim-hat to catch the semen\nForting on a 40\nGot to Chyna's house time to get naughty\nSo I rung the doorbell, she opened the door, in lingerie\nHad fresh food, whip-cream on a silver tray\nWalked in locked the door behind me\nThe high heels that she had on titled up her hiney\nI had on sweats so my dick buldged out\nShe put her in my sweats and said \"What's it all about her?\"\nI said \"I come to knock it out\"\nShe made me sit down and straddle me on the couch\nTitties in my face, griding on my dick\nShe started licking on her nipples and rubbin' on her clit\nNow she's sucking on her fingers\nShe has a surprise for me and she can't wait for me to meet her\nWait a mintue, HER?, then the bedroom door opened\nThe girl that walked out was so hot that she was smokin'\nNow my dick is hard as brass coltins\n\"Oh that's your boy's old lady, I thought that was a golden\"\nMan the only thought I had was long strokin'\nShe walked up and spread her pussy wide open\nMan high heels do something to a nigga\nThe way it prompts up everything on a female figure\nThis was built like a world class winner\nPretty face, caramel, so fine she could be dinner\n\"Hi, I'm Angie\" \"Nice to meet you baby\"\n\"Big Ed, huh?\" \"Shit it's all gravy\"\nBut this my dick was out\nAnd Chyna had that deep pistol working in her mouth\nAngie got alittle bit jealous\nMy girl Chyna's a hot dog, but shit Angie's the relish\nThey started sharing the dick\nBack and forth, back and forth, and Angie kept it\nChyna worked her way behind Angie\nWalked to her room, her ass switching in them G-string pannies\nAngie sucks a hellafide dick\nWhy she sucks on the balls, she strokes the meat with a twist\n\"Oh shit yeah slob on it\"\nShe wrapped her tits around the shaft and she twisted the knobs on em\nTitty-fucking while she sucks my dick\nBut leave it up to Chyna for the real freaking shit\nShe came out the room with a bag and a grin\nI looked at her and said \"Let the games begin\"\nChyna manuvered Angie on to the floor\nAngie kept sucking, facing me on all fours\nChyna started getting Angie from the back\nThe way Angie sipped I thought she was having a heart attack\nChyna reached in the bag\nPulled out a strap-on dick and stuck her tounge in Angie's ass\nNow that's just perverted\n\"You like that?\" \"Yeah go ahead and hurt it\"\nShe put on the dick, grabbed Angie's hips\nInserted it, and started working it, and working it\nWear the motherfucking ass out\nAngie stopped sucking dick and started biting the couch\nNow I'm looking like \"OH SHIT!\"\nReal life porno shit, a bitch banging a bitch\nJumped up and put the condom on my dick\nKY'ed Chyna's ass and starting looking for some shit\n6 9ing, multiple positions\nEverybody cummin', no intermission\nBig thick stickin', fuckin' in the kitchen\nWhip cream everywhere, everybody lickin'\nIt went on like this all night\nWhen I'm finished with them, look like they just lost a fight\n\nChorus:  [Big Ed]  (Mo B. Dick)\n\nFuck who you wanna fuck (Fuck who you wanna fuck)\nAt the Fuckfest\nSuck who you wanna suck at the Fuckfest\nEat who you wanna eat (Eat who you wanna eat)\nAt the Fuckfest\nCan't go meat to meat at the Fuckfest\nFuck who you wanna fuck (Fuck who you wanna fuck)\nAt the Fuckfest\nSuck who you wanna suck at the Fuckfest\nEat who you wanna eat (Eat who you wanna eat)\nAt the Fuckfest\nCan't go meat to meat at the Fuckfest\nFuck who you wanna fuck (Fuck who you wanna fuck)\nAt the Fuckfest\nSuck who you wanna suck at the Fuckfest\nEat who you wanna eat (Eat who you wanna eat)\nAt the Fuckfest\nCan't go meat to meat at the Fuckfest\nFuck who you wanna fuck (Fuck who you wanna fuck)\nAt the Fuckfest\nSuck who you wanna suck at the Fuckfest\nEat who you wanna eat (Eat who you wanna eat)\nAt the Fuckfest\nCan't go meat to meat at the Fuckfest\n\n*loud panting until the end*", "image": "https://images.genius.com/2c9efb860b4d6cf291a19972d492574c.499x499x1.jpg", "year": null, "title": "Fuckfest", "album": "Special Forces"}]}