{"songs": [{"image": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.1000x1000x1.jpg", "title": "Destroy and Rebuild", "album": "Stillmatic", "year": "2001-12-18", "lyrics": "[Intro]\nThis is a journey into the world's most largest and notorious projects: Queensbridge\nListen while Nas saves his hood from the most cowardest rappers\n\n[Verse 1]\nHe held a mass appeal and a likkle boy smile\nDepressed has a complex his mouth was foul\nYou need to stay around I feel like tellin' some stories\nFirst there's this arrogant fuck, his name's Cory\nHung around my man's Lakey and Big Trevor\nTrevor's still locked up, Lake's gettin' his cheddar\nCorey changed his name to ahh, whatever\nCornchip, Buckwheat look-a-like, it's Mega\nRight, Mega was his name, sorry about that\n(But it's so hard) to put a coward's name in my rap\nAlways actin' tough, a jokester be frontin'\nHe got snuffed, he got shot in the thigh, he did nothin'\nBut that's Nas always lookin' out for bredren\nCause when bredren don't return love it don't stress him\nCause gangstas do gangsta shit, real recognize real\nStill laughin' to the bank and shit\nBack to Cor', got him a deal but his rhymes was wack\nDef Jam mad that he signed the contract\nNow he got jealous and mad at my shine\nMaking silly tapes, I'm always on his mind\nNonsense, not to be obnoxious kid\nMega for the record you could suck my dick\nBitch, you from around the way it's sad what this do to me\nBut Queensbridge, we gotta have unity\n\n[Refrain]\nThey say (the bridge is over, the bridge is over)\nNah this is the time we destroy and rebuild it\nThey say (the bridge is over, the bridge is over)\nNah we the strongest hood but weak niggas kill it\nSo they say (the bridge is over, the bridge is over)\nNah this is the time we destroy and rebuild it\nThey say (the bridge is over, the bridge is over)\nNah we the strongest hood but it's these cowards that kill it\nSo they say\n\n[Verse 2]\nSince we on the subject of traitors and flunkies\nMega ain't the only faggot in my hood, dummies\nThere's plenty that wanna be me but cannot\nIts like King Arthur and Knight Sir Lancelot\nLefty and Donnie Brasco, Gotti and Paul\nBefore I woulda told you Prodigy's my dog\nThrough the ups and downs, robberies and all\nThough I always knew he wanted my downfall\nHe would say his little slick shit and act real funny\nFor what, nigga? You're butt and it got back to me\nAskin' a Braveheart to get back your jewelry\nYou ain't from my hood, don't even rep Q.B\nNature moved to Marcy\n(Man dick riding Nature) nothing else to say\nMan Nature moved to Marcy (far.. far away)\n(Backward ass niggas, man fuck them niggas\nGo head with the program man proceed)\nOld lady pocketbook snatcher, car thief\nOf course we ain't friends, you never stood on no blocks\nStreets or corners with zombies, ghouls and gangstas\nCops, drug dealers with pools of blood anger\nJust fills me when niggas let out of town to set shot\nAnd get filthy rich, its just not\nNo more morals, no loyalty, no more community\nQueensbridge, we gotta have unity\n\n[Refrain]\nThey say (the bridge is over, the bridge is over)\nNah this is the time we destroy and rebuild it\nThey say (the bridge is over, the bridge is over)\nNah we the strongest hood but weak niggas kill it\nSo they say (the bridge is over, the bridge is over)\nNah this is the time we destroy and rebuild it\nThey say (the bridge is over, the bridge is over)\nNah we the strongest hood but it's these cowards that kill it\nSo they say\n\n[Verse 3]\nI put the name on the map after Marley and Shan\nQ.B. before the ROC had one jam\nBefore the Death Row and Bad Boy beef\nHad streets locked with raw talent, I laugh at the weak\nSo this about cleanin' up house, my own backyard\nFamous home of rap stars well known be getting robbed\nP, how many times ain't you shamed that\nJungle was bustin' his gun to get your weak chain back\nThey don't respect you a cheque's due for me for your fame\nMega I hope you blow so I'm sayin' your name (Mega, Mega)\nHoes play your position 'cause you'll never be King\nEven Jigga want the crown: \"How that sound?\" Poor thing!\nI'm representin' Queensbridge U.S.A\nWhere two SK's go off every day ruthless-lay\nAll you little roaches and rats\nBesides my man Ricky, Nas the true ruler is back\nSo haters say\n\n[Refrain]\nThey say (the bridge is over, the bridge is over)\nNah this is the time we destroy and rebuild it\nThey say (the bridge is over, the bridge is over)\nNah we the strongest hood but weak niggas kill it\nSo they say (the bridge is over, the bridge is over)\nNah this is the time we destroy and rebuild it\nThey say (the bridge is over, the bridge is over)\nNah we the strongest hood but it's these cowards that kill it\nSo they say\n\n[Outro]\n\"The Bridge is over,\" my dick!\nThe Bridge'll never be over, long as I'm alive and breathin'!\nBraveheart to the graveyard! I'm the William Wallace of this shit\nAyo P, Prodigy I got love for you man, I love you man\nYou know what I'm sayin'?\nJust get them unloyal niggas from out your circle!\nYou can't save everybody!\nNiggas invited you to the hood - rep it right my nigga!\nBe untouchable, my nigga\nSo it be Mobb for life for real, and that's real!\nAyo Nature, I can't hold your hand through this shit man!\nI'm not your father, man!\nBe your own man, stand on your own two!\nI believe in you, believe in yourself, nigga\nOr dont even rep this, man!\nAyo Mega you wanna be a gangsta?\nThere's real gangsta shit going on in the streets man!\nYo niggas is in the grind! Where you be at man?\nNiggas be buckin'!\nWhy you never buckin'? Where you be at, man?\nAll of a sudden you the motherfuckin' Nino Brown of the fuckin' hood?\nIt's disgusting, man! Stay out the magazines!\nKeep my name out your motherfuckin' mouth!\nThere's no more room for jealousy, we destroyin' and rebuildin':\nThat means the cowards get out, and real niggas stay!\nNiggas been hating me since I been nine\nShining with suede motherfucking Bally's on and silks\nI'ma always be the young don\nDon't be like the niggas on the other side:\nHating me cause I'm beautiful!\nReal niggas in Queensbridge:\nYou niggas come up and get this money and move on baby!\nQ.B"}], "artist": "Nas"}