{"songs": [{"title": "Magic", "album": "LS2*", "year": "2019-07-24", "image": "https://images.genius.com/663a015db44e96af461f47bd8d4879b1.600x600x1.jpg", "lyrics": "[Intro]\nYeah\nRoll one up and hit this magic\nOh, yeah (Roll one up and hit this magic)\nYeah\n\n[Chorus]\nRoll one up and hit this magic (Yeah)\nWith the gang, we ball out, it could get tragic (Let's go)\nAll we got, we gon' let you niggas have it (Woo woo)\nStuck in my ways, think I need to change my habits (Woo woo)\nWhat would you do if you were me and didn't have shit? (Yeah)\nLook in the mirror, now I'm feeling like a savage (Let's go)\nTell my son I love him, for him, I'ma make it happen (Woo woo)\nNow my dreams reality, not going back to trapping (Woo woo)\nYou say that you proud of me, I turn my back, you laughing\n\n[Verse 1]\nNow I hit the scene, they like lights camera action\nLiving in a dream, now my music they be blasting (Yeah)\nStep out, I'm a star, always in the latest fashion\nHad to set the bar, niggas try to catch me lacking\nBank account for my son, he won't have to struggle\nYou can see it in my eyes, all I do is hustle\nThey tried to knock me off my feet, I'm ready to rumble\nFeel like I ain't ate in weeks, working off the muscle\nOh yeah, oh my, we ride, for my brothers no lie\nAll you niggas can die, never wrong, they right\nI ain't changing my side, yeah, we in it for life\nIf you down, we ride\n\n[Chorus]\nRoll one up and hit this magic (Yeah)\nWith the gang, we ball out, it could get tragic (Let's go)\nAll we got, we gon' let you niggas have it (Woo woo)\nStuck in my ways, think I need to change my habits (Woo woo)\nWhat would you do if you were me and didn't have shit? (Yeah)\nLook in the mirror, now I'm feeling like a savage (Let's go)\nTell my son I love him, for him, I'ma make it happen (Woo woo)\nNow my dreams reality, not going back to trapping (Woo woo)\nYou say that you proud of me, I turn my back, you laughing\n\n[Verse 2]\nAyy, how could you lie to my face?\nPeople claim that they be loyal, they be taking up space\nSee my broski lose his heart when he was fighting that case\nTook so many L's, I'm not going back to those days\nI'ma treat you how you treat me, do you like how it tastes?\nShawty, you's a one nighter, can't treat you like my Ace\nI got way too many problems to be worried, I'm straight\nMe and Craig selling weed, had to watch for the jakes\nOn the road, this shit crazy, I get eighty a show\nSave my money, stack it up, it look like I'm selling dope\nForeign cars, driving fast, I've never done this before\nGet high, drown out my problems, let me pour me a fo' (Yeah)\n\n[Chorus]\nRoll one up and hit this magic (Yeah)\nWith the gang, we ball out, it could get tragic (Let's go)\nAll we got, we gon' let you niggas have it (Woo woo)\nStuck in my ways, think I need to change my habits (Woo woo)\nWhat would you do if you were me and didn't have shit? (Yeah)\nLook in the mirror, now I'm feeling like a savage (Let's go)\nTell my son I love him, for him, I'ma make it happen (Woo woo)\nNow my dreams reality, not going back to trapping (Woo woo)\nYou say that you proud of me, I turn my back, you laughing"}], "artist": "Lil Skies"}