{"songs": [{"album": "Braille", "year": "2013-06-18", "title": "Hold Nothing Back", "image": "https://images.genius.com/6014fd37d6c92cafb49c7530025244ca.1000x1000x1.jpg", "lyrics": "[Verse 1]\nJson what happen, why Reach ain't sign you? You unashamed?\nYou 1-1-6, why Lecrae ain't never saying your name?\nYou ain't been on they albums lately\nThey ain't took you on no tours\nMan, them yo homies, man, what’s popping y'all cool, are you sure?\nYou signed to Lamp Mode ain't you? What's up with that decision\nHow’s that going, I'll be honest man yall just sound so different\nYou a Calvinist right? Is it true, could you please\nJust let me know I'm hearing things 'bout what y'all dudes believe\nWait, hold up\nNah they ain't sign me but it's good it ain't happen to work\nI'm 1-1-6 I will be this 'til I'm dead in the dirt\nOur relationship was never based off no albums and songs\nBut love a brotherly bond to this day it's very strong\nLamp modes my label I love them and though our music's different\nOur heart congruent consistent with God who offers forgiveness\nAs far as where I stand, keep the Calvinist title\nI'm a Christian, I believe in what I see in the Bible\n\n[Chorus]\nIt's so much up in the air so why you running away, running away\nWe heard the good and the bad so what do you got to say, you got to say\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\n\n[Verse 2]\nJ You a Christian rapper or a rapper that’s Christian?\nCall me whatever as long as you hear truth when you listen\nI ain't got no time to sit and debate 'bout no petty name\nWhen it's dudes in the streets that think life is a deadly game\nNow you moved to Idaho\nNah fam man Iowa\nReally?\nWhat made you leave St. Louis we know you love for your city\nThe Lord told me to go, I'm on staff at a church\nA pastor?\nNah just outreach stuff, man, I'm doing His work\nI left kicking and screaming but moving brought growth and faith\nI'm moving back in a few years just to serve at the gate\nTell us bout Duece and Truth, you think they real or fake?\nFalling don't make you phony, just means you need His grace\nThe Lord humbled them dudes, I was broke when I heard that news\nCause from a distance they both instilled in me lots of truths\nI don't love them no less and though I was upset\nThank God for repentance and I wish my brothers the best\n\n[Chorus]\nIt's so much up in the air so why you running away, running away\nWe heard the good and the bad so what do you got to say, you got to say\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\n\n[Bridge]\nSo much going around, so many questions\nI don't mind sharing my heart\nHope you feel it\nI ain't got a reason to hold nothing back\nOoh, shine the light\nOoh, shine the light\nOoh, shine the light\nOoh, shine the light\n\n[Chorus]\nIt's so much up in the air so why you running away, running away\nWe heard the good and the bad so what do you got to say, you got to say\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back\nI ain't gonna hold nothing back"}], "artist": "Json"}