{"songs": [{"lyrics": "[Intro: Asian Doll]\nIt’s so hard for bitches to, to say, “Damn I fuck with your style!” Like you know what I’m saying? “I dress like this cause you!” Like know what I’m saying? I ain’t never in my life been petty, I never in my life, just, you know what I’m saying, like gave a fuck! So when I see girls dressing like me, I be happy, I like really be happy, like I really fuck with it. I will like your picture, I will comment, like you know what I’m saying? I don’t give a fuck how many followers you have, I will fuck with you, because, you know what I’m saying, it makes me happy because it’s like damn, I’m doing something right, you know what I’m saying? I seen, I seen people hate my style, people talk about my style, people talk about my big shoes, people talk about my hair, people talk about everything, I, and it’s just like, all of a sudden, everybody doing it, and it’s just like Asian just started, Asian didn’t do, and it’s just like damn bitch, like you hoes never wanna give me credit for nothing, like, how the fuck? I did start it! Like how the fuck? I did bring this shit to the new generation, like we all like,  at the end of the day my nigga, I’m the first, I’m the first female artist of this whole lil’ thing to come out and say, “Nicki Minaj is my inspiration!” I look up to her, none of you bitches ever said that before! “I look up to her!” None of you bitches ever said that before! I ain’t seen not one interview, with nobody say, “Oh, Nicki Minaj, I’m inspired by her, I look up to her!” I can, I was the first! My nigga that’s how you know, that I ain’t with no hating shit, I never hate on a bitch in my life. I got everything I ever wanted. Like what you mean?\n\n[Outro: Nicki Minaj]\nUh, Asian Doll always shows me genuine love, so I just, it just warms my heart when girls do that", "album": "Doll Szn", "year": "2018-05-04", "title": "Doll Szn Intro", "image": "https://images.genius.com/30dd3a8bdc3a5a5e3492c52a90ce804a.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}