{"songs": [{"image": "https://images.genius.com/857a416f44825b13b2e0155587142ae2.600x600x1.jpg", "year": null, "title": "Multiply", "album": "Man vs Machine", "lyrics": "[Verse 1: Xzibit]\nI've beeeeen this way and I can't stop (ah)\nHands on the ball and I won't drop (no)\nHalf-assed rhymes that you can't watch (no)\nIt ain't cause I want to, it's cause I got-ta\nGet it Crip while the gettin' is good\nBefore the game is 10% skill and 90% Hollywood\nI don't need that, I don't believe that\nE'rybody gon' get hurt, if I do dirt\nI flirt with the idea of quittin' the game\nNah!! I'mma evolve continue to change\nIt take brains, balls and backbones to get it on\nAnd keep it on, we keepin it movin, to each his own\nSo I spit about it, whatever I feel about it\nI'm just bein real about it; X get hot nigga forget about it\nSpeech don't faiiiiil me now\nDedicated to the enemies that freeze and hold me down\n\n[Hook: Nate Dogg]\n(We) back on line (We) came to ride\n(We) build (We) stack (We) multiply\n(We) stay on the grind (Until) we die\nAnd back for mo', cause we can't get enough\n\n[Verse 2: Xzibit]\nAbove the rest, accept no less\nGo ahead, check the game, be my guest\nSomethin brand new and heavy to get off my chest\nWin time after time 'til there ain't none left\nHardhat, punch the clock, back to work\nI'm bigger, stronger, faster, built to hurt\nEverybody and anybody who come to my party\nLike they ready to get roudy and touch somebody\nWho's that nigga y'all came to see? \"X!\"\nOften imitated, but cannot be, \"X!\"\nWhat's next, collect respect like paychecks\nStraight to the bank with my bitch and have safe sex\nWhat do you believe in? I believe in\nSeizin the moment, livin and dyin to spit with a vengeance\nHere for redemption - been around forever\nY'all cats were just too blind to listen\n\n[Hook: Nate Dogg]\n(We) back on line (We) came to ride\n(We) build (We) stack (We) multiply\n(We) stay on the grind (Until) we die\nAnd back for mo', cause we can't get enough\n\n[Bridge: Nate Dogg]\nIt ain't my fault.. we keep droppin' hits\nAnd you can't spit like this, so I'm takin' yo' bitch\nIt ain't shit changed.. we gon' bang like this\nAnd I'm drinkin' this fifth, we still don't take no shit\n\n[Verse 3: Xzibit]\nI got a sixth sense, that tells me you ain't worth six cents\nI'm sick with my sixth sense\nWhattup Doc? I'm gettin' down to business\nCrooked as the cops to the Rampart district\nLose yourself in the music, move it or lose it\nAbuse it, let's booze it, please don't confuse it with the\nNext man, it's the X-Man rollin\nStand firm, solid as the ground I'm holdin'\nMake mine +Golden+, permanent +State+ issue\nStacked with the wealth that you can't take witchu\nLong range missile, if we got issues\nI'mma squeeze this shit and nobody gon' miss you\nI'mma keep swingin 'til the medics come get you\nWe busy, stay off my line, you can't get through\nPeep the design from the mastermind\nYo Dre, bring that shit back one more time!\n\n[Hook: Nate Dogg]\n(We) back on line (We) came to ride\n(We) build (We) stack (We) multiply\n(We) stay on the grind (Until) we die\nAnd back for mo', cause we can't get enough\n(We) back on line (We) came to ride\n(We) build (We) stack (We) multiply\n(We) stay on the grind (Until) we die\nAnd back for mo', cause we can't get enough"}], "artist": "Xzibit"}