{"songs": [{"lyrics": "Intro:\nMr. Mix Mr. DJ play that beat\nWon't you play it for me. In the mix mister hop\nForward hop back. Hop, hop hop\n\n[Verse 1]\nThe second somebody dies somebody else is born\nPeople are celebrating while other people mourn\nHome may be home to you but to me it's foreign\nEven the matador don't pull the bull by the horns\nOne man's enemy is another man's friend\nOne man's poisons is another man's medicine\nSo let us stand, let us sit and let us view\nThe changing of the guard oh it's so hard to keep it true\nIt's the balance of the scales it can't be challenged or expelled\nSoon as somebody lost somebody else prevails\nSome someone is quiet at the same time someone yells\nHalf full or half empty water in the well\nIt's the Half and Half Hypothesis the 50/50 theory\nEerie as it may seem check your balance beam\nIt's the Half and Half Hypothesis the 50/50 theory\nEerie as it may seem check your balance beam\nNow check your Balance Beamer with a feather and a rock\nWhether or not you find the answer is really not the plot\nSee it's like love and hate (love...and hate)\nThe same emotion, different weight\nPeople love to hate, so I know you know, just how this all relates\nIt's the posa- and the nega-tive, mini and mega live\nArm, a leg, a leg, an arm, headed by a nigga\nLike big and small, short and tall\nNight and day and so on, some people are bashful\nSome people just love to get their flow on (they flow on)\nSo here goes one to grow on\nI'm a go on and on and on, till the principles are laid out\nThe scales of justice weighed out, 'til your memory starts to fade out\nAnd your game of life is played out, got to balance out the power, don't we?\nBalance your emotions, push and pull positions\nLike the moon pulls on the ocean, balance on one foot, that's equilibrium\nOpposites attract and retract, that's a fact (I'm a Libra y'all!)\n180 degrees, but not that hot\nSo whether or not you find the answer, is really not the plot (really not the plot)\nBecause, giving is receiving (and) and seeing is believing (and)\nAnd the solar system, rotates so harmonious and even\nIt's perfectly balanced\n\n[Verse 2]\nSome people say life is about taking chances, choices and decisions\nVoices and opinions, politics and religion\nClues to the past and cash and keys to the future\nIt's a possibility and probability, on who's gonna execute yo ass\nSome slow and analytical, some quick fast on the dash\nLike heads or tails, but the head usually leads the tail\nSo I tell my tales from the head, cause they're embedded inside my cells\nReal quick, let me tell you about a fact, I know things will even out\nYou can disbelieve or doubt, or even shout, or leave it in your mouth\nCause, how you gone reason with grand, Mother Nature?\nRunning Mother Earth, controlled by Father Time, who's the chaser?\nIt's living and dying homey, laughing and crying dude\nTrying or lying my brother, walking or flying fool\nNow half of you are gone, find the time to shine\nThe other half? 'Gon' find crime, money, weed, wine\nTill it's too late, in a disillusion state of mind\nI just found my peace of mind, now they want a piece of mine\nToo late in a disillusion of mind\nThe orthodox is the unorthodox, they just got you on the names\nThe insane and the sane, are the same\nIt's a damn shame, so many people's aim is so lame\nAnd their gain is so minimal, caught up in the subliminal\nIt's pleasure and pain, water for the flames, the wild and the tame\nThe style still remains, if you use the right side of your brain\nInstead of going against the grain, you can penetrate the vein\nTo the point where what remains is a stain, of this universal thang That we call Balance (balance)..", "title": "The Balance", "album": "A Book Of Human Language", "image": "https://images.genius.com/8c348dfe824da4f3b04231c7e4d629ae.700x700x1.jpg", "year": "1998-04-14"}], "artist": "Aceyalone"}