{"artist": "Inspectah Deck", "songs": [{"title": "Bump & Grindin’", "lyrics": "[Intro: Inspectah Deck]\nWuuuuuuuu! Yo\n\n[Hook: Inspectah Deck]\nWe keep (bump & grindin') we keep\nWe keep (bump & grindin') yeah\nIn the 'Jects stay (bump & grindin')\nUp top they (bump & grindin')\nDowntown they (bump & grindin')\nIn the Hill, we (bump & grindin')\nThat's right (bump & grindin')\nThat's right, yo (bump & grindin')\n\n[Inspectah Deck]\nIn the middle of the floor, they actin' hardcore\nWith shirts off, flirtin', of course, the Dom pour\nSegal split, diggin' that hit from way back\nI gained that lady with the black Baby Phat\nStacked in the back, that ass, crazy fat\nShe bump and grindin', makin' it clap\nBaby, stop playin', why you shake it like that?\nWhen you know how my dogs like to chase the cat\nHot lights, camera, action, packed in\nBack to the front, eight cats on the blunt\nThe tracks gotta pump, the rats wanna thump\nWe strapped from the junk, got gats in the trunk\nMy niggas run the V.I.P., B.Y.T\nSlip pass security to be by me\nAnd I might be slidin' that too, providin' I do\nInvite your crew, and I'll invite mine too\n\n[Hook: Inspectah Deck]\nWe'll be (bump & grindin')\nIn the back they (bump & grindin')\nUp top they (bump & grindin')\nRight here we (bump & grindin')\nAt home (bump & grindin')\nOut of town we (bump & grindin')\nHaters, they see us (bump & grindin')\nUh huh, uh huh (bump & grindin')\n\n[Inspectah Deck]\nWe at the bar like what?\nSweatin' out the Henny, no doubt, we fucked up\nBut not enough, to let you call my bluff\nYou feel what I feel, then raise your cup\nYou holdin' that hydro, blaze it up\nI'm high with my eyes on snakes in the cut\nCuz some be playin' the wall, hatin' it all\nPrayin' I take the fall, but they small\nThis, it can't stop like Shaq with the rock\nI can stand in the lot and still smash the spot\nGot the grass in my sock with the hash and block\nMight blast your top, don't crash your drop\nKeep movin', shakin', don't stop\nWhat you doin', stay with it, won't stop\nTil you blue in the face with it, can't stop\nTil, it's a new day, dig it? Off top\n\n[Hook: Inspectah Deck]\nWe be (bump & grindin')\nShaolin we (bump & grindin')\nAll the time (bump & grindin')\nShorty, she stay (bump & grindin')\nIn the 'Jects (bump & grindin')\nTear up the club (bump & grindin')\nGettin' money (bump & grindin', bump & grindin')\n\n[Inspectah Deck]\nDamn girl, I love the way that fits\nHug your waist and hips, how you sway that switch\nD.J., keep playin' that hit\nWatch her shake that shit, I can't take that shit\nFind you in the back burnin', fat sermon on the wax turnin'\nEarnin' cash, puttin' work in\nCertain, to pop it off son, keep it urban\nFloatin' with some perfect Timbs, powdered in suburban\nCatch me in the midst, Ninja with the fifth in the gripper\nMr. Big Picture, city slicker\nWho makes loot, sway suits and flavor boots\nStay loose off the Henny, the Remy or Gray Goose\nMake moves like a wrestler, spark your hate groove\nMake truce with berettas and birds and eight coups\nToxi' off the fine bubbly, dubs shine on the buggy\nGot your eyes blurry, dimes love me\n\n[Hook: Inspectah Deck]\nCuz we (bump & grindin')\nNew York (bump & grindin')\nThe Dirty Dirty (bump & grindin')\nMid West Be (bump & grindin')\nWest Coast (bump & grindin')\nOverseas they (bump & grindin')\nIn the Benz they (bump & grindin')\nEverybody (bump & grindin')\n\n[Outro: Inspectah Deck]\nThat's right, Phantom of the Beat, ya'll\nWe make hits for the streets, ya'll\nRebel I., get familiar", "image": "https://images.genius.com/c3d252f814a4716a7a99fe1984ad2678.948x936x1.jpg", "album": "The Movement", "year": null}]}