{"songs": [{"image": "https://images.genius.com/bb87853b3afb97785056d36345957531.640x640x1.jpg", "title": "Decieved Emotions", "album": "Decided", "year": "2018-09-07", "lyrics": "[Intro]\nAyy, ayy, ayy, ain't that Politickin’\nRose are red, violets are blue and you try\nI'd never leave you yeah-ee\nOn and on and on and on\nThat's that shit I won’t let on\n(Fuck wit' my head)\nMy momma don't tell me she love me\nHow the fuck I expect someone else to?\nIt's a whole world, and I [?] (Leave me slow)\nBitch, they talk like I don't know they know (Yeah, yeah, yeah, slime)\nThey say pain makes the world go 'round\n\n[Verse 1]\nTell me somethin' that I don't know\nLike you if your soul want me dead\nIgnore the signs in my face, I pray that God never let\nAnd everybody that’s around they watch me run up my check\nAnd let me blow it at the same time they help me with debt\nShe like, money coming I can find another\nI know that’s what your brain thought\nAs I sat in prison say fuck my niggas, noticed I can't blame ya’ll\nI blanked him, I blank y'all, you speak on me I shame y'all\nMy flaw, I spoke on everything, now what you think?\nSpeak on your thoughts\nWe was rollin' deep, everything let your people see\nPlannin’ on exposin' me, let the dead see\nI already done kept it G, bet that boy can't fuck wit' me\nSay what I want, pull a rod from out the sea\nErryone of them stuck with me, I ain't got no momma\nSay the devil holdin' me, go up you ain't down wit' me\n\n[Refrain]\nTalkin' superstitious, that won't make me better\nAnd if it's competition tell me what I'm here for\nWe all was born by ourselves, can't die together\nI never make you feel how I felt\nThis world gon' live by itself\nHol' on\n\n[Chorus]\nYou only let me love you if you stay\nIt go on and on and on and on and on, yeah\nSteady lettin' me fuck you, what can't you say?\nIt go on and on and on and on, I'm gone\n'Fore y'all separate, y'all can talk it out\nWhat she need for to leave? You should give it all\nIf she feel that nigga better then he better than that nigga raw\nIf you came up once you could never fall\nIf you love her, don't let her walk\nIf she push you away, open the gate, you gotta let her out\n\n[Verse 2]\nGod made us outta dirt\nShe gave him fruit, he ain't deceive his self\nAnd if you read the Bible you should know that love would never help\nHoldin' in all of the shit that I felt\nIf you ain't here with me, then I don't need myself\nI ain't know I was this powerful\nI saw it when my grandma left, yeah (turn up Kentrell)\nUpgrade my doses with them meds\nDirty bitch I was unfresh\nWithout help, I came out blessed\nPulled my heart from out my chest\nCat and mouse that book I read\nCross me in the wrong way\nBlow yo shit out on the deck\n\n[Chorus]\nIt go on and on and on and on and on\nAnd if you stay then you won't even let me love you, bae\nIt go on and on and on and on and on\nSteady lettin' me fuck you, what is it you can't say?\n'Fore y'all separate, y'all can talk it out\nWhat she need for to leave? You should give it all\nIf she feel that nigga better then he better than that nigga raw\nIf you came up once you could never fall\nIf you love her, don't let her walk\nIf she push you away, open the gate, you gotta let her out\n\n[Outro]\nTouchdown nigga, yeah, aye\nIt be them same lil' niggas that payed for a feature, you heard me\nAye I don't speak on nothin' you know that I'm all the way out there bitch\nI been dumb, retarded, you heard me\n38 baby, believe that"}], "artist": "YoungBoy Never Broke Again"}