{"artist": "R. Kelly", "songs": [{"album": "R&B Jumpoff 29", "year": null, "lyrics": "(feat. Young Jeezy & Young Dro)\n\nI Want Everybody In The Buildin' To Put Up A Middle Finger Right Now!\n(Oh Oh Oh Oh)\nLadies And Gentlemen Once Again It's Me\n\n[Chorus:]\nGive Me A Club Full Of Chicks\nSexy With The Nice Outfits Man, And I'm A Blow It Up\nGive Me A Bar Full Of Liquor\nV.I.P Packed With Niggas Man And I'm A Blow It Up\nGive Me One Of Them Girls On The Pole\nStripper Joint With Hundreds To Throw\nBut Believe I'm A Blow It Up\nGive Me A Mic In My Hand Plus A Hundred Grand\nLil Weed And I'm A Blow It Up\n\n[Verse 1: R. Kelly]\nTo All My Real Live Niggas Wats Happenin\nIts Kells I'm Bout To Get Shit Crackin\nMuch Love To All The Playas That Be Mackin\nMiddle Finger To Fake Niggas That Be Actin\nBut Shout Out To All My Bitches In The Building\nI'm From The Chi So Put Yo C Up In The Buildin\nI Got Some Liquor In Me I'm Bout To Kill This\nFuck Watchu Heard Nigga Kells Is The Realest\nPlus We Got A Lot Of Ass In The Place\nPerfect Cuz I Like Ass In My Face\nWalk Right Pass Security At The Door\n10 Chicks Wit Me I Dont Even Know\nFrontin Chicks Be Like Hey Kells Ho\nI Be Lookin At Em Like Wo Bitch Wo\nIm A Billboard Mack Cuz Man I Pimp Charts\nI'm 60% R&B Bitch 40 I'm Hip Hop\n\n[Chorus:]\nGive Me A Club Full Of Chicks\nSexy With The Nice Outfits Man, And I'm A Blow It Up\nGive Me A Bar Full Of Liquor\nV.I.P Packed With Niggas Man And I'm A Blow It Up\nGive Me One Of Them Girls On The Pole\nStripper Joint With Hundreds To Throw\nBut Believe I'm A Blow It Up\nGive Me A Mic In My Hand Plus A Hundred Grand\nLil Weed And I'm A Blow It Up\n\n[Verse 2: Young Dro]\nDro Roll Me Up Blow It Up\nThe Rim To Small For Uhh Blow Em Up\nLook 30 Inches Sit Up Up On That Pearland Truck\nBout To Leave The Club And Go And Tear Yo Girl Ass Up\nDiamonds On Us Got White King Colors\nI Turn This Way And Turn That Way It Might Change Colors\nThem Broads Look Good Enough We Might Bring Rubbers\nAnd I Might Make Her My Girlfriend We Might Become Lovers\nBut That's Another Story Gator Shoe Morgey\nDro And R. Kelly Bitch Tell Me U Adore Me\nDifferent Color Mink Shit Wrist Full Of Pink Shit\nU Dealin With A King Lil Buddy U Need To Be Thick\nAy Young Jizzle Gettin Money Anyway\nU Make It Rain At Night I Make It Rain In The Day\nHundred Grand Stacks Put Them Thangs In Yo Face\nGrand Hustle In The Buildin Get Them Lames Out Ya Face\n(Let's Go)\n\n[Chorus:]\nGive Me A Club Full Of Chicks\nSexy With The Nice Outfits Man, And I'm A Blow It Up\nGive Me A Bar Full Of Liquor\nV.I.P Packed With Niggas Man And I'm A Blow It Up\nGive Me One Of Them Girls On The Pole\nStripper Joint With Hundreds To Throw\nBut Believe I'm A Blow It Up\nGive Me A Mic In My Hand Plus A Hundred Grand\nLil Weed And I'm A Blow It Up\n\n[Verse 3: Jeezy]\n(Me And The Boi Kells Make Gangsta Music\nWhen They Play This In The Club All The Gangstas Loose It)\nBlow It Up Yeah I Been Done Blew It\nHundred Grand Cash I Rand Right Through It\nDamn Right I Run The Streets But I Rather Run U\nCame In With 1 But I'm Tryna\nLeave Wit 2doulble Trouble Sittin On Dub Deuces\nSo Who's The Star Me Or The Car?\nGuess Who Made More Tonight Baby Me Or The Bar?\nIf Ya From The A Town Throw Them A's In The Air\nThey Don't Play About Me Put Them K's In The Air\nI'm High As Mount Everest Drunker Than Everybody\nAnd If The Shit Pop Off I'm Dumpin In Everybody (That's Right)\nFuck A Dress Code That Ain't How I Kick It (Naw)\nA New Pair Of Chucks And A Fresh Pair Of Dickies ( Yeah)\nSo G So Me\nMe And The Boi Kells Make Gangsta Music\nWhen They Play This In The Club All The Gangstas Loose It\nBlow It Up!", "title": "Blow It Up", "image": "https://images.genius.com/8c21f6ea9f6e839a5bc6ddd19dbbb024.500x500x1.jpg"}]}