{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "Violator: The Album V2.0", "title": "Livin’ the Life", "image": "https://images.genius.com/7192c76005d4451007e0a80856d4c669.500x500x1.jpg", "lyrics": "[Jadakiss]\nYeah\nYeah, fuck I'm talkin' 'bout right here?\nNiggas ain't ready\nKnowhatimsayin?\nMy nigga P\nKiss, c'mon\n\n[Chorus: Butch Cassidy]\nLivin the life, steady keepin it tight\nNever take a funny nigga's advice\nPimpin the game, never trippin on fame\nWhen I'm done you'll respect my name\nThe vision is real, time will reveal\nAs I pack the steel\nTreasure I found, with the platinum sound\nThat no other can put down\n\n[Jadakiss]\nI take a lot of advice, my lifestyle's product and dice\nAnd guns that'll target your pipe\nIt's sorta like approachin the don, wrong word, wrong vibe\n4-5'll leave most of you harmed\nMove coke through the ocean, paid off the coast guard\nSailed out to Cuba, made sure shit's potent\nViolence with caution..\nAnd ain't too many niggas you know that got pilots transportin\nEgg nog whip, four door Ferrari\n2 M-16s's, I beg y'all flip\nI'm the hardest nigga you know, check it out\nTurned 40 ki's to 80 when I get in the door\nSo I flash like cameras, blast like hammers\nI worry about y'all lil' niggas just like your grandmas\nGet shit jumpin like the playoffs\nEvery twenty minutes a day give or take I knock a K off\nBeen in the hood for real long\nCatch me anywhere and I got a half a mill' on\nJada, kiss you now, you die now - why later?\nDouble R and Violator\n\n[Chorus]\n\n[Prodigy]\nYeah, yeah, yeah, yeah, yeah\nP and Kiss y'all don't wanna miss this\nThat's two ghetto-ass niggas on the same shit\nWe the two best you ever gon' hear in your life\nAppreciate this shit; Infamous Records and Double R\nNigga Cadillac trucks and bikes\nMac 10's go off, P that young boss\nBlue bottles'll pop champagne and dutches\nHundreds of that Branson, honies what's happenin\nYeah, come thug it with us, we rugged and rough\nOut the box brand new shit for you to get crunk\nHeavyweight bars and hooks for you to turn up\nThis is that gangsta shit the world'll bump\nThis is that major shit, we burnin up\nKeep your ear to the street and you gon' listen to us\nPull up my V is crushed, I blew up the spot\nWit the twenties that keep spinnin after I stop\nWhen my bunny step out the car e'rybody watch\nWhen the Lambo' doors lift up, faces drop\nSomebody daughter fin' ta get fucked tonight\nCause we fillin up the cars and the trucks tonight, what\n\n[Chorus]\n\n[Jadakiss]\nC'mon, yeah\nUhh, uhh, yeah, yo\nNiggas is lame and they ain't firin back\nAnd I don't understand how these young boys be admirin rats\nBut don't worry 'bout Kiss, bein a snitch\nOnly time I drop a dime when I'm leavin a bitch\nAm I allowed to hit 'em?  These thugs that's actin\nLike slugs is awards and they proud to get 'em\nNigga how dare chumps; put the pumps to the back of they neck\nAnd pop 'em just like air bumps\n\n[Prodigy]\nYeah, yeah, yeah, yeah\nOK let's bang nigga, the fuck you thought?\nP wet behnd the hammer, you get blammed up\nGuns'll shut your mouth, and fuck you up\nMy dunns'll raid your crib and rape your slut\nWe them real live N.Y. niggas\nWe don't play, dead real boy, stay in your place\n'Fore I put skirt on you; a wood box with some dirt on you\nYou gotta be kiddin my shottie be spittin\nYou hittin light poles tryin to get away from me\nThe Continental T'll wrap around a tree\nFuckin wit P, yeah that brand new exclusive shit\nA polka dot whip, with blood burgandy fits\n\n[Chorus]\n\nViolator.. Violator nigga, what?", "year": null}]}