{"artist": "Benzino", "songs": [{"lyrics": "[Intro: Benzino]\nUn hun, un hun-un\nUn hun, un hun-un\nUn hun, un hun-un\n\n[Jadakiss]\nYo, yeah, aiyyo\nWe can do whatever you want to, I promise\nFight, play razor tag or spit lamas\nI'm two guns up over the roof\nHopin at least one hit your upper gums over your tooth\nCuz a lot of niggas jus talkin\nWanna kill a nigga on a record, when they see 'em they jus talkin\nIn my case, I'ma jus hawk 'em\nCuz niggas is waitin for a lawsuit, it's hot and they walkin\nThey sendin dudes up like clockwork\nNiggas that can't hold it down usually come home with artwork\nAin't no such thing as a smart jerk\nThen again, one fuckin dumb-dumb can make your heart jerk\nD-Block nigga, we got work\nThat old school grey shit, uncut, got niggas pops hurt\nYou ran off Broadway, I get top work\nMinority report, you don't know what you got murk, that's why..\n\n[Chorus: Benzino]\nEverybody wanna call your name\nUntil you squeeze them chromey thangs\nEverybody wanna call you out\nUntil you pull up at the house\nAnd everybody wanna try and bluff\nGo head nigga press your luck, what's up?\nAnd everybody wanna call your name\nDon't wait, jus please call my name\n\n[Jadakiss]\nDear God I got eighty five forty five bullets in the Tommy\nWith a extra thirty clip in my back pocket so try me\nI'm on the yellow lines on one knee\nTryna hit a nigga in a building in One-D\nYeah, D-Block, you hatin the unity\nI bring it to your motherfuckin gated community\nIn case you ever get it in your mind again\nTwenty lil dirty niggas, with no guns throwin Heinekens\n\n[Benzino]\nBy the time you hear this verse, I done staked you out\nMe, V nailed and hearse, layin at your house\nWe screwin silencers, put a muzzle on that AK\nRip that nigga shit in half, make that bitch pay\nAnnihilate, every piece of ground you walk on\nNo need to talk on coward, I get my chalk on\nIt's always one nigga on the side\nTalkin out his mouth next thing you know he bleedin from his side\n\n[Chorus]\n\n[Benzino]\nAre you crazy?  I was in the dirt since '87\nIf war is hell, then will I ever go to heaven?\nThe D duck, Zino bring the Tommy when I re-up\nFour and a half is nothin, get your ki's up\nYou boys stop bluffin, before you get beat up\nTake your car keys, throw your ass in the trunk\nSlide off with your bitch, L.E.S. track bump\nCats still can't figure me out (What?)\nAskin how this nigga in the game gained so much clout?\nFuck whoever wanna claim king, I lay you down\nTake your chain and your ring, you can keep the crown\nI told your man the same thing, he can eat these rounds\nLacerate your face, pistol whip you unconscious\nYour block never did so I know you can't want this\nYou rap a good one, but I see it in your eyes\nYou like to bang on wax cuz you don't wanna die\n\n[Chorus]\n\n[Outro: Benzino]\nUn hun, un hun-un\nUn hun, un hun-un\nUn hun, un hun-un", "image": "https://images.genius.com/6e1c33f62c229b45d503c4857602a733.1000x1000x1.jpg", "year": null, "title": "Call My Name", "album": "Redemption"}]}