{"artist": "Willie D", "songs": [{"year": "1989-12-21", "lyrics": "[DJ Ready Red]\nYo Will, the word out in the street, man\nYou gonna be high-capping now, since you got your new album coming out\n\n[Willie D]\nAin't that a bitch?\nYou know goddamn well I'm on that other level\n\n[Verse One: Willie D]\nWhen I left my neighborhood, to make this big break\nI promised my road dogs, that I'd dedicate\nA super jam to the hood, that's sharp as a sickle\nSo here it is, 5th Ward, better known as the Nickel\nEverybody know my hood, they say it's no good\nBut they don't talk that shit in my neck of the woods\nWe ain't got the homes and fancy rides\nSo the only thing we have to fight for is our pride\nWashington, Armstrong, Mayweather, and Williams\nRobinson, Thomas ???, we all be chilling\nBut when a sucker starts illing, the chilling disrupts\nAnd like hemorrhoids we tear their ass up, in the Ward!\n\n[Chorus: DJ Ready Red scratching Excerpts below]\nDon't don't don't FUCK WITH ME! ------> Al Pacino as Tony Montana\nFifth Fifth Fifth Ward! --------> Prince Johnny C\nMake a move and you're dead --------> Prince Johnny C\nDon't don't don't FUCK WITH ME! ------> Al Pacino as Tony Montana\nFifth Fifth Fifth Ward! --------> Prince Johnny C\nI'm down with J.. Fifth Fifth Fifth Ward! --------> Prince Johnny C\nMake a move and you're dead --------> Prince Johnny C\n\n[Verse Two: Willie D]\nCrack is sold on the main road to brothers that's bold\nThe police come around but they ain't got no control\nYou can get an ounce, in Powder's Coffee\nAnd you can buy pussy 24-hours a day\nHoes flag you down as you cruise the streets\nJump in a car with any-motherfucking-body they meet\nBefore you can make it to the block and stop\nThey'll chew your ass lick your nuts and suck your cock for a rock\nThey don't give a damn who you are in society\nAs long as you got the damn money\nWatch your back, stash your crack because you might get jacked\nWe got some vicious bitches trained to attack\nYou keep away from The Ward\n\n[Willie D]\nYo Ready Red, why don't you tell these soft-hearted, fake-ass\nDookie in the bootied-peanut patted face, ho-ass motherfuckers\nWhat Fifth Ward is boy\n\nHard, Hard, Hard, Hard, as hell\nHard, Hard, Hard, Hard... ----> LL Cool J\n\n[Willie D]\nAiy child, where your little punk-ass brother at?\n\n[DJ Ready Red]\nOh! nigga, I don't know what the fuck you're talking about\nThe last time I've seen your punk-ass brother;\nHe was playing with a motherfucking G-I Joe\n\n[Willie D]\nWait a minute motherfucker, let me tell your black-ass something\n\n[Verse Three: Willie D]\nMy little brother threw away his G-I Joe\nHe don't pack a lunch, kid, he pack a forty-fo'\nHe says the steel ain't his meal, he only use it with Jones\nBut every time he comes home, he has a different Dookie on\nMaybe I've influenced him, some say I've ruined him\nBut they ain't never been in my shoes\nSo yo, Fuck them pencil-pushing pussies down in city hall\nI blame 'em, should hang 'em for all this damn turmoil\nThey got the power to reconstruct, but don't give a fuck\nAbout the ones who are stuck, my zipper's down cause they suck\nI've voted and voted to do a way with the negligence\nI ain't going no war for a shit-talking president\nThe demon is scheming, but his masses are glad\nMy people is crying and dying while he sit on his regal-ass\nLaugh motherfucker but your dentures are fraud\nCause see, you're gonna get yours if you ever come to The Ward\n\n[Break: DJ Ready Red]\nYo D man, what's with these stupid motherfuckers?\nTalking about what hood they're from and shit\nCalling us meatheads, ain't that hurt?\nFifth Ward don't produce no motherfucking nerds\nMan, what I want you to do for me, man\nIs talk about these bitch-ass motherfuckers, spitting louder of nothing\nMan, put these motherfuckers on the spot\nBecause this goddamn shit has got to stop\n\n[Verse Four: Willie D]\nKeepin' 'em honors, Jessy Thomas, don't you worry I promise\nThey say we're meatheads, I guess that makes them vaginas\nThey can't get honor, that's just that high-capping shear\nThey come with shotguns, ain't got none because they can't come from here\nThey fear incarceration, not because of freedom\nBut how the penitentiary pimps are gonna greet them\nWalk around the free world, with the guns acting bad\nBehind the walls they lose the balls, and also the ass\nI know your type, you like to fight but don't walk alone\nAlways running with a thousand motherfucking morons\nReady Red gotta cut for you (It ain't enough for you)\nI'll tell you what do, you better not come to the Ward!\n\n[Break: Willie D]\nThat's right motherfuckers!\nYou come from the Ward, you can't help but be hard\nSo don't be taking your stupid-ass down here\nThinking you're gonna run something with that ho shit\nCause we'll fuck around and be shipping your ass back\nTo your freak-dog baldheaded-ass mama\nKeep away from the Ward!\n\n[Chorus]\n\n(*Gun Shots*)", "image": "https://images.genius.com/03c2b50829c5f112b3f64d1ceaa1bce1.700x700x1.jpg", "album": "Controversy", "title": "5th Ward"}]}