{"songs": [{"lyrics": "Oh my God\nThey've got angels sweatin' like Helots\nWorkin' their little halos to the bone combing them deserts\nMy figure eight knotted\nLifeline defined traffic\nThe way my schoolin' end-less-ly defined every day\nOne exquisite fitted crisis rivets an octagon of red\nTo the ceiling above my bed\nIt's not a conversation piece, like public spectacles\nUnleashed more of a clue\nSo when I wake up to the reigns I'll be one step ahead of you\nI slide like Kodachrome\nWrote a poem for every planet\nTracked their mileage from the sun in an envelope\nLicked it, stamped it\nGot eight thank yous in the mail, but nine planets means there's one left\nOnly the earth would thank me later with a breath taking sunset\n(man, I'm just a bum)\nZip that waterfall around your skeleton\nTell it to boil\nLoyalties, the shovel in the soil\nDig it, I split my lip kissing the winter\nNursed the blister in the sun\nStrung a hammock between spring and where the willows turn to blood\nMight of worked\nSip a little, litter it, love it\nWithout big beetles trying to sell him sunflower seeds by the bucket\nMight of, tugboat for the boxcutter above those ashes\nWithout hot air balloons floatin' their four passenger baskets\nAnd I'm asking you\nTo let a captive lacerate a caption\nSplash out massive\nUpholster plastic classes with famine patches\nI-dentify all saints linked around the fountain's warmth\nAnd for a second taste of pain when removing that crown of thorns\nAnatropic motley clique mockado, born hostile, pacifist huddled in subtle masochist\nStamp the blame on following an inkling\nMy fire escape overlooks ghost town market place\nMartyrs barter passes\nThen fast themselves to the target's face\nYou're killin' me\n\nIf I had a hammer, I'd build a city on stilts\nSo my feet would stay dry when God's wine glass tilts\n\nIf I had a shovel, I'd dig a hole in the dirt\nAnd I'll be hiding when his drunken stupor lands upon earth\n\nAnd if your little wing is broken\nI'll see the poacher in hell\nI can't afford another anti-burden soldier to cell\nMy carousel mimics the interests of a thousand leaking spigots\nAnd a colony of graziers raised to justify the grimace\n(and yes I read the treaty)\nI prescribed brevity plus the premise is my pin cushion\nMy limbs pushin' the knitting needle\nEvils, idle, peddle past the greeting\nWhere the sleepers feed the cycles\nStop, watch the eagles board the little engine that could not\nGhost in a shell\nAnd it fell in my lap\nPassion posted the bail but the guard had misplaced the key ring (that's wonderful)\nI lead a fleet of blazing Zaxxons directly into the village\nPower supply burning the bridge between the magnet and my eye\nNow how many cadavers satisfy a mad man?\nAnd how many crooked samaritans turn plesantville to bad land?\nI can count my own dusty nickels with you laughing\nAbout you'll turn my poor ass ebony and navy with cane lashings\n(well, you're right)\nGrip your pointed stick, incite your riot\nI'll sell your worth in a bottle, let profit explain my bias\nAtomic box cult, downward spiral rapidly\nCast to hell with hate mail, forged Christ's autograph\nLaughed itself, drastic catastrophe\nBiting my lip\nSkin and bones, stringent\nBingin' on rancid baits\nMummified well inside a muddy New York minute\nWas it\nYour remnants my smoke rings have cocooned prior to fading?\nWell, it wasn't conscious spite but it might have been that\n\nI am not your friend anymore\nMy arrow head dissertation\nWhen narrow bed sleepers occupy the basement\nAnd I am not your friend anymore\nCome the dawning of cerulean, your pity blend that we'll spit in the wind\n\nMan, if it were only that simple\nI'd add a guilt frame to encore\nI'd board myself inside my room to trace the wilting contour\nOne petal falls to the rug, she loves me not\nTown crier lugging a boom box with spirit plugs\nAnd a red radio flyer\nTied to irony like twenty burning igloos with a sailors knot\nFiddler crabs build sandcastles while high tide off azalea crops\nIn the icicle field I portray, cats get antsy\nAnd ask 'why if every light is dark do I continue dancing?'\n\nWhy if every light is dark do I continue dancing?\n\nWhy if every light is dark do I continue dancing?\n\nWhy if every light is dark do I continue dancing?\nWell if it ain't finally a question that's worth answering\n\nI boogie for the raindrops\nFor the purity, the anger\nFor my childhood recollections\nFor the comic book in my heart\nThe mocked intentions\nThe clarity, passion, seclusion\nThose cool summer nights\nFor the mark merchant across the street selling me stog's at half price\nFor the mights, the maybes, the nauseating pitfall\nMy girl, my friends\nFor the fact my window opens towards a brick wall\nFor the three legged dog I saw dragged on a leash\nFor the homeless man who walks my block in rainstorms\nWith plastic bags on his feet\nSee I'll throw the weight of ten Earths over one shoulder\nAnd walk across broken glass\nThrough every wicked world to kiss tomorrow's morning\nNot for nothing\nYou'll drown in a pool of your crooked morals\nWhispering 'maybe Aesop Rock was on to something'\n\nMaybe, no promises", "title": "The Tugboat Complex", "album": "Insideout Vol. 1 - A Fool Blown Compilation", "image": "https://images.genius.com/24845ebb3037bea700f254377153c256.600x600x1.jpg", "year": "2001-09-18"}], "artist": "Aesop Rock"}