{"artist": "Paul Wall", "songs": [{"album": null, "title": "Bread On The Menu", "image": "https://images.genius.com/f4538d52cd44a5a6367fd1c32b9e3a87.781x781x1.jpg", "lyrics": "Got the bread bread, bread on the menu\nIt's all about my brick 45 bitch\nYou got the bread bread, got the bread on the menu\nMoney call clothes the type of...\nGot the bread bread, bread on the menu\nGot the bread bread, bread on the menu\nGot the bread bread, bread on the menu\nGet your, get your own bread I don't gotta call the...\nYou already know I walk up in the corner store smelling like some dro'\nPolo on my body got them Jordans on my toe (retro)\nI'm covered up in ice my chest is twelve below (below)\nRolex on my wrist and I wear it like a pro (fo sho)\nI'm at the Rockets game somewhere sittin' on the floor\nI'm right behind the bench, I don't even know the score\nI'm leaning up the foe and I'm bout to post some more\nI'm bout to hear the dreams holla at the homie though\nI'm ridin with G look and be done in my bros\nMy mind on the paper so my pocket full of dough\nTill they put me in the grave I'm a get it til I go\nI got the dopest clothes that mean I keep protection\nSo much bread on me my pockets got a yeast infection\nI got that Wonder Bread, Mrs. Baird's, Nature's Own\nAnd I ain't sharin shit bitch go make your own\nDamn that's a lot of dough yeah that Ciabatta ho\nI'm offering drinks with so much ones liek guess a dollar store\nYou got that funny money you boys comedians. my money talk so God damn bad\nIt's disobedient. The root of all evil, bread the sweetest sin. Send me to hell, hand me my plate bitch I'm gonna eat again\nWallet full of grands, I ain't cooking biscuits\nGot all my grub found out the size of my bank account terrific\nMy mind on my paper, my hand on my heater\nA trill talk speaker and I speak it through ya speakers\nSwisher full of reefer and a bottle full of sleepers\nI'll talk ya out ya money, I could've been a preacher\nThe truth can't get deep but lies run deeper\nSo my pistol on my waste by my belt like a beeper\nPosted on a block somethin' like a parking meter\nMy frontin money old, like them wild margaritas\nI got a lot yards you come by the meter\nI got a lot of drink and I pour by the liter\nI gotta lot of hustles and some of them illegal\nI'm a grind all day 'til I meet the Grim Reaper", "year": null}]}