{"artist": "Ice Cube", "songs": [{"title": "A Bird in the Hand", "lyrics": "(Big Bird: Sesame Street)\nSay look at this! I've been cleaning out my nest, and I found an old book of my poetry!\n\n(Ice Cube)\nFresh out of school cause I was a high school grad\nGots to get a job cuz I was a high school dad\nWish I got paid by rappin' to the nation\nBut that's not likely, so here's my application\nPass it to the man at AT&T\nCause when I was in school I got the A.E.E\nBut there's no SC for this youngsta\nI didn't have no money, so now I got to punch the\nClock, gotta slave, and be half a man\nBut whitey says there's no room for the African\nAlways knew that I would clock G's\nBut welcome to McDonalds; \"may I take your order, please?\"\nGotta serve ya food that might give you cancer\nCause my son doesn't take no for an answer\nNow I pay taxes, that you never give me back\nWhat about diapers, bottles, and similac?\nDo I have to sell me a whole lotta crack\nFor decent shelter and clothes on my back?\nOr should I just wait for help from Bush?\nOr Jesse Jackson, and Operation PUSH?\nIf you ask me the whole thing needs a douche\nA Massengill\nWhat the hell\nCrack will sell in the neighborhood\nTo the corner house bitches\nMiss Parker, little Joe, and Todd Bridges\nOr anybody that he know\nSo I copped me a bird, better known as a kilo\nNow everybody know I went from po', to a nigga that got dough\nSo now you put the feds against me\nCause I couldn't follow the plan of the presidency\nI never get love again\nBut blacks are too fuckin' broke to be Republican\nNow I remember, I used to be cool\nTill I stopped fillin' out my W-2\nNow senators are gettin' high\nAnd your plan against the ghetto backfired\nSo now you got a pep talk\nBut sorry, this is our only room to walk\nCause we don't want a drug push\nBut a bird in the hand, is worth more than a Bush\n\nTell the politicians, the hustlers: live and let live (yeah)\nTell the politicians, the hustlers: live and let live (yeah)", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg", "album": "Death Certificate", "year": "1991-10-29"}]}