{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Intro: R.A. the Rugged Man]\n(There's only 50,000 heads that are true to this\nThe rest are clue-less to what real hip hop music is)\n\n[Verse 1: Sadat X]\nNow what I expect\nIt's spin a lost on some vile shit\nAnd the same rap jams is what slams on the radio\nWhy I have to pay my wage to be played on 97\nWhen I've been doing this shit on stage since I was 11?\nI be the underground king, the fighter, of low rate\nAnd the promo dates, is what the black man hates\nNow to me I should been platinum or at least should gone gold\nBut I ain't, so I got to keep my soldiers on the street\nSo we can eat, hey this program's directed at the radio who can't feel me\nThey ain't trying to jam my shit, when I'm trying to be legit\nI am the legendary and I vary\nLike the flavours from Ben & Jerry\nOne foot is in the street, the other in the studios\nSometimes I wake up late at night, and don't know which way to go\nShould I settle for a hundred thousand, or keep fighting public housing\nOr get my homeboys out of jail for trying to sell the skill\nOverfail on some own real rap shit\nI kick for niggas on stage that don't have shit\nR.A. what's the lesson for today, Rugged Man?\nShould we ignore the scan that influence the record sales\nAnd we need money right here -  motherfuck \"Save the Whales\"\n\n[Hook: R.A. the Rugged Man {Sadat X}]\n(There's only 50,000 heads that are true to this)\n{One foot is in the street, the other in the studios}\n(There's only 50,000 heads that are true to this\nThe rest are clue-less to what real hip hop music is)\n\n[Verse 2: R.A. the Rugged Man]\nHey, noh-how\nNow who these kids think they are? Don't sweat those kids\nThey're trying to ruin our careers, when I've been doing this rap stuff for 10 years\nI can't remember any time that was worse\nThey tried to treat me like Heavy D and said I couldn't curse\nGet hit up, get your head split up\nDon't matter Foxy Brown or Little Kim, in bed I can tear any freaky bitch up\nLeave the spot lit-up, the opposite of heaven is what we living\nNow how come these envious cats always be sweating my position?\nI'mma live life to the fullest till I die, it's my religion\nWe gon' beat down your whole cypher if your freestyle ain't hitting\nHow could this duo not work? R.A. the Rugged, Sadat X\nI'm top 5 lyrically, if you ain't listing me you dissing me\n49 wins with no losses, heavyweights know who the boss is\nDisrespect, don't want to find out what the cause is (Hey, hey noh-how)\nI make this come back in '97\nY'all lyricists who hip hop is your life give love back in '97\nDon't play me, I react violently now in '97\nIgnorant minds best to speak silently now in '97\nR.A. the Rugged Man, hated by everyone\nYo, yo, that's why I'm here yo\nYeah, we in here, we in here\n\n[Hook]", "title": "50,000 Heads", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}