{"songs": [{"year": "2013-04-09", "album": "The Luca Brasi Story", "image": "https://images.genius.com/74477bb3bcec8fbe04175853f1f3a145.275x275x1.jpg", "title": "Hold Ya Head", "lyrics": "[Hook]\nThis goes out to those who in the grave\nLoved ones in the grave, the others doing time\nBut we'll be just right\nHold your head, hold your head\nBut don't ever hold your head down\nEverybody love it when you're broke, hate it when you shine\nBack against the ropes, no frowns, we still smile\nHold your head, hold your head\nBut don't ever hold your head down\n\n[Verse 1]\nGot it out the mud serving local in the trap\nCouple faggots wanted me wacked, had me clutching gats\nPumping crack, crack smokers quickly coming back\nI do about 55 ounces off of brick, it's jumping back\nNeighborhood record label popping in my city\nDreadlocks, aqua green collar with a fitted\nHeadlock label say if I leave I get a headshot\nSigned one contract, business venture proposal\nPay close attention, tricky dealing with hidden motives\nLike I said I signed one contract, but noticed\nWent to jail, came home, label playing me closer\nShowed me two contracts with my signature and my social\nWhat the fuck is that?\n\n[Interlude]\nLet's be honest. When you check into a hotel and you sign for your room you don't write your motherfucking social security number next to your signature. I come they got my social next to my shit on two contracts. I only signed one\n\n[Hook]\n\n[Verse 2]\nAll I they ever told me was how blessed I was to be under them\nReaper'll kill you, God's children ain't the children of men\nThis for those who got picked on and teased all their life\nUnspoken motives of the cruel, on my knees every night\nBlack termal up under army fatigue with a pipe\nItching a brick of biscuit, no need to mimick pretenders\nIndeed I eat a business when enemies would befriend you\nUntil they see you defenseless and send a nigga to flip you\nStrictly dealing the district, they leave the building, it's history\nBack controlling the city with vacuum sales and them digits\nShitting on you bitches who wouldn't lend me a penny\nSmiling everytime I'm sticking my dick in one of your women\nGates\n\n[Interlude]\nA wise man told me that to get what you want you gotta know what the fuck you want. A wise man also told me that a double-minded man is unstable in all his ways. I'm up in focus\n\n[Hook]"}], "artist": "Kevin Gates"}