{"artist": "Ice-T", "songs": [{"title": "Hit the Deck", "lyrics": "\"I'm the minstrel man, the cleaning man\nThe pole man, the shoeshine man\nI'm a nigga man, watch me dance\" {unknown movie}\n\n[Ice-T]\nI put the lyrics on the paper with the pen\nEvil E makes the records spin\nIslam drops the beats that you rock to\nThought that I would never get you? Got you\nDoggin the floor like you know you never done before\nHow could a brother be so hardcore\nAnd still keep you on the floor like a maniac\nThat's your question? Well I'mma answer that\nI'm on the mic tonight I'm here to do it right\nIce, the capital T, airtight\nCoolest of the cool, a mack on a mission\nStep to me fool - you're missin\nMinus, gone, pow, you're outta here\nThis ain't no game to me, this is my career\nThrow me a mic, plug it in, \"Bet!\"\nI won't be happy til the dancefloor's wet\nI ain't no rookie, I'm a microphone vet\nEvil E's on the set, hit the deck!\n\n{*scratching \"be easy on the cut\" (3X)\nAnd \"no mistakes allowed\" -] Rakim*}\n\n[Ice-T]\nE-M-C-E-E, I-C-E-T, A-N-D, DJ Evil E\nDoggin the deck like it's never been done before\nYou had enough? \"MORE!\"\nHere we go, I'm about to blow up\nDon't you dare bite my rhymes, I'll make you throw up\nPoison soaked in an acid bath\nSwallow homeboy, your throat'll need a skin graft\nToss it up, while the DJ known as Evil cuts\nYou wanna know what's happenin - \"WHAT?\"\nThe beat become my soul, I'm goin out of control\nLook in my face as my eyeballs roll\nBack in my head and the mic glows red\nStep in my face and you'll wind up dead\n{*SLAP*} Yo, thanks, I needed that\nI was posessed by this treacherous track\nWatch out \"WORD\" this ain't no joke\nA sucker tried to flex and his arm got broke\nDon't make a move that you'll regret\nEvil E's on the set, hit the deck!\n\n{*scratched \"kick it\" (4X)*}\n\n[Ice-T]\nYou start to think and wonder bout how it's done\n\"An emcee? Maybe I could be one\"\nDrop the thought, get a job, change your mind\nTo be a dope MC takes time\nEight years of mine, no time for draggin\nYou wanna be an MC? \"Get off the bandwagon!\"\nBut if it's in your heart, get a pen\nDon't stop writin til the inkflow ends\nWork and work and don't halfstep\nDog the mic every chance you get\nMotivation must be kept\nStay down and build your rep\nYo so let me demonstrate, rappin as a fine art\nAnd when I'm finished, you can take this rap apart\nAnalyze my elements and tactics\nFirst I'm over there, and then I'm back to this\nI jumble topics, you won't know where I'll go\nBack in your face with a cold but steady flow\nYou feel the power of the Ice in the first row\nYou already know what to say, \"HOOOOOOOOO!!!\"\nOn the mic is a stone cold vet\nEvil E's on the set, hit the deck\n\n{*Evil E scratches for a long time*}\n\n[Ice-T]\nI'm in my mode, called the fourth episode\nOr the last verse, if you wanna decode\nSo I gotta raise the heat, hype up the beat\nSwitch the mic from airtight to elite\nPounce upon the deck, it ain't wet yet\nLet me see how hot you can get\nThen I'll turn up the amps, blow out the lights\nYou're in darkness, then the mic ignites\nGlowin like it did before, but even more\nThe room is lit, the raps are hardcore\nEvil cuts the records like a psycho with a switchblade\nYou see a blur -- that's the crossfade\nLoud and proud, words bombard the crowd\nLook up in the air -- you see a mushroom cloud\nI kick flavor to a musical track\nToo fast to catch, too complex to match\nI'm gettin hyped as hype can get\nEvil E's on the set! Hit the deck", "image": "https://images.genius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10"}]}