{"songs": [{"lyrics": "[Hook-Singing]\nSo much pain we live through the strain\nSo much to gain so I can't complain\nWe'll stake our claim our ? in the name\nSo take this game, let's make this change\nSo much pain we live through the strain\nSo much to gain so I can't complain\nSo much pain it just won't, go away\n\n[Riddlore]\nIt's all foul man; I swear to God trick dice in the game\nIf my life is the prize or the stakes too high for the flame?\nAnd nowaday's, this young killer's are nice when they aim\nI'm watching rapper's who died in the flames, am I in the same?\nBoth flow ? am I gonna change or be repelled by the same catalyst?\nOnly if I had a wish, I guess the vital analysts\nWon't be some ? and telling me I'm eulogized\nSo you decide but right now I gots to ride\nMove aside no sob stories when we swab stories\nDon't cry for me, just see through my eyes, we analyze, each other's philosophy\nOver beat's, sometimes I'll show you the child in me\nBut I only can show you what's alotting me\nAllowing me speak clearly without any doubt in me\nAre you doubting me, doubting me?\n\n[Hook-Singing]\nSo much pain we live through the strain\nSo much to gain so I can't complain\nWe'll stake our claim our ? in the name\nSo take this game, let's make this change\nSo much pain we live through the strain\nSo much to gain so I can't complain\nSo much pain it just won't, go away\n\n[Self-Jupiter]\nIt's a new day, just crazy as yesterday is\nAs lazy as tommorow was I'm as anxious as to get on like people at the chronic bustop\nWhat the hell took you so long!?\nLets get this operation moving in the right direction for a change\nBy the way, anybody got any spare of change?\nOr think I could get to Australia on a train?\nOr get out the hood alive?\nI'm I good for a five story or count story courtyard drive?\nNow you know I could show up at your house tonight\nOr run up a tab ? credit\nLife can get complicated, if you let it\nRoll out the red carpet when I arrive\nBrake out the good plates cups, sallads, bowls, spoons, forks and knives\nNow when I take this shit I want one of those Chinese wives\nOnly thing I turned down is my collar, and I'm subject to pop it\nStreet scholar in a quarter pocket, Self-Jupiter from the Fellowship\nI know you jock it\n\n[Hook-Singing]\nSo much pain we live through the strain\nSo much to gain so I can't complain\nWe'll stake our claim our ? in the name\nSo take this game, let's make this change\nSo much pain we live through the strain\nSo much to gain so I can't complain\nSo much pain it just won't, go away\n\n[Aceyalone]\nI rap everyday, I work everyday\nAnd it's a full time job knowing what to say\nBlowing the smoke away, and seeing what cha got\nAnd realizing what you really are and what cha not\nPulling your line out the water and seeing what cha cot\nJust, ? and boots and that can't be alot\nYou need different bait if you want to catch a bass\nGotta have your head straight just to get some cash\nI make this records just to keep me saying\nCause the world is more crazy than a song can explain\nTo make it simple and plain, we not simple and plain\nI'm just not the same, without my thang\nLive and let live on your own Promise Land\nAnd give rap back to the common man\nThe War wasn't over when they bombed Japan\nRise and stand, devise a plan cause it's..\n\n[Hook-Singing]\nSo much pain we live through the strain\nSo much to gain so I can't complain\nWe'll stake our claim our ? in the name\nSo take this game, let's make this change\nSo much pain we live through the strain\nSo much to gain so I can't complain\nSo much pain it just won't, go away", "title": "So Much Pain", "album": "Love and Hate", "image": "https://images.genius.com/8aabb2266f1dc21cbed33421bd2b76e2.220x220x1.jpg", "year": null}], "artist": "Aceyalone"}