{"songs": [{"album": null, "image": "https://images.genius.com/2747d1dbded3ab46deeda76498bdcf2c.1000x1000x1.jpg", "year": null, "title": "Stop Calling", "lyrics": "[Hook: Terrace Martin]\nStop calling, you bugging, stop calling, you bugging\n\n[Verse 1: Terrace Martin]\nHey, hey, hey\nThought we was through but now you wanna make up, hey, hey, hey\nI used to be the one that call but now I'm fed, why won't you stop calling?\nCan't you see you're falling?\nTime keeps on ticking, so move along the way\nYou keep on tripping, bugging me every minute\nEven though we got a son together\nWe ain't gonna be together\nWhen I was trying there was no together\nAnd now you'd rather be together\n\n[Hook]\n\n[Verse 2: lil qodax]\nHey, hey, hey, girl don't you get about over, let me help you out\nPut the phone down, don't let these feelings take over\nJust let the credits roll, no need to rewind\nWhy don't you leave me alone?\nStar 67 when you're dialing my phone\nYou're sounding all crazy when you call me at home\nRelax and listen to the dial tone\nYeah, I know it's kinda hard to say\nGoodbye, but I'm sick of all the games you play\nSay this, say that\nYou see my number on your cell, please delete that\nYou need to move on the time, because it's ticking\nAnd you need to stop sticking around, around\nCan't you see you're falling, and you're getting closer too\n\n[Hook]\n\n[Saxophone Solo: Terrace Martin]\n\n[Hook]\n\n[Verse 3: lil qodax]\nWe've been fighting this and here too long\nCan't you see it's clear the love is gone?\nWhen our kids both follow here are grown\nNo need to argue, just don't call my phone\nIf you need me too I'll make it known\nI will always love you yes for forever strong\nYou do you, I'll do me on my own\nJust as long as you don't call my phone\nPlease leave me alone, we just might give a doubts off\nYou can call someone, take a person, girl you're wasting my minutes\nI gotta handle the saaqa boy\n\n[Outro: lil qodax]\nSo you can stop calling, calling, calling, calling\nStop, stop calling, calling, stop calling, calling, calling, calling\nStop calling, calling, calling, calling, calling, calling"}], "artist": "Terrace Martin"}