{"songs": [{"title": "Reactions", "album": "Immortalized", "year": null, "lyrics": "[Intro]\nUh\nMobb shit\nUh, uh\n\n[Verse 1]\nHop in the Broham\nCousin man we rollin' stolen\nStay focused, go get the calico quick, we fearin' no man\nThe program\nYou just a dead man walkin'\nYou all witnessed The Sickness, it's only of the chosen\nHe said often\nThat money would change a fake nigga\nYou can replace me and mace me\nBut can't erase me off the rictor (rictor)\nLike hundred-percenter right through ya set\nTo settin' standards like Tony\nMontana, look at the picture\nGo figure\nMutha fuckas'll go just like the Lotto\nGustafos and Noreados\nI oops along and follow\nThe not-knows\nWhen the Glock goes through ya Polo's\nIn my dreams I was hated and was told to go solo\n\n[Chorus]\nMy Reactions, like tuff actin' Tenactin wit the Mac-10\nMakin' sure my money stack in fractions\nJust follow my lead an watch me mack it\nOnly way out of the situation is the savage\nMy Reactions, like tuff actin' Tenactin wit the Mac-10\nMakin' sure my money stack in fractions\nJust follow my lead an watch me mack it\nOnly way out of the situation is the savage\n\n[Verse 2: 2 Scoops]\nWhen will they let 'em G thee\nI feel the fresh air, but I dont feel free\nAn what I wouldn't give to live the way I thought life would be\nMobb music, my only key\nMass artilery, prayers from mama\nCombined to grant the serpents soul to brace for drama\nThey experienced the hard times, it all made sense\nThen came the secrets of a gracious bitch\nMy crooked ways won't straighten\nI'll chop these dogs\nWit a hand full of hustlas, but I'm on my own\nReachin' for prime real-estate, on the banks of Rome\nOne day... all my worries they'll all be gone\nAnger expressed with empty shells, introduced to livin' well\nReal niggas out to prevail\nMy guarantee\nSmokin' bomb from dusk til dawn, my simple wishes\nShreadin' through the darkness of seekin' my fuckin' riches\nThe wild west, 'cause it'll make it without a vest\nHard blows and hoes to test, your last request\nDescendants of vengeance\nThe out-done, can't run from repentance\nMy story won't go untold\nThe rocky roads\nHurt peers to the dirt to uncover gold\nSet up shop, you can't be stopped nigga start livin'\nYou ain't gon' soar with the eagles if you run with the pigeons\nUh!\n\n[Chorus]\nMy Reactions, like tuff actin' Tenactin wit the Mac-10\nMakin' sure my money stack in fractions\nJust follow my lead an watch me mack it\nOnly way out of the situation is the savage\nMy Reactions, like tuff actin' Tenactin wit the Mac-10\nMakin' sure my money stack in fractions\nJust follow my lead an watch me mack it\nOnly way out of the situation is the savage\n\n[Verse 3: Bart]\nI'm disconnected\nThere's no exceptions, I shoulda' stayed in school\nPlayin' baseball up on the tube\nInstead of bein' on the news\nI see it all out my Donna Karans\nConstantly drinkin' thinkin' \"FUCK MARRIAGE!\"\nI love this life I live\nWho gives a fuck if I die or live\nMy only thing in this world is my kid\nMy baby mama full a pressure\nI see our love growin' lesser\nThat's why I'm crumblin' herb up on my dresser\nNaked wit out my vest protector\nTwo in the morn kickin' ya door down\nIts goin' to the floor next to your four-pound\nPrepare the Greyhound\nI'm in the hood with the homies\nAll black with no mask, Fuck they saw me!\nWe throwin' up that EASTSIDE! (EASTSIDE!) worldwide\nAn stay high\nIt's Murder and Kamakazie and I\n\n[Verse 4: 2 Scoops]\nCelebrate, I scorched you when it's crucial\nShame with bliss\nDrop the Mustang in neutral, an swing that bitch\nGot a piss test comin' up, smokin' kills\nChasin' [?] go get balance with the golden seal\nThese songs are hyms that can seal my wounds\nEmpty clips for my dead ones, the Outlawz too\nOr til, my conscious cannot be content\nUntil I make the ends, so we can cover this months rent\nDefining moments of my life\nDefeated opponents too strong for my mic\nGlimpse at the corner of pushers and pimps\nLayin' dead for the luxuries of lobster and shrimp\nSee in the district, statistics with phony fathers\nEnter the realm where the Kool-Aid is Holy Water\nLook beyond the Valley-Jo, I got a job!\nCall my mom and let her know, I'm in the Mobb!\n(In the Mobb! In the Mobb!)\n(Uh, uh, Check it out, check it out!)\n\n[Chorus]\nMy Reactions, like tuff actin' Tenactin wit the Mac-10\nMakin' sure my money stack in fractions\nJust follow my lead an watch me mack it\nOnly way out of the situation is the savage\nMy Reactions, like tuff actin' Tenactin wit the Mac-10\nMakin' sure my money stack in fractions\nJust follow my lead an watch me mack it\nOnly way out of the situation is the savage", "image": "https://images.genius.com/2417c02a0230db056bb96cdac58d5dd6.400x384x1.png"}], "artist": "3X Krazy"}