{"artist": "Ace Hood", "songs": [{"title": "Cosmic Kev (Freestyle)", "album": "Body Bag Volume 1", "year": null, "lyrics": "('Grove Street Party' beat)\n\nOk, now pocket full of money\nBitches think I'm bowlegged\nJumping outta that Phantom\nStrapped up like a tool-shed\nPlay me like a sucka', leave you in a blood-bed\nBig fire in my waistline, and I'll bust mine into yo' head\n\nSK's, M16's, and AK's I'm totin'\nRidin' round with my dreads down and my young niggas ferocious\nSee they be on some other, sister mother brother\nAll my people strapped up, and they keep their's in their cupboard\n\nHomie, I'm just tryna' party, Rosay don't do Bacardi\nMy bitches like it thick, that pussy wet as a tsunami\nI jump into her waters and explore her like safari\nI swear my money old, smellin' louder than a Sharpie\n\nI'm a wild ass nigga, show me where that paper at\nAll about my dolla' signs, that should be my zodiac\nMan, you niggas super wack, hit me with the track, and I murder that\n\nMan you niggas too coffee, hate yo' raps\nI be statin' hip-hop facts\nYoung nigga, come see hip-hop back\nA-C-E, the best un-wack\nAnd you just here to clean the mats\n\n('We be Steady Mobbin' beat)\nOK, now welcome to my drumline\nPistol by my waistline\nHomie run up on me, give him 30 like it's breaktime\n\nTell him 'have a nice day'\nI do shit the right way\nIf you hata's hatin', y'all are sweeter than a rice-cake\n\nUsed to ride a Hyundai\nNow I'm in some new shit\nI can blow a 100, check the bank like \"that a'int do shit\"\nI be on that cool shit\nDining in that Ruth Chris\nAsk me what I'm doin', still hustlin' tryna' get rich\n\nI be goin' beast mode\nFly-fitted T on\nGuess what's by the belt tho'\nCall that bitch 'Just me Alone'\nAll black, no chrome\nChevy painted two-tone\nNeck full of ice like somebody turned the lights on\n\nSwaggin' with a redbone\nI just call her 'headphones'\nLove it when she sing the music right into my mic'phone\n\nHa, and nigga you don't want no problem\nThat AK-40, you can solve 'em\n\n(unknown beat, please tell me in comments)\n\nMy nigga Kid-Go, he just bought a trey-pound\nAnd he'll bust a nigga, I just call him greyhound\nMy top got an attitude, so it stay down\nI hate talkin' so I gotta keep a gun 'round\nPlus an extra clip, another 20 rounds\nSee me chisel up, you betta' know it's going down\n\nSee, I'm a problem, yeah on the beats boy\nHear you other guys like 'mmm chew toy'\n\nUh, well I'm a beast and on some other shh\nSee, y'all ain't ever seen this, it's like a mother-ship\nYeah, and everyday I'm gettin' scholarships\nBest Brain, I should nickname it 'collarship'\nGet it? Haha, 'collarship'\n\nMy mindframe so frickin' outta here\n'Blood, Sweat, and Tears' album of the damn year\nBetter ask Cosmic Kev, I'm the real deal\nHa, yeah, see I'm the real deal\nBetter pass on this Ace at a new deal\nChea!\nUh!\n\n(unknown beat, please tell me in comments)\n\nWell I'm a We The best gangsta'\nKnife by my ankle\nHold my label down like a mufreakin' anchor\nAll about the paper like a mufreakin' staple\nRocks in the watch, ain't talkin' bout cradle\nReal nigga hear, while you otha' boys fable\nRide with a snitch, that can end up bein' fatal\nShoot you in ya' spine, now ya' body disabled\nGotta pay feva, disconnected like cable\nRidin' in that 7, got it painted all maple\n\nYeah, I'm talkin' syrup, leather outta Europe\nCall my nigga Kev, tell him \"Hood finna' burn 'em\"\nLoad another beat, come and listen to the sermon\nPockets on Sherman, club with the dumb flow\nI be with a bad 'ho, moving in that new ghost\nAnd I'm ridin' two 4's, top where? Who knows\nTank top camos, Strapped like Rambo\nPaint's on slime, I should name the bitch Vado\n\nI don't, see a nigga out 'chere, cause they know I'm out 'chere. Yeah, a nigga out chere\nWanna' make a hit, well homie I can be yo' counselor\nShouts to my nigga Meek Mill, that's for real though\nCame out to Philly, ate a steak before my night show, Uh!\n\nHa, I'm a beast on the instrumentals\nKev, sorry for my incidentals", "image": "https://images.genius.com/c25f68306f2d640b9fbb887f2794daf9.500x500x1.jpg"}]}