{"songs": [{"title": "Fake Love", "lyrics": "[Intro: Jeezy & Queen Naija]\nYeah\nSwear to God, nigga\nThis one hit close to home, man\nYou can keep the fake love 'cause I don't need it\nI don't need it\nPraying on my downfall, don't receive it\n\n[Chorus: Queen Naija & Jeezy]\nIt's fake love\n(One thing about it, it's one thing a nigga can't stand is that)\nIs fake love\n(Said he was my dawg, said he'd always be my man, but look)\nWhy I feel like this?\n(Why I feel like this, nigga?\nI know I ain't wrong though, I can't be)\nIt's fake love (Fake love, nigga)\n(Huh? Yeah\nIntegrity is free, nigga, all that fuck shit cost you somethin', uh)\n\n[Verse 1: Jeezy]\nSaid he'd never switch up on me, that nigga lied\nNot my round, never my dawg, I almost died\nMoney made these motherfuckers crazy\nAll the gangsters made these motherfuckers lazy\nAin't shit funny, all joke jokes aside\nCuban Gooding Jr., let him out, he ain't tryna ride (Step out the car)\nWatched me work my fingers to the pole (Just sat there and watched me)\nEven let him stay off in my home (For real though, huh)\nYou's a real nigga 'til you tell a nigga no (No)\nYou's a ho nigga, let them niggas tell it though (Damn)\nFuck niggas (Niggas), bitches too (Too)\nBefore I chase you, I'll chase these riches boo (Straight up, uh)\nYou ain't got a loyal bone in your body (Not at all)\nProbably fuckin' five niggas in this party (Maybe six)\nCan't trust you, you can't trust yourself (Nope)\nNeed a boss bitch, you probably fucked the help (Woo)\nAnd I ain't never asked the man for a thing (Never)\n'Cept some Tylenol to help a nigga with the pain (Shit)\nShit, I'm all in (In), I'm goin' all out (Swear to God)\nThey only come around when you ball out (What's up? Yeah)\n\n[Chorus: Queen Naija & Jeezy]\nIt's fake love\n(That a nigga can't stand)\nIs fake love\n(One thing about it, he said he'd always be my man, what's up? Yeah)\nWhy I feel like this?\n(Huh, what's up?)\nIt's fake love\n(It's that fake love, nigga, keep that shit to yourself, let's go)\n\n[Verse 2: Jeezy]\nYeah, said I'm all in (In), I'm going all out (Oh my God)\nThey only come around when you ball out (Swish)\nPaper fucked up, doubts in my head (Fucked up, nigga)\nThat's when my main man left me for dead (Damn)\nAll the shit I did, all the shit I done (All the shit I done, nigga)\nNow your lazy ass wanna try to run (For real)\nI ain't even trip, I just ran it up (What I did, nigga)\nNiggas steady bitchin', I be mannin' up\nI fed niggas (Fed niggas), I led niggas (Yeah)\nThen your dawgs won't help you pull the sled, nigga (Yeah)\nTook 'em 'round the world (World), even gave 'em ice (Ice)\nLike Keith Sweat, somethin', somethin', somethin' just ain't right\n\n[Chorus: Queen Naija & Jeezy]\nIt's fake love\n(I said it's one thing about it, it's one a nigga can't stand is that)\nIs fake love\n(Nigga said he was my dawg, said he'd always be a nigga, man, but, ayy)\nWhy I feel like this?\n(That's just what it is, you know? Yeah, yeah)\nIt's fake love\n(It's that fake love, nigga)\n\n[Outro: Jeezy]\nYou know, one thing about it, nigga, I was sittin' up in that cell\nI ain't ask a motherfucker for shit\nAin't nobody go spend on a nigga\nAin't nobody check on my kids\nAin't nobody call my mama\nAin't nobody hit my sister\nI done paid my niggas' funerals and all\nI don't want shit back, on bro, can say it like this\nAll that fake love, you can keep that shit\nI don't need it, I don't want it\nI don't desire it, don't ask for it, man\nOn ten toes, nigga\nI'ma keep it goin', I'ma live the dream, nigga\nHow 'bout that?", "album": "TM104: The Legend of the Snowman", "year": "2019-08-23", "image": "https://images.genius.com/bc6135011548a24a95a5c16c968a3106.1000x1000x1.jpg"}], "artist": "Jeezy"}