{"songs": [{"title": "Daddy Issues II", "lyrics": "[Hook]\nEvery situation that we facing feel like déjà-vu\nMy nigga please don't ever ever love a woman more than she love you\nAll my niggas telling me that life goes on\nTell me what's the reason why I'm so far gone\nFuck your social-media encyclopedia cause them days are through\n\n[Verse 1]\nTell me do you want an actress\nTell me do you want a bad bitch\nTell me do you want a 'gram chick\nTo do photoshoots with Blaq Smith\nForever 21, let's bring out the champers\nI got too many cuts, do you got the bandage\nNow we're too established to deal with the madness\nLet's fuck up the mattress, then go make a sandwich\nGoing HAM in the Virgin Active\nTreat your body like a canvas (Oh yeah)\nEveryday is a tidal wave, one flood away from the tabloids\nThat's damage\nHow you gon' pack your shit away on a holiday\nThat's savage\nParents say \"Do you really got what it takes to be in tandem\"\nEven they couldn't find a way so they had to break up the family\nToyota Camry\n\n[Hook]\nEvery situation that we facing feel like déjà vu\nMy nigga please don't ever ever love a woman more than she love you\nAll my niggas telling me that life goes on\nTell me what's the reason why I'm so far gone\nFuck your social-media encyclopedia cause them days are through\n\n[Verse 2]\nEverybody got their armor on, that's Joburg\nBlessed bitches book bodyguards\nJust in case they run into the baby moms buying groceries\nSquad checking for the Audemars when you pour a glass\nAnd you toast it\nGoddamn, is that not some hoe shit\nFat ass tryna act bad on the socials\nBut when it's time for that home shit\nThey gon' backtrack like they wholesome\nBut it's over\nTryna keep up with the Joneses\nBut we too caught up in emotion\nIs she just a drop in the ocean\nOr she the one I can grow old with\nI say: Holy Father give me strength\nRight until the end\nShe ain't even tryna talk to me with respect\nAll I ever wanted was for you to go to bed and hit me with a text (Oh yeah)\nEverything is hunky-dory when we're on the jet\nLet's not pretend\n\n[Hook]\nEvery situation that we facing feel like déjà vu\nMy nigga please don't ever ever love a woman more than she love you\nAll my niggas telling me that life goes on\nTell me what's the reason why I'm so far gone\nFuck your social-media encyclopedia cause them days are through\n\n[Outro]\n[Kairo: Hello daddy....touch]\n\nMy\n\n[Kairo: Blood. Touch my blood. I love you daddy]\n\nSay \"Fully in\"\n\n[Kairo: Fully in]\n\nYou wanna go\n\n[Kairo: Yes]\n\nOkay, okay, okay. Bye. Say bye\n\n[Kairo: Bye]\n\nNo, into the mic. One last time and then we're done. Say bye\n\n[Kairo: Bye]\n\nWoah! And we're out!", "year": "2018-06-15", "album": "Touch My Blood", "image": "https://images.genius.com/135ec76e887661facfc2b21a80c4a8c4.768x768x1.jpg"}], "artist": "AKA"}