{"artist": "Z-Ro", "songs": [{"album": "Cocaine", "title": "But", "lyrics": "I been through enough with you\nFor a matter fact to much with you\nAnd loving doesn't mean I will continue to fuck with you\nThis aren't a fuck you song, it's a thank you for not loving me, causing me to love myself\nThis is an I love you song\nHow can I please somebody that can't be please?\nThere aren't nothing for Z-ro to do but leave\nAren't no such thing as a happy home unless im leaving alone\nEven though its not your time of mouth your cycle is on..\nThough I get enough beef in the street to eat\nWhen I get to the crib you try to feed it to me every time you speak\nR.Kelly got you self-centered\nWhat about when a brother is fed up?\nIts hard to keep his head up\nSee but this is the last time your going to try to run my life\nYou wanna run something?\nBecome a Dyke and get yourself a wife\n\n[Bridge]\nMe?\nI'm going to miss you\nBut the size 12 can kick you where the good lord spilt you\nNot trying to diss just telling you why I love you\nBitch\n\n[Chorus]\nThank for making it hard to make it better for us\nI was just trying to make some chitter for us\nI'm a one woman man\nBut\nWhen my one woman starts tripping\nYou can find where the strippers be striping\nI went out to get it and I came back with it\nI never complain I just handle my business\nGod is my witness\nI'm a one woman man\nBut\nWhen my one woman starts tripping\nYou can find where the strippers be striping\n\n[Verse 2]\nJust be a lady in the street\nYou oughter to be a freak in the sheets\nJust be respectful when your speaking to me\nThey say you never miss a good thing until its on its way out\nYou should have seen the sign when I started to stay out all night long\nDodging your call on the phone, not because im cheating\nBut im drinking and chafing, comtraplaing(s) if im staying or leaving\nIt aren't no question if I love you girl, it just your attitude makes me wanna hurl\nI know I give it to you\nHow you want it when im in you\nYou just say the word I just slow down change position\nAnd then continue\nThen you be acting like you don't know me when your aren't sexing\nI in jail stressing, and your mad at me for not showing affection\nPardon me for being human\nIf im not pleasing you then you got a problem with what im doing\n\n[Bridge]\nMe?\nI'm going to miss you\nBut the size 12 can kick you where the good lord spilt you\nNot trying to diss just telling you why I love you\nBitch\n\n[Chorus]\nThank for making it hard to make it better for us\nI was just trying to make some chitter for us\nI'm a one woman man\nBut\nWhen my one woman starts tripping\nYou can find where the strippers be striping\nI went out to get it and I came back with it\nI never complain I just handle my business\nGod is my witness\nI'm a one woman man\nBut\nWhen my one woman starts tripping\nYou can find where the strippers be striping\n\n[Verse 3]\nOur relationship faded\nI wish we would have made it I sha hate it\nBut I got my sanity back and I wouldn't trade it\nFor a meal ticket, aren't no maybe we'll kick it\nI don't want that\nLike getting out of prison I'll do anything not to go back\nCould it be meant for me to be one deep by myself while im awake and sleep\nThank to you I don't spend no more time try to please somebody else\nNow all my time and effect is put into pleasing me\nStraight up\nI'm gone and your going to miss Joy'Mack(s)\nArent no use in calling my phone\nBecause there aren't no getting wrote back\nI don't want to go to the movie or out to eat\nOnly way your going to see me\nIs if you see me out in the street\nI thought you was my future wife girl\nBut maybe my experience with you was\nPeroration for me to find the right girl\n\n[Bridge]\nMe?\nI'm going to miss you\nBut the size 12 can kick you where the good lord spilt you\nNot trying to diss just telling you why I love you\n\n[Chorus]\nThank for making it hard to make it better for us\nI was just trying to make some chitter for us\nI'm a one woman man\nBut\nWhen my one woman starts tripping\nYou can find where the strippers be striping\nI went out to get it and I came back with it\nI never complain I just handle my business\nGod is my witness\nI'm a one woman man\nBut\nWhen my one woman starts tripping\nYou can find where the strippers be striping", "year": null, "image": "https://images.genius.com/e2ffc8099acf82f0cda021f13e4a16ff.1000x999x1.jpg"}]}