{"songs": [{"album": null, "year": "2013-05-01", "title": "5 AM in Harlem", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "You're now tuning in to greatness\nShould be making theme music for the Matrix\nInstead I'm on this beat losing it, the basics\nYou know how we do it, I'm from St. Nich\nHey, bitch, I'm still the same dip\nBut I'm straight pissed, these niggas ain't shit\nI hate Riff, I tell her lay and quit\nTake me off your playlist, I ain't the on to play with\nNah, I'm from the era of the bars\nEven the mellow know it ain't get no better than JR\nI'm peddling the hard pebbles in a jog\nNeed a pack come and check itinh the God, facts\nHow could you think we are like?\nI'm as potent as a smoke you go to get from The Heights\nThat's loud raw, what you flipping is light\nCall it foul, boy, you ain't pitching it right\nRight, I'm from the home of Richard Porter, Alimo\nI was born to get the order, pass and go\nDaddy-o, catch me in El Barrio\nPeas with no patio, D's in the patty though\nThese niggas have to know, I'm a Diplomat\nThat mean I'm good anywhere I go to get it at\nDon't be thinking rap, you can Twitter that\nOnly bird you ever touched was a Twitter app\nAnd that's been a fact, where you huste, huh?\nYou ain't built like that, who your muscle, huh?\nYou get killed like that, wanna tussle, huh?\nYou gone feel my gats, here's a couple, huh\nThat's why I show none of y'all respect\nFeeling like the first time they brung me up to Flex\nHungry for a check so I'm dunking on your neck\nHopping out the spur when my dunking's on your neck\nHow you want it, holmes?\nI know exactly how you got my fucking number, holmes\nIt's in your mother phone, leave me the fuck alone\nI ain't wanna bone\nBut it's okay, see, she gave the thunder dome\nDon't talk to me, pay first\nEarly with the crack, it's all in a day's work\nPearly kind of gat, you talking, that thing squirt\nLike the herb you go to snatch, you're all gonna taste dirt\nI be out in orbit when I write\nHave your bitch logging on to Orbitz for a flight\nStart talking to me nice or don't talk to me, I'm nice\nWhat you thought I lost it over night? Motherfucker\nCake run, I'm going for ten mill\nAsk about the kid, I can broker you your next deal\nI'm dead real, R is a veteran\nThey should make me the president, the R is development\nI show you how it feels to be great\nWalk in and get a quarter mill for a tape\nLet's separate the real from the fake\nOnly the real can relate\nI'mma tell you how it feel to your face\nIt's thunder or nothing, double or fronting\nBesides that ain't nothing else up for discussion\nShit is broom brazy to J\nTwo words: can't wait, new tape on the way\nWriter"}], "artist": "J.R. Writer"}