{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "(Verse)\nShe got all the good qualities\nPlus she smoke weed and eat policies\nTom shoes, little tattoos\nRose cover up from a past dude\nI don’t know her, I pay attention though\nI think her titties fake, no extensions though\nHer teeth nice, her feet right\nHer attitude never change but the beat might\nHer nails did, her ass fat\nBut I don’t know her name, should I ask that?\nI just lit a dutch, should I pass that?\nIt’s been burning this whole verse, should I ash that?\nIf she checkin for love should I cash that?\nTake it slow on the first date or should I smash that?\nSo I even want her? Should I even bother?\nI know I ain’t the only nigga tryna holler\n\n(Hook)\nIt was money over bitches\nUntil I got rich\nNow all I’m thinkin\nIs who I’m gonna spend this money with?\nIs it you? Is it you? Is it you? Is it you?\nIs it you? Is it you? Is it you? Is it you?\n\n(Verse)\nHey, pretty lady\nAre you comin with me pretty lady?\nWe could ride through the city, pretty lady\nIn that 35, doing 50 pretty lady\nChannel clutch, yea you stuntin on em\nNo keys, push the button on em\nMolly in her system, now I’m touchin on er\nI’m her temptation, David Ruffin on er\nLove & other drugs, she a get you hooked\nGot her right out them panties, I’m a pussy crook\nI was caught in the moment\nSmoking back woods while she was performing\nThen we laid up til like 3 in the morning\nTalkin bout success and how badly she want it\nShe wanna be a model but she got a diploma\nBut Hollywood a drug and I wouldn’t condone it\nSo I fell back\nDidn’t want to but I understood\nThis the type of shit you go through when you out here chasin fame\nTryna get a name, thinkin YSL makeup cover up the pain\nGot you runnin round in circles, playin they little games\nNow you in the strip club, you’s in a different lane\nNow you tryna reach out but it’ll never be the same\nNow I’m kinda glad that I never knew your name\n\n(Hook)\nIt was money over bitches\nUntil I got rich\nNow all I’m thinkin\nIs who I’m gonna spend this money with?\nIs it you? Is it you? Is it you? Is it you?\nIs it you? Is it you? Is it you? Is it you?", "title": "Is It You (Ft. Sam Hook)"}]}