{"artist": "Ice-T", "songs": [{"title": "Make It Funky (12\" Mix)", "lyrics": "Feat. DJ Evil E the Great\n[Intro: Sampler of James Brown - Sex Machine]\nOne.. two.. three.. Hit Me!!\nUhh!! Uhh!! Uhh!! Uhh!! Uhh!! Hit Me!!\nHit Me!! Hit Me!! Hit Me!! Hit Me!!\nUhh!! Uhh!! Hit Me!! Uhh!! Uhh!! Uhh!! Hit Me!!\nUhh!! Uhh!! Hit Me!! Uhh!! Uhh!! Uhh!! Hit Me!!\nHit Me!! Hit Me!! Hit Me!! Hit Me!!\nMAKE IT FUNKY!!\n\n[Hook: Ice-T]\nSo the people can get down to the funky sound\nCause my crew don't mess around (MAKE IT FUNKY!!)\nSo the girls can get busy and dogg the dancefloor\nMake the guys get dizzy (MAKE IT FUNKY!!)\nTotally deaf as Evil E cuts the records and the beat is dealt (MAKE IT FUNKY!!)\n\n[Verse One: Ice-T]\nStupid fly, it's got to the F-U-N-K-Y\nSo that you can get loose as I produce sounds hard as the deuce\nManipulate the bass game, give the label a boost\nA lyric layer, rhyme sayer, born to be player\nPolitics were my kick, then I'll be your mayor\nGovernator, Senator, I'm your mentor\nRap rhythm is erratic, time is your four\nI'm the microphone scholar, clocking on dollars\nSee I'm here to make the place funky while the fly girls holler\nGenius, vocalist, rhyme style priceless\nPound of gold around my neck, mic in my fist\nThe microphone virtuoso, crazy insane, I'm loco\nWith the speed to exceed, that got the MC's look slow mode\nUnleash release words mean as a beast\nI eat MC's for lunch and dinner, I can serve for a feast\nTheir rhymes are elementary, mine deserve a PH.D\nThis beat is F-U-N-K-y, my name is Ice-T\n\n[Chorus: DJ Evil E the Great]\nMAKE IT FUNKY!! MAKE IT FUNKY!!\nMAKE IT FUNKY!! MAKE IT FUNKY!!\nWHORES!! Uhh!! Uhh!! Uhh!!\nUhh!! Uhh!! Uhh!! Uhh!! Uhh!! Uhh!!\n\n[Verse Two: Ice-T]\nUndoubtedly you recognize this jam is the ultimate cut\nUncontrollably you motivate and move your butt\nIt's rough, the beat is gangsterous, call it tough\nIf you're dissing, stop fronting, come on, what's up?\nComplicated voice, gymnastics are all in your face\nVegas got my highs, EVs got control my bass\nMy break is coming to get busy, no time to waste\nNow's the time do body work, here's the place\n\n[Interlude: Ice-T]\nUhh!! Uhh!! Uhh!! Uhh!! Uhh!!\nGo L.A.!! Go L.A.!! Go L.A.!! Go L.A.!! Go L.A.!! Go L.A.!!\nRock on, cold rocking the house\nAww yeah, in the place to be\nIce-T and Evil E rocking it out west, you know it buddy\nEvil E, you're from Brooklyn man, let's see whose in the house out there\nWe're gonna check it out right now, and get cold busy as I wanna see whose in the house\nIs Queens in the House? check Queens is in the House!\nIs Queens in the House?\nThe Bridge.. Queens Bridge.. The Bridge.. Queens Bridge..\nThe Bridge.. The Bridge.. The Bridge.. The Bridge.. --------- MC Shan\nGo Queens!! Go Queens!! Go Queens!! Go Queens!! Go Queens!! Go Queens!!\nI know Brooklyn is out there, is Brooklyn in the House?\nBrooklyn is in the House, Brooklyn is in the House --------- Richie Rich\nGo Brooklyn!! Go Brooklyn!! Go Brooklyn!! Go Brooklyn!! Go Brooklyn!!\nYo, let's check out Uptown, is Uptown in the House?\nUptown Uptown!! Uptown Uptown!!\nGo Uptown!! Go Uptown!! Go Uptown!! Go Uptown!! Go Uptown!! Go Uptown!!\nWell, you think Bronx is out there, is Bronx in the House?\nSouth Bronx, the South.. South Bronx.. South Bronx, the South.. South Bronx ----- KRS-One\nGo Bronx!! Hit Me!! Go Bronx!! Hit Me!! Go Bronx!! Hit Me!!\nGo Bronx!! Hit Me!! Go Bronx!! Hit Me!! Go Bronx!!\nYeah Buddy, so wherever you are from, if you with us tonight\nWe want you to do one thing, what you wanna do E?\nDon't you wanna go up, right now and go crazy for me, you know you gotta do one thing\n\n[Chorus: DJ Evil E the Great]\nMAKE IT FUNKY!! MAKE IT FUNKY!!\nMAKE IT MAKE IT MAKE IT FUNKY!!\n\n[Verse Three: Ice-T]\nMake it funky enough, so the tracks lay tough\nCause I'm tossing it up, and the Ice don't bluff\nThe girl charmer toy Harmer, juice strong as armor\nWhen I stand upon the stage you could call it melodrama\nIntense, suspense my voice emends\nI wouldn't have you come and see me under false pretense\nThe girlies do be wilding, as I'm profiling\nLimos lined around the block for about a mile and a half\nAutographs; the list goes on\nIf you forgot, Make It Funky is the name of this song\nStupid dope and you know it, it rates a ten\nYou pray my DJ cuts the records, so it starts again\nCause I can keep the mic cooking for an entire month\nMy rhymes are always hard hitting, I don't know how to bunt\nMy DJ cuts like a laser, E-V-I-L-E\nPut your finger on the records, make it Make It Funky\n\n[Chorus: DJ Evil E the Great]\nMAKE IT FUNKY!! MAKE IT FUNKY!!\nMAKE IT MAKE IT MAKE IT FUNKY!!\nHo Ho Go!!\nGo Ice!! Go Ice!! Go Ice!! Go Ice!! Go Ice!! Go Ice!!\nGo Ice!! Go Ice!! Go Ice!! Go Ice!! Go Ice!! Go Ice!!\n\n[Outro: Ice-T]\nWe gonna do it like that y'all\nEvil E MAKE IT FUNKY!!\nIslam MAKE IT FUNKY!!\nSouth Bronx MAKE IT FUNKY!!\nShawnie Shawn MAKE IT FUNKY!!\nMelle Mel MAKE IT FUNKY!!\nTDF MAKE IT FUNKY!! ~ AWWWWWWWWWWWW!!", "image": "https://images.genius.com/4087bd0151e7fc336a1bdb7aca3ef257.1000x1000x1.jpg", "album": "Rhyme Pays", "year": null}]}