{"songs": [{"title": "Gucci DeShay", "image": "https://images.genius.com/d39be70f638c88c431339e037c0e69e2.1000x1000x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nTrue story\nI started this at, like, eleven-o’clock Chicago time\nAnd I’m gonna do the whole mixtape tonight and\nGo to sleep fucking exhausted\nYo\n\n[Verse: brandUn DeShay]\nThis what you're all been waiting for, the spaceship has finally taken off\nSpace hoes in they space clothes, tell them take them off\nBreak them off proper on that KitKat shit\nSmelling like success, get a big ass whiff\nI’m the gift and my presence is the present\nI’m guessing it's a lesson, my confessions to the reverend\nI’m sorry I had to kill them, they don't pay me attention? I bill them\nSince I was a chillun, I'd see them BMXs and steal them\nA bad boy, just a tad coy, getting told on to the tabloids\nQuiet, but my actions made loud noise\nNow, more than ever, I crave attention, I’m ADD\nAt my last shows, I brought many hoes, like 80 deep\nSkating cheap, cheap skate, my money stay in wallets\nUntil I cop Impalas, polish them big like Christopher Wallace\nI honestly think I’m hotter than most of your favorite rappers\nTurn them girls on like old people do Clappers\nDick so big, my girl thought it was a strap-on\nIt took fucking forever to find this beat just to rap on\nNow it's on, I’m starting to get warmed up\nPractice drills, rapping until I'm stacking mills, trying to get more bucks\nLike Milwaukee's scouting couch, I’m trying to get more Bucks\nThese hoes full of drugs more than Lil Wayne's tour bus\nI’m sure you know: super flow, super beats, Super 3\nThey used to call me super lame\nWhat that make me, Superman?\nThen call me Clark Kent, I get more ass than a park bench\nDirty toilet seat, don’t start shit\nThat’s a smart tip, if you want it, you should take it\nRap is love, don’t fake it, just make it\n\n[Outro: brandUn DeShay]\n...And we'll keep it moving\nMaestro?", "year": "2009-12-25", "album": "Your Favorite! MixTape"}], "artist": "Ace Hashimoto"}