{"songs": [{"lyrics": "[Verse 1: Aesop Rock]\nYou want to know why? Because I'm\nDead messengers buried in their Melvin shirts\nAwoken as reanimated mummies from the sepulcher\nAnonymous and secular and ribbons and exposed brain\nRoll with grown men who still use code names\nFold crawl space on the SS coat tails\nMight chase six legs through his oatmeal\nOh dear, no pets eat his own homework\nPet cruise cobble step shoes that are bone bugs\nHolmes, sick to the fishbone comb\nMy yellow brick shtick ain't tip toe prone\nIt's a misthrown sticky bomb slipping off the fingers wrong\nAny blips you're witnessing are living in the Sigma laws\nBlip, blip, dag, these ghosts need a doctor\nShelter, clean Dunlops on a walker\nShe sells sea shells, he draws revenge\nPlots on a chalkboard, watch what you walk toward\n\n[Hook]\nLive free, die fat\nRock shot to a kill screen time lapse\nWatch how the blitzkrieg climax\nSpring clean hijack, bring me my axe\n\n[Sample]\nGirl: What are you doing up there?\nGuy: Stealing, I'm a weekend burglar\nGirl: I'm on my lunch break, you want to help me kill half an hour?\nGuy: No..\n\n[Verse 2: Blueprint]\nI'm laying in a cut overstuffed from a bad meal\nStaring at the sun, on my back like a fat seal\nDebating with myself about whether not rap's real\nCause broke motherfuckers are the only ones that have skill\nEverybody got intentions that they can't reveal\nMajor label acts got to act like they don't have deals\nClaiming grassroots, I'm like \"hell no\nYour buzz is as organic as Monsanto.\"\nI'm going at your beanstalk, ax in hand\nOver a beat bought Aes Rock, that's my man\nPeople sleeping still believing that we haven't expanded\nBut that's just a small part of the master plan, bitch\nPrintnificent, shining 'till your skin chafe\nWrite until the pen ache, reclining by a big lake\nI'm only winning cause I went in an gettin' waked\nChillin' at the crib by the time you get your shit straight\n\n[Hook]\n\n[Sample]\nYou suppose robots would enjoy listening to music?\nYou figure that if robots are electronic creations they\nEnjoy listening to electronic music\nYou think you can create a scientific symphony\nWe'd not only send to our metal friends but\nWould also be fascinating to human ears\nYou already have, and it's on the other side of the record\nI can't wait to hear it\n\n[Verse 3: Rob Sonic]\nMIDI with a drum change queue\nCherries in the mirror of his Mustang too\nTook his thang from the South to the Rocklin Hooters\nBought her wings and a round, then he chopped and screwed her\nCops at the Getty so he thumbed his nose up\nPedal to the metal, leave them dunked in donuts\nStuck on \"so what?\" from the aged Tequila\nWhen he drove into the back of an eighteen-wheeler\nBasic leader, camp is cardboard\nThe jet chooses raps to advance their shark soar\nMarked for M*A*S*H* out my cordial stingers\nAddress you crossly, corporal clinger\nAttention all freaks with newer footing\nMy radio is not played by Cuba Gooding\nNow, who's assuming that the man's a block boy\nCause he keep his fam happy with lots of Bok Choy\n\n[Hook]", "title": "BMX", "album": "Skelethon", "image": "https://images.genius.com/be7ecb35b49d25728281da97d28c2ca1.1000x1000x1.jpg", "year": "2012-07-10"}], "artist": "Aesop Rock"}