{"artist": "G Herbo", "songs": [{"title": "Everything (Remix)", "album": "Humble Beast (Deluxe Edition)", "year": "2018-02-16", "image": "https://images.genius.com/844b909dc3f98fbed4ce52747e1284e8.720x720x1.jpg", "lyrics": "[Intro]\n808 my crew\n\n[Verse 1: G Herbo]\nYeah, hit the scene, so fresh, so mothafuckin' clean (Herbo, okay, Herbo)\nAnd my car so fast, it's leavin' everything (Herbo, everything)\nI love you so, mama, and thank you for everything (everything)\nAnd you know, mama, I was doin' everything\nUsin' guns, ecstasy, I'm on extra lean\nIn the hood I'm sellin' molly, raw, everything (what you need?)\nHeroin, we crushin' Tylenol, everything\nWeed, soft, everything\nHit the mall, 50 G's, and I bought everything\nPlug just like Tom Brady, boy, I caught everything\nMy Uncle a gangster, I'm the one he taught everything\nYou can't be my lady, sneaky bitch, I saw everything\n\n[Chorus: G Herbo]\n\"Herbo, what you do for fun?\" Bitch, everything\n\"What you gon' do with that gun?\" (Bow) Bitch, everything\n\"What kind of drugs you wanna run?\" Bitch, everything\n\"If you die what you gon' leave your mom?\" (Huh?) Bitch, everything\n\n[Verse 2: G Herbo]\nEverything on you phony (phony)\nNiggas lie 'bout everything, put it on they homies (what?)\nHatin' ass nigga, you want everything on me\nSwervo saucy, everything got double Gs, don't it\nItalian beef with everything, extra cheese on it\nI done iced out everything, them VV's on it (ayy, Herbo)\nI done tried everything, except coke and dope (hah)\nI done fired everything, .40s blow the most (bow)\nSeen dead bodies, everything, so I drove the Ghost (skrrt)\nTold that bitch take off everything, I ain't even close (I ain't even close)\nTook everything in me not to close your fuckin' door (not to close your fuckin' door)\nBarney's on me, everything, everything boss\nEverything exhaust\n\n[Chorus: G Herbo]\n\"Herbo, what you do for fun?\" Bitch, everything (uh huh)\n\"What you gon' do with that gun?\" (Bow) Bitch, everything (uh huh)\n\"What kind of drugs you wanna run?\" Bitch, everything (uh huh)\n\"If you die what you gon' leave your mom?\" (uh huh) Bitch, everything\n\n[Verse 3: Lil Uzi Vert]\nYuh, everything (everything)\nMy new whip, that bitch, it came with everything (everything)\nI'ma turn that boy into a heavy stain (bow, bow)\nWhippin' up that dope, yeah, that's that heavy cream (whip it)\nI been fuckin' on your bitch since I was 17 (17)\nEven though my Glock hold 30, this a 17 (yeah)\nChop it, whole thing from the Medellín (uh)\nMy old gun, that shit was dirty but I kept it clean\nMask off, remember me\nExtra button on the back 'cause my Uzi a lemon squeeze\nGucci, Louis, Fendi, Prada, swag swag swag, that's my disease\nFuck her once, I gotta leave, smokin' dope, I'm Japanese\nFucked her in the master suite, I ball like an athlete\n\n[Chorus: G Herbo]\n\"Herbo, what you do for fun?\" Bitch, everything\n\"What you gon' do with that gun?\" Bitch, everything\n\"What kind of drugs you wanna run?\" Bitch, everything\n\"If you die what you gon' leave your mom?\" Bitch, everything\n\n[Verse 4: Chance The Rapper]\nYeah, yeah, yeah, yeah, yeah, I know a girl that do everything\nModel, DJ, do hair, everything, babysit, strip, run skrips everything\nDoctor said, \"What hurts?\" said, \"Everything\" (Huh)\nSomersault, nigga, you done been in every gang (yih, yih)\nShaun Livingston, you done been on every team (yih, yih)\nKnew the game, still you gave that bitch a wedding ring (huh)\nI took her number, gave her NuvaRing\nAnd never rang, never give 'em everything\nChano what you do for fun? Smoke a blunt\nSpades with the jokers, playin' poker\nMe and Oprah just might go for lunch\nFishin' with some bitches where they breakin' open coconuts\nShoppin', goin' postal, ain't been local since we opened up (since we opened up)\n\n[Chorus: G Herbo]\n\"Herbo, what you do for fun?\" Bitch, everything\n\"What you gon' do with that gun?\" Bitch, everything\n\"What kind of drugs you wanna run?\" Bitch, everything\n\"If you die what you gon' leave your mom?\" Bitch, everything"}]}