{"songs": [{"year": "1988-03-01", "image": "https://images.genius.com/77d88d155deb94b3da1eee1f8e5c78c1.395x400x1.jpg", "title": "Return of the Biz Dance", "album": "Goin’ Off", "lyrics": "[Marley] Aiyyo aiyyo, aiyyo Biz whattup?\n[Markie] Yo whattup Marl?\n[Marley] Yo man 'member when we first shocked everybody\n[Marley] with a FUNKY fresh beat?\n[Markie] Yeah with the \"Biz Dance,\" and you know\n[Marley] And \"Make the Music\" and all\n[Markie] Word!\n[Marley] Yo remember we had the \"Biz Dance\"\n[Marley] Yo we should get a funky beat and redo it man\n[Markie] Yo, I'm I'm bringin it back out\n[Markie] It's gon' be called, \"The Return.. of the Biz Mark\"\n\n[repeat 16X]\nGo Biz Mark!\n\n[Verse One]\nI'm the Biz Markie, I'm known for beatboxin and rap\nAnd now it's time, to bring my funky dance back\nAnd once again, puttin you in a trance\nIn case you all forgot it it's called the Biz Dance\nA movement by the body that's made like a puppet\nI'm here to bring it back, and party people love it\nSo everybody knowin, and those who wanna learn\nGet up and move your body as I return\n\n[Chorus: Biz Markie + sample]\n[Biz Markie] Wit the Biz Mark, Biz Mark..\n[repeat 4X] Go Biz Mark!\n[Biz Markie] Wit the Biz Mark, Biz Mark..\n[repeat 4X] Go Biz Mark!\n[Biz Markie] Wit the Biz Mark, Biz Mark..\n[repeat 4X] Go Biz Mark!\n[Biz Markie] Wit the Biz Mark, Biz Mark..\n[repeat 4X] Go Biz Mark!\n\n[Verse Two]\nWell I'm here to show you like a dance that never dies\nThat's put inside within yo' TV Guide\nA movement of the body that can't be beat\nIt's like done by the creatures on Sesame Street\nNow I can move my body when I'm dancin at a party\nLike a ballerina that's drunk on Bacardi\nI start to think of pop-and-twist\nYou think James Brown is wild - ah - bust this!\n\n[Chorus]\n\n[Interlude]\nNow, this is dedicated to everybody out there that know how to do it\nAnd those who wanna learn, this how you do it\nYou gotta get FUNKY!  You can't get funky you got to get SILKY!\nYou can't get silky, you got to get DOO DOO!\nAnd this the way you gotta do it, a little somethin\nYou gotta like, swing your hips like this and jump\nAnd then you gotta throw your hand up to your head\nAnd then your leg gotta hit your ear\nAnd then your hand gotta hit your head\nAnd your leg gotta hit your ear and jump\nAnd this the way to do it\nSay one.. two.. one, two, three\n\nGo, go, go Biz Mark!  Go, go, go Biz Mark!\nGo, go, go Biz Mark!  Go, go, go Biz Mark!\nGo, go, go Biz Mark!  Go, go, go Biz Mark!\nGo, go, go Biz Mark!  Go, go, go Biz Mark!\n\n[Verse Three]\nNow all the party people that's standin still\nGet on the dancefloor and let's all get ill\nKick your legs 'til the right is into the left\nAnd do a dance that is known as the DOO DOO DEF\nBecause to this day, it's still kickin live\nAnd if I dance with y'all I will revive it\nIt is of the words and isn't goin away\nI will make it come back like Sugar Ray\n\n[Chorus] w/o Biz Markie"}], "artist": "Biz Markie"}