{"artist": "Fat Joe", "songs": [{"year": "1995-10-03", "album": "Jealous One’s Envy", "image": "https://images.genius.com/d39ec88ceb1de2aaf358c7c2fdc2898c.640x616x1.jpg", "lyrics": "[Intro: KRS-ONE]\nMusic please\nYes, welcome to Jealous One's Envy\nWe'd like to thank you in advance for purchasing this product\nIt is a Relativity Records product, artist Fat Joe\nMy name is KRS-One\nAnd of course we're gonna bring THE noise\nCause we can never be toys\n\n[Verse 1: KRS-ONE, Fat Joe]\n[KRS-ONE]\nYes I am the ultimate, uttering ultimatum's for the fun of it\nIt appears to me you don't know who you fuckin with\nYou can't see this with bifocals cause you're local\nCan't hang with my vocals, better you fuck with Sonny Bono\nOr Yoko Ono, but KRS oh NO NO\nYou might think you all that but I don't give a fuck though\nI'm rolling hard like God for the squad black\nPackin them poppers bitch, where that money be at?\n[Fat Joe]\nAiyyo I be the show stopper, as I shine like gold\nOther rappers dull like copper, the certified fake nigga dropper\nWhich borough, is the thorough\nI know, do you know, let me know I'm sayin though\nThe coke connector, sweating leather with reflectors\nDon't get caught up in my sector, or I'mma haveta inject ya\nWith a slab of this lyrical dope shit\nFake MC's and wannabe's best to quote this\nFat Joe the true and living will prevail\nKingpin like Sonny up in Bronx Tale\nWill I fail? I doubt it\nI'm the nigga catchin bodies, while other niggas fantasize about it\n[KRS-ONE]\nTrue indeed, behind my back MC's claim they can serve me\nIn my face they screaming \"We're not worthy!\"\nYouse a has been, actually you ain't been\nI be touring, while you be home taping\nSo what punk, you could battle in a second\nFrankly the bottom line, is where's your hit record\nYou claim I'm jocking, claim I'm on your dick, where's your witnesses?\nIf I'm on your dick my name has got to be syphillis\n\n[Chorus]\n\"If you're feeling lucky duck, then press your luck\" - Jeru\n\"Up up up and away cuz I don't play clown\" - Kool G Rap\n\"If you're feeling lucky duck, then press your luck\" - Jeru\n\"Buck buck buck take that witcha on the way down\" - Kool G Rap\n\n[Verse 2: Fat Joe]\nAs we proceed to lock it down, don't get it fucked up\nWe be the kings of the Boogie Down\nAll we do is spark izm and get cash\nTortuing MC's like that warden up in Alcatraz (bo! bo! bo! bo!)\nIt's Fat Joe, yo you know my steelo\nGet so much love, I'm payin sixteen on a kilo\nSendin niggas outta town, still got control of the Boogie Down\nNow how the fuck you sound? (Yeahhh)\nAin't no army that could harm me or bomb me\nC'mon G you clowns ain't got a fucking thing on me\nI'm flashy like white linen (tell em)\nYour rap is under pressure like two outs tied score in the ninth inning\nI'm down with Kris and ain't no stopping me\nI'm out for Bronx and Monopoly with chicks on top of me\nIt's My Philosophy, but for now it's in the corridor\nSlappin caps like a ball hittin hard to my laborator\nThese motherfuckers don't want it\n(Word to mother Joe, these niggas don't want it!)\n\n[Chorus]\n\"If you're feeling lucky duck, then press your luck\" - Jeru\n\"Up up up and away cuz I don't play clown\" - Kool G Rap\n\"If you're feeling lucky duck, then press your luck\" - Jeru\n\"Buck buck buck take that witcha on the way down\" - Kool G Rap\n\n[Verse 3: KRS-ONE]\nMerrrcy, you wanna serve me but you ain't worthy\nMy style is too curvy, what you tellin me\nBut your flimsy ass will go home after the battle and find I'm your boss\nWith KRS-One up in your memory\nI know your kind, you rap write\nYou're Mr. John Gotti the Don, but you're just another bwotty mon\nTelecro bwotty mon, how you collect\nRap magazine dating back to, Tougher than Leather\nThe only reason you got, such an extensive rap collection\nCuz most of your rap mags are all stuck together\nWatch what you sayin, watch what you say\nWhen your skull gets cracked, whatcha gonna say crackhead?\nYour file is dead, kneel to the rap God in bed\nFore I slap you way Back in the Days like Ahmad\nDon't get me fed up, or vexed up, cuz you'll get set up\nMy crew don't let up, I be dead up in this piece (tell em)\nRecognize it's BlastMaster KRS-One\nFor ten years, Fat Joe, chillin on the East", "title": "Bronx Tale"}]}