{"artist": "Polo G", "songs": [{"album": "Die A Legend", "title": "A King’s Nightmare", "image": "https://images.genius.com/39fa1f0ccafe731f2ee88d0b98401aba.633x633x1.png", "lyrics": "[Verse]\nSpittin' verses, I'm desperate, I need a mansion and a coupe\nYou done signed over your life and now you slavin' in the booth\nNow we hang ourself with chains, they used to make us rock a noose\nShorties hoppin' off the porch 'cause it ain't shit else to do\nNothin' but trouble in the hood, normal sentence for the youth\nYou a king, you not a gangster, I'm just tellin' you the truth\nPlease just take my word, 'cause they done scrambled all the proof\nHis big bro ain't tryna warn him, he just taught him how to shoot\nOut there warrin' with each other, will there ever be a truce?\nWhy the fuck we into it? I'm going through oppression too\nFeel death in the air, it's like a nightmare, this shit is scary\nRiding for gang, now your casket is gettin' carried\nMama break down, you gettin' put in that cemetery\nShit fucked up my mental, seen too many obituaries\nThese bodies keep dropping, summer cold like it's January\nWhen you die, they gon' praise you, now they see that you legendary\nJust another cold case, look what they did to Kenneka\nHear them screams after that chopper sing like Aretha\nHomicide puddles, I got blood stains on my sneakers\nOut here playing life or death, tryna run from the reaper\nShit been fucked up at the crib, lashin' out on the teacher\nGrandma taking me to church, I fell asleep on that preacher\nChains, clothes, hit the block, hard-headed and eager\nWe just tryna stay afloat but this shit gettin' deeper\nI'm just tryna talk to you and tell my life through these speakers\nYeah, I conquered them struggles, I just had to stay focused\nTold myself that I'm the greatest, I won't wait 'til they notice\nWouldn't nobody help me up when I was down at my lowest\nI'm the only one believe when everybody was hopeless\nI done got so used to funerals, can't show no emotion\nMan, this lifestyle crazy, swear this shit get atrocious\nLike one minute on that block, you just laughing and joking\nNow your mans shot up on that ground, gasping and choking\nIn them streets deep, we was mobbin', went from innocent to goblins\nHad to take, we started robbin', catchin' white folks while they joggin\nBattle scars, we hate the rain, bullet wounds steady throbbin'\nFiends lookin' like zombies, half-dead, they just noddin'\nThat peer pressure comin' at you and it's too hard to dodge it\nGot dreams to make the league, late night plans, might sabotage it\nMy homie made the news, he 'posed to be on ESPN\nCame and left the same day, RIP to the twins\nDoctor said he could make it but his chances was thin\nMy homie just came home, did three in the pen'\nBack in them streets few weeks later, now he locked up again\nI wonder one day will we wake up? Is the cycle gon' end?\nI wonder one day will we wake up? Is the cycle gon' end?", "year": "2019-06-07"}]}