{"songs": [{"image": "https://images.genius.com/a9abb4468d35dbcbb121cd5e44c6c989.1000x1000x1.jpg", "title": "Adam and Eve", "album": "NASIR", "year": "2018-06-15", "lyrics": "[Verse 1: Nas]\nThe ghetto Othello, the Moor\nOh my God, they speak venomous on the boy\nOh my Lord, my enemy is fear, and I'm sure\nOh my God, they want the end of me 'cause I'm pure\nOh my Lord, discipline for the win, I just go for it\nIt's a trend for these men to die on their own sword\nJourney far, learn who you can be\nBut you can learn who you are when you around family\nChip off the shoulders of soldiers, on they grizzle\nMy granddaddy Mack Little married Nannie Little\nThey passed down wisdom, blessings were given\nPray my sins don't get passed to my children\nI made a killin', I'm alive like the morning star\nCourt Jordan's for the price on stock, so what the Hornets are?\nI need evaluations, I'm savvy, y'all\nEatin' foie gras and caviar, listen\n\n[Chorus: The-Dream]\nAdam and Eve\nDon't fall too far from the apple tree, ayy\nAdam and Eve, Adam and Eve\nDon't fall too far from the apple tree, apple tree\n\n[Verse 2: Nas]\nThe ghosts of gangsters dance\nChinchillas shake on the hanger, the force of this banger\nYeah, my language advanced, my cadence amazin'\nThe voice triggers somethin', what is this conundrum?\nThe clouds scurry, your spirit rumble, a boyish smile\nStill puff the loud, it's nothin' less than a quarter pound\nSavage narrative, every verse that I write bursts light\nBrings awareness to my personal life\nAfter my morning walk, Havana cigar, the ganja spark\nSee my doctor more, sweat in the sauna or the spa\nSpendin' fifty large at the Bellagio\nSpent twenty on a bad bitch I hardly know\nNew girl every night, two girls was every other night\nSexual addiction, gangster tradition\nThey wanna fuck me, have me under they belt, slightly offended\nYeah, that's how I felt, that's how it ended\nI'm just good at existin', existin' in my truth\nAs long as I enjoy the fruit, yeah\n\n[Chorus: The-Dream]\nAdam and Eve\nDon't fall too far from the apple tree, ayy\nAdam and Eve, Adam and Eve\nDon't fall too far from the apple tree, apple tree\n\n[Verse 3: Nas]\nWhat come first, peace or the paper?\nBefore I had a piece of paper, peace was in my favor\nBefore I sat to eat at the table, it had leeches and traitors\nCut the fat from the meat, extract the weak, bon appetit\nNo bacon, brothers is swine\nIt's so hard to trust 'em 'cause my hustle is mine\nIt's evident they all the same, with gray hair and still mean muggin'\nGray hairs of wisdom, that means you seen somethin'\nSay somethin', you stay frontin'\nBut these clowns got false crowns, fictitional kings\nYou broke my heart, Fredo\nYou bring this thing of ours down to a fable\nBe advised my guys dyin', enterprisin' at a boss's table\nThere's always room at my table\nInsecurities is keepin' you disabled\nAll this money to get, is there less time?\nThey ain't stopped printin' money, 'cause they made mine\nI learned to stretch time, these are the best times\nI'm in my neighborhood in stadiums, the Mets' kind\nWith restaurants and Carbone, spicy rigatoni\nGo hard, a red Bordeaux, oh God\n\n[Chorus: The-Dream]\nAdam and Eve\nDon't fall too far from the apple tree, ayy\nAdam and Eve, Adam and Eve\nDon't fall too far from the apple tree, apple tree"}], "artist": "Nas"}