{"artist": "ZelooperZ", "songs": [{"year": null, "album": "Help", "title": "Thunda Cats", "image": "https://images.genius.com/570be51c7ce336f54472ccd467be7e5a.500x500x1.jpg", "lyrics": "[Intro: ZelooperZ]\nI'm 'bout to shit on all y'all niggas, bitch!\n\n[Verse 1: ZelooperZ]\nYou cuffin' that ho, please-ah release her\nThree hun' for feature, me, I don't need her\nBut it's cheaper to keep her, on my side like beeper\nRedhead like Reba, Basquiat like Reebok\nShe calls me when she needs cock\nWhen she see the cock, she wake up\nFucked up her makeup while you callin' her to make up\nIt's Maybelline! Hit that bitch with the shoulder lean\nHit that bitch with the catering\nI'll bring that bitch my ding-a-ling\nPut that bitch on the EBT, scratch that, no DVD\nYou end up like Eazy-E, my bad, that's not a joke\nSmokin' on dope, bonfire, gettin' higher, Bon Iver\nSmacked yo' bitch with my PalmPilot\nNow you lookin' lost like a fuckin' lighter, bitch!\n\n[Hook: ZelooperZ]\nY'all done made me unleash the beast\nI got niggas on the west, I got niggas on the east\nKnow I'm on my rise, like some fuckin' yeast\nThe look in her eyes, she wanna come with me\nThunderCat (ho!), ThunderCat (ho-oh-oh!)\nThunderCat (ho!), ThunderCat (ho-oh-oh!)\nThunderCat, bitch! (ho!), ThunderCat, bitch! (ho-oh-oh!)\nThunderCat, bitch! (ho!), that's my ThunderCat bitch! (ho-oh-oh!)\n\n[Verse 2: Danny Brown]\nBoot it up with them moon rocks, sippin' on that 2Pac\nThug passion if you askin', got NASA up in my tube sock\nMake you come out your tube top, money up in my shoebox\nBet you change after two shots, box rain like it rain on a homeless block\nI’m comin' down, I’m comin' down, popped another, now I’m runnin' round\nDanny Brown and ZelooperZ, tell me what’s fuckin with that now\nNot a damn thing, not a damn thing, smoke so much, I can’t see\nBitch pulled a hamstring tryna pull all on my ding-a-ling\nYeah, girl down on the floor, on the floor, shake it slow\nGirl, you know can’t take no more, got a nigga like me looking red' to go\nDamn, girl on the floor, on the floor, shake it slow\nGot her like me, can’t take no more - got her like me, just waiting to go\nSippin' margaritas with some divas, ballin' out in two seaters\nSmoke so much damn reefer, I can't feel my face seats\nGet you out of your two piece, on the run like good grief\nPopped a pill, she popped a pill now I'm rubbing all on her buttcheek\n\n[Hook]"}]}