{"songs": [{"year": "2015-12-04", "lyrics": "[Part 1: Behind Ya Back]\n\n[Intro]\nYeah\nI'm on some shit, I'm on some shit\nI don't want a bitch that don't wanna bitch (Where is that, bitch?)\nShe been at the gym (Yeah, yeah), eating humus and shit\nShe crushin' on me cause I'm conscious and shit\n\n[Verse 1]\nBitch, it ain't no time so I'm straight for it, throw them clothes down if you want some\nIf you ain't 'bout it then don't come, I know I'm the shit 'cause I'm on one\nFinna nosegrind like a skateboard, that's your bitch? Well, I ain't sure\nYou a square, nigga, there's a name for it, you're a four sided ho shape boy (Square)\nNiggas act like they don't know where I'm coming from\nNiggas act like I'm supposed to stay away from ratchet shit like I ain't from the slums\nNiggas act like they don't see me but they always keep my fuckin' letters on they tongue\nInternet thugs online but they scary: M. Night Shyamalan\nNiggas claim they want my conscious lyrics but ain't appreciate it when they had it\nNiggas act like they gon' hold you down but when you need a favor where they hiding?\nBitches act like they ain't hoeing every time another ho is right beside 'em\nYeah we fucked, so what bitch? Go and tell the whole hood about it\nYou a turkey ass jive bitch, hope you die, bitch, sucking five dicks at a time\nAin't got no type bitch, got a wife bitch and a white bitch, bitch I'm fine\nWhy deez nigga- why deez nigga- why deez niggas lyin'?\nAnd these niggas ain't loyal either, all these niggas droppin' dimes\nBandz\n\n[Chorus]\nY'all niggas gon' find out about me (Bandz)\nIt took a while to get back up on my feet (Bandz)\nAnd everything that I say, is blown out of place\nIf I ain't the shit, why they fly around me?\nI'm on some shit, I'm on some shit\nYou hoes is the feds, I swear I'm convinced\nI hit a club, you know they gon' strip\nI throw all my money like I'm in love with that bitch, I just fuck on that bitch\n\n[Verse 2]\nLook what I gotta do to get respect, that's why I got my boot all in your neck\nThat's why I never ball without the check, often I get so bored I get depressed\nNowadays it's every man for himself, that's why my loyalty is with the set\nI don't know why these niggas fake cool, when they get to actin' I get perplexed\nI'm dishonest man and I must confess, I like nigga shit and I like to flex\nOn my hippie shit, just lost in my head, I forgot that I was still in the flesh\nIt's too late to try to save who I was, I like bitches and I like to get fresh\nHow the fuck did Bobby Ray get corrupt? Bobby Ray discovered Bobby himself\nAnd all they can say is you changed, say that you changed\nAnd all they can do to your fame is say that you lame (Man, that nigga lame)\nRemember me right, remember me right\n'Til the day of my death when I drop in my grave\nBandz\n\n[Chorus]\nY'all niggas gon' find out about me\nIt took a while to get back up on my feet\nAnd everything that I say, is blown out of place\nIf I ain't the shit, why they fly around me?\nI'm on some shit, I'm on some shit\nYou hoes is the feds, I swear I'm convinced\nI hit a club, you know they gon' strip\nI throw all my money like I'm in love with that bitch, I just fuck on that bitch\n\n[Part 2: Purple Mountain]\n\n[Spoken]\nNew music, [mood] music\nBaby-making music, your main lady shaking to it\nThis the feeling teachers never gave to students\nWho get paid too little to raise the stupid\nWho learn more from gangster music than basic schoolin'\nA whole generation of angry youth who get mistaken as a pain or a nuisance\nDistracted by the fame and jewelry, a country where we praise the wicked and shame the clueless\nWhen the enemy is within who do you aim the Nuke at?\nAre we really at the top or is that just how're we are trained to view it?\nI wonder who made the blueprint? Is it the same bloodline that enslaved the Jewish\nBuilt ships and chained us to it, paid a sniper to aim at Luther\nTook the World Trade, flew planes into it, and framed the Muslims?\nThis probably sounds like a scene from your favorite movie\nWell wake up, wake up, it don't take brains to do it, it take bank to do it\nWelcome to the capital where only the greatest do it\nGood intentions is what the road to hell is paved with usually\nAnd bitches swimming bottomless in bottomless ace of spade jacuzzis\nDrowning in my own lust, I had to drain the fluid out the group think think tank\nI outgrew the fishbowl, I snapped your fucking fishing pole\nFuck opinions, they just want me trapped and fucking pigeon-holed\nNow snap a fucking picture hoe\nGot me feelin' like I don't get it, you don't get it\nYeah there's truth but who gon' spit it?\nYeah I could say it but who gon' get it?\nComplicated fuckin' lyrics, who gon' listen?\nWe all fuckin' hated math, now who wants physics\nI ain't speaking to you all cause you all get it\nBut see there's projects from Duval to New York City\nYou ever wonder why it's called the projects?\nPicture the statue of liberty in a thot dress\nI leave you all to your thoughts to process\nSincerely yours truly, God bless", "title": "Behind Ya Back / Purple Mountain", "album": "WATER (We Are The Enemy Really)", "image": "https://images.genius.com/0fb63f56a90a658f950a838126f7ce63.800x800x1.jpg"}], "artist": "B.o.B"}