{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/bff1176ed6deb6d256cc9e04734b0136.365x365x1.jpg", "title": "Ol’ Time Killin’ (Remix)", "lyrics": "[Busta Rhymes]\nWhappen? Wunna nuh wa'an listen\nYuh nuh wa'an listen the bomb weh I drop on wunna bloodclot head\nNuff sound tink dem can gwaan however dem wa'an gwaan\nKardinal! (Yo!)\nDem man deh nuh realize seh we a deal wid a technology\nWe don't identify wid di whole a dem idiot soundbwoy already Yuh know, rudebwoy?\nBare big man ting a gwaan pon dem streets weh a controlla, nuh fadda? (Eh eh)\nMek we tek way a bwoy tings!\nGo tell di whole a dem idiot soundbwoy\nTell dem fools fi move and gweh\n\n[Kardinal Offishall]\nOl' Time Killin' I'm feelin', I'm spillin'\nI'm pulling out heat on industry niggas earning a million\nWith bullshit like Gilligan's\nSomebody go check Will and them\nAnd ask Uncle Phil to rep me while my shots get rid of dem\nDis X y'all I'm feel it all up in yo mega-lens\nSomebody go tell Missy I'm a hundred minute mission (Listen!)\nHunched over the side I'm a lyrical homicide\nRide di gyal feel a bone if I a pon tity pride (HEY!)\nSlew dem, Boo dem al dem fassy nah crew dem\nYo Kardinal and Busta come to crush the liccle fool dem (Who Dem?!)\nThe Circle Click and The Flipmode Squad reppin' da' T-Dot and B.K. back to\nY'all (HEY!)\n\n[Busta Rhymes]\nNow unna fi know seh unna fi stop the mumbo jumbo\nBefore mi run and go call Columbo\nFi lick out unna bumba-hole\nNuff shot a fire, see how shit is very simple\nTo leave you with holes and dimples\nInside of your shit and cripple a nigga (DAMN SON!)\nYuh betta roll out\nI'll dismantle ya whole mout fi talking what you nuh know bout\nHacksaw Jim Duggan some of these niggas is frontin'\nNuff' of these niggas is nothin'\nAlways huffin' and puffin'\nI'll soon come and give you a cuffin' (AH-OOH!)\nFrontin' like you tough, and soft as a blueberry muffin\n(EASY RUDE BWOY!)(FOOAH!)\nBecause of circumstance I might have to go hurt ya man\nIt's such a shame the way we fuck up the party and done di dance\n\nChorus: [Jully Black & BlackKat]\nIt's a Ol' Time, Ol' Time Killin'\nWe a deal with, run and get your money clip (BLOOK!)\nFor another day (BLOOK!)\nIn another way (WHAT!)\nDe man dem, nah take nah ray ray\nWe are murderer\n\"The..The MC...\" -KRS-One\nKilla...\n\"Murder She Wrote\" -Chaka Demus & Pliers\n\"Murderer\" -Barrington Levy\n\"When time it come to my sound which is de champion sound\" -Major Mackerel\n\n[Kardinal Offishall]\nBun ya calm give tanks and praise\nPut on ya' vest, protect ya' chest\nFrom dem hollow points stray\nWe runnin' in da' streets\nAnd we wildin' on the mics (SAY WHAT!)\nThe dress code is beats and white Nike's\nNuff niggas shinin' but I'm beggin' you to look again\nThe teams are so sold like Jordan playing for Washington\nStyle is like Allen I. on the all-star team (it's yoo much for you!)\nMake you wanna wake out ya' dream and wipe the dribble off your sweatshirt\nCorny niggas get hurt flirtin' with death\nEvery time the mic sees my breath\nThis ain't a killin', it's a favor that we doin'\nI'm taking em' out of misery fore' da' crowd start booing em'\n\n[Busta Rhymes]\nScrewing and pursuin'\nSplitting em' in 2 and em'\nNiggas I have to remember fore' I have to get all of my crew and em'\nWild street niggas from way back ah while I keep it hot\nFlexing with Bill Golayoot from B.K. to da' T-Dot\n\nChorus: [Jully Black & BlackKat]\nIt's a Ol' Time, Ol' Time Killin'\nWe a deal with, run and get your money clip (BLOOK!)\nFor another day (BLOOK!)\nIn another way (WHAT!)\nDe man dem, nah take nah ray ray\nWe are murderer\n\"The..The MC...\" -KRS-One\nKilla...\n\"Murder She Wrote\" -Chaka Demus & Pliers\n\"Murderer\" -Barrington Levy\n\"When time it come to my sound which is de champion sound\" -Major Mackerel\n\n[Kardinal Offishall]\nAh ha!\nCrown the king him Kardinal start to sing\nAnd make these weak cats pop the diamonds out they pinky ring\nAnd sell it off when I go off\nWhen the drummer start drummin' smokin' rocks up in the corner talkin' bout'\n(Yo Bust Coming!)\n\n[Busta Rhymes]\nIt'll be last one of you amateurs that will mash up any challengers\nFuck yuh bus stop, caw mi nah pick up any passengers\nYo pure dutty nigga ting a gwaan\nBus-A-Bus and Kardinal yeah we fill up a arsenal like carnival, yo\nWhile we chillin' and fulfillin' niggas with listenin' pleasure\nWhere's my drink yo let's salute the Ol' Time Killin'\nYou actin' bitchy man, my trigger finger itchy man\nWe don't engage in any social activity with chi-chi man\n2 body bag and a cute casket\nCould put you and a whole a ya' fruit friend in 1 fruit basket (Chyo!)\nAnd when the dance done you know we complete\nYou better bounce before we cock and put a shot inna ya bloodcleet\n\nChorus: [Jully Black & BlackKat]\nIt's a Ol' Time, Ol' Time Killin'\nWe a deal with, run and get your money clip (BLOOK!)\nFor another day (BLOOK!)\nIn another way (WHAT!)\nDe man dem, nah take nah ray ray\nWe are murderer\n\"The..The MC...\" -KRS-One\nKilla...\n\"Murder She Wrote\" -Chaka Demus & Pliers\n\"Murderer\" -Barrington Levy\n\"When time it come to my sound which is de champion sound\" -Major Mackerel\n\n[Kardinal Offishall]\nYeah..a nah we run wit it\nT-Dot!..B.K....Kardinal and Busta\nSemi...yes!\nFirestarter part one\nAnd M-ode, uh Raspberry, Circ..is Flipmode heh\nYa' na'mean..Can't F' wit us..Can't F' Wit'out us yeah\nEh-Heh! See you late!"}], "artist": "Kardinal Offishall"}