{"songs": [{"year": "2009-09-11", "image": "https://images.genius.com/f85c1a562a0a260e061aa6a73251d4ef.1000x1000x1.jpg", "title": "Salue", "album": "Monsterifik", "lyrics": "[Pre-Hook: Tech N9ne]\nAll around the globe\nIf you use booze to\nUnloose you, alcohol to boost you\nWe can take it straight\nOr mix it with juice too\nWe who is bout to get fucked up salute you!\n\n[Verse 1: Big Scoob]\nWhatcha drinking, brah?\nWhatcha thinking, brah?\nLet's pour some whiskey in this party, get it cranking, brah\nAt the crib, on the corner, in the car (Pouring liquor)\nAt the spot, at the club, at the bar (Til it hit ya)\nGive me a drank, so I can think, that's how I dos (How I dos)\nSo tell the 'tender get to mixing Caribous (Caribous)\nSlam the pitcher, now I'm fixing to cut it loose (Cut it loose)\nYou showed me homie, man you know I love that booze (I love that booze)\nIt's early morning, off of 5th, it's barely noon (Barely noon)\nMost believing that's the reason I'm a goon (I'm a goon)\nBut if I'm breathing, then I'm drinking, that's the rule (That's the rule)\nThen turn me heathen, if it's needed, clear the room (Clear the room)\n\n[Pre-Hook]\n\n[Hook]\nAll my people, here we go\nLift your cup and say salue (Let's get drunk in this bitch)\nSalue! (Let's get drunk in this bitch)\nAll my people, here we go\nLift your cup and say salue (Let's get drunk in this bitch)\nSalue! (Let's get drunk in this bitch)\n\n[Verse 2: Tech N9ne]\nEy, I'm bout to make me a gallon of carabeezy\nHop on my blackberry and call me up a breezy\nDrank up now she's ready to break me off some heezy\nIf her teethers get in the way I'ma say: \"Easy!\"\nHennessy richard, Hennessy parodies\nHennessy VSOP, Hennessy privileged is therapy\nHennessy play\nStep up my Hennessy game\nAnd get me energy win it, be friend at me, sin it became\nLet's get twisted up in your house\nI know it's far out\nLets drink some full yards\nThen let's start some bar bouts\nWe took the graw route\nAnd start to spraying bitches with liquors\nToo many salues brought the retard out\n\n[Pre-Hook + Hook]\n\n[Verse 3: Big Scoob]\nYeah\nI drink my whiskey straight-lace I don't need to chase (Uh-huh)\nFull throttle out the bottle, take it to the face (Uh-huh)\nDon't need no juices or no mixes man, I like the taste (Uh-huh)\nCrown Royal, black case, man this shit is great (Uh-huh)\nAnd now the party's jerking got these bitches all twerking (Uh-huh)\nAnd now I'm smirking, man I'm loving how this liquor's working (Uh-huh)\nI seen this liquor make the best bitch go bad (Wow!)\nI seen this school teacher come up creature so fast (Wow!)\nThe Carabeezy made her easy, had that hoe smashed (Yeah!)\nThen she pleased me with that heezy hit these gonads (Yeah!)\nMy tongue gets greasy with these breezies make these hoes laugh\nBig homie's greedy kinda sleezy when I'm chasing ass\n\n[Hook]"}], "artist": "Big Scoob"}