{"artist": "Problem", "songs": [{"album": "S2", "title": "Karma", "image": "https://images.genius.com/7fb9d8c4ebfefcd0475c83bda4bfb488.1000x1000x1.jpg", "lyrics": "[Chorus]\nYou're not on my mind\nYeah\nAnd well\nWell, I'm sittin' right on square one\nTryin' to get my head\nWhere it all started\nYeah\n\n[Verse 1]\nCan I live? (Can I live?)\nCan I grow? (Can I grow?)\nCan I be more than what I've shown? Listen (Yeah)\nNot a Muslim, not a Catholic nor a Christian\nI'm a leader, God, I still receive ya, hold on\nI ain't gonna be so nice too much longer, niggas (Yeah, yeah)\nFor my father, I'm here to deliver karma to you (Yeah, yeah)\nOff my growth, y'all eat, what am I, a farmer to you?\nThese life lessons ain't cheap, I'm tryin' to charge you niggas (Huh)\nPaid dues and prices for late night vices (Psh)\nPhone tapped by vices\nBullets hit friends heads 'til they physical's lifeless\nCan't just right this, can't Suge Knight this, can't lock it away\nAnd pretend it didn't happen, they just rappin', I'm just ventin'\nTurn pain into passion, clown movie, it was written (Yeah)\nI seem smitten, yeah I am, I stand tall\nStill they try to tear down your man (Why?)\nBitch was you created to tear down my plans? (Yeah)\nTearin' down my psyche, re-evaluatin' friends? (Yeah)\nSpendin' time over-analyzin' lies, missin all your truths? (All your truths?)\nRoundin' up my Y-Gs (All) and all my Snoops? (Yeah)\nTell 'em tool up, time to bring them Oscars to them actors (Yeah)\nRaw spelled backwards will be bad for you like laced Backwoods\nI'm angry (Fuck these niggas)\nBeen overlooked and disrespected, can you blame me? (Can you blame me?)\nThe animal's in every room, they can't tame me\nThey won't try (Nah), go on, try (Yeah)\nYou'll be spray paintin' another R-I-P name\n'Fore the last one you just put up paint dry (Got 'im!)\nIt's Diamond Lane, nigga, I can't lie (D-D-Diamond!)\n\n[Chorus]\nYou're not on my mind\nAnd well\nWell, I'm sittin' right on square one\nFor real\nTryin' to get my head\nWhere it all started\nYeah\n\n[Verse 2]\nNo, they say my dog just start snitchin' (Say it ain't so)\nI love women, but fuck these bitches (Bitches and hoes)\nI told you first verse, I'm here to bring the karma (Uh)\nIt's tough to raise your daughter when you don't respect they mamas (Uh)\nChachi, that ain't right nigga, where's your honor? (Where's it at?)\nI need a mood change, shit, where's Rihanna? (Uh)\nThe thick one, Problem, Chachi, pick one (Come on)\nMénage with a God, help massagin' my problems\nPsh, alarmin' you strangers, I'm far from a angel\nI keep it 200, the law will obtain me I'm ballin' and angry (Uh)\nOkay, see, Russell Westbrook with it\nMake the beat like the rhyme and lay the best hook with it\nAnd niggas still question my spirit\nQuestion my goals, question my motives, question my character\nLike I'm doin' this for money, nah\nI just want y'all to love me\nThe right way, though\n\n[Chorus]\nYou're not on my mind\nAnd well\nWell, I'm sittin' right on square one\nThat's all man, fuck\nTryin' to get my head\nMan\nWhere it all started\nKarma", "year": "2018-11-30"}]}