{"songs": [{"title": "Cold Blood", "lyrics": "[Intro]\nPoverty's paradise\nIf you want it, you'd better think twice\n\n[Hook: Canei Finch]\nStarted from the ground, building to the sky now\nWatch it fall down, but how you gon’ survive now?\nYeah, it’s cold blood in a nigga\nThe streets left no love in a nigga\n\n[Verse 1: Yo Gotti]\nIn a nigga, yeah, no love in a nigga\nIf I could paint a picture, I'd show a image\nOf a dog ass nigga, yeah, a raw ass nigga\nPopping pain killers, riding for the cause\nFour dogs with them pistols, na-na-natural born killers\nHe sold crack to his mother, turned his back on his brothers\nKilled his partner for the plug, he think everything a hustle\nCo-cold muh'fucka, holmes numb\nBlack heart, no feelings, just a gun, fo'real\nHe was raised in the trenches\nNot to mention, all the hoes they had dissed him\nSo holmes think the whole world against him\nPlayed ball, coach benched him, grandpa, Klan lynched him\nHe was raised in Mississippi but he moved up to Memphis\nKinda hard to adapt\nSo holmes turned to a strap\nDidn't succeed, tried rap, couldn't fight, got slapped\nShot dice, do crap, did time, back out, damn\n\n[Hook: Canei Finch]\nAnd from the ground, we build it to the sky now\nWatch it fall down, how you gon’ survive now?\nIt’s cold blood in a nigga\nThe streets left no love in a nigga\nStarted from the ground, building to the sky now\nWatch it fall down, how you gon’ survive now?\nYeah, it’s cold blood in a nigga\nThe streets left no love in a nigga\n\n[Verse 2: J. Cole]\nHey, no love, no love\nHow you gon' survive now? No love, no love\nYo Gotti, lemme paint a picture for these niggas, hey, huh\nHere’s a, voice for the voiceless\nMy words like, multiple choice to the choiceless\nEmerge like, a searchlight in the darkness for this young black carcass\nMy niggas either join the Armed Forces or they corpses now\nIn God we trust, but it’s bucks that we worship now\nBoy, that root of evil gon’ forever rule the people\nSee I seen just what that fast money gon’ come and do to people\nHit a lick, it was a hit, he said, “Let's go and do the sequel”\nBut his, nigga wasn’t ‘bout it, nigga wasn’t ‘bout it now\nFeeling guilty, what would momma think about me?\nTold 'em, \"Think about it, nigga, won't you think about it now?\"\nBut he was money hungry, plus he trigger happy\nSo they hopped up in the Caddy, burners packed just like a stadium\nThirty minutes later, blood is leaking at the ATM\nMomma in denial like her baby boy on trial\nFor a murder that he ain’t commit, tears soak the handkerchief\n\n[Hook: Canei Finch]\nAnd from the ground, we build it to the sky now\nWatch it fall down, how you gon’ survive now?\nIt’s cold blood in a nigga\nThe streets left no love in a nigga\nStarted from the ground, building to the sky now\nWatch it fall down, how you gon’ survive now?\nYeah, it’s cold blood in a nigga\nThe streets left no love in a nigga\n\n[Verse 3: Yo Gotti]\nFo'real, fo'real\nLights off, no candles, roaches all around the kitchen\nNigga hungry, mom embarrassed so she don't want us to mention it\nGrandma wanna help but momma ego kicking in\nShe a hustler, she don’t need no help raising her kids\nBills came, got evicted, stayed strong\nSquare business, she ain’t never showed weakness, real shit\nThat created the hunger, and that make the monsters\nGot the game from our momma, that’s some ill shit\nThirteen on the block, he was a lookout\nIn the kitchen, on the stove like it’s a cookout\nYoung nigga mastered the game, could put a book out\nRight when he thought it was over, he got took out (bang!)\nBrains leaking, nigga sneaked him, he ain't even seen it coming\nHe a hitta, he wasn't focus so he died over nothing\nNo revenge, with his friends shooting dice, bet again\nWin or lose, take it all, took out by his own men\n\n[Hook: Canei Finch]\nAnd from the ground, we build it to the sky now\nWatch it fall down, how you gon’ survive now?\nIt’s cold blood in a nigga\nThe streets left no love in a nigga\nStarted from the ground, building to the sky now\nWatch it fall down, how you gon’ survive now?\nYeah, it’s cold blood in a nigga\nThe streets left no love in a nigga\n\n[Outro: J. Cole]\nThey say the good die young, that’s the truth\nMy nigga floating up in Heaven now and that’s the proof\nI ain’t make it to the funeral, but homie rest in peace\nIf this world get too cold, I hope one day you rescue me\nNigga, maybe we can fly someday\nOh, we can fly someday\nYeah, up in the sky someday, mm\nDo real niggas get to Heaven? That’s that shit I ask the reverend\nThey say the good die young, that’s the truth\nMy nigga floating up in Heaven now and that’s the proof\nI ain’t make it to the funeral, but homie rest in peace\nIf this world get too cold, I hope one day you rescue me\nNigga, maybe we can fly someday (fly)\nOh, we can fly someday (fly)\nYeah, up in the sky someday (sky)\nDo real niggas get to Heaven? That’s that shit I ask the reverend", "album": "I Am", "year": "2013-11-19", "image": "https://images.genius.com/c110d9f81ab40dc4f80158b5112d3932.1000x993x1.jpg"}], "artist": "Yo Gotti"}