{"artist": "Preme", "songs": [{"album": "Dear America", "title": "Welcome to the Future", "image": "https://images.genius.com/228f06b6beee88a4c4c3a7b063ae1044.500x500x1.jpg", "lyrics": "[Intro: French Montana]\nYou a dead nigga\nMontana, P. Reign, Drizzy wassup, nigga?\nChug, Auti, OVO, nigga\nCoke Boy, haaann, aye aye aye aye aye aye\n\n[Verse 1: P. Reign]\nPut the money over bitches, ho, think I’m playin, I’mma let em know\nWe treat yo chicks like fish, nigga, catch em and then we let em go\nGet em beat and naked hit, I murder shit, piss the flow\nTold lil Remi King don’t kiss the ring, baby lick the throne\nYeah, now momma, show me how you kiss it\nI’m in love with the pussy but I’ll murder that kitten\nIf ya still wifin hoes, I won’t be caught dead kissin’\nShe gon’ swallow every bit, got her mouth babysittin’\nAnd my young’n same chair, just let me worry bout em\nLeft em niggas talkin’ beef, homie, don’t make a burger out em\nThis the south side, nigga; I'm a south side nigga\nTurn yo fuckin’ insides to your outsides, nigga\nSuck my jewels, go ahead, my dudes all bad\nBut your goons won’t bust, y'all the blue balls gang\nI chase money, not problems\nBut dare a nigga run up on me and that will be his very last day job\n\n[Hook: P. Reign]\n(You a dead nigga) If you threaten me\nFuck a gun charge, we take the felony\nAnd welcome to the future, baby (oh, baby)\nWelcome to the future, baby (oh, baby)\nI be whippin’ up, I got that recipe\nYou smell like money, baby, it's cuz she’s tellin’ me\nWelcome to the future, baby (oh, baby)\nWelcome to the future, baby (oh, baby)\n\n[Verse 2: French Montana]\nMontana! Coke Boys, OVO on the same song\nGettin’ head in the range, shawty brainstarter\nI was the last on the corner, like 8-Ball\nBumpin’ Three 6, MJG, 8-Ball\nThen paid my dues; I be strapped down, I move\nNiggas fight, man, I shoot, hunnid fifty grand that coupe\nI got hunnid grands in hunnids, I got fifty grand in twenties\nHit that strip club we stuntin’ then we fuck any bitch we wanted\nBought a dub line this week, made five hunnid large this week\nIf that money talk ho, then watch my speakers blow\nMe and Drizzy talk hoes, I let them killas go\nNo love, Bone Thugs, see ya at the crossroads\n\n[Hook x2]", "year": null}]}