{"songs": [{"album": "Prisoner of Conscious", "image": "https://images.genius.com/70850ebf7e5891df63851f2a86ecec08.936x936x1.jpg", "year": "2013-05-07", "title": "Delicate Flowers", "lyrics": "These times it's hard being a man. I try to explain that to my lady overtime\n\n[Verse 1:]\nMy girl is a delicate flower, a super-hero\nBeing a single mom helped develop her powers\nWe stay up to a elegant hour talking inhaling the sour\nReaching out to God cause the Devil a coward\nBut he still sits on my shoulder and whispers\nIt feels like my shoulder gets colder the more that I listen\nAnd now it seems like she ready to leave\nWe stay to beef the main reason my desire to spreading my seed\nI try to tell her I'm just a man\nShe said \"no, you're wrong\nCause you're way more than that\nYou need to cut the scam\nYou're not fooling me, this lunacy\nThem excuses might be new to the birds\nBut they ain't new to me.\"\nYo, I hate when the fit is thrown\nIt's like everytime I pick up the phone you bitch and moan, whoa\nI'm like why you stressing for?\nI'm pressing ignore, make me wanna never get involved\n\n[Hook:]\nI need to reap these benefits\nOoh, you so sensitive\nI say serve this royalty\nShe say I deserve your loyalty\nGirls have feelings\n\n[Verse 2:]\nMen lie out of fear but we front like we're not afraid\nWhether arguing or not, the bills gotta get paid\nWe are not in 6th grade, we're fighting and people watching\nOn Twitter she emo-blogging, I'm boiling her hemoglobin\nIt lead to sobbing the arguments never move me\nCause we acting out the stereotypes like Tyler Perry movies\nMy indiscretion is reeking in deep betrayal\nLibidos are like horses, it's hard to keep em stable\nShe believed me the way Mike believed in Fredo\nBut I need her, she the proof in my soul, my sweet potato\nBefore I let her go I know she'll be forever gone\nI can't leave when the weather wrong I weather storms\nShe like Katrina got me looking for FEMA\nCoveting my neighbor's lawn the grass is looking greener\nBut in reality it never is\nI'm sure there's others, but I'll never find a better fish\n\nGirls have feelings\nGirls have feelings\nGirls have feelings\nThey surely, surely do"}], "artist": "Talib Kweli"}