{"artist": "Anybody Killa", "songs": [{"title": "Thoughts of Suicide", "image": "https://images.genius.com/8a7a13e5aff4ea229c97fc6e44c5aae7.1000x1000x1.jpg", "album": "Mudface", "lyrics": "[Intro]\nHey man you alright?\nNo\nI seen how your ol girl was coming down on you\nYeah\nWhat happened? Your pops found out you lost that job and shit\nMmm-hmmm\nWell don’t worry homey, man parent be like that sometimes, it’s like they mad at you because they get old. Just don’t go all crazy on me, talking about you going to kill yourself again, alright\n\n[Verse 1: Anybody Killa]\nYes, in my mind I want to do it but when I pursue it I can’t seem to go through it\nSo I’m going to write a song just so you can feel everything I feel when I’m in the mood to kill myself\nI can’t control it, these thoughts of suicide, I’m always dealing with\nAnd I know I’m not alone when it comes to this, cause everyday it’s like the whole world pissed\nSo fuck your attitude and keep your bad mood cause I got one too\nAnd I don’t give a shit who you rolling with bring your whole damn crew\nWe’ll call it suicide when you messin with a killa someone’s bound to die\nAnd it won’t be me cause only one’s claimin my life is g-o-d\n\n[Chorus x2]\nYou ever thought of suicide, you ever thought of suicide, you ever thought of suicide\nGlad you didn’t do it, if you did you wouldn’t be here now\n\n[Verse 2: Anybody Killa]\nAre you easily influenced\nDoes your parents always say that your friends are the reason that you ruint\nDo you have hate for your boss, to where you wanna catch him alone and pop one off\nOr is it mental health, where the only problem that you have is with yourself\nCan someone please explain why it feels so good to cause so much pain\nWith all these thoughts we have, yep it’s easy to say to just relax\nBut when you that fed up, only thing in your mind is how deep to cut\nBecause you hate your life and you really don’t care\nAnd things would be better if you just weren’t here\nSo now you ready to go end it all\nInstead of thinking of the ones you won’t see tomorrow\n\n[Chorus x2]\n\n[Verse 3: Strict 9 & *Anybody Killa*]\nIt’s nothing nice, got the thoughts steadily running through my head\nI close my eyes and try to picture if I’m better off dead\nIt sucks to me, the one and only as I sit here by my lonely\nSeparated from the world cause the world is so phony\nHear my cries, tell me why when you do it tell them lies\nYou wear a disguise I can see it in your motherfuckin eyes\nIt’s suicide, last ride if you wanna get inside\nShotgun it’s your boy and I’m ready to die\n*Do people that commit suicide go to heaven?\nI’m sure everyone has their own theories\nBut I’m a firm believer that if you take you own life\nYour soul is trapped*\n\n[Chorus x2]", "year": "2008-11-25"}]}