{"artist": "Big Boi", "songs": [{"lyrics": "[Intro: Big Boi] + (Gucci Mane)\nYeah! All the ladies say hoooo\nAll the hoes say, (Hah, Hah, Hah)\nYeah! Here we go A-town! C-post!\nCutmaster Swift, down your throat\nBoy stop!!!!\n\n[Verse One: Bun B]\nHot damn, ho (ho), here we go again (gain)\nRaise up off of mines, put your elbow in\nSlow your roll like your off-sets is off set\nYou out of line, cuz you out off line, so you off net\nLeather seats all wet, paint up on the Fleetwood\nOn this point, Jordans on my toes, did my feet good\nStill got my Coogi, my shorty got a Gucci on\nFlossing on the same track I hear Big and Gucci on\nNow we remixed it like it's two different packs\nOf Kool-Aid in the same jug, and I'm feeling same, thug\nThis is for the boys in blue, and the G's flamed up\nI'm in the big body slab, raised up, game up!\n\n[Hook: Gucci Mane]\nI'm on my grind shawty, don't block my shine shawty\nHold up, hold up guess who just showed up?\nRolled up, rolls cut, drop with the doors up\nI'm on my grind shawty, don't block my shine shawty\nWait a minute, wait a minute, chill a little, sit a minute\nI can't close my safe no more cause I got too much money in it\n\n[Project Pat over Hook]\nIt's your boy....\nProject Pattah\n\n[Verse Two: Project Pat]\nI still get if off with the soft and the hard\nNow it's stacks that I stack for the sixteen bars\nUsed to dodge them laws in them stolen cars\nNow I'm Escalade, sitting high with the stars\nTook a shine like a star, now my head is in the clouds\nAnd I'm papered, so I'm right back on the line\nProject Pat, my dog, and I'm leading half a pound\nCousin house in the bay, on the North side of town\nMan, the streets in me, so I can't say I don't miss em\nDipping through the hood plucking chicks, but I don't kiss em\nShe wishin that I would take her home; long stick her\nThen I get her back, hit it from the back and I'm gone\n\n[Hook]\n\n[Verse Three: Big Boi]\nCan't be tripping bout no paper cause the safe is not so safe\nThe piggy bank got legs and feet, and can get up and walk away, shawty\nWith my southern drawl, awkwardly I spray\nLike the backside of a skunk and the stash house with the pump\nPistol whip in my lap at all times in the 'Llac\nFrom Atlanta to Savannah, can a nigga stop that?\nNot when God's got his hands on me only the strong survive\nAnd the weak minded are falling by the wayside\nThey try But which I overcome and succeed, indeed\nBut with success comes a great responsibility\nWe chose to lead not follow, It's a hard pill to swallow\nBetter get prescriptions filled cause there might not be tomorrow\n\n[Hook]\n\n[Outro: Big Boi] + (Gucci Mane)\nYeah, yeah, yeah-yeah\nA-Town representer (Hold-hold-hold up)\nEast Point, College Park\nDecatur, Yeah!\nI got me armor on, sword and shield on deck", "image": "https://images.genius.com/d490a9246c93be0a14dc0d13699d97a2.908x908x1.jpg", "year": "2010-07-06", "title": "Shine Blockas (Remix)", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}