{"songs": [{"image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png", "title": "E.I. (Squeaky clean edit)", "album": null, "year": null, "lyrics": "Uh.. uh uh uh uh\nUh.. wait a minute now\nUh-ohhhhhhhhhhhhhh!\nUh, uh..\nCan you hear me out there?\nLunatics.. is y'all ready?\nLet me hear ya\nUh-ohhhhhhhhhhhhhh!\n\nI'ma sucka for corn rows and manicured toes (hey)\nFendi capri pants and Parasuco's (alright)\nPassadity ?? city, with one or two throws\nI'm droppin 'em outta high school straight into the pros\nWho knows? I know!\nAnd I love it when you make your knees touch your elbows\nAnd break it down low to the flo', and there you go\nNow throw it on me slow\nAnd everytime I Bust a rhyme, baby \"Gimme Some Mo'\"\nYou say you like that, when I hit it from behind\nAnd I'll be right back; yeah that's my very next line\nI use it - time after time, when I'm speakin my mind\nIt's no matter if I'm shootin game to a pigeon or dime\nI ask her, \"Who dat is, talkin that shit about the 'tics?\"\nSomebody probably jealous cause they bitch got hit\nBut ain't nobody else droppin shit like this\nShould we apologize? Nah fuck 'em, just leave 'em pissed, HEY!\n\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! What's poppin' tonight?\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! If the head right, Nelly there ery'night\n\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! What's poppin' tonight?\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! If the head right, Nelly there ery'night\n\nWe can gamble to the break of dawn, nigga\nMoney long, nigga\nPass up the skirt to talk to the thong, nigga\nSome say I'm wrong, but fuck it I'm grown, nigga\nIf you ain't bout money then best be gone, nigga\nI'm fast (uh) double takes when you walk past me\nNasty, don't be scared boo, go 'head and ask me\nI drive fastly, call me Jeff Gord-on\nIn the black SS with the naviga-tion\nSee the joint blaz-on, somethin smells amaz-on\nI got a chick rollin up, half black and asi-an\nAnother one pidge-on, tellin me to come home\nHer husband on vacation and left her home alone\nI used the V-12, powers; weight loss, powers\nFrom +Phat Farm+ to +Iceberg Slim+ in one shower\nGet a room in Trump Towers just to hit the P hours\nKicked the bitch up out the room cause she used the word ours, HEY!\n\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! What's poppin' tonight?\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! If the head right, Nelly there ery'night\n\nAiyyo I smash-mouth a whole ounce, of that sticky\nWash my hands under a gold spout, when feelin icky\nLet go off in a ho's mouth, I ain't picky\nStart frontin when the shows out - whatchu mean?!\nTwenty inches when they roll ouuuuuuut - come and get me\nBig faces when they fold ouuuuuuut - is you wit me?\nDon't make me pull that fo'-fo' ouuuuuuut\nI keep it closer when the dough ouuuuuuut\nThen I slide up in the Escalade\nMe and E gettin solid like the Ice Capades\nAnd me and Heezy - frosty, project mo' wrapped up than Bugsy\nYou understand me, wrapped wrists like mummies\nIf you compare me to your local grocery\nThen you'll see I got more carrots/karats than \"Aisle D\"\nMore bread than \"Aisle G\", then bag and scan me\n+Sure+ like +Al B.+, meet the 'tics in Maui, HEY!\n\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! What's fuckin' tonight?\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! If the head right, Nelly there ery'night\n\nSt. Louis y'all, uh, uh\nUh-ohhhhhhhhhhhhhh!\nUh, can you feel that?\nLunatics y'all, uh, uh\nUh-ohhhhhhhhhhhhhh!\nUh, uh, Uncle Phil up above y'all, uh, uh\nUh-ohhhhhhhhhhhhhh!\nYell it universal y'all, uh, uh\nUh-ohhhhhhhhhhhhhh!\nUh, uh, chillin chillin chillin with the crew y'all\n\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! What's poppin' tonight?\nAndele andele mami, E.I. E.I\nUh-ohhhhhhhhhhhhhh! If the head right, Nelly there ery'night"}], "artist": "Nelly"}