{"songs": [{"lyrics": "[Intro]\nAye!\nBitches ain’t on shit, niggas ain’t on shit, they babies ain’t on shit, they mamas ain’t on shit\nNever been on shit period! Yeah! Da Doll Way, whole lotta that! Fuck you talkin’ bout?\n\n[Hook]\nMake these hoes listen , pay attention all that beef shit\nWe ain’t really start it, but lil Asian Imma finish it\nYoung rich bitch we from Texas, bitches counterfeit\nPop off Smith and Wesson we ain’t rockin’ bruh you counterfeit\nImma Murda shit! Imma Murda it! Imma Murda shit! Imma Murda it!\nBitch I’m the best, Hunnit in that tech\nCommas on my check, VV all on my chest\n\n[Verse 1]\nLil bitch ain’t bout no action, built you up, gave you a name\nOn my mama we so solid, Cuban stood up in that paint\nI ain’t smiling at no opp, bitches dumb up in the brain\nYou was chokin’ on my dick, wanna feature for the fame\nI unfollowed bitches, I’m so cocky\nCause you ugly, not my problem\nPretty bitches been a hobby\nTootin’ .30s, solving problems\nBitches in my face, bitches want my place\nYo nigga wanna taste, he get robbed before the date\nHot dog hot dog hot diggity dog\nLook at bitches telling lies, I’m really putting them on\nBut I take, cause my swag, bitch I gave you a loan\nThink about it, Asian Doll sit and calling ya phone\nYou took a L and you spook\nDove right in the booth\nAnything Asian spit outta 10 is the truth\nAny hoe get out of line, then that bitch gon get slapped\nDropped a bag in that beef, I’m a real bitch no rap\n\n[Hook]\nMake these hoes listen , pay attention all that beef shit\nWe ain’t really start it, but lil Asian Imma finish it\nYoung rich bitch we from Texas, bitches counterfeit\nPop off Smith and Wesson we ain’t rockin’ bruh you counterfeit\nImma Murda shit! Imma Murda it! Imma Murda shit! Imma Murda it!\nBitch I’m the best, Hunnit in that tech\nCommas on my check, VV all on my chest\n\n[Outro]\nWhere my check bitch?\nOn my neck bitch!\nYou get stretched bitch!\nYou get wet bitch!\nGive me neck bitch!\nHa!\nFuck is they talking about?\nYou on that opp shit, don’t be surprised when you get dropped quick\nYeah, dropping bitches like flies, period\nYeah!\nFuck they talking about? Texas against everybody!", "album": null, "year": "2018-02-22", "title": "Murda", "image": "https://images.genius.com/9098079c183d5dd652987f6ffd004514.1000x992x1.jpg"}], "artist": "Asian Da Brat"}