{"songs": [{"image": "https://images.genius.com/ea14fcea5af3aba0d7e333af219ecad0.1000x563x1.jpg", "album": null, "title": "D.O.A. (Death of ACTA)", "lyrics": "[Verse 1]\nOnly rapper to be called a thief without stealing\nDownload an MP3 for free, these people hit the ceiling\nI'm just a citizen that's teaching you a lesson\nFor restricting my freedom of expression\nHow can ideas be possessions when they're freely replicable?\nHence unapplicable property laws are reprehensible\nDidn't Jefferson express his opinion on the matter\nWhen he said inventions shouldn't be given a patent\nWhat happened to that thinking, we're stuck in a pattern\nWhere the people with everything are keeping everything from us who haven't\nWe want it back, look, fed up of adverts, left and right\nBegging me to buy til there's nothing left of mine\nTo spend, never mind, who's next in line to testify\nThat we need laws like these to protect our rights?\nMedicine has never been something I'd ever deprive\nEspecially when a life depends on it to survive\nYeah, it takes an incredible effort to develop them right\nBut putting wealth over health, I said it's never been right\n\n[Verse 2]\nI'm just a citizen that's teaching you a lesson\nFor restricting my freedom of expression, and I reckon\nIf old blues themes hadn't been used by Led Zeppelin\nWe wouldn't ever have any heavy metal then\nThe history of music would have never even happened\nAnd amusingly there wouldn't even be a Metallica\nTo tell us that we should hang on the gallows of law\nSo we wouldn't even need to have a Gallo Report\nOh and by the way the fricking Gallo's support\nIs made of signatures which have been apparently forged\nThis shit is sinister, and cannot be allowed to enforce\nSo tell your ministers and MEPs of how it's been brought about\nAlthough you'll probably get a shallow retort\nBecause the lobbyists have got a grip around all their balls\nIf I was boss, I'd tell them get the Hell out the door\nBecause I've had enough of corrupt crooks ramming through laws\n\n[Verse 3]\nI'm just a citizen that's teaching you a lesson\nFor restricting my freedom of expression\nYes, and deep packet inspection? squeeze that up your rectum\nIf your postman did that to you you'd be having him sectioned\nArrested for meddling in your private affairs\nBut it's only online, right? so why should we care?\nBecause digital rights should be applicable right\nHere in real life, and we're not criminals, right?\nSo this is just why we'll never give up the fight\nTo be considered innocent until we kick up and die\nGiving internet providers responsibility\nFor the whims of their subscribers infringes privacy\nBefore the internet, media was a rarity\nBut how do you expect it to keep its value without scarcity\nAnd that's what scares me, seeing their cons and schemes\nTo stop their creaking business model being obsolete\nWhat a robbery they pull off so obviously\nDon't give a fuck who it affects as long as it's not me\nWell I'll keep making copies, see if they can stop me\nThey'll have to confiscate my PC and take it off me\nSee there's no problem with taking my property\nFor creating some lines of binary, blatant hypocrisy\nAfraid to face the controversy relating to what we need\nMaking a profit off it or breaking monopolies", "year": "2010-10-19"}], "artist": "Dan Bull"}