{"songs": [{"title": "Ransom (Remix)", "album": "We Love You Tecca", "year": "2019-08-15", "image": "https://images.genius.com/c20f01f5a9b39aad87873d79134c3328.1000x1000x1.jpg", "lyrics": "[Intro: Lil Tecca]\nTurn you to a dancer\nYeah\nInternet Money, bitch\n\n[Chorus: Lil Tecca]\nI got black, I got white, what you want?\nHop outside a Ghost and hop up in a Phantom\nI know I'm 'bout to blow, I ain't dumb\nThey try to take my flow, I take they ass for ransom\nI know that I'm gone\nThey see me blowin' up, now they say they want some\nI got two twin Glocks, turn you to a dancer\nI see two twin opps, leave 'em on a banner\nAnd I got two thick thots, wanna link the gang, yeah\n\n[Verse 1: Lil Tecca]\nI got red, I got blue, what you want?\nThe Chanel or Balenciaga, Louis and Vuitton\nShe know I got the Fendi, Prada when I hit Milan\nI needed me a die or rider, I need me the one\nI started from the bottom, you could see the way I stunt\nI want all the diamonds, I want that shit to weigh a ton\nThe opps, they tryna line me 'cause they hate the place I'm from\nBut them niggas don't know me, they just know the place I'm from\nI got lots of shawties tryna pull up to my place\nBut you ain't want me last year, so just get up out my face\nThey all up in my inbox, so I know they want a taste\nI know they want my downfall, lil' nigga, are you laced?\n\n[Chorus: Lil Tecca]\nI got black, I got white, what you want?\nHop outside a Ghost and hop up in a Phantom\nI know I'm 'bout to blow, I ain't dumb\nThey try to take my flow, I take they ass for ransom\nI know that I'm gone\nThey see me blowin' up, now they say they want some\nI got two twin Glocks, turn you to a dancer\nI see two twin opps, leave 'em on a banner\nAnd I got two thick thots, wanna link the gang, yeah\n\n[Verse 2: Juice WRLD]\nI'm in it to win it, I'ma be the best, yes, sir\nStarted from the bottom, I ain't have no one, yes, sir\nHad to get big on them niggas, Bruce Banner\nBro split wigs, turn a nigga to a dancer\nI got hard, I got soft, what you want?\nSince the day that I've been on, they been blowing up my phone\nI can't hear 'em, I got all this loud in my lungs\nThumbin' through these blue faces while I'm smoking on Runtz\nUh, I'm in the hills (Ooh, yeah), countin' them bills (Ooh, yeah)\nAll baguette diamonds (Ooh, yeah), chandelier give her chills (Yeah)\nFeel like yesterday I was just watching Fresh Prince (Uh)\nNow the crib look like Bel-Air, rip to Uncle Phil\nMoney big, Uncle Phil, twin Glocks, Phil and Lil\nNiggas hate, Uncle Tom, spin them off me, carousel\nGet 'em off me, go to hell, silencer, kill 'em soft\nTecca'll take you for ransom, me, I'll put you in a coffin\n\n[Chorus: Lil Tecca]\nI got black, I got white, what you want?\nHop outside a Ghost and hop up in a Phantom\nI know I'm 'bout to blow, I ain't dumb\nThey try to take my flow, I take they ass for ransom\nI know that I'm gone\nThey see me blowin' up, now they say they want some\nI got two twin Glocks, turn you to a dancer\nI see two twin opps, leave 'em on a banner\nAnd I got two thick thots, wanna link the gang, yeah"}], "artist": "Lil Tecca"}