{"artist": "Fabolous", "songs": [{"year": "2015-04-18", "album": "Friday Night Freestyles", "image": "https://images.rapgenius.com/4f8e6d5433aca3d841179ce0e574659a.500x500x1.jpg", "lyrics": "[Intro: DJ Clue & Fabolous]\nLive from the 718\nWorld Famous DJ Clue.. Desert Storm\nThe Kid Loso... Welcome to Friday Night Freestyle Baby\nWe turning up for the Streets... This that Hall of Fame flow baby\nStop Playing.. (Lets Go)\nYea kid mobbin' with the gods...  (Clue)\nUh huh, Uh huh we like it\nYea Kid mobbin' with the gods\nYou don't want no problem with the gods\n\n[Verse 1: Fabolous]\nLook I talk it cause I live it, stand on my own pivot\nI don't need your credit, and you ain't got it to give it\nAll I do is fill up banks, Aunt Viv it\nDrink Belaire Champane and Club Liv it\nI come from the era where you really had to live it\nCouldn't say you Bentley, you're really a Honda Civic\nEvery thing you said painted pictures so vivid\nSo when I talk clippers, know that I can Doc Riv it (swish)\nBig man, pace your self like Roy Hibbert\nYou feel froggy than leap, stop all the ribbits\nI pop up at your crib and cats lookin' like Xzibit\nBox braids and mean mugs, I mean thugs\nType you would merge with on some purge shit\nPut in 'work' ASAP, on some Ferg shit\nMy homies said \"niggas just tryna wave surf you\nTryna jump aboard the wave you gave birth through\"\nAll these niggas late and want me to waive curfew\nTalkin' like they shooters when they wouldn't spray perfume\nThey know who the hell I be, I'm L-I-T\nI pass one to French like \"c'est la vie\"\nJu L-I-E, stay off the L-I-E\nThe 2 Chains made a single no L-I-E (Truu)\nI mean I don't care what her man says\nHe better come 'airing' like Hernadez\nOr you gon' hear that 'Braat' like Birdman says\nLeave him hanging out his helmet, Richard Sherman Dreads\nSee, I hit shorty like I need that bouquet\nHer man hit me back like \"you need some WHO cake?\"\nI text him right back like \"you heard that new Drake?\nYou know that if you reading this it's too late\"\nSee you ain't offending me\nIt ain't like you ain't heard son is fly as Kennedy (JFK)\nRiding in the six, got a lot of enemies\nA lot of people tryna drain me of the energy\nI know how it be, you know me from Brevoort\nUsed to call me \"Sport\", now it's Resorts\nBoats and  sea ports, foreign v's bought\nStamps and p-port, bunch of bitches in them Ms. Parker jean shorts\nMami got some head that'll stop a deport\nThroat game have me stuck, call it deep thought\nBut watch where you kick it\nYou park in the wrong spot, you know you'll get a ticket\nAll of that tough talk, and now the shit is crickets\nBe alot of places where these niggas can't visit\nThey think yo mans missin'\n\n[\"I been around\" hook chant]\n\n[Fabolous ranting]\nI been around the world nigga..\nI been around your girl too\nStop callin my muthafuckin phone talkin bout who this?\nDeez NUTS! GOT 'EM! Hahahaa... GOT 'EM!\n\n[DJ Clue]\nDJ Clue... Desert Storm...\nStreet Fam... I told ya'll...\n\n[Fabolous ranting]\nDon't let me catch you in the wrong spot nigga\nDem boys gon give you a ticket\nTryna take the waaave from a nigga\n\n[DJ Clue ranting]\nWe ain't done yet\nYa'll niggas is sleeping at the wheel\nWe on auto pilot", "title": "Been Around The World Freestyle"}]}