{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "Don’t Aproach Me", "album": null, "lyrics": "Pssh, man I need a lighter man\nRight here\nYeah, whassup Slim?\nWhat's crackin'?\nHit this shit\nShit I almost hit this motherfucker today\nPssh, is that right?\nWhat is it with motherfuckers thinkin' that\nBecause we're in the spotlight or whatever that\nThey can do or say whatever they want to us and that we won't retaliate\nProtect my motherfuckin' self, by any means necessary\nRight?\n\n[Hook: Eminem]\nCause you don't know me, I don't know you\nSo don't approach me, I won't approach you\nAnd don't insult me, I won't insult you\nCause you don't know what I will or I won't do\nCause you don't know me, I don't know you\nSo don't approach me, I won't approach you\nAnd don't insult me, I won't insult you\nCause you don't know what I will or I won't do\n\n[Part 1: Xzibit & Eminem]\nMake no mistake, I'm the Golden State heavyweight\nBein' underrated gave me time to create it\nCan you relate? I renovate, straight out the gate\nCarried my weight, but seem to receive nothin' but hate\nMillionaires snatchin' crumbs off my little son plate\nKidnapped, locked in a trunk, get shot in the face\nNo hoes, no clothes, no one showin' up for my shows\nYou know how it goes, I might as well kick it at home\nBut my baby momma hate my guts and can't stand me\n(Yeah)\nPacked up, moved out, started a new family\nSo all this strugglin' for what, so I can blow up\nMarry a slut but can't watch my seed grow up?\nFuck that, this the fuckin' thanks I get\nFor tryin' to edutain assholes and feed my bitch\nYo, I feel like my whole life is upside down\n(Upside down)\nCause you seein' more support than I'm seein' my child, it's like\nEveryday I wake up, another drama\nIt's a wonder I'm alive, survivin' this karma\nIf I can hold on to my private life for five minutes longer\nI might get my wife to let go of this knife and just calm her\nWithout these cameras in our faces like animals\nFor your Channel 2 action news to follow our ambulance up the avenue\nAnd catch a glimpse of all the suicide attempts\nAnd what we do in private since they won't let us put up a fence\nAnd you wonder why I carry every gun under the sun\nWhether it's unloaded full or an un-registered one\nNo bullet, you're so full of shit\nThis clip is so full it'll spit if I don't pull it\nAnd don't give me no bullshit I'm not in the mood\nI just got in a feud in some parkin' lot with a dude\nOver Kim and she just slit both of her wrists over the shit\nDon't tell me 'bout the show business shit, I know what this is, bitch\n\n[Hook: Eminem]\nCause you don't know me, I don't know you\nSo don't approach me, I won't approach you\nAnd don't insult me, I won't insult you\nCause you don't know what I will or I won't do\nCause you don't know me, I don't know you\nSo don't approach me, I won't approach you\nAnd don't insult me, I won't insult you\nCause you don't know what I will or I won't do\n\n[Part 2: Xzibit & Eminem]\nThis ain't business, this is personal bitch\nYou don't know Xzibit from shit, new school, class dismissed\nI had a very fucked up day, I'm needin' this fifth\nShuttin' motherfuckers up like they pleadin' the 5th\nYo Em, it's time to get serious with it\n(Yeah)\nTime for everybody to feel it, similar to the egg in the skillet\nThis is your brain on drugs, Xzibit brain on thugs\nAin't no neighborhood that's big enough to bang on us\nAin't no love lost my niggas, relax yo'self\nI'm about to snatch it all and start spreadin' the wealth\nTo my niggas who never seen it I mean it when I holla\nAt the top of my lungs about my guns and my loved ones\nGot, tons of ammo to crack your enamel\nChangin' your channel, you played like a fuckin piano\nRidin' slow through Cali like I'm ridin' a camel\nMillionaire motherfuckers with their brains in their flannels\nI feel like, Tony Soprano, who do I trust now?\nJust hit me on my tele' nigga soon as I touch down\nSpit lines to split spines just to get mine\nBig behind bitches gettin' dick to spit shine\nSniff lines of coke, that's the only shit that make you dope\nBitch-ass nigga that's droppin' the soap\nGet choked out and beat, put your head in a vise-grip\nAnd turn 'til you motherfuckers tell me the right shit\nSo do I gotta buy a whole block to myself\nA front door with twelve locks\nAnd have a bodyguard walk me out to my mailbox\nAnd every time somebody makes a threat, run and tell cops?\nFuck that, I protect myself with these twelve shots\nAnd one in the chamber, gun in the waist\nAnd one in the ankle, waitin' for someone to come to my place\nTryin' to walk up and knock like these cocksuckers are not\nGonna get a shotgun or a Glock shoved in their face?\nAnd it's a disgrace Halie can't play with her toys\nIn the front yard without you drivin' by honkin' your horn\nScreamin' some shit, leanin' out your windows, beepin' 'n' shit\nOr pullin' up in my drive like I won't leap in your whip\nAnd so these kids tell their friends and relatives where I live\nSo my address ends up on the Internet again\nSo then, I do an interview with spin, tellin' them\nThat if someone comes to my crib, I'ma shove a gun in their ribs\nAnd reporters, blow it out of proportion\nOh, now he's pullin' guns on his fans\nJust for tryin to stand on his porch\nAnd I'm the bad guy, cause I don't answer my door like, \"Hey hi\nYou guys wants some autographs? Okay, form a straight line\"\nSometimes I feel like loadin' this rifle\nAnd climbin' the roof at night and hidin' outside to snipe you\nIt's not that I don't like you it's just that when I'm not behind the mic\nI'm a person who's just like you"}], "artist": "Xzibit"}