{"songs": [{"image": "https://images.genius.com/04319a4d486f8b67c0a8c75fda7e49fd.500x500x1.jpg", "album": null, "title": "Bye Bye BPI", "lyrics": "This is addressed to Geoff Taylor of the BPI\nThanks to STB for the beat\nYou're the BPI's VIP and you've picked a fight with TPB\nBut P2P's too deep to preclude, don't you see?\nYou can't stop it\nYou won't stop it\nYou won't block it\nSo find another way to lie and line your own pocket\nMost of us have composed a lot, no profit\n99% of us will never have a pop hit\nIt's not rocket science, so don't knock it\nAnd don't pretend like you're being philanthropic\nTalent isn't rare, it doesn't need protection\nAny claim to the contrary is pure condescension\nA con, deception, the wrong perception\nPropagated by a proper dong, it's evident\nGo to any pub\nIn any town\nIn any county\nAnd count the musicians doing it without need\nFor some rudes in suits, shitting on our scene\nAnd sticking in the boot\nSo you can stop telling me stuff\nPut your money where your mouth is\nAnd take a salary cut\nCause I'll happily put your cash into the hat of a busker\nThe BPI doesn't give a fuck for\n\n[NOW SPEAKING: STEPHEN FRY]\n\nLook, I've studied your justifications of what you seem to think\nThere couldn't be a clearer case of circular reasoning\nYou judge talent by how well they're selling\nBut they're only selling from how well you're selling them\nYou think Adele'd have reached where she was\nWithout the media machine feeding the buzz\nYou say artist should get paid for the work they do\nBut you only care about the ones that bring in revenue\nIf the bottom line is the sign of a good artist\nThe why the need to manipulate the market?\nSo Pro laissez faire you recommend protectionism\nWhere's your decision, on which method it is or isn't?\nThe only way your in today's position\nIs through decades of ripping of plagiarism\nBut now the next generation's risen\nYou're complaining \"Hey, we need to change the system\nThese crazy kids and their disco dancing\nIt isn't legitimate if we haven't cleared the sampling\"\nBut surely sampling is always a bad thing\nNot just when the bank accounts need balancing\nAnd if MC's are paid related to their talent\nHow come I make a fraction of what T-Pain is selling?\nIf I re-made a ballad with sheen aimed at amorous teenagers\nDaniel'd be famous now but it isn't gonna happen\nSo I'll stick to rapping with integrity\nSomething your industry is lacking\n\n[NOW SPEAKING: IMMORTAL TECHNIQUE]\n\nAsk any MC or composer\nPiracy?\nYes Please! It's the only method I know to my VSTs\nNothing is proportionate, the prices are extortionate\nTo lawfully produce, only a portion can afford the stuff\nI'm sure that cutting off connections and dealing bans\nWould leave the music scene desolate, completely bland\nInnovation comes from underground\nWhere there ain't much money round\nSo we resort to lawlessness to make the funny sounds\nAnd then of course all that goes around comes around\nThe majors wander round and plunder from the underground\nSee you need us as much as we need you\nAnd that might not be much depending on your view\nI was once on the tube once and overheard a conversation\nBetween two rec execs planning exploitation\nA singer had passed on\nSo they tacked a crap track onto the back catalogue\nAnd laughed a lot\nI thought: \"I can't believe it, this is a mix up\"\nI'm literally listening to paint a vulgar picture\nThat the BPI can leave a site on the net censored\nIs an incredibly terrible threat to the new tech sector\nNow there's a industry that really needs fighting for\nThey're the future, you're just a wounded dinosaur\n\n[NOW SPEAKING: TOM YORKE]\n\n[NOW SPEAKING: JOSS STONE]\n\nTchaikovsky didn't need the BPI\nStravinsky didn't need the BPI\nVerdi didn't need the BPI\nVivaldi didn't need the BPI\nRossini didn't need the BPI\nDebussy didn't need the BPI\nPuccini didn't need the BPI\nSo why do we need the BPI?\n\nI don't need the BPI\nHomeless busker doesn't need the BPI\nBritish music doesn't need the BPI\nThe future doesn't need the BPI\nYou don't need the BPI\nWe don't need the BPI\nThey don't need the BPI\nThe BPI needs the BPI\nBYE BYE BPI\nBYE BYE BPI\nBYE BYE BPI", "year": "2012-03-04"}], "artist": "Dan Bull"}