{"songs": [{"image": "https://images.genius.com/f31f4a68e496da9b2956bab033443eb6.600x600x1.jpg", "title": "Verge", "album": null, "year": "2016-01-29", "lyrics": "[Hook: Nasty C]\nY'all don't understand\nY'all work on my nerves\nNow come get your mans, before he get hurt\nI'm not with the purge, but I'm on the verge\nI am a perv, I fuck on the verge\n\n[Post-Hook: Nasty C]\nI'm with the paper, I am a nerd\nI get a lil' bit of bitch, what I think she deserves\nThe tougher a hater, he left in a hearse\nI'm not a fake one, I give you my word\n\n[Verse 1: Nasty C]\nYou know it, you know it\nYou noticed, you know\nMy brother told me if you take a fall for your nigga\nThere can't be no rope\nIf that nigga can't do the same\nThen he can't be your nigga, that can't be your woe\nNow why when I'm getting more money\nYou look at me funny, this can't be no joke\nIf you act, I'll react, man I can't be no hoe\nWe go 50/50 on a bad bitch, I don't do average\nYou got little titties but you nagging\nBetter check on your manners\nTryna get my siblings in the mansion, 'cause family matters\nI been through the bullshit like a passage\nThat just made me a man\nThat just made me a savage\nThat just toughened my balance\nGuess it made me attractive, 'cause I fuck like a rabbit\nI was rapping in all of my classes\nPhony niggas watching through the struggle\nNow you call me tryna link up like you had me\nJust give me this little bit of answer\nWhere was you when I pulled up to shows in a taxi?\nExactly\nWhere the fuck was you when I was dying rushing to the doctors, praying it ain't cancer?\nWhere was you when I was skipping classes struggling with the verses to impress Cassper?\nWhere was you when I was getting bashed by my own dad talking about a masters?\nI put everything on the line nigga even Sam\nI a'int kissing asses\n\n[Hook: Nasty C]\nY'all don't understand\nY'all work on my nerves\nNow come get your mans, before he get hurt\nI'm not with the purge, but I'm on the verge\nI am a perv, I fuck on the verge\n\n[Post-Hook: Nasty C]\nI'm with the paper, I am a nerd\nI get a lil' bit of bitch, what I think she deserves\nThe tougher a hater, he left in a hearse\nI'm not a fake one, I give you my word\n\n[Outro: Tellaman]\nI'm on the verge, I pray I take over\nThe shoulder got cold, but my drink colder"}], "artist": "Nasty C"}