{"songs": [{"lyrics": "[Intro: Jay-Z]\nYoung Hov in the house, it's so necessary\nGreen Lantern in the house, so necessary\nWhy you fronting on me? Is that necessary?\nYou know you've become a star\nBecause you're the biggest target out there, right?\nWhen everyone's on the court, they're coming for you\nWhen the opposing player walks into that arena\nThey're thinkin of upstaging you\nYou're, you're like a trophy to them\nThey're thinkin' \"if I'm better than this guy\nThe spotlight turns on me\"\nSo, you know you're a superstar because you're a marked man\nAnd everyone's coming for you\n\n[Run DMC sample]\nThe, the, the king\nThey wanna be the, the, the king\nThey wanna be the, the, the king\nThey wanna be the, the, the king (king)\n\n[Verse 1: Jay-Z (Chris Martin)]\nInspired by Basquiat, my chariot's on fire\nEverybody took shots, hit my body up, I'm tired\nBuild me up to break me down to build me up again\nThey like \"Hov', we need you back so we can kill your ass again\"\nHov got flow though he's no Big and Pac, but he's close\nHow I'm 'posed to win? They got me fighting ghosts\nMost kings (... get their heads cut off)\nWith the same sword they knight you they gon' good night you with\nShit, that's only half if they like you\nThat ain't even the half what they might do\nDon't believe me, ask Michael\nSee Martin, see Malcolm\nSee Biggie, see Pac, see success and its outcome\nSee Jesus, see Judas\nSee Caesar, see Brutus\nSee success is like suicide\nSuicide, it's a suicide\nWhen you succeed, prepare to be crucified, uhh\nMedia meddles, niggas sue you, you settle\nEvery step you take, they remind you you ghetto\nSo it's tough being Bobby Brown\nTo be Bobby then, you gotta be Bobby now\nNow the question is, \"Is to have had and lost\nBetter than not having at all?\"\nBecause dawg\n\n[Chorus: Chris Martin & Run DMC sample]\nMost kings get their heads cut off\nKeep on climbing 'til you reach the top\nKeep on coming if they ready or not\nMost kings get their heads cut off\nThe, the, the king\nThey wanna be the, the, the king\nThey wanna be\n\n[Verse 2: Jay-Z]\nUhh, everybody wanna be the king then shots ring\nYou laying on your balcony with holes in your dream\nOr you Malcolm X'd out, get distracted by screams\nEverybody get your hand off my jeans\nEverybody look at you strange, say you changed\nLike you work that hard to stay the same, uhh\nGame stays the same, the name changes\nSo it's best for those to not overdose on being famous\nMost kings get driven so insane\nThat they try to hit the same vein that Kurt Cobain did\nSo dangerous, so no strangers\nInvited to the inner sanctum of your chambers\nLoad chambers, the enemy's approaching\nSo raise your draw bridge and drown 'em in the moat\nThen, spirit I'm evoking\nThere's kings who've been awoken\nFrom shots from those who was most close to them\nThey won't stop until you ghost to 'em\nBut real kings don't die\nThey become martyrs, let's toast to 'em\nKing Arthur, put a robe to him\nLike James Brown, no the show ain't over\nUntil Rome's ruined\n'Til the republic is overthrown\n'Til my loyal subjects is over Hov'\nLong live the king, no, the reign won't stop\nThey want my head on the chopping block\nI won't die, nah\n\n[Chorus: Chris Martin, Jay-Z & Run DMC sample]\nMost kings get their heads cut off\nKeep on climbing 'til you reach the top\nKeep on coming if they ready or not\nMost kings get their heads cut off\nKeep on coming if they ready or not\nLong live the king, know the reign won't stop\nThe, the, the king\nThey wanna be the, the, the king\nThey wanna be\nLong live the, the, the king\nThey wanna be the, the, the king\nThey wanna be\nMost kings get their heads cut off\nKeep on climbing 'til you reach the top\nKeep on coming if they ready or not", "title": "Most Kingz", "image": "https://images.genius.com/df289bcd68021310706098f4e10a030d.500x500x1.jpg", "year": "2010-08-31", "album": "Invasion Radio 2k10"}], "artist": "JAY-Z"}