{"songs": [{"image": "https://images.genius.com/a0a2dba499c26beced5d3cccef79acd0.480x482x1.jpg", "title": "Problems", "album": "Bad Hair", "year": "2016-09-23", "lyrics": "[Hook:Nasty_C]\nNigga I got problems\nWhat you think I'm smoking for?\nWhat you think I'm smoking for?\nI've been quite for a while now\nThink I should be open more\nThink I should be open more\nYou don't know how I've been over timing\nIt's kind of hard to maintain sober minded\nWhat you think I'm smoking for?\n\n[Verse 1: Erick Rush]\nShe just gave me a banger and some headphones and I can reach forever\nI know my teachers probably never thought I would be this clever\nJust another freedom lover\nThe industry will play you get you hair get you a bed but then forget to leave some covers that's cold\nSee I was just a little rascal\nWatching BET videos like man that's cool\nI swear I had a million dollar plan that June\n'97 in summer I let my pants hang loose\nNow I'm feeling like I got my Juice Back\nIt was a climb from the bottom I'm just glad I got my View back\nAnd some haters I told them 'Voetsek'\nI ain't got time for your bullshit\nTrying to record a winner so badly I'm about to lose it\nSurrounded by these beats I'm just glad I ain't got no bruises\nBut I got problems, who got a doobie??\n\n[Hook:Nasty_C]\nNigga I got problems\nWhat you think I'm smoking for?\nWhat you think I'm smoking for?\nI've been quite for a while now\nThink I should be open more\nThink I should be open more\nYou don't know how I've been over timing\nIt's kind of hard to maintain sober minded\nWhat you think I'm smoking for?\n\n[Verse 2: Nasty_C]\nTo see the bullshit on my back drop\nCause, nobody know me when the track stops\nBitches wanna see the champagne or the strap pop\n'Cause a bursted condom is a jackpot\n99 problems, 99 Jerks\nQuiet niggas normally smoke the loudest\nI bet I treat your woman like she's mine\nHit the loud like once a month and leave my conscious spotless\nProblems, pressure cause if I up and left I'd leave a lot of niggas stressing probably jobless\nYes sir, I took that private jet to fly back home and fill my nest up\nI'm walking in a straight line and shaking these haters off me\nNiggas that put their word on the cross and they double cross me\nBitches that hate the gentlemen answers my poppa taught me\nAnd that's problems on problems on problems\n\n[Hook:Nasty_C]\nI got problems\nWhat you think I'm smoking for?\nWhat you think I'm smoking for?\nI've been quite for a while now\nThink I should be open more\nThink I should be open more\nYou don't know how I've been over timing\nIt's kind of hard to maintain sober minded\nWhat you think I'm smoking for?"}], "artist": "Nasty C"}