{"songs": [{"year": null, "album": "Enigma", "image": "https://images.genius.com/482eea61300bdf72a62b443973fd7a5c.1000x1000x1.jpg", "title": "Dangerous Ground (feat. 50 Grand)", "lyrics": "[Keith Murray]\nYo, you think them niggas out there impress me?\nDon't none of that shit impress me\nOh, I'm supposed to listen cause they on the radio?\nPsssh, I'm ready\n\nI got, nuttin to lose in the world to gain\nI leave you slain and make your family relocate and change their names\nLike the West coast say, I'm bout the ?macolay?\nNiggas be slippin when I be flippin and I'll see you next trip\nCause revenge is a motherfucker payback is a bitch\nEspecially when I'm coin with that Def Squad click\nCan you relate to an intense, motherfucker\nGridiron mic cuffer, terror to the jugular\nSmother all the others, punk motherfuckers\nBut I'ma keep it real, cause me and you is brothers\nIt'll happen so fast boy you won't stand a chance\nCause the L.O.D. put in work like red ants\nAnd when I walk by Curtis Mayfield'll draft\nAnd spell the full limp love is just like Shaft\nShit I craft, is harder than Chinese math\nPlus I lay you down for standing on Dangerous Ground\n\nChorus: Keith Murray, 50 Grand (with variations)\nAiyyo you're standing on Dangerous Ground, too close to the crown\nLet's see if you know the bounds\nI said you're standing on Dangerous Ground, too close to the crown\nLet's see if you know the bounds\nAiyyo y'all standing on Dangerous Ground, too close to the crown\nLet's see if you know the bounds\nYo kid you standing on Dangerous Ground, too close to the crown\nLet's see if you know the bounds\n\n[Keith Murray]\nLet's embark on this mission like Black Indiana Jones\nIs eatin Pookie sandwiches and smokin chronic bones\nSee I kill it a little, then leave it alone\nLet my man 50 G drag it into his zone\n\n[50 Grand]\nNow 50 Grand's in the room and Legion of Doom\nAnd if you sayin Def Squad's the bomb then I'll assume\nIt's takes brain splittin compositions, makin incisions\nDranin the blood up out silly niggas, like morticians\n\n[Keith Murray]\nNow I'ma mack out and pimp the rhythm like Too $hort and Dru Down\nAnd wait for what go around to come around\nAnd beat it in the head with this, send em off into the unknown\nIn and out of conciousness, kind of like\nA hip-hop microphone hypnotic\nSpecialist in gettin inside artists, sick word analyst\nWorld's most foul freestylist\nC'mon man y'all niggas know y'all can't get with this\n\nChorus\n\n[Keith Murray]\nAnd kill the noise playboys cause we have no flaws\nWe employ hits the whole family can enjoy\nI'll be masterin the Funk like Flex, mentally\nEtchin and Sketchin, speakin with my hands like Terminator X and\nScheme and get choked out like Radio Raheem\nMy team'll put you to sleep and let you dream\nI'm not down with the East West coast controversy\nMe say you you say me, across the country makin millis\nI'll be glad to see a brother get paid for hard work\nBut instead y'all steady tryin to ditch up the dirt\n\n[50 Grand]\nYeah niggas still tryin to toss salt in the game\nAnd y'all done read my name graffitied in the walls of fame\nLet me explain niggas die for fame in this game my name's\nLike a migraine, rappers get banged out the frame\nSee some funny style niggas in the house tonight\nWith posses too thin to win, and too light to fight\nThink twice\n\nChorus\n\n[Keith Murray]\nI had the last watch and y'all niggas on the corner pumpin gas\nNervous like you lyin to a polygraph\n\n[50 Grand]\nCome see a real show, cut off your flow, killin you slow\nOne time for L.O., I'm like a thief, in your window\n\n[Keith Murray]\nOr catch us in the streets, herdin like cattle\nDefeatin rappers without contracts and battles, swingin like Mickey Mantle\n\n[50 Grand]\nNiggas trippin like they wanna be me\nChallenge Def Squad, L.O.D. you livin Dangerously"}], "artist": "Keith Murray"}