{"artist": "360", "songs": [{"album": "Falling & Flying", "year": "2010-12-17", "title": "Just Got Started", "image": "https://images.genius.com/d8cf9deb03602ff2cf25cf1e09bef05b.600x600x1.jpg", "lyrics": "[Intro: 360]\nUh, yeah\n\n[Pre-Verse: 360]\nI feel 'em, I feel 'em, they trying to slow us down\nWe hear 'em, we hear 'em, but see we don't know how\n\n[Verse 1: 360]\nNow I'm seeing what I need to be\nRunning on through with a need for speed\nOne of the few with something to prove\nAnd nothing to lose, so leave us be\nIf you feel like there's nothing to live for\nHonestly, why the fuck would you live for?\nThat's the reason I give it all\nBut still feel the need to give a little more\nUh, now I feel like there's nothing more to say\nUh, I understand what I'm in it for\nI know I could run this all the way\nI won't get another chance if I miss it all\nSee if could have a crystal ball, I wouldn't\n'Cause I like it when there's risk involved\nIt's the stuff, lights so rare\nIt's too fast, I don't care\n\n[Hook: 360]\nI know we just got started, baby, I don't care, woah\nI know we just got started, baby, I don't care, woah, oh\n\n[Pre-Verse: Pez]\nI feel 'em, I feel 'em, they trying to slow us down\nWe hear 'em, we hear em but see we don't know how\n\n[Verse 2: Pez]\nSee, we all need an outlet\nBut it seems it's a dream that most people ain't found yet\nI knew it was out there, somehow from the outset\nBut believe me, it ain't easy picking a different route\nIt took a bit of living to figure out\nMost keep on fitting in with the crowd\nI don't fight it, there's no time to slow ride it\nIt'll all go by you, shit, life is too short to cruise forth\nGotta keep improving and move forward\nLet the rest all happen in due course\nDown there, I've been there before, don't want to be anymore\nSo hold steady while I walk this tightrope\nI know I might fall but I don't care\n\n[Hook: 360]\nI know we just got started, baby I don't care... woah oh oh oh\nI know we just got started, baby I don't care... woah ooh\nWoah... oh oh!\nWoah... oh oh!\nWoah... oh oh!\nWoah... oh oh!\nI know we just got started, baby I don't care... woah oo oh oh!\nI know we just got started, baby I don't care... woah oo oh oh!\nI know we just got started, baby I don't care... woah oo oh oh!\nI know we just got started, baby I don't care... woah oo oh oh!\nI know we just got started, baby I don't care... woah oo oh oh!"}]}