{"songs": [{"year": "2018-07-17", "album": "Pure Intentions", "image": "https://images.genius.com/2619374aaf74e820050eff994da86264.1000x1000x1.jpg", "title": "Fool", "lyrics": "[Intro]\nAyy, whats your problem nigga?\n\n[Hook: Curt Chambers]\nYou gon' make me act a fool now\nYou don't want me to lose my cool now\nI've been doin' just fine for a few now\nTill you came along and fucked up all my mood now\nIt ain't sunny when it rains (sunny when it rains)\nSo don't let me shine on yo' ass again\n\n[Verse 1: K.A.A.N.]\nI was doin' just fine before you entered in (before you entered)\nIt's like you searchin' for weakness, tryin' to find your center here (find your center here)\nSanctuary for insanity my nigga yah (my nigga yah)\nLookin' for reactions you just tryna get the trigger pulled (blow)\nCock back like what you say, oh no there's no debate\nSee clouds belong outside, not in your inner state\nIt's like you fiend to have a camera flashing in your face\nIt's 'cause you always got some fuckin' stupid shit to say (fuck outta here man)\n\n[Hook: Curt Chambers]\nYou gon' make me act a fool now\nYou don't want me to lose my cool now\nI've been doin' just fine for a few now\nTill you came along and fucked up all my mood now\nIt ain't sunny when it rains (sunny when it rains)\nSo don't let me shine on yo' ass again\n\n[Verse 2: K.A.A.N.]\nIn all reality nigga, I give a fuck if you go\nRep return a repo, or give it all to a ho\nActin' outta pocket like she 'bout to call an audible though\nThen turn around and go give that bitch some more, no\nAnd it don't bother me that your life's a quote\nBut wanna down-talk niggas like what you doin' is dope\nCondescending mothafuckas get they lip busted\nAnd they can't be trusted, so its mothafuck 'em\nYah, this ain't our first go-round, nah we seen it all before\nYou the type of nigga to undercut your mom to get all the gold\nTryna be the star of the show, but your 15 minutes on a layaway though\nYou ain't gonna get what the fuck you want\nWhats the point of all this dumb shit though?\nFuckin' dumb-ass\n\n[Hook: Curt Chambers & K.A.A.N.]\nYou gon' make me act a fool now\nFuckin' niggas, ha ha ha ha\nYou don't want me to lose my cool now\nYou was doin' better just sittin' there lookin' stupid\nI've been doin' just fine for a few now\nOl' Ashton Kutcher \"Dude, Where's My Car?\" bitch ass\nTill you came along and fucked up all my mood now\nOK now I'm mad, shit!\nIt ain't sunny when it rains (sunny when it rains)\nSo don't let me shine on yo' ass again\nIt ain't sunny when it rains (sunny when it rains)\nSo don't let me shine on yo' ass again"}], "artist": "K.A.A.N."}