{"artist": "6ix9ine", "songs": [{"year": "2018-01-24", "title": "SHINIGAMI PT. 2", "album": "SCÜM.WØRLD.ØRDER", "lyrics": "[Intro: 6ix9ine]\nScum Gang!\nBoy, fuck you thought? My squad go crazy\nTry and put us in cages, can't contain us\nMy block go crazy, my block go crazy\n6ix9ine the squad, and that's on my mom\nMan, that's on my baby\n6ix9ine the squad, man, that's on my mom\nMan, that's on my baby (Squad!)\n\n[Verse 1: 6ix9ine]\nPop out on these silly niggas\nPop up, like a wheelie nigga\nLine up, it's fifty niggas\nWhen we line up, we gon' kill them niggas\nSplit your face like a Philly, nigga\nReal shit, I ain't feelin' niggas\nHustle all, no-chill a nigga\nOff the leash, like \"get them niggas\"\nWish a nigga would try to run up on me\nWish a nigga would try run up on Kahee\nWish a nigga would try run up on Squamane\nStop it, keep a .380 in my pocket, cock it\n\n[Verse 2: Daze]\nY'all know Tekashi but my name is Daze\nI do no talking, I just let it spray\nWe're the real niggas, y'all niggas frauds\nBustin' off, no talk nigga\nWish a nigga run up on 'Kashi\nPut the 380 to his noggin, pop him, drop him\nMoe grab your drink, we gon' pour the shit up\nCranberry Sprite might fuck with the crunch\n'Cause Daze gettin' high and be counting these bucks\nYou broke niggas need to shut the fuck up\nWith your broke ass, get your luck up\nWith your broke ass, get your luck up\n\n[Verse 3: 6ix9ine & Daze]\nBoy fuck you thought? Nigga my hands don't talk\nNigga my bite don't bark\nFuck you thought? Nigga you ain't no star\nYou slide up, get lock-jawed\nI paid for the Glock, I came to the block\nGunshot, gunshot, one time, one time\nI paid for the rocks, I stuffed to the socks\nOne sale, one sale, top notch, top notch\nI run up on nigga, go ape on a nigga\nNo face, no case, no trace on a nigga\nBlack switchblade to the face of a nigga\nNever ever will I catch a fade from a nigga\n\n[Outro: 6ix9ine]\nTEKA$HI69 from that SCUM fucking squad\nFuck your bitch and fuck the law\nRide my squad, fuck 'em all, squad", "image": "https://images.genius.com/baed5fb10c9b9b4670b048a673baeec6.1000x1000x1.jpg"}]}