{"songs": [{"year": "2010-09-14", "album": "Overly Dedicated", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg", "title": "Barbed Wire", "lyrics": "[Intro: Kendrick Lamar]\nOne time\nReporting live\nCompton, California\n\n[Verse 1: Kendrick Lamar]\nHave you ever felt like, like you never get life?\nLike you never did right, sort of like a black sheep?\nBack down, backing out your dreams like some bad sleep\nChasing for the wind but you never win the track meet\nOh, what a cold world for a broke nigga, it's bitter\nAnd life's a bitch, don't hit women, so I bit her\nI struck enough pain let her know I wasn't playing\nI was so sincere like Nas first name, in Belly\nThey tell me, it's very difficult to see 25\nAnd if I survive it's probably with a celly\nMy opportunities are low because my brown complexion floats\nIn the ghetto rather in some heels like Giuseppe's\nThey want me unemployed, until I hit the streets\nFulfilling voids of broke D-Boys selling weed\nFucking up my prestige, 'til I live with the blues\nBB King or the neighbors of Snoop, that's why I'm\n\n[Chorus 1: Kendrick Lamar, Ash Riser & Alori Joh]\nIn the club like fuck it, though\nThey say it's only one life, life, life\nAnd if you say I can't live comfortable\nI'ma tell you that's a lie, lie, lie\nSo while I hold this bottle of Ciroc with a hand full of ass\nCelebrate the very day that I get past\nThrough the barbed wire\nWe are, we are (fine)\nWe are, we are (true)\nThrough the, through barbed (wires)\nWe will, will break (through)\nSo while I hold this bottle of Ciroc with a hand full of ass\nCelebrate the very day that I get past\nThrough the barbed wire\n\n[Verse 2: Kendrick Lamar]\nHave you ever felt like, like you never get life?\nLike you never did right, sort of like a black sheep?\nTryna get away from the world's stereotype\nBarbed wire got a barricade on your destiny, she desperately\nIn need of some inspiration, see what the people saying\nShe gon have a baby then flee from her education\nAt the age of 16, credit card scam schemes\nSee a scar on her eye, boyfriend brutality\nShe'll never get by, no how, no way\nWelfare recipient, property of the state\nHousing, Section 8, corner store prostitute\nThe owner bout to prosecute, the niggas tell her that she's cute\nHoodrat trashy, six baby daddies\nAnd this baby daddy is new to the family\nChilling in pajamis, waiting on the first\nFast forward spilling drinks on her fur, that's why she\n\n[Chorus 2: Kendrick Lamar, Ash Riser & Alori Joh]\nIn the club like fuck it, though\nThey say it's only one life, life, life\nAnd if you say she can't live comfortable\nShe gon' tell you that's a lie, lie, lie\nSo while she up in VIP pouring Merlot in the glass\nCelebrate the very day that she get past\nThrough the barbed wire\nWe are, we are (fine)\nWe are, we are (true)\nThrough the, through barbed (wires)\nWe will, will break (through)\nSo while she up in VIP pouring Merlot in the glass\nCelebrate the very day that she get past\nThrough the barbed wire\n\n[Verse 3: Kendrick Lamar]\nHave you ever felt like, you finally got life\nYou finally got right? No longer a black sheep\nLiving off ya dreams like Christina uh-Milian\nIn the front seat of a convertible eloping to get married\nWhat a feeling of overcoming the odds\nIt's like we just hit the lottery, my God\nThere must be a God, cause golly\nYou done made it through the fight while squabbling Ali\nNow ya lifestyle's looking up and you escaped the crooked cuffs\nAnd you ain't have to kill a nigga just to make a couple bucks\nAnd she ain't have to go and fuck on everybody for a dollar\nMaking good decisions, got a independent business-mind\nAnd both of y’all are steady grindin', doing it the legal way\nJust tryna make a decent pay on every second of the day\nBut they won't give you the credit, disses out they mouth\nYou must have joined the Illuminati just to ball out\n\n[Chorus 3: Kendrick Lamar, Ash Riser & Alori Joh]\nIn the club like fuck it, though\nThey say it's only one life, life, life\nAnd if you say they can't live comfortable\nThey gone tell you that's a lie, lie, lie\nSo even if you overcame doubt and ya living ain't bad\nKnow it's a barbed wire that's always in your path\nThrough the barbed wire (just laugh)\nThen everybody say...\n'Cause I won't get caught again\nAnd I'm here to stop the trends\nYou can catch me if you try\nDisappear into the night\nAnd I'm gone\n\n[Outro: Alori Joh & Kendrick Lamar]\nSo you made it past all the barbed wires?\nThere's one more left *Gunshot*"}], "artist": "Kendrick Lamar"}