{"artist": "WC", "songs": [{"year": "1997-10-07", "lyrics": "[Dat Nigga Daz]\nYeah, call up my gangbangin ass homeboys\nTray Deee, CJ Mac, and WC\nWhat's happening nigga?\n\n[CJ Mac]\nOne time...\nOn this, Long Beach historic collaboration\nDub-C, Tray Deee, Daz, and CJ Mac\nReal riders... real riders, do real things\nReal riders, do real things\nHa ha, yeah, thought you knew\n\nShe sells, sea shells, by the seashore\nIt's time to she s-h-ome mo', skanless\nSee me in the Benny posted up sippin Remi\nAll you see is riders round me every time you bustas see me\nBarrio, Rolando, five plus one\nNumero, never dos, saggin five-oh-ones\nGangbanger fuck that (westside!) take the cash flo'\nPeace treaty what? Save the drag low\nMy enemies be slidin through here, fuckin with these bitches\nThat I be callin my little sisters\nGet your dick sucked, cost that ass half a bird\nFuckin with them hista-bitches get that ass served\nTie them up, holla me up, do this all the time\nDon't say shit, or watch that ass catch a nine (pow...)\nReal riders do shit that real riders do\nLong Beach and South Cen-tral, for real crimin fool\n\nChorus: repeat 2X\n\n[WC] Ollie ollie all on G!\n[Daz] Get a pistol whippin if that ass start trippin (Oooh-ooh!)\n[WC] Ollie ollie all on G!\n[Daz] Survival of the fittest and it's up to us to get it\n\n[Tray Deee]\nIt ain't no pity in my city told you once befo'\nThink you're pretty come here kitty get your lumps for sho'\nGet your guns ready jump if you Gump steady bump\nCause ain't none here be punks what we hump Chevy trucks\nPenny chumps get they bluff called, swift\nPig bow down to dust all quick\nEvery bitch get her kicks off the deez and switch\nAin't no guessin who the next you spend the evenin with\nThis the life niggas like, killin fights and violence\nBreakin in the days from fillin nights with sirens\nSmilin only when I hear the enemy passed on\nAnd blast on the last known nigga to act wrong\nBeen sane insane since named surface\nDoin what it take, motherfuck if it's worth it\nThe turf come first (westside!) all the rest is secondary\nMost other niggas killers only if it's necessary\nDaz know they ass can't fade it (straight up)\nLong Beach to SC, stayin Gang Related\n\nChorus\n\n[WC]\nKill-a-forn-ia, home of the color bandanas\nWhere niggas are known for set trippin gettin' they bang on for a livin'\nAK-47, Chuck Taylors and K-Cutters\nGettin on my sag on, blast on, as I mash on you busters\nRollin in my Coupe Do' with the dura-clip\nFull of niggas with jheri curls, perms, and a toothpicks\nFuck a rap record, I run with niggas with jail records\nTats on they necks, blue brownies and hairnets\nTwo-strike victims, niggas with full counts\nNo smiles, quick to knock your bitch-ass out\nCaught in these Westside activities, drivebys and casualties\nLord please forgive me for this gangbang mentality\nBut I was raised by a crew of straight killer's niggas\nPulin triggers on trenches and knick kickers\nNo studio gangsters just niggas affiliated\nDub-C, Tray Deee, and C Mac, gang related\n\nChorus 2X", "image": "https://images.genius.com/7893982cf65937e95b38b8d431dcf885.500x499x1.jpg", "album": "Gang Related - The Soundtrack ", "title": "Gang Related"}]}