{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Style 1: Old-School Rap]\nI straight rock to the rhythm, got the audience clappin'\nGonna utilize 27 styles of rappin'\nOther people may have tried a video like this\nBut you know my shit is phatter and they all gettin' dissed\nOh yes, yes, y'all, I'm too fresh, y'all\nKate Upton got some nice breasts y'all\nBut if she ain't got a booty, she ain't get in my jeans\nShe need to do squats and eat some macaroni and cheese\n\n[Style 2: Boom Bap]\nEast New York from the Boogie Town, Bronx where the criminals hang\nWe pushin' fat whips and criminal slang\nTriple fat goose jackets, Timb boots, and black beepers\nMy style is deadly, you could call me the rap reaper\n\n[Style 3: G-Funk]\nMan, I'm from Cali, I ain't givin' a fuck\nI got a 40-oz. of O, straight gettin' drunk\nYou know I'm hanging at the Marriott with a few bitches\nDrive away in my 64, hittin' my switches\nI'm saying oh, girl\nI'm a motherfuckin' gangster\nAnd when you give me pussy, I'm gonna say thank ya'\nCause I appreciate it\n\n[Style 4: Hyphy Movement]\nThe hyphy movement was so fucking incredible\nWe got the ecstasy, we thizz, right on, fuck a schedule\nI'm in the cut, I'm getting hyphy-hyphy-hyphy-hyphy\nCan you understand me? That's unlikely-likely-likely-likely\nWe go dumb, all the big bottles\nAnd tropical K's throwin' gang signs where we from\nI got the molly, get a quick taste\nPut Mac Dre on the five dollar bill doing the thizz face\n\n[Style 5: Crunk]\nMan, this is the Crunk style, okay\nYou gotta sound tough, no matter what you say!\nWhat?\nI think kittens are cute!\nI think puppies are cute!\nKoala bears are cute!\nI like sloths, panda bears too\nI'm a gangster, like Ryan's toy review!\nYeah\n\n[Style 6: Bay Area/Mobb Music]\nI'm from the city and you know it's the town\nTen toes to the turf, put my foes on the ground\nTake a whiff of black and mild, this that thug car smell\nWe moving weight up out the trunk like a drug cartel\n\n[Style 7: Old Kanye]\nI'm not good in my impression of Kanye\nI bought my girl a Louis Vuitton latté\nMaster Ceremonies, MC's, I'm sorry\nYou a master of none like Aziz Ansari\n\n[Style 8: New Kanye]\nMan, I've been crazy\nEver since my girl made a tape with Ray J\nCause Ray J my favorite actor\nAnd I wanna make Part 2 with him, I have to\nThen I wanna make Part 3\nFeaturin' me, having sex with me\nDance, in leather pants\nVote Donald Trump\n\n[Style 9: Jay-Z]\n(Young, Young, uh)\nYoung Mac in the place to be, be\nGot Cristal bottles, two hundred dollar, P\nMa, you look like Janet\nDiamonds in my Rolex looking like pomegranates\n\n[Style 10: The Neptunes]\nI sing outta key\nI'm not even close\nI'm so-o-o rich\nI eat avocado toast\n(Now lemme see your titties)\n\n[Style 11: Eminem (on drugs)]\nI used to rap humble, now what I say is cocky\nInsane and stocky, like the goalie from a game of hockey\nYou can hit me in the face to stop me, but my name is Rocky\nI'mma make you promptly learn MMA and go take karate\nYou gon' have to fight me with a hand grenade and a Glock\nTwo cannons, chains and a rock and a bandage taped to your cock\nMy fucking enemies ran away, didn't watch\nWhen I cock back the gat, and I blam away like I'm Pac\n\n[Style 12: Rap Rock]\n(Oh yeah, boiiiii)\nAll you gotta do is be white and nasal\nAnd you can be a rap-rock singer on cable\nBlah blah, blah blah blah blah, blah\nMusic like this sucks blah, blah blah blah\n\n[Style 13: U.K. Grime]\nMan, don't give a fuck, competition\nYou know they get killed in the booth\nYou know I gotta grind like a dentist\nAnd now you get drilled in the tooth\nWho the fuck's that man? What a cum sock\nMan look at enemies like they kumquat\nBye boy, you look like you're very built\nRappers from the UK are very skilled\n\n[Style 14: Mumble Rap]\n(English) *slurred gibberish* Skrrt, skrrt, skrrt, bad bitches\n(Translation) In physics, quantum dynamics is the quantum version of classical dynamics. Quantum dynamics deals with the motions, and energy and momentum exchanges of systems whose behavior is governed by the laws of quantum mechanics. Quantum dynamics is relevant for burgeoning fields, such as quantum computing and atomic optics\n\n[Style 15: Miami Trap]\nHuh, I'm a drug dealer that'll creep up on ya\nAll I want is cocaine and three cheese lasagna (Uhh)\nI got a yacht, where I go relax\nI spent a million bucks on some Little Debbie snacks (Boss)\nYou know I almost got indicted, boy\nI hid a key of coke in my pet tiger's, butt (Uhh)\nCountin' cash money, I don't need a visa\nI can't rap, man, I'm hungry, I need a pizza (Uhh)\n\n[Style 16: Reggae]\nNope, I gotta draw the line here, man, I'm not doin' a fuckin' Jamaican accent\nNext\n\n[Style 17: NYC Jazz Rap]\nListen to me while I kick a sick rap flow\nGirls sendin' XO's like its tic-tac-toe\nThe beats are all jazzy and the rhymes all fresh\nThis style was perfected by A Tribe Called Quest\n\n[Style 18: West Coast Underground]\nBut on the West Coast, D-E-L and Hireo\nDid it too, and we rocked the phone, the micro\nTake jazzy underground, hip-hop on vinyl\nDidn't talk about violence, it was more mindful\n\n[Style 19: Horrorcore/Juggalo]\nTake a bloody axe and walk through a haunted house\nSmoke a dead body, 'til I get cotton mouth\nEat their motherfuckin' brain and their fuckin' toes\nFamily for life, Juggalo (Woo-Woo)\n\n[Style 20: Houston Slab]\nI'm slammin' Cadillac do's\nSwitchin' lanes, wood grind, ridin' Chevy on vogues\nCandy paint on my dick, man these hoes can't chill\nSouth Texas, motherfucker, we just way too real\n\n[Style 21: Club]\nUh, you know I be in the club\nMe and my thugs got VIP in the club\nI say the same line in the club\n'Cause you know the word club always rhymes with the club, uh\nI love the club, let's go to the club\nI got my girlfriend, my wife, and my hoe at the club\nClub-club, club at the club\nIf the seal don't dance, he gettin' clubbed at the club\n\n[Style 22: Drake]\nOoo, girl, you and me should lie down, oooh\nKiss me on my big ass eyebrows, girl\nI'm so unlucky\nRihanna use a strap-on when she fuck me, oooh\nBecause I-I sing about my mom like she's my girlfriend\nMy mom's my girlfriend, Oedipus\nGirl, don't you start now, oooh\nYou want my heart now, oooh\nYou want some lovin' by I Dutch oven\nPull up the sheets and fart now, oooh\n\n[Style 23: Reggaeton??]\nOk! Yeah, y'all. This Mr. 305. Mami, move that booty if you love particle science, yah\n\n[Style 24: Wu-Tang]\nHey, yo God\nKung-fu death grip, bust your head like a watermelon\nPour the candle wax on a spotted leopard\nFly Adidas Tracksuit\nHundred twenty apple flavored golden pussies\nRockin' with a coat made out of crab legs\n\n[Style 25: Chopped & Screwed]\nGirl, my gold teeth make me cuter than an otter, otter\nI be sippin' cough syrup, syrup like it's water\n\n[Style 26: Memphis Rap]\nSee a thick bitch as she wiggle her ass\nI am a fuckin' bawler man, I'm gonna throw up my cash\nMan, I'm from Memphis, Tennessee, Land of the Players and Pimps\nIt doesn't matter what the beat sound like I'm rappin' like this\n\n[Style 27: Midwest Chopper]\nGod? Are you listening? Please help me stop fucking strippers and make me do an album with Mac Lethal\n(Chea!)\nAnd sippin' fine wine\nIt's time, N9ne, design lines\nTime lines fine\nI climb vines like Einstein\nTakin' a pint of shine\nThey confined, it's rhyme time\nStickin' the chopper flickin' this\nIt's my time and I shine\nI grind behind dimes\nDivide spines, prime rhyme slime\nAnd nine plus nine\nIs eighteen, minus nine\nIs nine and I'm N9ne\nAs long as I'm N9ne\nEverybody knows that I'm fine\n(Cheeeaaaaaaaaaaaaaaaaaa! *cough*)\n\n[Style 28: Dipset (bonus)]\nI'm from Harlem, that means I'm forever the man\nBut what that mean? That means I'm forever the man\nBitches wanna get married, never no chance\nMami just desperate for a ring like Kevin Durant\n\n[Every beat in the song was produced by Michael \"Seven\" Summers.]", "year": "2017-06-09", "album": "YouTube", "title": "27 Styles of Rapping"}], "artist": "Mac Lethal"}