{"artist": "Post Malone", "songs": [{"album": null, "title": "​​rockstar (Remix)", "image": "https://images.genius.com/0b6581862805ae6a2726c87a1e7f4f8e.1000x1000x1.jpg", "lyrics": "[Intro: Nicky Jam, Ozuna & 21 Savage]\nEy, yao'\nNicky Jam\nOzuna (Ozuna)\nPost Malone\nSpanish Remix\nTrapstar\n(Tank God)\n\n[Coro: Nicky Jam]\nHago lo que quiera\nCompro lo que quiera porque soy un rockstar\nVoy pa'l avión privado\nEn el Ferrari, en el tablero \"180\" (180)\nVoy de camino a Suiza\nPa' lanzar mi propio Hublot a la venta\nY voy llamando al Russo\nPorque quiero gastarme un millón en prenda'\n\n[Verso 1: Nicky Jam]\nUna Panamera, un F12 frente a casa (Wuh)\nGucci, Ferragamo, compro todo plaza (Ajá)\nRhino pa' los corta', ratas que te cazan\nMiles de hipócrita' que vienen y te abrazan\nYeh, yeh, vivo la vida como un rey (Rra)\nKilos de música de Medellín a Monterrey (Rey)\nSiempre cruzando todos los límites de la ley (Ley)\nMi movie siempre está en play, yey (Play, yey)\nVivo la vida como un rockstar\nLos que tiraron ya no existen, obvio no están\nTengo brujas que con los palos te acuestan\nCon peine doble llenos que se manifiestan (Wuh)\nDicen que el dinero el alma me consume\nYo sigo celebrando en un jet por las nubes\nNadie me las daba cuando abajo solo estuve\nAhora la cuenta nunca declina, siempre sube\nSiempre sube, siempre sube, siempre (Wuh)\n\n[Coro: Post Malone]\nI've been fuckin' hoes and poppin' pillies\nMan, I feel just like a rockstar (Star; ayy, ayy)\nAll my brothers got that gas\nAnd they always be smokin' like a Rasta (-sta)\nFuckin' with me, call up on a Uzi\nAnd show up, man, name them the shottas (-tas)\nWhen my homies pull up on your block\nThey make that thing go grrra-ta-ta-ta (Ta, pow, pow, pow)\n\n[Verso 2: Ozuna]\n'Tá bien, ustedes son los que más tienen\nVamos pa' los números y verán que son mis nenes\nLo que yo me compro no es pa' frontearle' a ustedes\nEs pa' yo llevarme a su mujer en la Mercedes\nMaybach, G Wagon, la llevo al privado\n30 mil de altura, de camino a Colorado\nLe regalo un AP en oro rosado\nMe dice que le gusta en el avión si se lo hago\nPregúntale a tu patrón que sabe lo que haremo'\nEn P.R. calentón, en R.D. reclamón y conectao' en el Bronx, eh, eh\nPregúntale a tu patrón que sabe lo que haremo'\nEn P.R. calentón, en R.D. reclamón y conectao' en el Bronx, eh, eh\nYo soy una estrella, to'as las babys a mí me quieren, me reclaman\n200 el Richard Miller, pero más cabrón que la casa está salda\nYo no tengo enemigo', tampoco amigo', a to' los trato por igual\nQue canto pa' las babys no significa que no te la puedas buscar\n\n[Coro: Post Malone]\nI've been fuckin' hoes and poppin' pillies\nMan, I feel just like a rockstar (Star; ayy, ayy)\nAll my brothers got that gas\nAnd they always be smokin' like a Rasta (-sta)\nFuckin' with me, call up on a Uzi\nAnd show up, man, name them the shottas (-tas)\nWhen my homies pull up on your block\nThey make that thing go grrra-ta-ta-ta (Ta, grrra-ta-ta-ta-ta)\n\n[Outro: Post Malone]\nStar, star, rockstar, rockstar, star\nRockstar\nRockstar, feel just like a rock...\nRockstar\nRockstar\nRockstar\nFeel just like a-", "year": "2017-12-15"}]}