{"songs": [{"title": "Better Dayz", "album": null, "year": "2015-05-03", "image": "https://images.rapgenius.com/c8ed5fc66a7a8a42c527f46d59364e79.950x929x1.jpg", "lyrics": "Produced by C-Sick\n\n[Verse 1: Lil Bibby]\nThey say I'm from a place where niggas don't make it out\nBest thing to do is get your cake and bounce\nWord around town, bucks made it now\nBut I'mma go hard til they take me out\nAnd I'm ridin' with them goons cause the goons gone shoot\nThink White Shawn  don't want a new coupe\nIf a nigga was a threat then that boy'll be through\nTwenty on his head, what the fuck he gone do?\nI ain't duckin' no action, I ain't just rappin'\nYoung niggas clapping, we can make it happen\nLearned mathematics, from fucking with crack addicts\nWas gone for a minute now a nigga back at it\nI kill for the dough, still kick it though\nStill got smoke and it's still for the low\nIn the field with the shit, I'm still with the shit\nNiggas know Bibby, I'm as real as it get\n\n[Interlude]\nHold up\n(Bibby what's up bro?)\nNiggas round here talk crazy bout what they'll do to a motherfucker\n(Like what?)\nYou think I'm worried about a nigga man?\nWe got more choppers (check), more lawyers (yup), and I'll die bout my shit\n\n[Verse 2: Lil Herb]\nI'm from a city where they forever hate\nYoung nigga wanna see better days\nLotta nights I coulda seen Heaven gates\nGod stay with me but I never pray\nI keep my gun on me, I ain't never safe\nAnd I'mma let it spray naw I won't hesitate\nEating meals with the steel cause it's real in the field\nBitch it's kill or be killed, I don't live a better way\nWithout a doubt I go hard for my niggas\nRoc Block, Kobe Squad them my niggas\nAnd yea I got an open heart for my niggas\nStill gotta keep a Glock for my niggas\nCan't stop em once you startup my niggas\nGettin' money, fuckin' starts with my niggas\nThey ain't tryna play the part of my niggas\nThen I might have to depart from my niggas\n\n[Interlude]\nLook it's like what's best for everybody else ain't always whats best for you my man. Can't hand feed no sharks nigga. Still Never Leave My Brothers though\n\n[Verse 3: Lil Bibby + Lil Herb]\nYoung nigga so sick, need a check up\nOn the road, Bibby tryna run a check up\nGettin' money, all these hoes wanna sex us\nNigga out of town, still throwin' sets up\nUse your head 'fore I leave it on the curb\nThis real talk, this is not just some words\nNiggas sneak dissin'? Man that nigga got nerves\nHad to call to the city, check up on my nigga Herb like\nWhat up bucks? I'm ridin' over east with it on me\nI still gotta look to my left and my right\nNiggas want me to sleep by my lonely\nI'm riding and smoking and thinking\nI'm only 19 but I feel like a grown-up\nAye Lil Bibby look at the mess that we madeAll these other MCs tryna clone us\nAin't that a bitch\nIn my face, on my dick\nBig face on my wrist shit be makin' 'em sick\nStart hatin' and shit\nMan I think they just wanna see a nigga trip\nThen I had a thought right when I was bout to flip\nGotta calm down, let me hit my nigga TIP like"}], "artist": "Lil Bibby"}