{"artist": "Wiz Khalifa", "songs": [{"year": "2016-08-04", "lyrics": "[Verse 1]\nSee I be gettin' to it, gettin' to it\nCome to these broads I be stickin' movin'\nDon't ever talk it, if I didn't do it\nI'm ridin' round, bumpin' on some new shit\nLooking for a bad broad to cruise with\nCome and kick it with a winner\nNo, we never losin'\nI'm a call some of my dawgs, call them girls you cool with\nI ain't nothing like them niggas cause they all illusion\nI'mma roll some of this weed put my car in motion\nNow we roller coastin'\nTell me I'm the one you need\nWell, that ain't hard to believe\nHit this chronic then we leave\nBy now you probably wonderin what tricks I got up my sleeve\nCause tell me how you want it tho\nAnd I'll slow down the speed\nI open up the roof and drop the top you feel the breeze\nYeah I'm young and successful\nBut I made it out the streets\nI'm throwin all my funds\nAnd make it back in a week\nYou need to roll with me\nYou the baddest, to say the least\n\n[Hook]\nShorty, whats good?\nIf you down, we can ride out to the hood\nI'm tryna meet her, when you meet me like I should\nWe got you on, so you meet us   understood, it's understood\nIt's all good! I'm tryna leave with the baddest one in there\nTop down riding round through the city blowin loud while we screamin\nI'm tryna leave with the baddest one in there\nTop down riding round through the city blowin loud\n\n[Verse 2]\nMajor player, major paper\nYou with a money maker\nTell them lames you gon' call them later\nI'm just tryn get you higher then a skyscraper\nTake you out get you flyer than a pilot, babe\nI ain't running game no this ain't the same\nI'm tryn put you in position to do bigger thangs\nEverything in your name\nLet your homegirls hate\nNiggas try, but they ain't gettin in a way\nI've been workin all day, now I'm dressed, tryn make a play\nWonderin if she leave here or she gon' stay\nI'ma let you push the whip, to the crib, while I twist\nSay you stoned so Im gon' take this one to the face\nNiggas tryn win the race, I'm just tryn get you laced\nTake her right up to my place\nBring the bottles by the case\nRoll the chronic, have a taste\nI ain't got no time to waste\n\n[Hook 2]\nShorty, whats good?\nIf you down, we can ride out to the hood\nI'm tryna meet her, when you meet me like I should\nWe got you on, so you meet us   understood, it's understood\nIt's all good! I'm tryna leave with the baddest one in there\nTop down riding round through the city blowin loud while we screamin\nI'm tryna leave with the baddest one in there\nTop down riding round through the city blowin loud", "image": "https://images.genius.com/c5a5c5bd18d5c5dc321d431a4dfbb71b.500x500x1.jpg", "album": "Margiela Music 3", "title": "Bad Influence"}]}