{"artist": "Problem", "songs": [{"album": "Chachiville", "title": "Don’t Want No Smoke", "image": "https://images.genius.com/0b8764d1237a5e4c830d12f02cc1b589.1000x1000x1.jpg", "lyrics": "[Verse 1: Problem]\nLate night, Fresh Prince on the tube\nOG and Jim Beam got me in the mood\nI'm in Louisville, living like a rockstar\nMade it off, still influence where the blocks are\nBiggest fear going broke on a cop car\nPeople I know treating me like I'm a pop star\nMan, I really hate that shit\nMoney don't make me, but I make that shit\nLook Eazy, N.W.A. that shit\nHave K come through and straight K that shit\nHot boy out the D.L.G\n'Fore I tell, I'll take that plea\nI was made different\nSwear these niggas don't want no smoke\nShout to 21 savage, wanna quote that quote\nWhy these niggas sleeping on me, on God I'm woke\nPlottin' on who in the way\nGet your clown ass choked\nGet your clown ass smoked\nThat's the drink in me talking\nMy unit G, I'm Lloyd Banks in some Barkley's\nBailing through the west, not giving one fuck\nFive-O on my tail, tryna get a young buck, what\n\n[Hook: Problem]\nThese niggas don't want no smoke\nNo, these niggas don't want no smoke\nNone of these niggas don't want no smoke\nMan, these niggas don't waant no smoke\nThink about it\nThey'd of been got me out this bitch\nMan, these niggas don't want no smoke\nThink about it\nThey'd of been got me out this bitch\nMan, these niggas don't want no smoke\nThink about it\n\n[Verse 2: Problem]\nPubilc Emeny, Chuck D and Flavor Fav\nStreet niggas hit the game and got major paid\nBlacked out and plagued out, that's a major fade\n[?]\nMajor pain done left no major stains\nIn my community, no sights of unity\nWon't nobody call me no liar\nGrapes and the Hunnids got Watts on fire\nR-I-P Speedy and Mofia Ray\nImagine a world with no choppers that spray\nHelicopters for days, stood on top of my city\nThen niggas got high and took lives with no pity\nSome niggas alive think they'll never see fifty\nBut I ain't gonna lie, you ask me then I'm guilty\nThis past 25 seemed like a bonus\nAnd it seem like after that is when I got the coldest\nDisrespecting the women but they the ones that hold us\nDamn when the world give you the coldest shoulders\nLocked and loaded nigga\n\n[Hook: Problem]\nThese niggas don't want no smoke\nNo, these niggas don't want no smoke\nNone of these niggas don't want no smoke\nMan, these niggas don't want no smoke\nThink about it\nThey'd of been got me out this bitch\nMan, these niggas don't want no smoke\nThink about it\nThey'd of been got me out this bitch\nMan, these niggas don't want no smoke\nThink about it\n\n[Bridge]\nI swear, I don't want to know\nIf you hatin' me, just keep it on the low\n\n[Verse 3: Problem]\nSo fucking fired up right now\nIt's 3:43 and I'm up right now\nHalf a zip, last sip in my cup right now\nOld dog and I'm feeling like a pup right now\n'Cuz I swear these niggas and bitches gon' keep tryin' me\nThinkin' we the same, like Siamese\nTryin' to align me with these weak ass niggas\nWe niggas is grimey in the street, ask nigga\n[?]\nMy hearts cold, thought I had a friend but the mark told\nStreet niggas live by a harsh code\nHood meetings late nights when the parks close\nLying about lies only make it worse\nCatch fades, if the bullet don't catch you first\nNerdiest nigga get scared then bet he burst\nFuck second, I'm cumming first\n\n[Outro: Taxstone]\nChachiville, Problem, What's going on my nigga? East coast to the west coast, you know I'm gonna come to check in. I hope you not giving these niggas no motherfucking room to breathe. I want your foot on they neck so motherfucking hard that they eyes start to pop out they head. You understand, my nigga. Please don't give these niggas no room. I always tell you, man, \"Don't trust no nigga that never died before.\" You hear me, one more time. \"Don't ever trust no nigga that never died before.\" 'Cause a nigga that's alive, you can't trust them. You understand and alot of niggas ain't living so alot of niggas alive to begin with. So with so many trust issue that I got that I deal with that I need you to understand that you gonna deal with the further you succeed. You an independant artist my nigga, you just preformed at the rings game, like, this shit ain't light my nigga. This shit is about greatness, this shit isn't about haters or pessimist that want to drag you down every five minutes, you got to keep fucking the baddest bitches, you got to keep taking care of your family, you got to keep doing thing for your kids, and you got to keep not letting these nigga breathe. You understand, 'cause the moment you give these motherfuckers the moment to breathe, motherfuckers are gonna blow your motherfucking food, and you can't blow on my motherfucking food 'cause you can't share my fucking food, nigga. You understand, alot of niggas are gonna ask you, \"What size sneakers you wear?\" And you got to tell them your size nigga. You understand what I'm saying. Let nigga know whatever you want to take, come take it, but if you come take something, something might get taken from you that you can never get back again. Be safe though. Chachiville", "year": "2017-01-20"}]}