{"artist": "Porta", "songs": [{"album": "#OFF*", "title": "Otra Salida", "image": "https://images.genius.com/33da1d3767403b9b0c864c2ad7f31686.1000x1000x1.jpg", "lyrics": "[Letra de \"Otra Salida\" ft. Uve Sad]\n\n[Coro: Uve Sad, Porta]\nNunca pensé lo que sería, me desvié (Me desvié)\nTracé otra vía, ¿Merezco esto? Mi muerte en vida\nAyúdame a encontrar otra salida\nNunca pensé lo que sería, me desvié\nTracé otra vía, ¿Merezco esto? Mi muerte en vida\nAyúdame a encontrar otra salida\n\n[Verso 1: Uve Sad]\nAntes de dormir me angustiaré, diré que ha sido mi culpa\nTe llamaré, te haré saber que no he ganao' tus disculpas\nAunque sepa que todo es mentira a pesar que la herida se irrita\nSigo mirando hacia arriba pensando en el día que acabe mi vida y, ey\nMírame, ya lo sé, no estoy bien\nEsto es algo que no puedes resolver, ey\nFíjate ya no me, puedo sostener, ey\nTuve fe no me alejé siempre te haré mi ciel... ey\nY ahora que ya no quiero mirar más atrás\nTal vez después de tanto tiempo pueda respirar, ey\nPero no es así y es que sigo mal\nYo sé que es por mí; no consigo amar\n\n[Coro: Uve Sad, Porta]\nNunca pensé lo que sería, me desvié (Me desvié)\nTracé otra vía, ¿Merezco esto? Mi muerte en vida\nAyúdame a encontrar otra salida\nNunca pensé lo que sería, me desvié\nTracé otra vía, ¿Merezco esto? Mi muerte en vida\nAyúdame a encontrar otra salida\n\n[Verso 2: Porta]\nHace tanto ya que me dejé de callar\nQuizás porque todo me da igual\nLo que puedan pensar me la suda, no hay tiempo pa' dudas\nLa vida es cruda, la llaman realidad\nLo que pierdes no vuelve, los sueños se cumplen sólo si no duermes\nTodos podéis verme con estas ojeras de panda\nEn esta basta jungla sin verde\nNo pienso esconderme de ti (Nah)\nSi eres feliz, por qué miras tanto hacia atrás\nQue el fin te dejó cicatriz, en fin, del fin\nTú nada en tu zoyo me quedo en el mar\nPa' descansar de ésta carga\nMientras tú estás en Starbucks\nYo rapeándole a un bar-man\nSigo en estado de larva\nValiente el que afronta de frente como yo (Ah)\nTengo a mi familia y a mis bros (Ah)\nAl amor de mi vida y tú a mí no (Uh)\nEs causa del efecto dominó (Off)\nPorque es suficiente, va por todo el que siempre me valoró\nNo quiero que lloréis mi muerte yo seré infinito si vivo en vuestra voz\n\n[Coro: Uve Sad, Porta]\nNunca pensé lo que sería, me desvié (Me desvié)\nTracé otra vía, ¿Merezco esto? Mi muerte en vida\nAyúdame a encontrar otra salida\nNunca pensé lo que sería, me desvié\nTracé otra vía, ¿Merezco esto? Mi muerte en vida\nAyúdame a encontrar otra salida", "year": "2019-03-21"}]}