{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Scratches: DJ Premier]\nBust a move, we show and prove\n\n[Verse 1: Scoob]\nHa ha, hey hey, laugh now nigga\nMy man's right behind you, Kane pull the trigger\nI don't play, I'm from the hill where shit is real\nAnd I'll be on your ass like bugs on a windshield\nSo bring your grip or you can think twice\nCause I got more rhymes than a five pound bag of rice\nI'm hitting hard, oh word, I'm gon' rock it\nOnce the shit drops, that's dough to the pocket\nI cut hair and you still can't get no part\nYou couldn't deal with Scoob if we was playing cards\nBut if I got beef then it's time for code red\nMy gun is like a ho, it be taking mad niggas to bed\nSo hurry up and skedaddle\nEven if you join the army, you still couldn't battle\nSo where you from? England, you somebody great?\nYou burning Scoob, \"I don't think so mate\"\nI got the style that get you open like a bag of smoke\nI'll have your friends saying \"Ah man, that shit is dope\"\nLeave me alone when I'm rocking on the microphone\nAnd play like E.T. and phone your black ass home\nYo Sauce, if you're down with the groove\nGet on the mic and won't ya show and prove\n\n[Verse 2: Sauce]\nHey, here I come with a slick rap, tic tac toe\nWhen I flip tracks, so gimme my dick, back\nI flow to it and through it, if you ever need to wonder\nHow you got dope like Sauce, money you didn't do it\nI write my own with bigger hope, drink of Scope\nWrote what I figured, nope, damn you dig a nigga doe\nRhymes too drastic, bastard, pull hookers like elastic\nNBA style, fantastic\nNo time to bite, but I just might, tonight\nI write left-handed cause I like to grab my dick with my right\nWho could ever say that I don't get plenty play\nWin lose or draw, I'm booking whores, anyway\nAs I get ready I'm steady if I go crazy I'd take Eddie\nIf I was Fred, I think I'd have to bone Betty\nSucking and lucking, hey, niggas I'm ducking, nay\nNada no never meaning ain't no motherfuckin way\nRappers get gassed come on and get fast\nTry to get past when I blast, and you can hand over your ass\nOne line and that's fear\nRappers get so damn pussy they gotta go for a pap smear\nSo Shyheim, if you're down with the groove\nGet on the mic it's time to show and prove\n\n[Verse 3: Shyheim]\nI spark the mic like weed that's in a cipher\nAnd I get girls open like a reggae song by Tiger\nSo check me out, as I flip this here track kid\nAnd make mad noise like a Metallica record\nI'm psycho, a villain to the styles I be killing\nWhen I'm thrusted, and all competition gets dusted\nCause I rock the world from U.S.A. to Asia to Russia\nIf your shit stinks I'mma flush ya, then bust ya\nLike a crazy man from Cali son\nMy jams be packed like a Farrakhan rally, what?\nYou know my style, I put the F in effin foul\nThe Rugged Child lock shit down like Rikers Isle\nAnd got more girls than a trailer load with Shabba\nMore Super than Cat, I'm the punani Don Dada\nSo Big Daddy, if you're down with the groove my man\nGet on the mic and won't ya show and prove\n\n[Verse 4: Big Daddy Kane]\nNow tell me who is the man?\nWith the high-potent lyrics no rapper can ever stand\nAnd stepping to me, thinking I can be touched?\nNot even Michael Jordan'll gamble that much, yo\nI get down on it and give it to rappers that even act like they want it\nI come for your title kid, run it!\nOr else get hit with the ultimate, too legit skit\nAhh yeah, that's that shit\nDrop lyrics on ya, strong as ammonia\nThat'll dethrone ya, scorn ya, joan ya, I tried to warn ya\nYou was wack since I known ya, fake as a cubic zirconia\nWhat I just shown ya, real lyrics doggone ya\nLook inside my rap book at every text my man\nAnd see that I got, more essays than the Mexican\nThe Messiah that's feared great, leaving rappers in a weird state\nScared straight, for their prepared fate\nStrong as an elephant, intelligent, compelling and elegant\nSo well in it with every single element\nAnd competition gets none\nIf I was wearing pantyhose you still couldn't give me no run\nI see the way you're trying to get to me\nBut with that speech impedi-ment, man you gotta come better G\nYou're hitting all the wrong switches troop begin again\nMumble mouth rappers couldn't last a minute with\nThe non-resistable, non-competible\nNo No No I'm not saying I'm the best\nI'm just saying I'm fucking incredible\nAnd let's just make one more thing understood\nThat if I fart on a record, trust me nigga it'll sound good\nSo Jay-Z, if you're down with the groove, my mellow\nGet on the mic it's time to show and prove\n\n[Verse 5: JAY-Z]\nOne checking it two, checking it three\nCheck out the J, check out the A, check out the Y, check out the Z\nAight G!\nI'm breaking MC's up like EPMD\nAnd these nuts if you rappers trying to see me\nI'm buckwild with styles, ta-dow\nI've been in it running a hundred miles I'm well endowed, baby gal\nUhh, the greatest nigga to touch it, you niggas can't fuck with\nThe, incredible skills of the G from Brooklyn, big up kid\nAnd ain't no eating me up, you fast fuckin with jigga\nI'm like Prince jeans, I bring the ass out a nigga\nWhen I rock it it's in the pocket, baby mop it don't knock it\nTill you try it, once you start, you can't stop it\nI'm the cocky breed, I'm dope like poppy seed\nI live one rent from besides that be\nBetween get off my dick and stop jockin me\nWhen I bust a rhyme you're diggin the sound\nI know you loving the way it's, goin down baby\nSo Ason huh, if you're down with the groove, why don't ya\nGet on the mic and show and prove\n\n[Verse 6: Ol Dirty Bastard]\nCome on\nWu-Tang killa bees on a swarm\nRain on your college ass, disco dorm\nSlippery when wet and don't you ever forget\nYou couldn't get a flick, of the hype outfit\nBecause the way that I dress this style mad wild\nEnough to make a crowd of women scream \"Ow!\"\nWhether at a party or just in bed\nAll thoughts on Ason, keep that in your head\nYuh, my beats are funky and my rhymes are spunky\nSometimes I'll be like \"Well god damn what's the recipe?\"\nI don't know, I ask my momma she don't know\nShe says \"Go ask your goddamn father!\"\nIt's all about me in the place to be\nNiggas think they all that, yo, that shit is G\nMad game and it's a motherfucking shame\nHow many enemies wanna claim the name\nOf Ason, who carries on like a manager\nYo! Sounds fly, right?\nDanger!!!", "image": "https://images.genius.com/c57181cdaaeb4f7bcf3a5a0f89a83315.1000x1000x1.jpg", "year": "1994-08-13", "title": "Show & Prove", "album": "Daddy’s Home"}]}