{"songs": [{"image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg", "title": "Here and There (Girl You Bad)", "album": null, "year": null, "lyrics": "[Intro]\nAyo, ayo Corey, listen man...\nIf there's one thing I can't stand it's, you know, these nondescripts\nActing like they don't know who the hell I am\nYou know what I mean? So that's why I gotta run down, nigga\nYou know, I'm Nicki Minaj, Nicki Lewinsky, the black Hannah Montana\nWhen I do it, it get done\n\n[Verse 1]\nYou must not know who I am\nI don't get the spot 'till 2 IM\nDon't be mad, lil mama, cause you not in\nEverybody wanna roll with the crew I'm in\nLook, they wanna know why I'm posted at the bar\nI tell them I'm just signing posters at the bar\nBut really, I don't know why I'm posted at the bar\nYa bitches act up I got the toaster by the bar\nI get cake cause I always got a hustle\nI prompt weight and I ain't talkin' 'bout my muscle\nClub everyday, but that ho ain't me\nCause I be home with the scale like Do-Re-Mi\nI mean I walk like Onami, I mean Naomi\nI keep the thing on me\nAnd you know it ain't a bitch that's got a thing on me, no\nThat's why he wanna go and put a ring on me\n\n[Hook]\nHe be like, \"Oh, God! Girl, you bad\"\nHe be like, \"Oh, God! Girl, you bad\"\nI be like, \"A million here, a million there there\"\nA million in the air, I mean in the lair-lair\n\n[Verse 2]\nYou must not know who I be\nOn my way to Tai-Chi off the L.I.E\nDon't be mad cause you not a ninja like me\nThink she badder than Nicki, that's a L-I-E\nBitches know I'm half gone, I got my ski mask on\nYou bitches is too busy getting T-bagged on\nWhen I do it, it get done, two sticks in my bun\nPull up in the 6 hun, they be fixin the run\nCorset, Louis Vuitton; it be cuppin' my boobs\nI just left petite Vuitton, let me buckle my shoes\nWait, hold on, little daddy, let me fix my suit\nI got that presidential cooch; when he see it he salute\nI am the mistress, stay with a rasta\nIf you get at him, I'll turn your brain into pasta\nOn 'em spaceships, yup we came in with NASA\nEven out in Mars we the stars, oh my god\n\n[Hook 2]\nThey be like, \"Oh, God! Girl, you bad\"\nThey be like, \"Oh, God! Girl, you bad\"\nWe be like, \"a million here, a million there, there\"\n\"A million in the air, I mean in the lair, lair\"\n\n[Verse 3]\nYou must not know who I are\nSucka-sucka MCs call me sire\nI'm the ninja; my ad-libs say \"hi-ya!\" (Hi-ya!)\nKonichiwa -- sayonara\nListen, I am the girl, the girl they call Nicki\nI am young Nicki, finicky so picky\nAnd I am like Jada, Halle and Kimora\nNo I'm not in church but this is Christian Dior-ah\nI'm not impressed, I'm not impressed with you\nI'mma need a lot of cheese and some mustard too\nCause I get more green then the vegetable\nThey say I'm rude, Yeah I'm rude like huxtable\nI mean Rudy, I'm tutti-frutti\nAnd I got some good cookies so they blew it and took it\nI'm so Marylin Monroe\nWhen the wind blow I'm Marylin Monroe\n\n[Hook 3]\nThey be like, \"Oh, God! Girl, you bad\"\nThey be like, \"Oh, God! Girl, you bad\"\nWe be like, \"A million here, a million there there\nA milli in the air, I mean in the lair lair\""}], "artist": "Nicki Minaj"}