{"artist": "Andy Mineo", "songs": [{"title": "No Way Out", "album": null, "year": "2016-03-17", "image": "https://images.rapgenius.com/10a20131b482453cab1c2aecab3b97a9.480x360x1.jpg", "lyrics": "[Intro]\nIt's Track or Die\n\n[Verse 1]\nThis is what you need to know\nGo for great, never settle for that mediocre\nIf I don't do it right I won't do it\nWhy you think you waiting for the music, huh?\nWell this right here take time\nI gotta come right every time\nIf you wanna hate, I ain't hatin', that's fine\nGo and get a number, join the back of the line, alright now?\nIt's wrapped around the buildin'\nEven under heat I'm chillin', well\nWhy they don't want the Bible in the school?\nWhy they want the Bible in prison, well\nWhat, y'all ain't seen that comin'?\nLook, all I really know is one hundred, yeah\nI seen a couple people get they money right\nNow it's like you can't tell me nothin'\nI might run up on the Sway show\nAnd I might hit the stunt button, aow!\nThat's for all you rappers who ain't talkin' about nothin', nope\nYou see, the money don't change people\nI know you thought that it does\nBut give a broke man bread and you see who they always was\nNah mean?\n\n[Hook]\nNo way out, ain't no easy way out\nThere's no way out, ain't no easy way out\nNo way out, ain't no easy way out\nNo there ain't not easy way out now\nOff top\n\n[Verse 2]\nI'ma put it to you straight\nEveryday I wake up off top, I go pray\nThen I thank God that I made it\nBest part is that I did it His way\nI see y'all gettin' cray on the social\nBut that ain't really you, little homie I know you\nSo when you done tryna live for a world that don't care about your soul\nBest bet you could roll through\nIt's all love, all love man\nI only want the best for 'em so I check for 'em\nIf they money messed up man, I even got a check for 'em\nInvest in 'em, I bless 'em\nAnd you ain't gotta pay back\nLook, I deserve death, man, I never had to pay for that\nOn a track I give any rapper that you know a run for they money\nGod forbid I'm ever chasin' that\nYoung boy from the East coast\nGoin' beast mode every time I get a beat though\nHow you tryna start with me? You ain't even off the sea\nIt's a legendary moment like it's Jordan from the free throw, bang!\nLife, no one survives it\nGram's in the kitchen, she whippin' that pasta\nShe told me, \"Mangia, eat up\"\nI'm just eatin' up, get the sweet potato\nWhite boy got soul, that's Anita Baker\nLately we been on a roll, I don't mean a baker\nYou should check for us, man, I don't need a waiter\nYou ain't from Atlanta so please don't get brave\nThese internet thugs got opinions\nBut then when I see 'em it's love\nYou know what I'm thinkin'? You should've kept thinkin'\n\n[Hook]\nNo way out, ain't no easy way out\nThere's no way out, ain't no easy way out\nNo way out ain't no easy way out\nNo there ain't not easy way out now\nOff top"}]}