{"artist": "E-40", "songs": [{"title": "Big Time", "image": "https://images.genius.com/ee0bfed3457e247f13777ca4b1e81082.1000x1000x1.jpg", "album": "The Ball Street Journal", "year": "2008-11-24", "lyrics": "[Chorus:]\nIf I got rich one day, I won the lotto\nI'll be up in the club, drunk, poppin' bottles\nImma live it up like it ain't no tomorrow\nBig time, big time, big time, big time\nBut I got to get it my way, I know it ain't pretty\nWell, I'll be doing my thang till them boys come and get me\nI'll be doing my thang till I run my whole city\nBig time, big time, big time, big time\n\n[Verse 1:}\nI get to it, I hustle, I get it in, trying to win like Steve Wynn\nMoney long like Jay Leno chin, I didn't put nothing in my government\nI paid my bills in money orders when I was in the trap hella heavy\nWhen I used to quarterback that yolla\nPerm down to my shoulders trying to get it while it's good\nTil the po po's headquarters up a hub station in our hood\nA lot of these rappers don't even sound like they believable\nBut you can ask your daddy and uncle about E feasible\nThey'll say he the gospel, he a for real fisher\nHe used to cop from me, now I cop from that nigga\nHad to share the same bath water with my brother\nUsed to argue, fuss and fight over pillows and covers\nThe low man at the bottom of the totem pole\nUsed to go the Salvation Army for school clothes\nNow I'm a whaler, tycoon bro, everyday is Christmas\nRecord company, real estate, food and beverage dealers\n\n[Chorus]\n\n[Verse 2:]\nPimpin' is ugly out here, it's gross\nBest friend will try to sneak if you let him get too close\nThe body will fall if you kill the head\nWhat else?\nLovers turn quick, they forget who buttered their bread\nWhat was you tellin' them?\nI was just tellin' one my dudes\nThey threw the old rules out the window\nCreated they own new set of rules\nWhen the shit in the air\nBe a man, you can't be scared\nBut you can't be\nTry to nip it at the bud before it get too outta hand\nBefore what?\nI got some real ones in the pen\nThat I visit cause they my folks\nUp in there programming\nWhat they making?\nMaking diamonds outta soap\nJust got my car up out the shop\nWhat you got in it?\nRetarded knock\nUse the loot that I won at a crap game\nAnd painted it butterscotch\nYou can hear me throbbing up the block from miles away\nMy neighbours loose it\nPo-po's pull me over at least 3 times a day for my music (ugh)\nMy over head 60,000 dollaz a month total\nWhat else?\nConducting business on my sidekick T-mobile\n\n[Chorus]\n\n[Verse 3:]\nNiggas on the money on a first name basis\nAnd I ain't ate all day, I want my birthday cake\nSo if it ain't about the money, you can get it out my face\nIf it ain't about money you can walk the other way\nCause I always been about my dough\nWhen they see you doing good, they want to catch you slipping\nCause them boys going to look out you know\nThat ain't gone ever stop me, now don't you worry about me\n\n[Chorus]"}]}