{"songs": [{"year": "2009-11-28", "album": "All In", "image": "https://images.genius.com/eaa01b60d9c696f343464dff9e0ea1fb.500x500x1.jpg", "title": "Head 2 My Toes", "lyrics": "[Hook]\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\n\n[Verse 1]\nPull in that liquor I don't see a nigga fresh, I got a bad bitch here\nGot to keep a bitch spending, lot of stacks this year\nMy niggas, hold them jiggers and they can't sit still\nRollin, in the club all drinks on Tee\nBy the bar, if I don't know you then you ain't gon' drink\n(What you want? What you need? Hey)\nGates, he a lunatic, something like an animal\nDon't mind doing this so watch how you handle them\nMy eyes on lil momma with a real cute face\nGot a body, but she still got a real cute face\nShe don't hold nothing back when she working (never gate?)\nShe done roll one back and got the working of a gates\nDead Game, they jock my team, you could be by a freak\nBut watch my jeans, costume made Browny Brown and you ain't got these\nYou be rocking Ed Hardy but you can't afford these, guaranteed\n\n[Hook]\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\n\n[Verse 2]\nA lot of women get excited when they smell my cologne in this place\nMr. Gates, what that is you got on in this place?\nJean Paul Gaultier, a little bit of Prada\nPolo (?)\nMami twisting her body, got her ass in the air\nIn her baby fat dress, where she at? Over there\nYou lil goons looking crooked but I ain't gon' blink\nI got a thing on me and it will bang homie, South Side\nYou ain't know? Being V.I.P a line\nOutside in front of Rash. Tryna V.I.P the drop\nKinda tipsy get to trippin' you won't see I.D or not\nOn that liquor, mind your business or you're leaving with a shot\nPosted in the corner, politicking with a waitress\nReal nice shape, matter-fact what your name is?\nIce in my watch, and my chain and my bracelet\nLet me do my thing, I'm with People's Entertainment\n\n[Hook]\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\n\n[Verse 3]\nI ain't coming to your party if my girl can't enter\nI ain't listening to shit if DJ Earl ain't spinning\nMy pants gotta sag that's just everywhere I go\nPlus I got to show my ass that's just everywhere I go\nHad coke your ole lady 'fore I pump her with that wood\nGot me floating while I'm chopping steady smoking on some good\nGates, it's ridiculous the way I dismiss a chick\nI great them with the same type of treatment that a swisha get\nI lick them, then I rip them, then I use them all up\nA bitch lying if she ever said we blew them all up\nMy friends lend me the dick said for you to call us\nNow I'm tryna see what's happening with you and all us\nHeard Do It In the Mirror and I rush to get naked\nTell your brother that this crack on the tracks the Gus made it\nOh yeah, at the hotel, heard all the lobby\nUpstairs undressing I (rebird uncovally?)\n\n[Hook]\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean\nFrom my head to my toes clean"}], "artist": "Kevin Gates"}