{"artist": "Cam’ron", "songs": [{"title": "Coleslaw", "album": "The Program", "year": "2017-11-10", "image": "https://images.genius.com/2d988f3cf7ed4e06f71fc90a8d5abc57.1000x1000x1.jpg", "lyrics": "[Intro]\nSee y'all don't like it when I'm nice\nY'all only like it when I'm ignorant\nSo that's exactly what you get\nLucy, I'm home! Lucy, I'm home!\nUgh, talk to 'em...\n\n[Verse 1]\nKanye got on stage, what he do? Played Jay-Z out\nWhat he do next? Check into the crazy house?\nFuck that you made a living talking greazy\nBesides that, man, you Yeezy with the Yeezy's\nBe yourself, you ain't gotta go AWOL\nAnd fuck that 'Ye, I been this way since yay tall\nIf you regret it then dead but if you said it, you said it\nYou meant what you said, can't tell me forgive and forget it\nI'm different, I'm from a different type of hunger nigga\nAsk OG Juan how I was when I was younger nigga\nShout to Fat Mike, Dave and Rock and they brother Mel\n[?] just some east side niggas, I know they wouldn't tell\nBut peep the details, it's me, weed and females\nTwo to be exact, I met 'em doing some retail\nChanel bags, both had on the Adidas with the sea shells\nAsked what they do, boo said \"Real estate and weed sales\"\n\n[Hook]\nColeslaw, ain't nobody seeing you\nColeslaw, no nobody wanna be with you\nColeslaw, nah, ain't nobody eating you\nThey misleading you, yeah mistreating you, nigga\nColeslaw, ain't nobody seeing you\nColeslaw, no nobody wanna be with you\nColeslaw, nah, ain't nobody eating you\nThey misleading you, yeah mistreating you, nigga\n\n[Verse 2]\nIt's funny, funny niggas like Bill Murray\nWhy? Funny because they still worry\nWarn 'em, tell 'em throw up a Hail Mary\nWho you? I raise my shooter, I'm Dell Curry\nDamn baby! I couldn't help but stare at your ass\nBut them [?] been in your head though a year and a half\nLet's get it right, go to the mall and tear up some tags\nThen to my car, open my pants, clear up your tab\nFake hustlers understand why they mad at me\nWhy? Twenty year run started off with a half of P\nThen I got a ki of D from the faculty\nBouffers that was bouffin'\nStrong bladders, they never had to pee\nAnd that ain't half of it, kilo's all in grandma's cabinet\nAround the time M.O.P. was yappin' shit\nYou getting money say word, that ain't accurate\nNo promo, but no homo, I ain't jacking it, nigga\n\n[Hook]\nColeslaw, ain't nobody seeing you\nColeslaw, no nobody wanna be with you\nColeslaw, nah, ain't nobody eating you\nThey misleading you, yeah mistreating you, nigga\nColeslaw, ain't nobody seeing you\nColeslaw, no nobody wanna be with you\nColeslaw, nah, ain't nobody eating you\nThey misleading you, yeah mistreating you, nigga"}]}