{"artist": "Ace Hood", "songs": [{"title": "4 A Minute", "album": null, "year": "2015-05-31", "lyrics": "[Intro]\nI've been gettin' money for a minute\nAskin' me a lot where I been\nBut I been gettin' money for a minute\n\n[Pre-Hook]\nUh, see, I been gettin' money for a minute\nRain, sleet or snow, I go and get it\nUh, see, I been gettin' money for a minute\nAnd they ain't got to talk it, boy, I live it\n\nAnd now I'm gettin' money like never before\nThey don't want to see me ball out of control\nMarried to the money, I had to propose\nNiggas, they ain't know me, expect me to fold\n\n[Hook]\nBut I been gettin' money, uh, see, I been gettin' money\nUh, see, I been gettin' money\nSee, cause I've been gettin' money\nTell me, tell me where you been, nigga\n\n[Verse 1]\nWork out a pulse at the corner store, still got my jewelry on\nThey got that okey-doke, move that dope out to Mexico\nYoung nigga tweakin', young nigga tweakin'\nHit after hit, but tell me why these niggas sleepin'\nSo where you been? I been gettin' money\nI been fuckin' bitches, rollin' Swishers, gettin' blunted\nPlease don't make me pull out the coupe\nAnd go 'head and pull out the Chevy\nSixty bands on the bezel, I made a mil' out the settee\nI did a lot for you niggas, who the fuck told you to hustle hard?\nUh, who the fuck gave you 'Bugatti', nigga?\nUh, hottest flow, I'm not bein' modest, nigga, no\nAsk a nigga where he been, I been gettin' money\nAnd ever since I got it, niggas, they been actin' funny\nBut I ain't even trippin', no, I ain't even trippin'\nAnd I just bought a Roley, dog, and I can't waste a minute, no\n\n[Pre-Hook]\n\n[Hook]\n\n[Verse 2]\nOkay, you broke niggas counterfeit and we just the opposite\nI'm way overconfident, all these cheques I'm depositin'\nMade a young nigga greedy, young nigga greedy\nI bought the world and everything in it, I'm needy\nNow, where you been? I've been in the gym\nI done got my weight up just in case they do a tenth\nPlease don't think it's sweet like some sugar\nI put that boy undercover\nHe woke up in a hospital, heard the voice of his mother\nI tried to tell him, but they ain't listen\nI'm in that Bobby, Johnny Gill, that new edition\nCountin' up dollar after dollar, so repetitious\nThis bitch I'm wit', her head so good, I paid her whole tuition\nI'm trippin', askin' where I been, I been gettin' money\nAnd ever since I got it, niggas, they been actin' funny\nBut I ain't even trippin', no, I ain't even trippin'\nI just left overseas and made another half-a-million, nigga\n\n[Pre-Hook]\n\n[Hook]", "image": "https://images.rapgenius.com/6a3406d8288c6f0e229cb78526ae15ca.300x300x1.jpg"}]}