{"songs": [{"year": "2017-09-11", "image": "https://images.genius.com/84420a132152a19b7d6b4521e6e94937.1000x1000x1.jpg", "title": "No Complaints", "album": "The Purple M&M", "lyrics": "[Intro]\nHey, hey check me out man\nI walk in the bank to no complaints\n'Cause I know all my cash on my card\nI know I ain't gotta swipe that motherfucker\nI might serve your seat, you hear me?\nCouple labels callin', ha\nSo you know it ain't no complaints\nWord, word, word\nAin't no fuckin' complaints man\nAin't no way I'm geekin' until they accept me\nDon't worry 'bout me, hah\n\n[Verse]\nWalk out the bank (walk out the bank)\nAin't no complaints (ain't no complaints)\nI know the bank teller (you do?)\nHis name is Frank (ah yeah)\nTwenties and franklins (woo woo)\nI got a plug, he speak a different language (word)\nEyes to the scope, leave a fuck nigga brainless (rrah, rrah)\nPut him on the news if he want to be famous (doon-doon-doon)\nDo I act an ass or an anus? (word)\nYou don't know? then why you complainin'? (complainin')\nYou foul like a personal trainin' (yeah)\nTake your raps so that's personal aimin' (that's on my mama)\nBut don't take it personal, shit can get worser though\nDidn't want to hurt you so I had to murk your ho (word)\nShells on his back but no ninja turtle though (turtle)\nKillin' these babies like I was on birth control (she dead)\nThis is the life that I live, this is the life that I chose (I chose, I chose)\nBitch I'm so fresh in this bitch, I just might strike me a pose (flex)\nGold teeth and Girbauds (golds)\nCopy my swag, little boy you a ho (a ho)\nOne thing a nigga can't say, that's for sure (whoa)\nDamn that nigga treated me like a ho (huh?)\nShooters, they on the front row (yeah)\nWith them Rugers every time it's a show (word)\nThese niggas they gon' hate for sure\nWhen you're up next it's time to blow (to blow)\nNo complaints, I ain't worried 'bout it (worried 'bout it)\nI'ma stay flier than a bird about it (a bird)\nI'ma act like I ain't heard about it (word)\nYou know my ad-lib (word), not a word about it (word word word word)\n\n[Outro]\nHah, hah, hah, no complaints\nYeah, yeah, yeah, no complaints\nHah, word, no complaints\nWord, word, word word word word\nNiggas ain't 'bout shit nigga"}], "artist": "BlocBoy JB"}