{"songs": [{"title": "Power Up", "lyrics": "[Hook]\nPower up, I been gone for a minute I had to\nPower up\nTell these niggas that they hour's up\nI been gone for a minute I had to, power up\nI been gone for a minute I had to, power up\nI been gone for a minute I had to, power up\nTell these niggas that they hour's up\nAye where you been? Had to power up\n\n[Verse 1]\nHad to power up, out the Yucatan, I'm a hooligan, look at these\nI don't need car keys, everything on my wrist look frosty\nCross me, bitch look bossy, nigga you don't know what this cost me\nUh, been through shit, show you how it feel on my mental shit Made me wanna rip through shit, yeen down in the struggle then forget you bitch\nAll on my toes, hold up hoe, who sent you bitch?\nKill em, flavor, flavor, mix it wit swag, callin' me swavor\nShoe, tailor, tailor, these are my crocs, these are my gators\nI am a beast, let me release, I kill 'em all wit my ammo\nThey call me commando, Mr. went Rambo [?]\nThese are the standards, you can get handled\nNigga welcome to Atlanta, mob ties\nYou see it, you see it, you see it, Dro Soprano\n\n[Hook]\nPower up, I been gone for a minute I had to\nPower up\nTell these niggas that they hour's up\nI been gone for a minute I had to, power up\nI been gone for a minute I had to, power up\nI been gone for a minute I had to, power up\nTell these niggas that they hour's up\nAye where you been? Had to power up\n\n[Verse 2]\nDro, rappin' on A-List, you B-List, see this that straight drop D shit\nWhat up though, hit em up, go for the gusto\nMake me go crazy nutso, keep it on hush though\nMy nigga right there, he a shooter he don't talk too much though\nThey wonder why I got a lot of bottles, I been on the charger, let's go\nOne, warning, don't try me\nTwo, cock back, I'm firing\nThree, bow, crazy, pull up in the Benz, eyes lazy, uh\nI be walking on rappers, clip in, smokin' on rappers\nIts a disaster, I am the master and I'm killin' em backwards\nWait till I get you, I'm gonna give you your lyrical issue\nWait till I pull it, spit it, these are the bullets, ripping your tissue\nThey will not miss you, they do not hear you\nI kilt all your homies, your homies, your homies\nThey are not near you\n\n[Hook]\nPower up, I been gone for a minute I had to\nPower up\nTell these niggas that they hour's up\nI been gone for a minute I had to, power up\nI been gone for a minute I had to, power up\nI been gone for a minute I had to, power up\nTell these niggas that they hour's up\nAye where you been? Had to power up", "album": "High Times", "year": "2013-10-15", "image": "https://images.genius.com/301c5442f3c36df0f9bc84839ae91216.640x640x1.jpg"}], "artist": "Young Dro"}