{"songs": [{"lyrics": "[Hook 2x: Afu-Ra, Kardinal Offishall]\nSha-la-la-la-la-la-la, bum-bum, she-lay-ah\nAll the pretty girls wanna wind up them way, sha-la\nSha-la-la-la-la-la-la, bum-bum, she-lay-ah\nSee them lil' girls, buckwildin' in the place, sha-la\n\n[Afu-Ra]\nI like a chunky, badunki, mami\nWord is bond, hypnotize a brother, like she was a swami, I be\nAll up on this dance hall, clean\nI can wind up some tight, and have her spendin' her greed, come on\nAnd face it, take it-take it down to the floor\nHave her spinning her around, have her coming back for more, that's right\nShe fell in love with a king man, dippin' the end\nThe type of cat, that I can rip up the jam\nI'm brand new again, a new tune again, I'm not a hooligan\nMe and shorty, we enact the Blue Lagoon again\nCrisp and clean with no caffeine, and don't you see\nHer booty's boomin' her jeans, it's bustin' at the scene\nAnd don't you see, shorty, yeah, you lookin' good shorty\nYou and me shorty, that's right, let's make a movie shorty\nI know you see it shorty, damn, you kind tight, shorty\nYou and me, precise, that's right, we kinda right shorty\n\n[Hook 2x]\n\n[Jah Don]\nThe type that wanna battle, but they know I battle New York\nThey really wanna know what's up\nThey all set out to bank up, or they find out what's up\nThe New York, all sound, yes, that's us\nThem girls, them type to time\nWe all see them, but then dey bum on the time\nBaby girls, y'all free the bloodline\nWe all see them, but then dey bum on the time\nWhen y'all off, and when I'm on, and then have to spend mines\nCuz each and every day, a blood can get in my way\nSo keep my minds in front, and don't send him my bad way\nIt's all about a better way, and really wanna try\nI be there for you, and atleast I don't pretend, and do I try\nBegin to hold it down, cuz the world is mine\nSo then me keep it sharp, as a dime, wow, wow\nWe held it tight, now, it's so tight, now\n\n[Hook 2x]\n\n[Kardinal Offishall]\nMr. Kardinal say, back up in it again, my friend\nYea a murderer, finish it again up to the end\nMe don't play, me don't lay with them, we slangin' them\nStrayin' them away from all the suckers, and no luck\nIt's the same ten steps, back up truckers, we high class fuckers\nGirls looking real bugee, before they get stripped that's it\nThey come with a bag of talk, and a bag of attitude\nBut all I'mma trynna do is bag it up, and teach you\nDot City, where the queens in jeans stay\nAll of them ghettio chicks live around my movie, you know?\nIt ain't nothing, you cutting to a PF Cuttin'\nCuttin', then we trucking, ready to be with another suckers\nBlack Jay's from BK to UK\nStay the number one champion, with the girls, dun\nGet it? Girls if you wit it, let me spit it in the place\nWhat come, don't know why they waste, you know?\n\n[Hook 2x]", "title": "Deal Wit It", "album": "State of the Arts", "image": "https://images.genius.com/6641519bda508e451130d48bde3b5fe7.480x483x1.gif", "year": "2005-07-01"}], "artist": "Afu-Ra"}