{"artist": "Wale", "songs": [{"title": "Center of Attention", "year": "2009-11-10", "lyrics": "[Hook: Wale]\nI call a spade a spade\nWhat you want me to say\nSay I’m destined for fame, well I am very afraid\nDo you know what fame is?\nIf you did, you wouldn’t want to be famous\nEverybody finger point in your direction\nEverybody seems to misread every sentence\nBetter or worse, the center of attention\nGift and a curse, the center of attention\n\n[Verse 1: Wale]\nSee I wouldn’t wish success on my worst foe\nYou see the devil is alive but he work slow\nAnd yea I should’ve seen the signs by my first quote\nBefore you sign, you’ll be blind if you’ve been broke\nAnd true I’ve seen better times cause I’m getting dough\nBut my vision has inclined to some Interscope, and its home\nThis country has an obsession with celebrity\nBut, who is to blame when we let them in on everything\nFrom B’s wedding ring, to beef meddling\nIronic we on air, but they never let us breathe\nWe all make mistakes, why you wanna make an issue?\nIf I don't diss another nigga you dont get that issue\nI don't really get you, see what the problem is\nKeeping up with Khloe and Kim, not the Obamas is\nYou tryna find where Rihanna is\nTo be honest you ain't minding where Osama is\nAnd its not a big deal, its a small affair\nFuck Barack’s change, we’d rather talk Milian’s hair\nAnd if the sky fall tonight, we all be alright\nJust tell us where all the stars is\n\n[Hook: Wale]\nI call a spade a spade\nWhat you want me to say\nSay I’m destined for fame, well I am very afraid\nDo you know what fame is?\nIf you did, you wouldn’t want to be famous\nEverybody finger point in your direction\nEverybody seems to misread every sentence\nBetter or worse, the center of attention\nGift and a curse, the center of attention\n\n[Verse 2: Wale]\nNah, I wouldn’t wish fame on my enemy\nPaparazzi like a life time sentencing\nNo comma, no pause, no anything\nJust know fame has a price, lose everything\nDC has never seen such progress\nSo bitches on the scene seem quite stalkish\nThey like talking, its like gossip\nHow little hugs can turn to draws offered\nThough uncalled for, they gon drop them\nAnd your girl's cousins tryna get her other options\nAnd now your best friend's having kids\nThey two now, and haven’t seen their godfather yet\nDon’t let me talk about the deal ones\nMommy found out I’m paying everybody bills\nBig said it, more money more ills\nSo I spend it real fast, cause I’m tryna sit and chill\nA lil, signed, sealed, delivered\nBefore a nigga signed I had a healthier liver\nShit, now my lips liquor-ish\nAs my record label nitpicks at this\n\n[Hook: Wale]\nI call a spade a spade\nWhat you want me to say\nSay I’m destined for fame, well I am very afraid\nDo you know what fame is?\nIf you did, you wouldn’t want to be famous\nEverybody finger point in your direction\nEverybody seems to misread every sentence\nBetter or worse, the center of attention\nGift and a curse, the center of attention", "album": "Attention Deficit", "image": "https://images.genius.com/a820f3f34251c1428eb5e289fe202b13.600x600x1.jpg"}]}