{"songs": [{"lyrics": "[Intro: Paul Anka (Jay-Z)]\nNow, the end is near (Can you believe this shit Guru?)\nSo I face (I'm from the hood man) the final curtain\n(No the REAL hood the hood, not the RAP hood)\n(The REAL hood, like three pair of pants)\nMy friends, I'll say it clear (pair of sneakers)\n(My moms is bustin' her ass) State my case\n(Nigga I'm goin' to Japan tomorrow!) Which I'm certain\n(You understand what I'm sayin'? Can you believe that?)\nI lived a life that's full (They have people, waitin'\nAt the airport like five days like I'm a Beatle or somethin')\n(That's really somethin'!) And I traveled each, and every highway\n(Seen the best of the best, the worst of the worst) and more\nMuch more than this (still here) I did it myyyyyy wayyyyyyy\n(Let's try this one, uhh, yeah!)\n\n[Break: Jay-Z (Paul Anka sample)]\nGangsta nigga\nPut my hustle down, tore the game up, nigga\nTook your high score down, put my name up, nigga\nTore the doors down to the Hall of Fame is Jigga\nI did it my way (and more.. much more than this)\nThat's right, it's a beautiful thing man!\n(I did it myyyyyy wayyyyyyy) I did it my way -- Hovi baby!\n\n[Verse 1: Jay-Z]\nMomma's youngest and strongest, survived summers like saunas\nMastered a corner like Deion in his uniform\nPop hurtin' assertive, flirted with death\nDamn near murdered before my first album hit the shelf\nGrandma's favorite, she could not understand\nHow there's people in the world who wouldn't want me as a neighbor\nHas to explain to her, you think these folks want me in the penthouse\nAs a reminder that I make top paper?\nBlack entrepreneur, nobody did us no favors\nNobody gave us shit, we made us\nThe Rap Pack, I'm Sinatra, Dame's Sam Davis\nBiggs the smart one on the low like Dean Martin\nWe came in this game, not beggin' niggas pardon\nDemandin' y'all respect, hand over a check\nAnd while y'all at it, hand over the jet\nWe the reason they ain't hand over Def Jam so quick\nThey knew every year I was droppin' new product\nI was raisin' the stock up, while buildin' the Roc up\nBut that's alright, 'cause they knew they had to see us\nWhen it was time for us to re-up, make us multi-million-aires\nJe-je-jeah!\n\n[Chorus: Paul Anka sample]\nAnd more, much more than this; I did it myyyyyy wayyyyyyy\n\n[Verse 2: Jay-Z]\nJeah! In my lifetime\nI caught smaller cases, but I had capital\nHypocritical system let me right back at you\nYou better hope a rich rapper never attacks you\nNot even that scratches you, 'specially if you black dude\nThey don't give a shit unless the accused just happen to rap\nAnd they can look good by paintin' him as bad news\n'Cause in my past, I seen dudes get half of they views\nExposed to the curb and nobody said a word\nSo imagine how disturbed I was\nWhen I seen how big they made my fight scene at the club\nLet me explain exactly how this shit was\nThis nigga Un yo I scratched him, he went home without an aspirin\nBut it’s cool 'cause we back friends, it happened and it's over\nIt's in the past and I'm glad, now I'm back to bein' Hova\nMaybach with the chauffeur, laid back\nHelicopter seat, feet inclined, shit feelin' like a sofa\nHelicopter meet me, Teterboro take me over\nSomewhere peaceful for the weekend now it's back to speakin' to vultures\nSo the next time that page six approaches us\nHere's a quote from Jay, nigga I did it my - way\n\n[Chorus: Paul Anka sample]\nAnd more, much more than this; I did it myyyyyy wayyyyyyy", "title": "I Did It My Way", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg", "year": "2002-11-12", "album": "The Blueprint 2: The Gift & The Curse"}], "artist": "JAY-Z"}