{"artist": "Apathy", "songs": [{"title": "Be My Boo", "image": "https://images.genius.com/f2ae9bce15f063f63ba6b80794c6b3a1.256x256x1.jpg", "album": null, "lyrics": "[Intro: Samples and Apathy]\n\"And you always said you'd be my boo!\"\n\"To all the ladies in the place with style and grace.\"\nAnd this is dedicated to...\n\"To all the ladies in the place with style and grace.\"\n\"And you always said you'd be my boo!\"\n\n[Verse 1: Apathy]\nMy Boo baby, the Whitney to my Bobby\nThe answer to my problem‚ probably help me hide a body (Yeah!)\nYour body so perfect‚ make we wanna blow a circuit (*Bzzz!*)\nBlow a load inside the cervix‚ like as soon as I insert it\nYou make me feel like Jodeci in '92 (True!)\nYou know lyrics to Wu songs, you the fliest Boo\nUp in the Beamer like... Cleopatra flexin'\nGivin' me the fat erection (Uh!), get the D without protection (Yah!)\nVIP pussy‚ I got the passcodes (I got the passcodes)\nI'm gettin' head in the whip, takin' the back roads\nYou suck the soul out me, that's why I sweat you\nI could never get sick of you‚ 'til the end Boo\n\n[Bridge]\n\"At night, I think of you.\"\n\"And you'll always be my boo!\"\n\n[Chorus]\n\"To all the ladies in the place with style and grace.\"\n\"And yes, yes, y'all... Ya don't stop!\"\n\"To all the ladies in the place with style and grace.\"\n\"...and you always said you'd be my boo!\"\n\n[Verse 2: Apathy]\nYou the black magic to my spell book (Uh!)\nLet's light this world on fire and watch Hell cook\nIf we a'int sinnin', we a'int livin', you my Mallory\nI manifested you; you the scare the shit outta me! (Whoa!)\nChillin' with chinchilla, look like a million dollars Boo\nWanna demolish you, by pleasin' every molecule\nYou got my heart on lock, I shoot you a heart Emoji\nWhile the Glock is on me, I would save you from the Knockatomi\n'Cause you my die hard, ride or die, I'd die without you\nI have no interest in my oxygen supply without you\nWent from lust to love, I guess I'm super lucky\nI'm a Demigod, but you a Goddess - only you could fuck me\nIt's like if Superman was fuckin' somethin' regular\nWe out in outerspace, bustin' nuts on a nebula\nNext time I see you, I'mma have a few, kinky new\nThings to do, always say you'll be my... Boo\n\n[Bridge]\n\"At night, I think of you.\"\n\n\"And you'll always be my boo!\"\n\n[Chorus]\n\"At night, I think of you.\"\n\"And you'll always be my boo!\"\n\"To all the ladies in the place with style and grace.\"\n\"And yes, yes, y'all... Ya don't stop!\"\n\"To all the ladies in the place with style and grace.\"\n\"...and you always said you'd be my boo!\"", "year": "2019-07-01"}]}