{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Big Daddy Kane]\nMmm.. ohh yeah\nMmm, mmm, mmm, ohh yeah\n\nAllow me to introduce myself\nAs the Big Daddy Kane\nA smooth lover from around the way\nThat's bound to drive any bitch insane\n\n[Dolemite (Rudy Raw Moore)]\nWell Dolemite is my name\nAnd rappin and tappin is my game\n\n[Kane]\nOh yeah? Well me tell you somethin Mr. Dolemite\nThe shit you talkin years ago, I could see\nBut it's the 90's now and rap is all about me\n\n[Dolemite]\nListen.. when it comes down to rappin\nI was THROUGH with it before you learned what to do with it\nI'm the KING so I'm stakin my claim\nIn the rappin game\nY'know? For all players, I am the speaker\nI'm also known as the hot pussy seeker\nWhen it comes down to ridin up and down in some pussy\nI make it weaker\nAlso it gets a little deeper\nI was walkin down Broadway the other day\nAn old old lady came my way\nShe said, \"I'll be glad when you 'come 18\nI'm gonna give you a funkin like you ain't never seen!\"\nI said, \"LADY! Why wait for so much time to pass?\nI've been WANTIN to tear up yo' old gray ass\"\nSo I pulled out my dick\nIt was so shiny it looked like it was painted\nThe ho took one look and damn near fainted\nI stuck it in the bitch and the bitch began to shout\nThat, \"Oh Mr. Dolemite, take that motherfucker OUT!\"\n\n[Kane]\nWell you ain't sayin nothin slick to a can of oil\nI walked barefoot from New York to Dallas\nWon for Pimp of the Year at the Caesar's Palace\nMade a big snowstorm on the 4th of July\nAnd drunk the waters in the Atlantic Ocean til that shit was dry\nI was makin money before Washington was put on a bill\nAnd I kicked Jack's ass and took his ho Jill\nI'm the one who broke the bull's back\nAnd made people say FUCK McDonald's and call ME the Big Mac\n\n[Dolemite]\nWhy you long lanky motherfucker\nYou ain't nothin but a sucker!\nI was born in a barrel of butcher knives\nShot in the ass with two Colt .45's\nI've been slapped by a bear and bit by an eel\nI chew up railroad iron, and shit out steel!\nI jumped in the ocean and swallowed a whale\nHandcuff lightning and throw THUNDER's ass in jail\n\n[Kane]\nWhy you ignorant decrepit motherfucker\nLet me tell you somethin\nI'm the one that put the M in mackin\nBecause when you did it you was only actin\nI made pimpin a full time job\nSo bitches wouldn't have to go out and rob\nI made the streets of New York hot as a SAUNA\nAnd hung a Home Sweet Ho sign on every corner\nYes I'm the player of all players and the mack of all macks\nGive a headache to Excedrin and knock the SHIT out of Ex-Lax\n\n[Dolemite]\nWhy you insecure no business barn junkyard\nRat soup eatin motherfucker!!\nIt was in the early 1960's when I originated my pimpin game\nI was callin whores jives ass bitches\nAnd pimps - sucker ass lame\nKANE, before you can take my reign\nYou gotta cook me a chicken and a half a day\nWalk from New York to Los Angeles and throw the bones away\nYou gotta be BORN BLIND and cannot see\nYo' bitches have the POCKS in the ass so bad they can't even pee\nRide a bald eagle a million feet in the AIR\nAnd get out and do the runnin man while you up there\nHave the Mumps and the Asiastic Flu\nAnd the Crabs around yo' ass start singin the Yankee Doodle Doo!\n\n[Kane]\nAww fuckit I give up", "image": "https://images.genius.com/9018e5e448f4d08b6115d24de00e8af0.1000x1000x1.jpg", "year": "1990-10-30", "title": "Big Daddy vs. Dolemite", "album": "Taste of Chocolate"}]}