{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "Judgement day - xplicit album version", "album": null, "lyrics": "Oh, yeah, yeah, yeah, yeah\nYou can turn your back and then walk away\n(You can turn your back and then walk away)\n(Yes, uhh, breathe with me)\nSoon be comin' the Judgement Day\n(Ah, soon be comin' the Judgement Day)\n(Come on listen, yo)\nI know you're fed up, feel like you can't get up\nHave faith, stay strong, keep your head up\nYo, it only gets worse, we in a world\nWhere your status and your bank account determine your worth\nThere's no time to rehearse, the clock been tickin'\nBecause we all started dyin' at birth, I speak the truth and it hurts\nIt felt like I was dyin' of thirst\n'Til I was blessed with my voice, I move mountains with verse\nThe worst thing you ever seen in your life, 'The Passion of Christ'\nPregnant chicks buyin' rock, hittin' the pipe\nIt ain't like, I ain't tried to tell ya, misery love company\nKeepin' the wrong company brings failure\n'Cause people use people like paraphernalia\nWith a scam, with a scheme, with a dream to sell ya\nBut I ain't got nothin' but love for all my soldiers and thugs\nTo all of my women, we gotta keep livin', come on\nYou can turn your back and then walk away\n(Oh, don't turn your back and then walk away y'all)\nSoon be comin' the Judgement Day\n(Soon be comin' Judgement Day)\nYeah, come on, Mr. X to the Z had to raise the stakes\nHad to touch my people like T.D. Jakes\nOn the ground like a nigga flippin' crumbs to cake\nI won't stop like an eighteen wheeler with no brakes\nBein' dipped in here on so each CD's weight\nNiggas be fake, they speak what they can't create\nYou won't, see me break, I'm built for a tough frame\nOne-eighty-five and I'm still on huff\nI was only 15, tryin' to pass that rock\nNever got caught, just sat down, collected my thoughts\nThis is bullshit, I ain't got a plane or a boat\nI'm just another nigga sellin' some coke, you know?\nHad to grab life right by the throat, murder I wrote\nMy callin' for ballin' wasn't pedalin' dope\nIt was oversea convoys, bangin' out cuts\nNo police or government agency lockin' me up, so what?\nYou can turn your back and then walk away\n(You can turn your back and then walk away)\nCome on, soon be comin' the Judgement Day\n(Soon be a comin' a Judgement Day)\nWhat do you believe in? I believe in karma\nAnd that fo'-five to drop that drama\nCan't wait for the time when I meet my maker\nPicture everlastin' life in Jamaica, time to wake up\nWatch your thoughts, your thoughts become words\nYour words become actions when the bullshit happens\nKeep laughin', that's when the gauge start clackin'\nFeel the buckshots smackin', have your body mismatchin'\nYo, I feel the devil tryin' to force my hand\nSteady bringin' out the soldier in a peaceful man\nSee I was born to be all that I can, without a uncle named Sam\nAs you can see we just a part of his plan\n'Cause first there was a war on blacks\nAnd then there was a war on crack, now it's war in Iraq, come on\nI never give up, I only give back\nI ain't preachin' I'm just statin' the facts so let the choir sing\nYou can turn your back and then walk away\n(You can turn your back and then walk away)\nSoon be comin' the Judgement Day\n(Oww, soon be comin' the Judgement Day)"}], "artist": "Xzibit"}