{"songs": [{"title": "By the Way", "lyrics": "[Intro]\nYeah\nJust call me young\nMy money grown though, by the way\nHa ha, let's go\nHa ha ha, Young, you already know what time it is\nLet's go\n\n[Hook]\nSaid I'm young by the way, the one by the way\nI ain't trippin' I just do this shit for fun by the way\nThe truth by the way, the proof by the way\nMr. Front up on me know I'm gonna shoot by the way\nI said it's on by the way, I'm in the zone by the way\nYou can call me Mr. Get 'Em gone by the way\nI did it by the way, I was with it by the way\nI talk it like I did it cause I lived it by the way\n\n[Verse 1]\nWhat ya say Young\nThe boy might go nuts, holes in niggas just like donuts\nMy kreme be krispy, these niggas can't get me\nMust be the wrong size cause these niggas can't fit me\nNever let 'em play me, never let 'em bullshit me\nIf they ever bullshit me, send the coroner to get me\nAnd when the coroner come get me, I'mma take you pussies with me\nI ain't trustin' 12 shots, you know I keep them choppers with me\nAnd I don't trust you Bumba clots, you know I keep them shotta's with me\nCan't let the goons get bored, gotta keep them niggas busy\nAnd I ain't trustin' nobody, so I took my money with me\nCause last time they got me get me get me\n\n[Hook]\n\n[Verse 2]\nStay on it by the way, I want it by the way\nTake it to ya mama's mama house where everybody stay\nWhere everybody sleep, leave everybody sleep\nHave a baby by who, that's everybody's freak\nBaby like a drycleaners, done seen everybodys sheets\nTake 'em straight to the hood, let everybody eat\nI went down they went down, now everybody cheap\nOr should I say cheaper maybe even lower\nYa'll niggas gettin' missed if ya'll talk any slower\nThen ya flow a be screwed, now that a be rude\nI demand my respect, plus I gotta sack\nHad the Westside crackin' ask about in the map\n\n[Hook]\n\n[Verse 3]\nI turned a brick into a clothing line, a Boost commercial\nAnd they still talkin' yola, so who's commercial?\nYoung like Noah I move them birds by the two\nDaddy need to smoke, the coupe need a pair of shoes\nI keep my A.I. on still won't cross over\nI gotta half a box left I think I need more soda\nHustlin'' since I was ten still ain't met Sosa\nI just got this thing in it's too big for a holster\nThey say I'm bipolar so indecisive\nSo muthafuckin' what I know some bitches who like it\nThe real niggas recite it, the real bitches they love it\nIt's just the way that I thug it it's what they want I'm like fuck it\n\n[Hook]", "album": "The Recession", "year": "2008-09-02", "image": "https://images.genius.com/1b0e8d5c8ba78942c07465f1565ca9c0.1000x1000x1.jpg"}], "artist": "Jeezy"}