{"artist": "Fat Joe", "songs": [{"year": "1993-07-27", "album": "Represent", "image": "https://images.genius.com/74218f34fc7a7f477441922b9caced21.1000x1000x1.jpg", "lyrics": "[Fat Joe]\nYeah.. uh-huh..\nChill.. hah, yeah..\nC'mon..\n\nI'm comin rougher than the roughest motherfucker could get\nPlayin' Russian Roulette, never lost a bet yet\nBluffin, ain't my style, niggas ain't sayin nothin\nCause I'm buckwild without frontin\nRaw to the core, I grew up poor\nOnce I hit the door, I began to explore\nCuriosity killed my cat, but not me\nBecause I learned how to kill with agility\nI grew up in the South Bronx, punch you in your mouth punk\nI know these streets like Fred Sanford knows junk\nIn the trunk of a car lays a body\nHead decapitated, bust him with my shotty\nStabbed the mug, to make sure, he wasn't comin back\nNow police, can picture that, with a Kodak.. huh!\nThey can't stop me with a homicide investigation\nCause if they do my crew is hittin up the station\nYour best bet, is to let me jet\nCause I bring war, like a vet, when I'm upset.. huh!\nI'm not the one you wanna play out in a program\nYo, you better tell them who the hell I am\n\n\"This is Joe Da Fat Gangsta\" Yeah! (2X)\n\"This is Joe Da Fat Gangsta\" Tell em who the hell I am\n\"This is Joe Da Fat Gangsta\"\n\n[Fat Joe]\nNow on the hip-hop tip, I'm no joke\nGet live at a jam, and leave a system broke when I spoke\nMC's froze, but I never said freeze\nHopin I don't hit em like a fucked up disease\nFall up in the club, Mr. Hype for a night\nChoke a rapper with a cord, hang him from the lights.. huh!\nNow you do wanna mess around with the Fat Man\nCause you see my face in every newsstand\nEvery other magazine from Billboard to Spin\nPick it up and read Fat Joe strikes again\nHow true, I'm not about weed and brew\nI'm just another papichulo like the rest of my crew\nSo give me the microphone\nThis jam is dedicated to my main man Tone\nCause he flips, and I flip, and we flip the script\nAnd you know, you don't wanna get your ass WHIPPED\nParty over here, another in the hospital\nLincoln, Memorial, notice that's how I sent you, hah\nI was the one who played the shoot 'em up games\nHere's another patient, and yo what's my name?\n\n\"This is Joe Da Fat Gangsta\" Yeah! (2X)\n\"This is Joe Da Fat Gangsta\" Tell em who the hell I am\n\"This is Joe Da Fat Gangsta\"\n\n[Fat Joe]\nSo I cruise around in the B-M\nOr in the Benz, hurtin enemies and makin new friends\nThey shake my hand, smile in my face\nThe nine's in my waist, so there won't be a chase\nThat's it, the situation is blown out of proportion\nWhen you leave, you must use caution\nLook over your shoulder, even on your block\nWhen I come to visit, you know you're in shock\nSo don't say who is it, act like you know\nKickin down doors is the Gangsta Fat Joe\nAnd I got no time for games\nMy name is goin down in the gangsta hall of fame\n\n\"This is Joe Da Fat Gangsta\" Yeah!\n\"This is Joe Da Fat Gangsta\" Tell em who the hell I am\n\"This is Joe Da Fat Gangsta\"\n\n[Fat Joe]\nYeah.. Fat Joe Da Gangsta\nRepresentin in ninety-three\nPeace to my man Diamond D\nPeace out to my man Ski\nThis jam is ?letido?, ha hah", "title": "Da Fat Gangsta"}]}