{"artist": "ProfJam", "songs": [{"album": "#FFFFFF", "title": "O Hino", "image": "https://images.genius.com/76b0a3e47f422248d64c650bcb5b5b32.1000x1000x1.png", "lyrics": "[Intro]\nYeah\nO Olho 'tá no Cimo, \nDois do mundo e um na testa\nVou cantar o Hino que junta a turma de vez!\nEsse é o destino que me colaste aos pés, então protege-me!\nMão no peito para o Hino Hino Hino!    \nO Hino, Hino, Hino!\nLevanta 'pó Hino, Hino, Hino!\nO Hino, Hino, Hino!\nQue é só: win, win, win!\nWin, win, win! \nSó dá win, win, win! yeah\n\n[Verso 1]\nPergunta à minha cota se eu não tenho tentado\nO mundo anda à roda logo a mente nem trava\nPeço ajuda a God - eu não aguento sem 'tar\nCom Ele do meu lado c'o andamento que tenho cá..\nPai, eu sou teu filho ’tão eu tenho de singrar \nEu tenho vendido mas não venho vendado\n'Tou a ver a city com uma lente bem larga\n''tão vou tirar uma pic e depois Tu vem comentar\n“isso é o Hino, Hino, Hino!”\n\n[Refrão]\nHino, Hino, Hino\nQuando eu 'tou na scene a minha team 'tá toda atrás do\nWin win win\nWin win win\nWin win win\nTenho a palma escrita e já foi lida, diz a sina que é win, win, win!\nWin win win\nWin win win\nO contrato c'o Devil eu parto a pen que me deram\nEssa merda eu não assino\nIsso é o Hino, Hino, Hino\nO Hino, Hino, Hino\n\n[Verso 2]\nMontei o meu esquema numa esquina\nComo eles temem que eu já não baze daqui!\nTenho a conta feita, nunca chumbo no teste\n'Tou-te a dar na boca, nessa nuca e na testa\nEu não calço a luva, dou uma dupla e ainda pedes\nQue eu mate essa Tuga - sou macumba e uma peste!\nVim do womb da Besta\nPego lume na festa\nEu não durmo nem sesta\nSó afunda não encesta\nÉs aluno então presta pouca atenção ao resto...\nShawty wanna do me like a bright shine knight\n'Tou a cuspir lava, sai-me fire e cai no mic\nO combate da life I gotta fight like Mike\nAfiada a faca faço da mind my knive\nBoy eu vim do escuro ‘tão do cuspo sai light\nSe iluminar o mundo, o Olho do Topo vai blind\nSempre na altitude porque um puto fly high\nEntão snifa cada line aqui do pai que eu payo white…\nMothafucka aceita que na cena a minha sede vem de cima\nQuando acende não desliga nem que eu pire a meio!\nTinta sai da pena, tanta ferida na caneta, \nCom a grafite a ficar quente - cada linha queima!\nO meu caderno parece uma frigideira! \nE o Inferno ao pé de mim 'tá frio, gelei!\nEntão toma nota: 'tou a bater na porta do teu Sótão,  \nA ver se acordam - toma conta do que dizes!\nSó vejo a Vitória, dou-te o Olho, junto o Código, \nO meu tónico que eu 'tou a pôr em cicatrizes!\nJá vi o Demónio dentro de um body\nQuando um boy ainda era shorty, numa de eu escolher Juízes!\nEu parti-lhe os cornos, disse:\n\"A Ordem não é Ódio! Agora foge, evapora e nunca me pises!\nEu vivo com Deus, tu não vês?\nDesde o momento que nos conhecemos!”\nHuh\nMas deixa-me voltar ao meu tema\n'Tou a tocar no Alto, essa altura eu não temo\nYey    \nSe 'tou num Fight Club, então pito do meu bread\nDread, eu tranquei (lock) o jogo e nem tenho dreads\nPerguntam se foi pelo cash \nMas sabem que eu nasci 'pa fazer o que eu quero!\nDrogas em mim, aprendi que é brinquedo...\nNão toques em mim, acredita vim quente!\nNão dou provas amigo, acredita quem quer…\nEu sou o Prof, o que ensina o game que a Think ergue yah\n'Tou mais sick nessa shit que a puta do beat dessa shit yah\nMesmo assim meu puto ya, 'tou mais fat (phat)\nQue a puta do BIG nessa shit ya ya\nMothafucka\nAgora sabes que um gajo dá-lhe um bico nessa shit! \nYa vais ouvir essa shit!\nPac without a shirt - Realest Shit!\nThat’s a win win win!\nWin, win, win!\nEssa merda é minha minha!\nIssa Sheen meme memo! (#winning)\nIssa win win win!\nIsso é o Hino, Hino, Hino!\nIsso é genuíno yeh, genuíno!\nEu 'tou fora d’horas, essa cobra não me morde\nSó me adora que eu sou Divindade \nReza a História\nQue na fronha da cegonha não vem vida ingrata \nFiz da vida um sonho já que não durmo nem quando fica tarde...\nSou álcool, essa shit aaarde!\nNão dá 'pa negar, eu sou o King, pinky ring, bling bling...\nNódoa pa lavar, killed a man, momma, eu vim tipo Queen!\nFiz o crime com o que eu rimo\nEntão eu vingo c'o meu chino bem clean…\nTu vais gritar essa shit, isso é “win win win!\"", "year": "2019-02-21"}]}