{"songs": [{"image": "https://images.genius.com/bc81d9af4dcfd1214d246b07d855635d.1000x1000x1.jpg", "title": "Cool Patrol", "album": "Cool Patrol", "year": "2016-10-17", "lyrics": "[Spoken Intro: Dan Avidan]\nYo Ninja Brian, you see that high schooler over there getting pushed around?\nThis looks like a job for the Cool Patrol!\n\n[Verse 1: Dan Avidan]\nHey kid! (yo!) You're getting picked on in school\nThe other boys! (huh!) They say you just ain't cool\nWell, that's bullshit! (yeah!) We're gonna teach you the rules\nThose motherfuckers ain't gonna bother you no more\n\nWe are the bad boys (oh!) from the tough side of town\nWe are the Cool Patrol (whoo!) we'll turn your life around\nThose bullies (aw, shit) their ass is done for now\nWe're gonna show you how! So fuckin' listen y'all! First…\n\n[Chorus: Dan Avidan]\nYou put your hands in the air\nAnd you jump off the ground\nAnd then you take that funky butt and you shake it all around\nAnd lightly jog in place and then crank it up to a prance\nThis is the Cool Patrol Dance\n\nNow put your hands in your pockets\nAnd take them right back out\nThen spin around in a circle and make an animal sound (moo)\nThen glide into the sprinkler like you're gonna water the plants\nThis is the Cool Patrol Dance\nWhee!\n\n[Spoken Interlude: Danny Sexbang, JackSepticEye]\nYou get all that kid?\nThat wasn't actually very helpful...\nThat was just like an instructional dance...\nHell yeah!\n\n[Verse 2: Danny Sexbang]\nMotherfuckin' bullies better watch their ass\nYou're sending all them shits a message there's a new king in class\nWhen they see you they're gonna freak out and piss their pants\nThey are your bitches! They are your bitches because...\n\n[Chorus: Danny Sexbang]\nYou put your hands in the air\nAnd then stick out your rear end\nAnd then you wiggle it real hard and you hug your closest friend\nAnd then you wildly remove your clothes and tearaway pants\nThis is the Cool Patrol Dance\n\nNow rub the peanut butter on you\nFrom your head to your feet\nAnd cover up your nudity with different cheeses and meats\nThen slap a camel because this could be your only chance\nThis is the Cool Patrol Dance\n\n[Spoken Bridge: Danny Sexbang]\nCool break!\nAlright...\nThis is cool\n'Scuse me...\nHey I have an idea!\nLet's kick it!\nWhoo!\n\n[Chorus: Danny Sexbang]\nYou put your hands in the air\nAnd grab a bird from the sky\nAnd eat it whole so that you may absorb its power of flight\nNow you can also dive bomb fish because your vision's enhanced\nThis is the Cool Patrol Dance\n\nYou're basically a superhero now\nSo throw some cars\nThen rub your magnum thighs together and set fire to Mars\nNow harness all your sexy fury in a victory stance\nThis is the Cool Patrol Dance!\n\n[Spoken Outro: Danny Sexbang, JackSepticEye]\nYour training is complete, now go show those fuckers who's boss!\nOkay! Hey guys, listen up... You put your hands in the a-\nOh god! Aw he might... he might actually be dead"}], "artist": "Ninja Sex Party"}