{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legendary Classics Volume 1", "year": null, "lyrics": "[Verse 1: Hell Razah]\nI keep it ghetto where it's grimey, grimey, you know how Bed-Stuy be\nThrowing them block parties, building with God bodies\nBefore Dirty died, BK been lively\nMy project army, Red Hook been behind me\nI spit jewels shiny, bright as Illuminati\nThe black owl see the white inside Colin Powell\nHitler and George Bush, they got you acting Nazi\nI be a child of Israel, young Haile Selassie\nGhetto Government, ark of the covenant\nA track with Rugged Man, I had to come fuck with it\nJoJo, Remedy, Blaq Poet, running shit\n\n[Verse 2: JoJo Pellegrino]\nMmm, that's how you comes with it? I fucks with it, yo\nPelle' keep it a thousand, a hundred percent\nHe got clout and a ton of respect\nNever sold my soul, I leased to him when he cut me the check\nSit pretty, spitting ugly, I say this nice and clear\nI'm the best that never did it, all them other guys is ehh\nUnimpressed with the state of rap, I'mma help them embrace the fact\nMove forward, take it back, shedding light, watch 'em fade to black\nBlap, and fuck rappers that can't compare to me\nThey scared of me, Pelle' the streets, keep your ear to me\n\n[Verse 3: Remedy]\nI pop a pill, chill, sit back, release my anxiety\nGot two exotic Colombian bitches on both sides of me\nMake clothes, raid codes, Mr. Secret Society\nI hate liars, this is the truth, there's no denying me\nFuck you, pay me what you owe me, let 'em know\nStaten Island like Joey, I'm Israeli like Razah is\nYoung Haile Selassie, white Jew, never Nazi\nThere's black and white poets in hand, yo Rugged Man\n\n[Verse 4: R.A. The Rugged Man]\nLike Bo King cousin, bass in your face, displaying hate in the place\nWhite folks hate me, I'm disgracing the race\nUnderground I hold the crown and I ain't gon' pass it\nEvery verse that I spit, I give birth to a classic\nAm I ignorant? Hmm, maybe, hmm, probably, am I genius?\nThat's a possibility, possibly, as amazing\nAs I spit it's obvious, I'm the cockiest, I write hits\nI don't need no Gwen Stefani's or Fergie white chicks\nKill the species of weak MC's, faggot rappers\nI'm allergic to your sweetness like diabetes\nMaster of mack, and max relax and jab in slabber\nYou battle, you bagging your bitch, waving and bruising\nWill leave in a broken ragged Caddy, babbling\nTraveling, bullets splattering\nRat-a-tat shattering, I'm the Gracie family grappling, yup\nAnd hating on me is like hating the truth\nYou can lie to yourself, but deep down you know I'm the truth\n\n[Verse 5: Blaq Poet]\nWhy? Blaq Poet motherfucker\nThat's the name, and I'll, blow your troubles\nRight out your brain, it's insane how I penetrate\nYour dome piece, microphone fiend, fuck the police\nI'm a known beast, I get it popping, I'm not stopping\nLyrical AK spray, got your body flip flopping\nYo, R.A., who the fuck want it?\nI have these punks running back up in they mama stomach\nI'm a real deal, straight from the gutter\nMight fuck the hood, but you dumb motherfuckers\nYa'll can give it up, I don't give a fuck, just\nGet out the way, I'm coming through like what, plus\nThe guns bust, no dust, no rust, trust\nYou better roll with the rush, don't oppose us\nOr get crushed by the truck, all G's up\nWhen the shit start you better not freeze up", "title": "Posse Cut", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}