{"artist": "Doughboyz Cashout", "songs": [{"title": "Woke Up", "album": "#ItsThaWorld EP", "year": "2013-01-01", "image": "https://images.genius.com/2f212c43d5cd81dc8b379d3f4437b744.300x300x1.jpg", "lyrics": "[Verse 1: Payroll Giovanni]\nWoke up and I felt like balling\nAin't even got up out the bed and money calling\nGot washed up, threw on some new shit\nLeft my old jewels at the crib, got on my new kit\nDid this shit, should I cop some rims on these hoes?\nOr should I ice my whole watch?\nFuck it, I’mma do both!\nShining on these bitches for the days I couldn't\nGotta look good cause I know they looking\nFlying through my hood, just scoop my cheese\nFor my young wild niggas that be hustling P's\nI’mma get money fanatic, drug money in the mattress\nChopper in the closet, work in the attic\nGrew up with bosses, learned from my losses\nWe really do this, we don’t just talk it\nNiggas want fronts, old bitches want me back\nWe the Detroit Big Tymers, how you love that?\n(Bitch)\n\n[Hook: Young Jeezy]\nWoke up and I felt like balling\nAin’t got up out the bed, money calling\nTook 27 bands and they’re all in\n36 wholes, meet me at the mall then\nWoke up and I felt like balling\nAin't got up out the bed and bitches calling\nForgis on the Monte cause they like that\nDoughboyz Cashout, yeah they like that\n\n[Verse 2: HBK, Doughboy Quis, Doughboy Dre]\nTen bands calling, I ain’t even brush my teeth yet\nDrown in the water, nigga fuck getting my feet wet\nKillers on my side, and they ain't never went to recess\nUp all night, counting money, I ain’t sleep yet\nWay before this rap shit, nigga I was on\nKush bows in the basement got it smellin strong\nHad to switch my phone, feds trying to tap my shit\nCavalli this, Gucci that, I'm on some stunting shit\nI’m in my coupe looking cool, ho, see me and true\nBefore snow gave us a chance at 40 bands worth of jewels\nYou will end up on the news if you fuck with my gang\nYour best friend will kill you, what your thought on your brains?\nI'm swerving lane to lane in my whip on Rouches?\nYou call that girl your wife, I just call her a groupie\nI stay rocking Gucci, either that or Gisueppe\nTalking loud on my cell, trying to show off my prezzy, bitch!\n\n[Hook: Young Jeezy]\nWoke up and I felt like balling\nAin’t got up out the bed, money calling\nTook 27 bands and they’re all in\n36 wholes, meet me at the mall then\nWoke up and I felt like balling\nAin't got up out the bed and bitches calling\nForgis on the Monte cause they like that\nDoughboyz Cashout, yeah they like that\n\n[Verse 3: Yo Gotti]\nFirst thing I gotta say, nigga free meech\nNext thing I gotta say, I got ‘em 23\nDoughboyz Cashout, who me?\nRolls Royce catch them out, wifely\nOn set, all day nigga got them wifey\nShe’s a ho nigga, why you’re trying to wife a freak\nIt’s so cold in the D, no weather\nYoung nigga thugging, plus they got beretta's\nHome of the hustlers, you know they getting cheddar\nYour price high, but my price better\nMake it rain on the bitch, shawty where your umbrella?\nDope boy shit, nigga I ain’t never tell a soul\nNigga dippin in the pack, fucking what they nose\nNigga fucking off the set, trickin to the hoes\nTalk a lot of gangsta shit, but be the first to fold\nYo Gotti a real nigga, everybody knows!\n\n[Hook: Young Jeezy]\nWoke up and I felt like balling\nAin’t got up out the bed, money calling\nTook 27 bands and they’re all in\n36 wholes, meet me at the mall then\nWoke up and I felt like balling\nAin't got up out the bed and bitches calling\nForgis on the Monte cause they like that\nDoughboyz Cashout, yeah they like that"}]}