{"songs": [{"album": "If Heaven Was a Mile Away (A Tribute to J Dilla)", "image": "https://images.genius.com/9312bcdc87acaf69bf4807d06a1292f3.500x500x1.jpg", "year": null, "title": "Circulate (100 Bars)", "lyrics": "ST. . . Termanology. . . J DIlla. \n\nI circulate the papes\nMy mind state concentrate on the paper chase\nWith good rates on the weight no seed or shave\nHennessey to the face don’t need to chase\nMy enemies I erase out my mind frame\nMy style caine on the beat, I step like ten deep\nThat S and then T, don’t sweat the technique\nThat’s me, repping that ST (unh)\nWent on a brief chase, stashing my briefcase\nHash on my weed’s laced, flashing my deep crates\nLike Flex, but I flex album release dates\nSo damage a beat tapes sampling beat breaks\nI check with a weak fake rapper diseased snakes\nThat ran through the beat game, wacker with each tape\nThey try to destroy the game with that noise\nAnd blame the bad boys, like Puff the same choice to suck\nAnd make corny rap with shiny suits for loot\nAnd pollute the booth with that music\nLosin’ the truest of art in confusion\nDo I wanna lie— or give you the truth\nDo I wanna fry— or ride in Lex coupes\nLet’s choose. I be on the Henny and juice\nGrey Goose make you loose with the tongue\nSo I’m real enough to tell you ain’t nobody doin’ shit where I’m from\nLike even my own sons they owe me a fortune\nI said when it’s all done they’ll know I am The One\nSo crucify me, try and design me\nAnd your mind is being grimy, the one you should probably\nTry and snake for his papes, you can’t get nothing by me\nIf you did it feel special, cause homie I let you\nI’m a street nigga, which means I done been broke\nIt don’t mean I shot a nigga every day that I woke\nIt don’t mean I slang coke every day though I did\nFor a good amount of time, then I had me a kid\nLooked myself in the mirror, like ‘son you could sit up\nIn the bing doing sit ups in a box with them killers\nOr you could reconsider, calm down with the liquor\nBrush the coke off the scale, throw that shit up in the river'\nHow could I go hard without seeing po cars\nJust trying to doze off, feds trying to Bogart\nMy life is trife but I’m destined to know God\nSo I don’t give a fuck if they hit me with no charge\nI’m destined to be what I’m destined to be\nSo if I’m stretching these beats so effortlessly\nAnd I make it look easy like the homie ED\nStuff the baked ziti, fuck the HPD\nPuff the gray seedless dutch with hay steaming\nMy eyes gleaming, I’m straight leaning\nWelcome to another level when I am MCing\nI’m Rakim, LL, and I’m Kool G in\nA blender with a semiautomatic four-fever\nAnd a stole Visa, divas catch beatings\nCheeba roll trees, the green is so mean and\nNothing like a joke, I smoke that homegrown\nWant that funky cold medina, fuck with Term-lo\nLo. . . now fuck around and get smoked\nI come with a razor dripping with AIDS to fuck your face up\nI got the pistol laid up haters better hit the gym up\nInvest in a vest, the best of the best\nThe recipe just: mix a little cut with the fish\nI’m a insane spitter, and I run with them caine dealers\nOld school spitters say I remind them of Caine nigga\nPolitically, analytically I am physically\nEvery bit of a real MC, trilogy after trilogy\nMillimeters to kill MCs willing niggas on MTV\nAnd leaving bodies in the trees. . . with the fleas\nGimme any beat, I’m burying you bastards\nPlastic bag rapper, save money on the casket\nHomie, I get shady like Cassius\nGet them bullets out, Tom Brady type fashion\nI ain’t in the whip, Mercedes all flashing\nI be in the hood where the .380s is blasted\nMashing, while they call me the truth\nY’all dudes is hardcore, just not in the booth\nI’m the supercalifragilistic rich spic\nWith hits like Will Smith, my chick a bit schiz\nBut man, she suck dick, lips and big tits\nLike pam, the sick scripts I write is all night\nLike my nigga Joe— thank God for that whiiiite!\nMotherfucker, damn right\nI keep goin’ with deep flowin’ like each poem\nWas written by niggas in the pen\nStraight blowin’ they time in confinement\nThe sirens are blind they try and combine us\nWith shine and define us as gangsters and riders\nWith shanks into violence, we face any problems\nWith fakes and vaginas\nThe holes in the loot get you holes in the suit\nWhere it’s told to the troops never fold or we shoot\nJust explode in the booth like your flows is the truth\nIf you flow for the loot then you’ve chosen the route\nOf the evil, conniving deceitful despising\nThese creeps that be lying the beef they reside in\nThe bling that they buying, they sing for the diamonds\nIs weak and I’m dying for cheeks that ain’t mine\nI creeping and sighing, floating through Baghdad\nMy shoes flying at Bush faster than Arabs\nCash in my safe has gone for a paycheck\nAs small as a paint chip off of my tape deck\nI rhyme with a straightjacket and a face mask\nAnd I ain’t finished til I bodied every beat Jay has\n\nDilla. "}], "artist": "Termanology"}