{"artist": "Fashawn", "songs": [{"year": "2009-09-09", "album": "The Antidote", "image": "https://images.genius.com/0c0448ad9b16fefb55596d9de67e6efd.500x500x1.jpg", "lyrics": "[Intro]\n(\"All the animals come out at night\nWhores, skunk, pussies, buggers, queens, fairies, dopers, junkies\nSick\nSomeday a real rain’ll come and wash all this scum off the streets\")\n\n[Verse]\nHop off the plane, hit the baggage claim\nJFK from LAX, watch the time change\nA few hours, I’m half-sleep, feeling scatter-\nBrained, bones aching, I need to stretch, hop the L\nTrain to the city, I heard the Chemist cooking up in the lab\nGot approached by some niggas who be stickin’ up cabs\nSaid, “Ayo, where you from? Never seen you around”\nI reply, “California, on my way uptown”\nSomehow I wind up in the wrong borough\nSurrounded by seven goons and they all thorough\nOne had a gat and he cocked it\nTwo was pattin’ my pockets\nThe other four sat back watchin’\nSame night, met a chick in Lefrak City  with fat titties\nDrove a nigga through Queens, we blew a pack of Phillies\nTold her, “I’m trying to get to Hell’s Kitchen”\nTold me she ain’t even from New York\nJust on a visit, my head’s spinnin’\nNeed to sit and relax, take a sip of some ‘gnac\nFor a minute before a nigga collapse—made a call\nWith a couple of coins I had left, my Blackberry and wallet gone\nNow I’m vexed—what the fuck?\nHow I end up in the Boogie Down BX, wanderin’ ‘round\nOutta bounds, watch your step\nI thought I heard a gunshot ring from the back of the ‘jects\nNow I’m thinking: Will I even make it back to the West?\nGod-willing, I don’t get stuck in this maze of large buildings\nA thousand feet tall in this field with odd tenants\nSomehow I gather up enough change\nTo hop back on the train, almost forgot why I came\nTake a look at my watch, it’s a quarter to 12\nWhat a night, what a city, ‘nother story to tell", "title": "Lost in New York"}]}