{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "F**k with you girl", "lyrics": "Hey man, hey man you know what I’m saying\nI told these niggas a thousand times if I ain’t told em once man\nAin’t nothing gonna stop me show em the mother fucking the flat line you understand that?\nAs long as a breath in my body, and my heart still beating my chest pardon\nI’ma still begin this suffer nigga hate, you understand?\nOf I old you who won’t like it, you got two options\nLeave with it a dime from you\nI need to go and find you a real tall building\nOr a nice pretty bridge and take a lead homes\n’cause that’s all, that’s the solution I got for you\nIf you think I’m gonna ease up\nYes, is that your mother fucking mine partner\nIf you think I’ma slow down\nThen your ass is that your mother fuckin mine partner\nIf you think I’ma do anything yeah that’s precise for what I’ve been doing for the past 90year\nYou got me fucked up homes\nSo I ain’t gonna tell you no more\nI’ma let man key do it for me\nAy man, run this shit\nMLK\nWho would reach it, who would reach it, I I I I\n\nChorus:\nHey I’m rounding round with my lights on, you broke way\nTop down with my shades on, you AK\nRight beside me so don’t do it, you try me\nAnd I’m gonna do it tell me do you wanna guide me, oh well\nSO what, fuck it, fuck it, so what\nFuck it, so what, fuck it, fuck it, so what, oh well\nFuck it, sO what, fuck it, fuck it so what\nFuck it, so what, fuck it, fuck it so what\nI’m rounding round, my lights on, my top down, my nights on\nMy white teeth, my AKB side me don’t get wrong\nWe won’t take no shit hoe, and brought day we..\nThen bro say I’m old there I hit that they call back\nPocket full them clothes stacks\nMy home boys we mow rats\nHe Gucci, he Louie, he Ermies by all that\nI pull up then have bout here whole shout\nYou saw that that’s TI and he fly\nIf not what you call that\nStill big bang can’t foll it up\nHundred pound to the loud can’t roll it up\nCouple Hollywood bitch get em foll to fuck\nReal nigga can’t help but notice up\nWe cool the shit weed up the fuck\nYou approaching us, you know what\nYou don’t give a fuck about your life\nWhy should I, so what?\n\n[Chorus:]\nHey what you know about me\nZippin on that I’m on\nAnd out of money I see\nFrom out of places I’ve gone\nOG’s call me your G and I’m your nigga why do you think\n’cause I’ve been putting that work\nAnd I’m movin up my ring\nAK with me I ain’t plan you get shot if you don’t\nNo chopper spring bloss a blazzin fuck around if you won’t\nDon’t you know I’m still on bank here to the seat go on big blow\nMy wrist right in high way clip full of them hot thing\nSeat belt in my AK nigga try me in this main day\nDon’t go down no plane crest and fur no his lane male\nYou think ’cause I’m famous I won’t grab that bank up\nPull one in the chain but then let go\nHey let’s go\n\n[Chorus:]"}], "artist": "T.I."}