{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Hook: repeat 2X]\nOh daddy\nYou know you make me cry..\nHow can you love me?\nI can't understand why..\n\n[Beanie Sigel]\nThat's what they yellin when they grab me\nEyes are swellin, cryin, tryin to stab me\nOnce they realize they can't have me\nWhen I leave 'em try to let 'em down easy like rhyme\nI snatch your heart so easy like Valentine\nCan't get caught up in that loop again\nNever letting Cupid in\nBoo you buggin ain't no time to be lovin\nMan the grip on my pistol only thing I be huggin\nIt's mack daddy not your daddy mack\nBitch you got it criss-crossed (scrap)\nI ain't havin that\nI can't have your back\nLook how you act when I had your back\nPicture me havin that back to back\nI pimp proper like shrimp-lobster\nCheck out my pimp-posture\nEven my limp proper, mama\nI can't help what's runnin down your face\nI moved your ass into that furnished place\nLike you earned that space\n[Hook]\n\n[Beanie Sigel]\nGod damn baby you had me\nAll the twirlies in the caddy used to take it back gladly\nWe was tighter than Tommy Buns and Keesha\nYou cleant my guns, count my ones, bagged the reefer\nShit I thought you was the one - you was my bitch\nThe one that never snitched\nTaught you how to bust a fifth, shit\nI taught you how to push a whip\nTaught you how to suck a dick\nTaught you how to fluff a brick\nBut you got more drama than a B-mama\nGot me goin through the motions like C. Thomas\nWith the bullshit, he say she say\nThe bitch is mad cause my jams kick like Eastbay\nMad cause they mans got they kicks on replay\nHow you drop from celebrity status\nPushin Bent to niggas in celebrity wagons\nIn them sucka type Jags\nNow you fuckin type mad\n\n[Hook]\n\n[Young Chris]\nOh mommy its so sad\nWe had it together\nYou had it whenever\nThat's yo bad\nYou fucked up\nIt wasn't meant to be\nYou lucked up\nTold me at the end don't trust her\nSee that's when all the bullshit started\nThat's what three me in reverse, counter-clockwise\nIn my mind I swore that we would work\nBut I guess that I was wrong\nRan into a dead end\nUnfaithful bitch\nYou fucked the nigga I was blazin with\nFugazied shit\nIt wasn't him it was the paper shit\nNowadays its all about the latest shit\nThat or they favorite...car\nOr get paper from ball\nUnless your label all that\nAnd you labeled as stars\nMakin the millions\nGot them bitches willin to do\nWhatever it takes\nTakin it off or willin to screw\nWhoever I bring\nGuess it's a celebrity thing\nBut I was never ashamed\nI was blessed with the game\n\n[Hook]", "image": "https://images.genius.com/48c4319dfc3c978405c6c446d03d8171.500x500x1.jpg", "year": "2005-03-29", "title": "Oh Daddy", "album": "The B. Coming"}]}