{"songs": [{"album": "The Warm Up", "year": "2009-06-15", "title": "Dead Presidents II", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, Fayettenam\n\n[Verse 1]\nThese niggas is playing\nRussian Roulette with a full clip, foolish\nMy crew is foolless, no, we don't dance\nAll we do is stay two steps ahead\nMake the hoes get loose like a noose neck\nInstead while these dudes beg for head\nThey got the game twisted, heavy traffic in this rap shit\nLook how my lane shifted, elevated my game, lifted my name\nNow these lame niggas could never get it\nLike that bad bitch you wanted but could never hit it\nClever with it, my flow like a devil spit it and heaven sent it\nSo high, if I dropped I would fall for 11 minutes\nSo yeah, I operate on a higher plane, my thoughts take a higher train\nIt's dope, then you should know the suppliers name\nIt's J. Cole, set of horns and a halo\nAnd all these Jose Canseco's wanna text us like Waco\nIts hard to remain faithful niggas be throwing hate\nYo I'm in a league of my own so what the fuck would I play for?\nSome next niggas almost slid in but didn't fit in\nNaw I ain't Maury Povich but who the fuck is you kiddin?\nThese big wig niggas throwing their bid in\nTry not to show stress, I guess the flow is protested like a sit in\nI told my niggas we would get in\nBut that ain't even half the battle\nStay behind like a shadow or you catapult\nNow if I had a ladder or now even if I had a rope\nI'd climb that motherfucker to the top and never let it go!\n\n[Chorus: Nas (Sampled) & J. Cole]\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for dead fucking presidents to represent me\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for dead fucking presidents to represent me\n\n[Verse 2]\nHeaven or hell, you choose, freedom or jail, you lose\nI can't stop, I'm as hot as the devils shoes\nOvercame a low life status to blow like Gladys\nAhead of my time like I live my whole life backwards\nI'm nothing like these ho-like rappers\nMy whole life practice to be the one\nWhat's it like to be LeBron\nThey calling you the saviour, so much pressure but you deal with it\nThe weight of the world on your shoulders but you still lift it\nIll with it for real, lil nigga from Ville that real niggas can feel\nNobody taught us how to cook still niggas a grill\nNo Foreman, try not to call them ladies bees but them hoes swarmin\nNow honey, aye is it destiny or is it money you're feelin\nHeard rumors of a deal and now you thinkin a million\nPardon my paranoid mind but I'm starin in the mirror livin in fear that things a never be the same\nNo one left for me to blame but myself cause I asked for this\nHeaded for fame but in my brain, hey can I last in this?\nAye five years I'll probably laugh at this\nTry not to let it wear me out like a bad bitch with fashion sense\nI keep it fresh while these wack niggas rehash and shit\nJackin styles you know, ski mask and shit\nI pass these niggas, they tryna do it how these other niggas did it\nI'm tryna live it how no other nigga ever lived it\n\n[Pre-Chorus: Nas (Sampled) & J. Cole]\nI'm out for dead fucking presidents to represent me\nDead fucking presidents to represent me\nI'm out for dead fucking presidents to represent me\nDead fucking presidents to represent me\n\n[Chorus: Nas (Sampled)  & J. Cole]\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for presidents to represent me (Get money)\nI'm out for dead fucking presidents to represent me"}], "artist": "J. Cole"}