{"artist": "Doughboyz Cashout", "songs": [{"title": "Cut From A Different Cloth", "album": "We Run The City Vol. 4", "year": null, "image": "https://images.genius.com/23fae754ab1f3586489a22a2472df3be.500x500x1.jpg", "lyrics": "[Hook: Payroll Giovanni]\nHave you ever seen a hundred grand?\nStacked in a duffle bag?\nHave you ever seen coke, nigga?\nOr look down at yo wrist and seen it froze, nigga?\nWe cut from a different cloth\nWe cut from a different cloth\nLame nigga get lost\nThere's no comparison\nWe cut from a different cloth\nWe cut from a different cloth\n\n[Verse 1: Payroll Giovanni]\nStones all in my big face\nShining all in your bitch face\nI make due on my sick day\nEveryday a get rich day\nYou niggas square like a brick shape\nNever seen no brick, though\nNever had no crack spot, but you\nRap about that shit, though\nSippin dime on my patio\nWith a slim chick with a fatty, though\nReminiscing about old days, when I hit rocks\nIn my old J's\nHad a dope spot before a mustache\nWhen I had a Coupe, you had a bus pass\nI stuff bags while you cut grass\nShe made you wait, I don’t fuck fast\nAt a hotel with no bitch, though\nJust a lot of work and my pistols\nMy cuz, though, tryna get flow\nAfter this, though, Imma get low\nServing killers all in the trenches\nSpotted at the club, jumping out the Benz\nI was in the game when you was riding bitches\nStaring at caine through my Cartier lenses\nY'all ain't from my pedigree\nUsed to flip amphetamines\nDid dirts and my bezzle clean\nThat's real dough with that metroline\nHalf these boys ain't selling things\nUnless you count selling dreams\nWe do it here, we lost niggas\nCan't fuck with us\nOur cloth different!\n\n[Hook]\n\n[Verse 2: Doughboy Roc]\nI don't play games,  so don't sike me!\nYeah, you rap and get tats, but you ain't like me\nAnd we made 100 on set and runs\nCame home bought seven guns\nMook already has six, nigga\nAll we drop is classics\nYou tripping, girl, you fucking with the hell, bitch!\nDoughboy Roc, ask around, they'll tell you that I melt shit\nGot dogs in this state free Memphy and his friends\nThat light skin doing braids got a black ass doing dreds\nI strap mines i dump mines I be on that real shit\nFuck some punch lines like Bron Bron when it's crunch time\nSo calm down, got a dozen of them choppers, each got a hundred rounds\nAnd if I got it going to get it swear its gonna get ugly\nMy grandaddy a gangsta, shout out to Buggy\nYou front my niggas hunt\nYou don't pump the shit I pump\nYou don't do the shit that I do, BYLUG the fucking crew!\n\n[Hook]\n\n[Refrain]\nWhere your watch at? where yo chain at?\nWhere your coupes at?\nWhy you lying in your raps wit yo lame ass?\n\n[Verse 3: Big Quis]\nBeen balling nigga why hate been riding foreign since MySpace\nRep the D in the right way how you say you real and your ice fake?\nAsk around boy I been a fool been rocking Gucci since middle school\nThis chain I'm wearing got 20 carats got bitches staring like I'm in the news\nYou actin like you getting money that ain't your car that's your uncle shit\nYou know the real before the deal our ice alone was a couple bricks\nAin't drove the whips that we crashed, fucked the hoes that we smashed\nBought the ice that we cashed I’m tired of being on humble shit\nKid got a new chain on pay got a new chain on\nRoc got a new chain on that muthafucka just came home\nI’m getting money never been bummy\nThese niggas hating cause they always on me\nWe been winning can't see the difference\nThen you got to be a goddamn dummy BYLUG\n\n[Hook]"}]}