{"artist": "G Herbo", "songs": [{"title": "Fight or Flight", "album": "Welcome To FazoLand", "year": "2014-02-17", "image": "https://images.genius.com/4af4495189941f1b86086adb14c093ca.300x300x1.jpg", "lyrics": "[Verse 1]\nMy momma used to say, \"Never quit, baby that just don't exist!\"\nAnd just cause she'll suck ya dick, don't mean you could trust the bitch!\nI'm just giving you the real\nCause I don't come from Hollywood or Beverly Hills\nI'm from where mothers don't care and babies get killed\nWhere you gotta rob and go steal for stomachs to fill\nAnd it's hard for a young, black nigga like myself\nWhere the police compare oneself with everybody else\nSo that means if you yourself they think you're everybody else\nSo I don't care 'bout no one else\nJust my family and myself\nYeah, that's just my way of thinkin'\nIn my city and it helps cause no one gives a fuck\nAbout me, you, or nobody else\nAnd it's cool\nI'm still livin' over East\nWe still chillin', sippin' lean\nSmokin' swishas, stackin' hunnits to the ceilin'\nWe still winnin'\nWe just fightin' to survive\nIt's a shame I gotta ride with this nina on my side\nThey used to say...\n\n[Chorus]\nNever quit, never give in\nHey, don't you quit\nNever give in\nNever quit, never give in\nHey, don't you quit\nNever give in\n\n[Verse 2]\nLil Herb, I'm the actual\nHottest young nigga comin' out the murder capital\nSpit lyrics that when real niggas hear it they just capture you\nBut don't let it capture you\nThey like, \"Fuck who went before you, who the hottest after you?\"\nThat actual answer is unanswerable\nHaters try to answer, but who the fuck was askin' you?\nAnd it's true, I'm the truth\nI just grind, no excuse\nAnd broke niggas I won't stoop to a level low as you\nI gotta get it, I ain't down with it\nAll the shit I did, I can't slip\nSo I'm dying with it\nAny nigga try and get it!\nThey try to be with it\nSee me? I gotta be with it!\nWon't ever leave my squad, but I can't put my family in it\nMy family in it, can't confuse family with business\nNO LIMIT MB, we'll fuck ya family nigga\nIt's family dinner, break bread everyday\nPray my circle never break\nAnd I can hear my momma say, \"Look...\"\n\n[Chorus]\nNever quit, never give in\nHey, don't you quit\nNever give in\nNever quit, never give in\nHey, don't you quit\nNever give in"}]}