{"songs": [{"image": "https://images.genius.com/ed02a6df16ee132adc1cdcc9547fd61a.500x500x1.jpg", "year": "2013-10-11", "title": "Legends Never Die", "album": "Serial Killers Vol. 1", "lyrics": "(Intro)\nLegends never...\n\n(Ea$y Money)\nEver since the day I got old\nThey told me I would never make it this long\nNow years after the day that I’m gone\nThey’ll be playing my songs and my name will live on\nWhen everybody thought that I was insane\nI stood tall after all that have came\nSo let the good Lord call on my name\n‘Cause I done rep I’m working the game\n\n(Hook-Ea$y Money & Xzibit)\nWe never die\nNever die!\nWe just live on\nLive on, live on\nWe never die\nNever die!\nWe just live on\n\n(Xzibit)\nYea, I’m a cowboy steppin clear\nWith a pistol pointblank behind your right ear\nYea because fear is not a option\nSay my name 3 times – I appear with a shotgun\nNow what you motherfuckers want from me?\nI’m from the gutter, I’m medicated by drug money\nTake everything, there ain’t nothing else you could take from me\nNever break from you niggas, swinging until my hands bloody\nTime flies, dreams die, people lose faith\nTryna hide behind a lie with a straight face\nBuzz kill, boots on the ground ‘cause I’m straight lace\nFuck love, never needed love in the first place\n\n(Hook-Ea$y Money & Xzibit)\nLegends never... die...\nNever die!\nWe just live on\nLive on, live on\nWe never die\nNever die!\nWe just live on\n\n(B-Real)\nSo many doubted so little time\nSo many haters coming to mind\nLater for waste ‘cause moments to bind\nBecause I would never look back and regretted this fucking life\nAround, I do it for the ones who supported the dream\nAnd making every second of their life as a part of my team\nIt take the heart of a lion, the crown of a king\nBring up a throne and you keep the frame in mind but you singing my songs\nStill serial kill the bullshit, spit up the thrills\nAnd if you will, you’re not the killer, for real I be dealing\nThe run of the mill, with no skill, top Billy the dun\nThat’s why I reply\n\n(Hook-Ea$y Money & Xzibit)\nLegends never... die...\nNever die!\nWe just live on\nLive on, live on\nWe never die\nNever die!\nWe just live on\n\n(Xzibit)\nYea, I was born to live forever\nI am legend, gather my thoughts and line em up together\nFeel like pulling my own Beretta put it to my head\nBetter days ahead, left for dead with my daily bread\nYea, I’ll cause a slaughter in your tabernacle\nI storm your castle and guillotined your queen\nLos Angeles to the rotten apple\nI’m playing tackle\nGiving concussions cold like going to war with the Russians\nStarving like my ribs and my stomach is touching\nI’m filthy as a pig, all this drinking and fuckin\nIt’s just my destiny til the death of me, stand and deliver\nConfessions of an unapologetic serial killer\n\n(Hook)\nLegends never... die...\nWe just live on\nWe never die"}], "artist": "Xzibit"}