{"songs": [{"title": "Had 2 Gat Ya", "image": "https://images.genius.com/4497d9f9098a8438168e2e20c2a9f9a4.722x710x1.jpg", "lyrics": "[Brotha Lynch Hung]\nI'mma let it be known\nThat I'm with the foe so nigga you know it's on\nOil my chrome cause I got murder in my blood and in my chromosone\nFor the fact that I take none, pack a gun in my dang-a-lang\nThat nigga that nigga that gang bang no never that nigga that claim\nYeah, I'm a nigga eating Jesus brains\nI got the evil in my muthafuckin back and in my muthafuckin veins\nWearing my black to creep\nMomma told a muthafucka he'd be dead in a week\nSo nigga what? load me like a tre five sev\nPass the dank takin dead body's to the blood bank\nAnd while I hook em up proper\nI got them swallowing in my loaded heart stopper\nPOP! POP! the trigga fiend, the niggas spleen\nPlus the barrel on my muthafuckin nine, lookin plus\nThat nigga that nigga that runs them mothafuckas back\nI got you fiendin for a nigga like you fiend for crack\nCause its like that (mo wiggita then a nigga get might packed???)\nCause in the 4 you know never know you better gat right back\nSo niggas know us brothas can't go out like that\nSellin my momma the crack, watch yo back cause(You know I had to gat ya)\n\nChorus: repeat 4X\n\n(Yeah, you know I had to gat ya)\n(187 on a) (nigga)\n\n[BLH]\nYeah, picture your death\nThat nigga that siccness\nFigure to sick this, foo\nThat nigga that rips\n(??? look at that nigga ) that siccness drops\nAnd as my trigga goes Pop! Pop! Pop!\nThat niggas be ducking from the buck shot\nSee, fuck it when the gun drops, you know its in a hoes cot\nSo there it goes, not the average nigga\nThe baby killa, (???a rabies)\nDealin that nigga maybe killin that nigga that smooth way\nThat mothafuckas ain't shit to me\nWhite nigga, black trigga cracks every mothafuckas back\nLate in a day, fools used to get they squabs on\nThe blood gang deuce-nine Creek Mobb zone\nRunnin a mothafucka like a pit bull, loadin up that clip tool\nBut stealin on muthafuckas like a clepto\nLet no, other muthafuckas raise yo hood\nHalf the mothafuckas smokin niggas like wood\nGot locked up with they cock up, some other niggas asshole\nBut atleast my niggas had enough heart to blast though\nNow the deuce ain't deep like 86\nI'm solo, might as well pin me on a crucifix\nThe deuce-fo' age, baby killin athiest\nFor the funk right back, cause (You know I had to gat ya)\n\nChorus\n\n[BLH]\nSame ol fool, that nigga deep load, what up\nAin't no doubt who runs the muthafucka\nCause every cut I drop is like a muthafuckin main course\nHella niggas eat that's why I make so many corpse\nCause when they hear that nigga that nigga that siccness drop\nMy nine millimeter goes Pop!\nMy sign going to creep them\nNightmare creeper millimeter meter\nLock up, main corpse, spirit your brain\nGot niggas killin niggas, just because I'm rappin insane\nSomething like a Manson mind, my nigga Triple Sicx\n(i got em doing a devil dance of mine)\nLeavin em only one chance to die and niggas wanna used a Glock\nNiggas wanna go to heaven but don't want to get shot down\nYeah, with my .38 snub nose\nI got niggas crawlin to me tryin to pack me for the hella holes\nLettin loose like Antonio Montana\nWith a Uzi and I'm kickin em with a 12 gauge Moss'\nAnd I'm off, psycho like I'm Michael Myers part six\nBrotha Lynch, rippin his arms off up the crucifix\nAnd when I grab my 9 millimeter gun, puttin' it to your back\n'Cause I don't know how to act so (You know I had 2 Gat Ya)\n\nChorus 2X\n\n(You Know I had 2 Gat Ya)", "year": "1993-11-08", "album": "24 Deep"}], "artist": "Brotha Lynch Hung"}