{"songs": [{"year": "2013-10-25", "album": "S.C.O.T.", "image": "https://images.genius.com/84085e89142cb021fb85634062e40a2b.700x700x1.jpg", "title": "One Of A Kind", "lyrics": "[Intro]\nYou know I'm not an arrogant cunt but you know I run this shit ayy\n(Oh yeah fucking oath)\nHey\nYeah this is Scott, sickest cunt out there\nHa ha, you dig?\n\n[Verse 1]\nTell 'em Nebs, I ain't fucking round when in this booth\nEnd careers if the beef is worth it you can choose\nAin't a rapper in this country done what I done\nAnd no one helped me at the start and look how far that I've come\nCheap imitations, imitating on the greatness\nThat I'm making makes me switch it up on beats that Nebs is baking\nThey needed me to save the scene, so tell em that the saviours here\nI never had to act a part a street cunt, think I made it clear\nPlus my brain is not the same when the fame come\nIt's like the only way to get away from it is take drugs\nStill I'm the greatest here, tell ya man to fall back\nThe raw rap in store that is selling more than raw crack\nUndeniable, my rhyming skill and the swaggers hot\nPlus my shit be popping they just angry 'cause you faggots not\nYour missus' hands in her pants when she hears the voice\nThe only reason bed time comes and you think that you got her moist!\n\n[Hook]\nRunning and I'm never stopping, gotta go and chase the dream\nAs long as I'm here breathing there is nothing they can take from me\nOne of a kind, yeah I'm one of a kind\nAnd I'm never gonna stop, can't run out of time\nRunning and I'm never stopping gotta go and chase the dream\nAs long as I'm here breathing there is nothing they can take from me\nOne of a kind, yeah I'm one of a kind\nAnd I'm never gonna stop, can't run out of time\n\n[Verse 2]\nLeave 'em all for dead 'cause I'm way too far ahead\nWhen this drops check the ARIA charts, I'm there again\nSo confident on top of it, you rapping like the opposite\nBut somehow you try bite my style gronk it's just so obvious\nGot back up by an army, 'cause disasters like tsunamis\nWhy you rapping 'bout your barbies? We make money, why we laughing?\nLook at all this gold I got, rapping like it's all I got\nMy rapping is attacking all the acting, got the balls or not?\nDidn't think so man, they watch and copy\nIf you gonna do that shit, try do it not as sloppy\nDon't think it was a fluke, I made it man and it's pure skill\nIn the booth about to pop another fucking bluer pill\nSo who the man this year? I'm the fucking man this year\nKers one I'm the man for the next ten\nThen you witness history, you looking back like thank fuck\nBefore our time the only reason why you gonna hate us?\n\n[Hook]\nRunning and I'm never stopping gotta go and chase the dream\nAs long as I'm here breathing there is nothing they can take from me\nOne of a kind, yeah I'm one of a kind\nAnd I'm never gonna stop, can't run out of time\nRunning and I'm never stopping gotta go and chase the dream\nAs long as I'm here breathing there is nothing they can take from me\nOne of a kind, yeah I'm one of a kind\nAnd I'm never gonna stop, can't run out of time\n\n[Verse 3]\nAussie rappers suck my dick, pull down the zip politely\nThis ain't a fucking trick, this rapping shit is just for my team\nTell 'em all to give it up sincerely from the sickest cunt\nThe same mind set as 2Pac when he wrote his shit to \"Hit Em Up\"\nFuck 'em all ABK UF\nThat's all that's left, marked for death, if they even half a step\nI mean it man we ready, chop ya body to confetti\nEnergetic, you're pathetic, like me trying to past a medic\nCool man I rule, make 'em drool, I'm the shit son\nMaking 50K off a track, tell me which one\nYou decide you should probably suicide\nIf you got the choice to ride and you ain't choosing my side\nYou try ya best to keep up in a chokehold that's a sleeper\nMake you hit the legs like when I used to hear the fucking beeper\nWit a bunch of shit dacked, trying to make some quick cash\nNowadays I sit back and make it when I spit tracks!\n\n[Hook]\nRunning and I'm never stopping gotta go and chase the dream\nAs long as I'm here breathing there is nothing they can take from me\nOne of a kind, yeah I'm one of a kind\nAnd I'm never gonna stop, can't run out of time\nRunning and I'm never stopping gotta go and chase the dream\nAs long as I'm here breathing there is nothing they can take from me\nOne of a kind, yeah I'm one of a kind\nAnd I'm never gonna stop, can't run out of time\n\n[Outro]\nYeah\nThis is Kerser\nGovernment name, Scott\nSickest Cunt Out There\nAnd I can quite comfortably say\nWe're running Aussie rap\nThis is it now, this is all that's left\nKerser, Nebs, S C O T\nIt's time to harden the fuck up\nWe found a solid jam (laughing)\nCheck them charts brah, we gonna bully all you motherfuckers\nMe and nebs floating to the top yeah fuck\nYo-yo-yo-yo-yo-yo-yo!"}], "artist": "Kerser"}