{"songs": [{"year": null, "album": "Fire and Glory", "image": "https://images.genius.com/dd8fc4f20fab691cb0bc8e71f35767a4.300x300x1.jpg", "title": "Freshie", "lyrics": "[Intro]\nIt is eight o'clock here in Kingston, Jamaica. The Kingston police have issued an APB out for wanted criminal Rostacious Johnson. He has last been seen headed towards The United States of America or Canada. If you have any info, please call us right away\n\n[Hook: Ro Dolla]\nI was a gangsta\nLivin' my life hustlin' on the block, with no food to eat\nRollin' with them prankstas\nSettin' the streets on fire with the heat\nI had no choice as a gangsta\nLivin' my life hustlin' on the block, with no food to eat\nRollin' with them prankstas\nSettin' the streets on fire with the heat\n\n[Kardinal Offishall]\nAiyyo, stepped off the Air Jamaica at the age of 10\nLanded at the Dot airport, coming out of May Pen\nRaised by his grandmother, until his real mother\nCould send for the youth, and reunite, aiight?\nSo now he's growin' up exposed to the ghetto limelight\nNo pops (nope) plus his moms got to work nights\nMoonlightin' as a janitor, to make bread for the two\nAll the while he's growin' up, runnin' with a crew\nIt started off tryin' to make a little extra creamer\nBut then it turned to pushin' rocks, savin' for the Beamer\nTold his moms he got a job workin' in the trade\nAt a local grease monkey, that's how he's gettin' paid\nAnd that's how he got the deal on the black man wagon\nMoms thought it was suspect, but she's still braggin'\nTo her kin about \"How he come home and grow right\"\nAll the while he's wildin' out, money starts pilin' now\nThe next crew saw the flex and start red eye\nJealous of the way them niggas hustle\nTil he get a little muscle, uh huh, bust a bunch of shots\nThere my nigga laid, really holdin' down the block\nThat nigga gangsta\n\n[Hook: Ro Dolla]\n\n[Kardinal Offishall]\nAiyyo, 6 weeks in Intensive, holding on to prayers\nOn the 7th, he was back on his back in the west wing\nHis man dem came visiting, in his ear whispering\nHow the block was hot, and there was nuff shots whistling\nAnother week and he was back on his feet\nDischarged, ready to get back and hit the street\nMoms was still working overtime, clueless to the real\nAbout how his son was living in the hood packin' steel\nPushin' coke - no joke - them cats wanted retaliation\nWord got back, about who led the slaughter\nOne nigga named Blaka, real name Elroy\nNext day *gunshot* what happened to that boy?\nFor the next three months my man stayed on the low\nTold his moms he wasn't workin' cause the garage was slow\nBut just as he tried to resurface on the strip\nSomeone on the turf called 222-TIPS\n\n[Hook: Ro Dolla]\n\n[Kardinal Offishall]\nNow my man locked up, and had to sweat inside a jail\nCause his man done fled the scene, and moms couldn't afford bail\nThe trial came and went, his mother cried \"Discrimination!\"\nSaid the judge didn't know her son\nHe said he knew him too well, he'd seen him there before\nTurned the cheek prior, now he feels he's on fire\nGot burned by the same little quick-talkin' freshie\nDoesn't know how to act, so now he got to go back\nMy man got dipped, sent right back to May Pen\nGrandma didn't want him now, family wouldn't take him\nHe thought about work, but he said \"F that!\"\nHe got a fake passport and just came right back\n\n[Hook: Ro Dolla] x2\n\n[Outro]\nIt is a sunny day here in Jamaica. Unfortunately we have bad news to report. Rostacious Johnson was apprehended in Canada, and suffered fatal wounds to the back of the head. Rest in peace, my brother\nAnyways, in tomorrow's news, Capleton will be singing..."}], "artist": "Kardinal Offishall"}