{"songs": [{"lyrics": "[Intro]\nI like this Asian Doll\n\n[Verse 1: Asian Doll]\nLil’ Asian Doll with the flow\nGet more head then a barber, on the low\nThese bitches mad, cause they man wanna blow\nIt ain’t my fault, I got that crack, I’m a pro\nStop talking numbers if it ain’t real\nI leave it scarred on the beat, bitch it don’t heal\nI’m independent, I can drop, how you can’t tell?\nName ringing bells, I don’t fuck with hoes, these bitches fake as hell\nPussy soaking, badder beach\nYou housewives need to eat another peach\nWhy bitches dissing missing Asian, another reach\nDeepthroat dick, all you bitches eat\n\n[Chorus: Nicki Minaj]\nAyo, I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nI mean I been Storm, X-Men been formed\nHe keep on dialin' Nicki like the Prince song\nI-I-I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nAyo, I been north, Lara been Croft\nPlates say Chun-Li, drop the Benz off\n\n[Verse 2: Asian Doll & Nicki Minaj]\nDrop a bitch off, hit her with a saw, I’m the hardest doll\nAsian Doll flyest of them all, princess, born a star\nOwn style, own bars, bitches bite, I write it all\nThey thinking I’m a prime, sneak dissing, I fight ‘em all\nI’m that one bitch, spit real shit\nGave my ex nigga to that lil’ bitch, I’m too rich\nHeard ‘em talking foul, pop my twenty, turn it down\nYou a hoe around town, real bitch I bring the sound\nI ain’t never sold my pussy cause my pussy is the best\nIf he saying I’m a rookie, that’s why I make these niggas sweat\nDamn he ate me like a gusher, I ain’t even give him sex\nWrap my legs around his head, like the Cuban on his neck\n‘Beat my chest, bitch it’s King Kong!\nI’m the reason bitches yelling that they shoot\nBitch it’s King Kong!\nBut the pretty chopper hanging out that coupe\nGo against me, but I’m solid, and you wonder why you lose\nTime to wake up, hit the snooze, follow the leader, you in school\nBitch it’s King Kong!\nNicki really taught me how to do finesse\nThis is King Kong?\nBitches grew up fans, now they wanna sweat\nThrowing shots, but it ain’t aiming, put that vest up on your chest\nHow many championships?\nI don’t know, but we ain’t count, unless a check\n\n[Bridge: Asian Doll & Nicki Minaj]\nThey need bitches like me!\nThey need real ass street bitches like me who gon’ smack the shit out of one of you dumb ass bitches\nY’all disrespect me, fuck is you talking about?\nChun Li!\n\n[Chorus: Nicki Minaj]\nAyo, I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nI mean I been Storm, X-Men been formed\nHe keep on dialin' Nicki like the Prince song\nI-I-I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nAyo, I been north, Lara been Croft\nPlates say Chun-Li, drop the Benz off\n\n[Outro: Nicki Minaj & Asian Doll]\nI come alive, I, I'm always sky high\nDesigner thigh highs, it's my lifestyle\nI come alive, I, I'm always sky high\nDesigner thigh highs, it's my lifestyle\nI need a Mai Tai, so fuckin' sci-fi\nGimme the password to the fuckin' wifi\nQueen of teens surfboard, tryna ride the wave\nEdges laid, Asian paid, click my pic and save\nI’m still the badder bitch, if I had a bald fade\nReal bitches back in style and we come in all shades!\nYou know these niggas on the low\nGoofy nigga wanna skeet, he tryna blow", "album": null, "year": "2018-04-20", "title": "Chun-Li", "image": "https://images.genius.com/358d62089cec98f4b4697c2387a4afce.1000x986x1.jpg"}], "artist": "Asian Da Brat"}