{"songs": [{"title": "How I Know", "album": "Just Cause Y’all Waited", "year": "2018-03-29", "image": "https://images.genius.com/12036111d33dad5181371a05389e3641.1000x1000x1.jpg", "lyrics": "[Chorus: Lil Durk & Lil Baby]\nHow I know if you die for me?\nKnow if you shoot for me?\nHow I know if you still love me? yeah, yeah\nHow I know you won't steal from me?\nKnow you won't kill for me?\nI know that you still love me, yeah, yeah\nHow I know you won't turn on me?\nFeel like the love phony, gotta keep my gun on me, yeah, yeah\nHow I know you won't die for me?\nKnow you will ride for me, just don't ever lie to me, yeah, yeah\n\n[Verse 1: Lil Baby]\nThought I'd never see the day that you would switch up\nAin't no hard feelings, I'm wishing you good luck\nI can't lie, I miss your touch, you got that good love\nI put diamonds on your hand, don't hold your fist up\nHow I know if I get jammed you gon' keep it real?\nHow you gon' say that I ain't solid, I ain't ever squealed\nIf I die today give it to my son, ain't writin' no will\nAll these thoughts inside my head, it got me poppin' pills\nRunnin' with my steel, there's some niggas in the rear\nIf they get they chance they will\nBut I ain't worried, I'm gon' kill\nI'm gon' drill every one of them\nWe gon' kill every one of them\n\n[Chorus: Lil Durk & Lil Baby]\nHow I know if you die for me?\nKnow if you shoot for me?\nHow I know if you still love me? yeah, yeah\nHow I know you won't steal from me?\nKnow you won't kill for me?\nI know that you still love me, yeah, yeah\nHow I know you won't turn on me?\nFeel like the love phony, gotta keep my gun on me, yeah, yeah\nHow I know you won't die for me?\nKnow you will ride for me, just don't ever lie to me, yeah, yeah\n\n[Verse 2: Lil Durk]\nOne time to cross out Migo, he gon' take your life\nSo I don't understand how Plies ran off on the plug twice\nAnd you can't remix none of that lean if it's not cut right\nAnd you can't say you super trill 'cause you ain't cut right\nSex her once then kick her out 'cause I don't nut twice\nThe way that A$AP died don't sit in my gut right\nAnd if we ever find the killer then he must die\nAnd I'm always low on niggas, I don't trust high\nI don't know if you'll ride, I don't know if you gon' slide\nI don't know want me to die, I don't know if it's your pride\nAnd if it is then hide it then\nMe and Lil Baby do it for the trenches, we gon' ride with them\n\n[Chorus: Lil Durk & Lil Baby]\nHow I know if you die for me?\nKnow if you shoot for me?\nHow I know if you still love me? yeah, yeah\nHow I know you won't steal from me?\nKnow you won't kill from me?\nI know that you still love me, yeah, yeah\nHow I know you won't turn on me?\nFeel like the love phony, gotta keep my gun on me, yeah, yeah\nHow I know you won't die for me?\nKnow you will ride for me, just don't ever lie to me, yeah, yeah"}], "artist": "Lil Durk"}