{"songs": [{"title": "Dat $tick (Freestyle)", "year": "2016-09-27", "album": null, "image": "https://images.genius.com/3776e90f3b0ee5c9cdd497c0dfd360e1.1000x563x1.jpg", "lyrics": "[Intro]\nUh, uh, something, something aye\n\n[Verse 1]\nI say it's Imperial, Curry is the sickest individual\nSpitting liquid swords with no need for Bobby Digital\nGenius, I'm mischievous, I'm the king of this\nWhen it comes to features, I'm the only nigga breathing, bitch\nKilling tracks, bitch, I got the Glock to your weave\nTried to put me in a box, but yet I bob and I weave\nYou can have Bob's Burger, if you talking 'bout beef\nKnow some niggas with heat, between they shirts and they briefs\nHollow tips catch a favorite, niggas copy and bleach\nBoy you think you street, yo ass barely a guard rail\nCall me young Yu-Gi-Oh! 'cause Curry play his cards well\nNinja turtle bullets, so you know that be a hard shell\nIf them other few niggas try to harm me\nThen that just proves that I'm a one man army\nNever hated people that be putting in work\nAll you underground niggas just competing for dirt\nEarth, I'm down to it which explains why I'm blessing bitch\nThe greater the power I possess, that’s an exorcist\n\n[Interlude]\nAh shit, I fucked up, I fucked up\nBut aye, can we keep going?\n\n[Verse 2]\nMy nigga came through, rolled a spliff\nAnd I'm finna go and lift into the heavens\nI don't really give a fuck, I'm lucky number seven\nIf I shoot a number seven then there's gonna be eight\nI don't really give a fuck, all you rappers get ate\nLike meals, nigga, I want mills, nigga, you chase deals\nNigga, I just killed everything that you own\nI don't really give a fuck, I'm gone\nI got Dat $tick, 'cause I got that shit\nLike I'm living in the woods, I'm a bear in this bitch\nYeah, I fuck really bare in this bitch\nI don't really give a fuck, what I'ma wear in this shit\nLike uh, ya'll know everything that's going on\nI don't really give a fuck, nigga, I'm just flowing on\nLike water rapids, nigga, I'm just rappin'\nI don't really give a fuck, I'm about to go in, ah!"}], "artist": "Denzel Curry"}