{"songs": [{"title": "Flyboy Status", "album": "Ahead of My Time", "year": null, "image": "https://images.genius.com/2423f27676ca06cba1ebacca71115bf0.500x500x1.jpg", "lyrics": "[Lil' Flip]\nHey pimpin' (hey pimpin')\nThem diamonds you wearin' (which ones?)\nThem yellow diamonds (oh these?)\nThey ain't real yellow diamonds homie (how you know?)\nThem treated diamonds playa, haha\nI'm baaacckk\n\n[Hook]\nI'm a fly boy\nI'm a I'm a fly boy\nI'm a fly boy\nI'm a I'm a fly boy\nI'm a fly boy\nI'm a I'm a fly boy\nSave all the talkin' cause you blowin' my high boy (Aye, aye, aye)\n\n[Verse 1]\nYou see my paint (you see my paint)\nNigga you see my whip (you see my whip)\nOn twenty-siiixxes, bitch you know it's Flip\nI got my stunna shades (I got my stunna shades)\nI got my game tight (I got my game tight)\nI fly G-5's, I don't have to change flights (haha)\nOh yes, the chest got VVS (VVS)\nSo many drugs I can open up a CVS (come get it)\nGucci flip flops (Gucci flips flops)\nGucci tank top (Gucci tank top)\n'Fore my patna Screw I pour a lil' drank out (rest in peace)\nWho flyer than me? (you?)\nWho higher than me? (stop)\nI'm gettin' head like Shawna ??\nI'm supplyin' the streets, it ain't no denyin' a G (nope)\nLook I'm the first one (wit what?), wit platinum on his teeth cause\n\n[Hook 2x]\n\n[Verse 2]\nWhen I pull up all them hoes be\nTryin' to leave the club\nWill they smoke some bud wit us?\nGood girls like thug niggas\nPo' nigga, I dare any one of y'all to try me\nEven when I take a shit that pistol right by me (which side?)\nI'll be, grindin' til they put my body in a tomb\nScreens in my whip, bigger than the ones that's in your living room (yeah)\nCandy paint shined up, twenty cars lined up (ooohh-weeee)\nAnd they all cost bra (how much?) triple your house dawg (haha)\nCall me Flip or 'Flipperachi' call me anythin' but broke\nAll I need is V12 nigga I can cook coke (yeah)\nI'm the number one fly boy you peepin' out my chain (bling!)\nI'm at the strip club, makin' hundreds rain cause\n\n[Hook (2x)]\n\n[Verse 3]\nYo my Chevy ridin' high boy\nTwelve hundred dollar shades on my eyes boy\nTwelve thousand dollar blades on my ride boy\nFour 18's got me soundin' like a quire boy, haha\nI slow the car down and speed it up\nHey chump, I slowed your broad down and beat it up, haha\nSo don't be playin' wit a G shawty\nCause I can make you disappear for a G shawty\nThey always talk about the kid in the street shawty\nThe kid got more beef than the meat market, let me park it\nCause I don't trust valet wit my keys\nLet's make a bet for 50 large, who flyer than me? nobody\n\n[Hook]"}], "artist": "Lil Flip"}