{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "3 A.M.", "album": "Perception", "year": "2017-10-06", "lyrics": "[Chorus]\nCall me at 3 a.m\nTellin' me that I could be the one, oh, yeah\nMaybe I was in love from the outside\nGuess I ain't what you want no more\nIf you got someone else inside of your life\nYeah, that's good for you, I'm happy\nYou got someone that makes you smile\nMore than I ever did, yeah, that's great\n\n[Verse 1]\nListen, why they always tryna hurt me?\nWhy they always tryna burn me?\nI swear to God, shoulda never even happened in the first place\nOnly time you hit me's on my birthday\nWish that I could tell you that I got a lot of love for you\nWish that I could tell you I got trust for you\nOnce you put some money in the bank you understand that the money ain't enough for you\nYeah, look what it's done to you\nEveryone's your friend when the music start buzzin'\nI'm closer to the people that were there when I was nothin'\nTryna talk about the past but you always changin' subject\nI ain't good at shakin' hands but I'm good at holdin' grudges\nWhy you always frontin', huh? Always tryna play wit' me (woo)\nYeah, whatchu gotta say to me?\nI am not a slave to the people writin' checks to me\nThis is destiny, they ain't never had respect for me, ah!\n\n[Chorus]\nCall me at 3 a.m\nTellin' me that I could be the one, oh, yeah\nMaybe I was in love from the outside\nGuess I ain't what you want no more\nIf you got someone else inside of your life\nYeah, that's good for you, I'm happy\nYou got someone that makes you smile\nMore than I ever did, yeah, that's great\n\n[Post Chorus]\nI don't like that!\nI don't like that, no! (I'm really sorry)\nI don't like that!\nWhy you actin' shady on me?\nWhy you always tryna-\nWhy you always tryna play, I ain't got a clue right now\nEverything I ever wanted was someone, I'm watching them go\n\n[Verse 2]\nYeah, you said I'm scared for you\nLemme say a prayer for you\nHope you never make it to the top just to find out there ain't nothing there for you\nAnd now the people tryna tell you that they care for you, never cared for you\nFirst time that you ever told me that you loved me, I know that was probably weird for you\n'Cause I didn't say it back, I'm so caught up in the past, and I know I wasn't fair to you, woo!\nMaybe I don't see the world like I'm s'posed to\nMaybe I'm just living in a nightmare\nMaybe all the people that I thought that I was close to\nWouldn't be around if it wasn't for my career\nYeah, this third record doesn't pop off, how many people 'bout to drop off?\nI know how it works, if the record doesn't work, then it's my fault\nI'm in a room full of fans singin' my thoughts, my God, woo!\n\n[Chorus]\nCall me at 3 a.m\nTellin' me that I could be the one, oh, yeah\nMaybe I was in love from the outside\nGuess I ain't what you want no more\nIf you got someone else inside of your life\nYeah, that's good for you, I'm happy\nYou got someone that makes you smile\nMore than I ever did, yeah, that's great\n\n[Post Chorus]\nI don't like that!\nI don't like that, no! (I'm really sorry)\nI don't like that!\nWhy you actin' shady on me?\nWhy you always tryna-\nWhy you always tryna play, I ain't gotta clue right now\nEverything I ever wanted was someone, I'm watching them go\n\n[Outro]\nYeah, yeah, I'm done with that\nReminiscing 'bout all we had\nWe got nowhere to go, you got all the things you wanted\nGot everything that you wanted\nYeah"}], "artist": "NF"}