{"songs": [{"title": "Old Soul", "lyrics": "\"Feels like that I've been here before\"\n\n[Verse 1: Akala]\nI don't wanna romanticize another time that's gone by\nBut I have to be honest and tell you that\nI'm an old soul, so some Nina Simone\nIs gonna put me in the zone better than some talk of Patron\nOr Crystal or Pistols it's oh so tedious\nI want to hear some tunes like Strange Fruit with meaning in\nI want to hear the wolf howling and the waters muddy\nI want it to dance, want it to make me cry but also funny\nI'm feeling that inner city blues, Marvin's the town crier\nSome Soul II Soul, some Aswad with Dub Fire\nSome Gregory Isaacs, a little touch of Dennis Brown\nI love the soul but nothing moves me like that Reggae sound\nJamaican blood, sound system upbringing\nOur black American cousins are big influences on the songs we are singing\nIt's all Soul with Africa at it's base\nSo Fela and Masakela, Makeba play from the same place\n\n[Hook: Asheber]\nI remember, I remember\nDo you remember?\nI remember\nI remember, I remember\nCause I'm just an old soul\nI'm just an old soul\nI'm just an old soul\nDo you remember?\n\n[Verse 2: Akala]\nI'm quite sure the right chords are a cure for disease\nIf music is the food of love, let us feast\nAn open appetizer, whose songs cannot retire\nThe legend Stevie Wonder comes bursting out through the wire\nThe main course, of course, is Hendrix and Marley\nJames Brown will get down and start the after-party\nAfter dark is only Pendergrass\nGrab a partner and do the slow-grind wallpaper dance\nThere is something about the old sound on the analogue\nAnd real musicianship that we just can't carry on\nOr maybe I just am an old soul romanticizing\nAbout the good old days when Miles Davis was a commercial artist\nWhen singers could sing soul\nAnd had a message\nAnd if you saw them live they sounded better than the record\nBut how would I know I was not even on the globe\nWhen most of these artists rocked\nSimple, I'm an old soul\n\n[Hook: Asheber]\n\n[Bridge: Asheber]\nOld souls, old souls\nOld souls, old souls\nAnd it feels like\nAnd it feels like\nLike I've been here before\n\n[Verse 3: Akala]\nAre you like me, are you an old soul?\nDo you only like music from before you were born?\nWhen you're listening to records\nOr contemplating the questions\nDo you ever get the feeling that you've been here before?\nDo you find yourself talking about the kids these days\nThen have to remind yourself about your actual age?\nIf it's only Reggae or Soul since you were five years old\nA little Blues, a little Jazz\nYou know you're an old soul\n\n[Hook: Asheber]", "year": null, "album": " The Thieves Banquet", "image": "https://images.genius.com/acaf5708a18660f33365d7d63e4937b7.500x500x1.jpg"}], "artist": "Akala"}