{"songs": [{"image": "https://images.genius.com/c97dc009b7b1ff0982e14799c3dd3042.375x375x1.jpg", "lyrics": "[Intro]\n(Yeah)\nCan you feel it?\nDon't answer that, that was a rhetorical question\n(Ahem) rhetorical (rhetorical)\n(unhhh)\n\n[Verse 1]\nForever life been never nice, we expedite the process\nAnd every night I get advice, cause life is way too complex\nHeaven's lights are hella bright, ironic how that came to be\nBut can't you see? This angel speaks\nShe's saying the place is safe for me\nI told \"wait for me,\" the make believer normally disguise\nTransform before your eyes and glorifies euphoric highs\nThe morning rises and I'm fast asleep\nSomewhere off in the master suite\nHaving dreams of Latin queens and nasty freaks\nMy mind, it wanders to places yonder and even farther\nWhen I'm sleep walking I'm Stephen Jobs or I'm Peter Parker\nA genius author, a Jesus preaching just to feed his daughter\nThe weed to spark up, yeah he's a goner, fuck these primadonnas\nI'll always wonder what happened 3000 years ago\nI like to toy with the idea that we really know\nIs what I do important in the grand scheme of things?\nIn my head these dreams are dreamt, trust me we are kings\n\n[Hook]\nI'm wearing a blindfold, like where did the time go\nI know you hear me out there, give me a sign though?\nI'mma follow you wherever your mind goes\nBaby I'mma follow you wherever your mind goes\nTake me away girl, somewhere they won’t be\nHold you closely, look at me, don't speak\nWill you follow me wherever my mind goes?\nSo will you follow me wherever my mind goes?\n\n[Verse 2]\nI'm just trying to make it all make sense\nAs you hypothesize on how to monetize and take advantage of\nAll the time “we fall behind, get lost in this Aquarium\nAmerica, the standard of vanity when the camera's up\nWe become celebrities, distract from the hysteria\nConfessions that I have and curiosity about life and death\nMost of us will never understand it, we just like the quest\nRead about the meaning of dreaming and all its messages\nSedatives that take me to God, witness his fetishes\nWe all in search for substance, that drugs you pain and numbness\nCircumstances advance the second chances for this beloved\nI wish I could tell you that I didn't see this coming\nBut I'm ready for it all to end, die before tomorrows trend\nYour life, it all depends on dollars spent and knowledge gained\nDarkness on the brain, lost inside, forgotten days\nLife, it works in such mysterious ways\nAll these years that I pray, hope you hear what I say\n\n[Hook]\nI'm wearing a blindfold, like where did the time go\nI know you hear me out there, give me a sign though?\nI'mma follow you wherever your mind goes\nBaby I'mma follow you wherever your mind goes\nTake me away girl, somewhere they won’t be\nHold you closely, look at me, don't speak\nWill you follow me wherever my mind goes?\nSo will you follow me wherever my mind goes?\n\n[Outro]\nWherever my mind goes\nI'mma follow you wherever your mind goes\nWherever your mind goes\nWill you follow me wherever my mind goes?\nI'mma follow you wherever your mind goes\nI'mma follow you wherever your mind goes\nWill you follow me wherever my mind goes?\nWill you follow me wherever my mind goes?\nI'mma follow you wherever your mind goes\nI'mma follow you wherever your mind goes\nWill you follow me wherever my mind goes?\nWill you follow me wherever my mind goes?\n[Instrumental]", "year": "2013-06-18", "album": "Watching Movies With the Sound Off", "title": "Aquarium"}], "artist": "Mac Miller"}