{"songs": [{"year": null, "title": "No Idea", "image": "https://images.genius.com/ece3d210dc35f31beebaff89c8ab6f36.996x1000x1.jpg", "lyrics": "[Intro (Overlapped with Bridge): Saigon and (DJ Whoo Kid)]\nYeah, it’s real.  Fuck, man.  In the hood, man (Fort Knox!).  It’s from the heart, man.  It’s from the motherfucking heart, man (Abandoned Nation!).  Don’t ask me some shit about it on record (Volume One!).  Nah’m saying?  Fuck niggas, man.  We live in the hood, motherfucker.  If I can get on record and talk about all the shit I’ve been through, man.  Niggas, look in my fucking eyes, man.  I’m 25 years old, man.  Look at me, man.  Fuck is going on, man?\n\n[Bridge 1 (Overlapped with Intro): Sample from Fantastic Four - “My Love Won’t Stop at Nothing”]\nIf you could tell me\nWhy did you take your love\nWhen mine was here to stay?\n\n[Verse 1: Saigon]\nI’ve been through war, been through fear\nMy whole life, in and out of prison for years\nBut who cares?  Do you care?\nWell then hug me and tell me that you swear\nI doubt Jesus even love me anymore (Nah)\nI don’t he has since I was a little boy\nDog, I had to walk before I crawled (Why?) ‘cause\nWe had mice, roaches, and rats patrolling our floor\nBy fourteen, I’m holding a four.  Most niggas\nMy age was getting whoopings ‘cause they stole from the store\nBut me?  I’m on the ave, being cop-car-spotted\nPistol on my waist with a pocket of narcotics\nNobody could tell me nothing.  Far as sex\nI was already fucking when my dick was the size of my bellybutton\nLord knows I got some praying to do\nTry and sit and listen to what I am saying to you (Go ‘head)\n\n[Hook: Jovan Dais and (Saigon)]\nYou don’t know what I’ve been through\nIn my life (No) in the past few\nYears\n(Nigga, you have no fucking idea) I’ve\nHad my share of ups and downs\nMade some mistakes (Yup, and I’ve...)\nAnd I shed some\nTears (You hear?)\n(You have no fucking idea)\n\n[Bridge 2: Jovan Dais] (x2)\nOh\nLord, please\nWatch over me.  Days\nStrange, can’t change\nMy destiny\n\n[Bridge 3: Sample from Fantastic Four - “My Love Won’t Stop at Nothing”]\nYou’re my love\nHe took yours away\n\n[Outro: DJ Whoo Kid and Saigon]\nDJ Whoo Kid: Whoo Kid, Just Blaze.  Y’all can’t stop it.  Saigon.   Whoo!\nSaigon: Y’all little dusty-ass niggas in the hood.  Nigga, get your fucking weight up, man.  Get that crack out your sock, nigga, go get a real hustle.  Stupid motherfucker", "album": "Abandoned Nation"}], "artist": "Saigon"}