{"artist": "Bow Wow", "songs": [{"album": null, "title": "For My Hood (Explicit)", "year": null, "lyrics": "Cash Money\nAyo!\nI do this for the hood!\nAyo!\nSean Kingston, I put that on my hood\nThis my life!\nYeah! Boweezy! Khaled\nAyo! Uh huh\nBoweezy I put that on my hood\nEveryone in the hood like me!\nPut you hands up\n\nChorus- Sean Kingston\nThey see me lookin good\nThey sayin I done changed\nAin't a member on the block no more\nBut I'm still the same\nSo that's not the case I'm busy gettin money on tour\nMan I put that on my hood, hood, hood\nMan I put that on my hood, hood, hood\nI'm the same man\n\nVerse 1- Bow Wow\nThe boy doin numbers\nI do it for colombus\nI put my city on the map now go locate a compass\nThey sayin I done changed, attitude ain't the same\nI guess this the negative effects that money brings\nI'm still the same shot from buck town\nAin't nothin changed but the label, I'm reppin cash money now\nGot love for the hood, I'm still givin back\nAnd sum still hate, well boy I'm used 2 that\nUh, and I got my mom a bigger house\nDo it for the people they the only ones I care about\nInstead they make me out to be somethin that I'm not\nSayin that I only care about hoes in my cash knots\n\nChorus- Sean Kingston\nThey see me lookin good\nThey sayin I done changed\nAin't a member on the block no more\nBut I'm still the same\nSo that's not the case I'm busy gettin money on tour\nMan I put that on my hood, hood, hood\nMan I put that on my hood, hood, hood\nI'm the same man\n\nVerse 2- Bow Wow\nThru the recession I was helpin people thru the drought\nThis is for my people who is locked up and ain't gettin out\nAnd bart came home, no more phat time\nWhile he was locked up I made sure that his daughter fine\nYea, now that's real people, they got people registered 2 vote now how much realer do it get?\nAnd I love givin back, puttin smiles on kids faces\nPayin off tuitions makin sure they get an education. (it ain't nothin)\nI would never turn my back on y'all, sis we used 2 window shop but now we tearin down the mall\nNow I'm puttin up position to helpin make a difference\nI know I mess up sometimes so I ask God for forgiveness\n\nChorus- Sean Kingston\nThey see me lookin good\nThey sayin I done changed\nAin't a member on the block no more\nBut I'm still the same\nSo that's not the case I'm busy gettin money on tour\nMan I put that on my hood, hood, hood\nMan I put that on my hood, hood, hood\nI'm the same man", "image": "https://images.genius.com/614882a739214b1f5b83cfac37dadea2.800x800x1.png"}]}