{"artist": "Pimp C", "songs": [{"album": "Long Live The Pimp ", "title": "Friends", "image": "https://images.genius.com/674567be14a7f8b6e0eee4a149f04bd4.220x220x1.jpg", "lyrics": "[Intro: Juicy J]\nBe careful, cause you can't trust these so called friends out here\nThey be jealous\n\n[Hook: Pimp C]\nWhat about your friends will they stay on they grind?\nWhat about your friends will they be around?\nWhat about your friends will they let you die?\nWhat about your friends?\nWith friends like that I don't need enemies\n\n[Verse 1: Pimp C]\nI had a lotta niggas that was down with me\nOr should I say a lotta niggas hang around with me?\nBut when I took my fall\nI found out I really didn't have many friends at all\nWhen I was out there rollin' in the Benz and ball\nMy momma used to get a lotta telephone calls\nNiggas tryna see how we was, I had a buzz\nBut all that shit stopped when I got popped by the fuzz\nA couple niggas kept that shit true indeed\nBut not the ones I used to bail outta jail and feed\nWe used to smoke weed and get drunk off brew\nI went to TDC, nigga, I couldn't find you\nYou couldn't find me that's what you told yourself\nBut you couldn't tell that bullshit to nobody else\nBut when they asked you how I was doin', you told 'em I was cool\nKnowin' you ain't talk to me since I went to the pen, fool\nNo pictures, no conversary, money to eat\nAnd now you think it's all good, cause I'm back on the streets\nI'm back on these beats and still blowing like the wind\nBut these is the niggas that we call friends\n\n[Hook: Pimp C]\nWhat about your friends will they stay on they grind?\nWhat about your friends will they be around?\nWhat about your friends will they let you die?\nWhat about your friends?\nWith friends like that I don't need enemies\n\n[Verse 2: Juicy J (Pimp C)]\nIn these streets and these traps, nigga you better be strapped\nNiggas out here plottin' be prepared to shoot back\nNigga ain't no rules, nigga it ain't no love\nA nigga put a knife in your nigga, could be your blood\nKill a nigga over money, kill a nigga over drugs\nThey killing niggas over hoes be careful who you fuck\nOne false move and you fucked and out here on that bullshit\nCatch a fuck niggas and they hit his ass with the full clip\n(What about your friends)\nNiggas ain't real\nNiggas ain't trill\nNiggas be jealous\nOver the hoes, over the whips, over the crib\nNiggas be broke, pockets be hurt\nNigga be stressed\nNigga be learning\nWhoop your friend, you gotta murk 'em\nPayback it's closed curtains\n\n[Hook: Pimp C]\nWhat about your friends will they stay on they grind?\nWhat about your friends will they be around?\nWhat about your friends will they let you die?\nWhat about your friends?\nWith friends like that I don't need enemies\n\n[Verse 3: Nas]\nIt's so ill,  pop no pills\nStraight Henn' a toast to Pimp C , now on to fake friends\nTina best friend husband fucking her cousin\nHer cousin, she think her baby by Tina husband\nBut Tina had a miscarriage by me\nTen months later, Tina had a baby, it's deep\nSoon the whole hood to be related\nLike an African tribe, misplace mis-situated\n13, she's already ripping\nSo whoever daughter she is, you about to be in grandpa position\nAnd pot, no pot to piss in\nMan, stop and listen\nYour man from the sand box, he on the stand snitching\nHis John Hancock got 'em lamb chops, what is miss'in?\nHome exonerated cause he cooperated\nI peep the bullshit coming, the streets taught me\nAnd in abundance, now my circle a hundred\n\n[Hook: Pimp C]\nWhat about your friends will they stay on they grind?\nWhat about your friends will they be around?\nWhat about your friends will they let you die?\nWhat about your friends?\nWith friends like that I don't need enemies", "year": "2015-10-19"}]}