{"songs": [{"album": "B.O.A.T.S. II #METIME", "image": "https://s3.amazonaws.com/rapgenius/UMG_cvrart_00602537507474_01_RGB72_1500x1500_13UAAIM70647.1200x1200-75.jpg", "title": "Extra", "year": "2013-09-06", "lyrics": "[Hook: 2 Chainz]\nI got extra, I got extra\nI got money, I got work\nFar as hoes, I got a plethora\n\n[Verse 1: 2 Chainz]\nI get money, 12 gauge shotty\nI don't like nothing but hoes and tattoos on my body, yeah\nI got extras, you want some?\nFucked your girl on accident, that's a hit-and-run\nHeaven's sake, it's been a hell of a day\nI pray for all my niggas with a federal case, damn\nOkay\n\n[Bridge: 2 Chainz]\nSouthside, I got all this\nSnake skin on my hat, albino\nI'm rich, like Lionel, I get head like rhino\nI'm ridin' on my rivals, survival, bible\nRifle, bullets, for y'all niggas!\n\n[Hook: 2 Chainz]\nI got extra, I got extra\nI got money, I got work\nFar as hoes, I got a plethora\n\n[Verse 2: 2 Chainz]\nI just went on the run, 100 piece for a show\nI just had a threesome for three weeks in a row, yeah\nLast name Chainz, first name 2\nI'm T.R.U. to it, you know how I do it\nI get head 'fore I screw it, first thing I do\nYeah, you know I'm stuntin' cause I'm gettin' to the money\nPut it in her tummy, pu-put it in her tummy\nHit her with the morning dick, ooh, I ain't pissed yet\nYeah, I rep the A, the only thing I flunk is piss tests\n\n[Bridge: 2 Chainz]\nSouthside, I got all this\nSnake skin on my hat, albino\nI'm rich, like Lionel, I get head like rhino\nI'm ridin' on my rivals, survival, bible\nRifle, bullets, for y'all niggas!\n\n[Hook: 2 Chainz]\nI got extra, I got extra\nI got money, I got work\nFar as hoes, I got a plethora\n\n[Verse 3: Rich Homie Quan]\nOkay, I'm rich, like Homie\nI got yo bitch, from my homie, 2 Chainz, what it do?\nIn the living room, full of that paper\nUsed to have a little room, now that's a house and an acre\nMy partner in the kitchen room, and he fucking with the bakin'\nChopper lift ya to the moon, nigga, fuck y'all thinking?\nIf I get her in the room, she gon' suck my babies\nTryna work her moves, tryna trap me with a baby\nIf you owe me money then, real soon, you better pay me\nMe and 2 Chainz just like shoe strings, strapped like laces\nAy, and I'm too clean, riding in a car from the 80s\nRich Homie, no new team, boy, I'm a star like Macy's\nBoy, I thank god I made it, got a couple broads in Decatur\nI'm in the fast lane driving in the car, going crazy\nAnd I got your main dame, yeah, the one you call your lady\nFirst million dollars, most important thing: saving\nAnd if you wanna book me, hit my agent\nI got eight pounds in a old car\nOn old Nat in front of skate town on the\n\n[Bridge: 2 Chainz]\nSouthside, I got all this\nSnake skin on my hat, albino\nI'm rich, like Lionel, I get head like rhino\nI'm ridin' on my rivals, survival, bible\nRifle, bullets, for y'all niggas!\n\n[Hook: 2 Chainz]\nI got extra, I got extra\nI got money, I got work\nFar as hoes, I got a plethora"}], "artist": "2 Chainz"}