{"artist": "Anybody Killa", "songs": [{"title": "Attitude", "image": "https://images.genius.com/8a7a13e5aff4ea229c97fc6e44c5aae7.1000x1000x1.jpg", "album": "Mudface", "lyrics": "I just don't understand how everyone in this world, all of a sudden, got so hard\nCould it be me or just does it seem like certain people try and take it too far\nI don't know but when the time comes, motherfuckers better show respect\nAnd if they don't then you best believe, this warrior going to shave some heads with a dull hatchet\nAin't no fooling around, I'll beat the shit out of your bitch and dump shots in your moms house\nI got the urge to ball up my fist and start swingin, so since I'm in a bad mood, bring it\n\n[Chorus]\nWhat's with the attitude?\nWhat's with it, what's with it\nWhat's with the attitude?\nEverybody's entitled to have one\nWhat's with the attitude?\nWhat's with it, what's with it\nWhat's with your attitude?\nEverybody's entitled to have one\nI'm aggravated, feeling depressed, it's like my hearts beating too damn fast\nPeople in my face makin it muddy from the dirt that they talk and I need to clean it off\nSometimes I need to get away to another place away from all the hate\nSo I can sit back and relax and try to clear my head\nInstead of staying in the hood and leaving bodies for dead\nI'm so damn emotional, and I think that it's time for me to take control\nInstead of fast pace I'm gonna put it in slow mo\nSo you will understand when I say don't test me ho\n\n[Chorus]\nLots of people say I'm a kind hearted guy\nI am but some of ya'll should be terrified\nWhy, guess it all boils down to trust\nBefore a motherfucker really starts to self destruct\nAttitudes, everyone's entitled, but some of ya'll take it to a level that's vital\nMood swings, Jekyll and Hyde, aggravated individuals upset with life\nWho wants try to calm me down when I'm in a state of mind that wants to let off rounds\nGuess I'm tired of just playing it cool, so every now and then I get an attitude\n\n[Chorus (til end)]", "year": "2008-11-25"}]}