{"artist": "Warren G", "songs": [{"year": null, "lyrics": "Warren G: This song is dedicated to all my people who's (that was) caught up in hurricane Katrina. Louisiana, Mississippi, Alabama. We Ridin' Wit'ch Y'all. U Know what I'm sayin'. I feel your pain, we gonna make it through this y'all. Yeah. Come on\n\nWe here today then gone tomorrow's got me singin' a Marvin Gaye song and make me want to holla so I hop in my Impala just to cruise, shake my blues off, hard to follow, hard to swallow what they sayin' on the news. Good lord, it's a crazy world, watchin' cops puttin' cuffs on a fie (five) year old girl. Racism, Racism got our babies in the system, Mom and Daddy's in the prison, that's intentional division. They don't want to saw you now they keep the family divided. Keep it gangsta keep it real, that's all I hear, but I don't buy. When it's revolution time, all these fools will keep quiet like \"Shhh!\" You can you can hear a pen drop. Can go to one tent cuz I might get popped, people shootin' on the freeway, when will it stop? But stay strong cuz the rain don't last and push the … price of gas\n\nChorus: Don't let no one, no one get U down. Cuz if they do, if they do, I'll be around\n\nChorus: Don't let no one, no one get U down. Cuz if they do, if they do, I'll be around\nB-Real: What's really good? Wus really hood? Wus really goin' on? Open your eyes and ears wide. Wipin' all your tears from all the lies and fears. People get blinded here, let me define it clear. You gotta cross the bad. Tell us the thoughts and prayers someone you getting lost … homie the cost ain't fair…\n\nSnoop Dogg: I try to do right, I don't wanna do wrong I'm doing better things I wanna live long. Ain't there too many fools out there harder than me, I love football so much man I started a league. Oh what a pity, it's made for the inner-city; it used to be dark, but now the parks real pretty. Little boys outside throwing footballs, in tha hood y'all. Hey Snoop Dogg, how could y'all; Let 'em pass instead of blast the foot ball field is a class, and I'm the teacher, teachin' my lesson, shotgun information no smith and no Wesson. The haters keep stressin', and everybody wanna ask me the question. Hey Boss Dogg, how u feel now, u helping out the kids and they still hatin' on you, wow!\n\nOutro (Warren G): U know what I am sayin'? There a lot going on this world. But we gotta keep pushin', and movin' improvin'. Yeah. Even though we got these hard times, we still gotta keep in steady u know, keep pushin'. So I want y'all tah ride wit' me and cha cha tah this, Come on. Dedicated to my people out there strugglin'. Single parents, 9 to 5, steady hustlin', college students workin' hard to be somethin', anybody makin' somethin' outta nothin', dedicated tah my people on lock-down, to everybody lost somebody wish they still around, to all the solders fightin' for us on foreign ground. To one and all, turn the frowns upside-down!\n\nChorus: Don't let no one, no one get U down. Cuz if they do, if they do, I'll be around. (fades out)", "image": "https://images.genius.com/88d06e2416b1e25418599c77d27a1253.640x640x1.jpg", "album": "In the Mid-Nite Hour", "title": "Get U Down"}]}