{"songs": [{"title": "The Lovers Freestyle", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Verse: brandUn DeShay]\nI hope you're not wrong because dreams are often misinterpreted\nI was once a stencil, now a pencil because I sharpened it\nPut it to the college ruled paper\nDid my homework in the class where most of the kids in college drove for paper\nPut down your GPA and make me weigh it\nOn a scale of 1 to 4.0\nIt hardly seems fair\nTell me, what kind of major do I take up\nIf I dream of being on magazines and fly?\nThey'll shoot you\nThey got us programmed like computers\nThey wanna see ones and O's\nPut down the greats like Brutus\nPut on the tape like screw it, I don't need CDs\nCash, dollars, I don't even plan on having no seeds\nUnless they get in through a loft, food for thought\nAm I a big fish in a little pond or just food for sharks?\nI don't need to find out the hard way\nGo from number one in just a penny like Hardaway\nMy dad said God'll save what's meant for me\nAnd what's meant to be\nSo that's why I love sleep, so I can see it in my dreams\nStay up until 3 A.M., just playing my music\nChannel through God like my ceiling flouorescent\nRestoring faith to the fans like I'm Rasputin\nTeaching them to black, don't mean you've got to act stupid\nThe words are useful\nNiggas don't compare me to the humans, I am just\n​brandUn DeShay and that's all that I am doing, my purpose is not certain\nBut I'm certain that I will make waves like I'm surfing\nFind me channel surfing, no Pablo Picasso\nIf I'm not on your television, then that's a problem\nYou got me? I just want to make music\nMy only passion, why is it so hard to understand this?\nThis is what I'm doing, this is who I am\nComposing music until the day I am\nOne hundred and ten years old, matter of fact, with a ten-year-old\nThat grew up and had his own ten-year-old\nUntil I got tens of thousands of euros that I can give to charity and fluoros\nAs much as I can, I hope that you know\nMy soul and my passion is so true\nIt may be me and it's not so you\nSo don't give your opinion if I ain't ask for it\nI just want to do my thing, not get cash for it\nThey can pay me, but it's only going back to the people who need it\nThe people who breathe in this music who can't live without it\nIt's like carbon dioxide and oxygen, CO2, I can get\nWhatever I need, so whatever I bleed\nIs whatever you can take with you the day that I leave this earth\nThis body is worthless\nWhen I get to Heaven, that's when I'll be perfect\nAnd that's certain, my purpose is to\nLift up the lovers from the ground\nWhen all the fighters come around\nLike a hero, I can save you\nSo, what's happening, little boy?\nWhat you saying?\n\n[Outro: brandUn DeShay]\nYou want you a car?\nYou want you the girls?\nYou want you the money?\nYou want you the world?\nWell, good luck\nBe blessed\nI'm blessed", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}