{"artist": "Bas", "songs": [{"lyrics": "[Verse 1]\nCeelo with the G's\nPut the paper down, rake the leaves\nPiece of little weed\nNigga break it down, pick the seeds\nFiend, roll a swisher please\nNo promethazine, got amphetamines\nGot me on a devil lean\nSahara to the Gobi niggas know me to be hot as water\nSay, \"Trust me, he flows\"\nNot livin' for tomorrow, got no time to borrow\nBitch, I rep my borough\nYeah, trust me Queens know\nFuck a knight in shining armor, play for team No Daughters\nWhat this game has done taught us is \"Trust me, she blows\"\nStop makin' demands, bitch stay in your pocket\nShe eyein' my grands, bitch stay out my pocket\nShe eyein' my man, go ahead bitch rock it\nWe get it and split it, I never could knock it\nI look at the bar and I bet I could top it\n\n[Hook 2x]\nHundred racks just to drive off a lot, though\nScenic route just to dodge all the potholes\n20 racks at retail, isn't it?\nCause the devil's in the details, isn't it?\n\n[Verse 2]\nCeelo with the G's\nPut the paper down, rake the leaves\nHere's a lil' weed\nNigga break it down, pick the seeds\nFiend, roll a swisher please\nCause the mook it give me epiphany\nWhen hoes try to play me like tympani\nLike Mighty Kong, show me finer homes\nAnd designer stones, I want Tiffany's\nTold her find a clone, I know I'm kind of stoned\nNo trick bitch, you can't get wit' me\nCause I found my zone\nHad to put on a form, a good fit for me\nI seldom see myself in dreams\nI live this shit, no issues wit' my self-esteem\nTunnel vision, hear every station\nYo television, I failed to mention\nFrail attention in school, dog\nFailed attention, that rude boy\nFire lit by my crew boy\nTo acquire shit that I'm due boy\n\n[Hook]\n\n[Verse 3]\nFall back or pass through\nMatter fact, that nigga that gassed you was ass too\nSon, we gon' last like tattoos\nHo nigga get a glass shoe, why?\nYou can try it, but you can't high tie it\nThat shit weak and you can't fight fire\nI've been wired for days, out in London town\nI just lock shit down but I ain't got priors\nFeelin' like the best, nigga ain't that biased?\nFuck, try it straight to the head but I ain't Lem Bias\nFrom the ground up, to them telephone wires\nI hold down my city since Boys on Da Block\nThey gave me the key, I done blown all the locks\nCalled a committee, Queens in this bitch\nI hit all the spots, I brought all them with me\nNever been petty, don't got the time to be harboring envy\nI'm Fendi with mine\nGucci, bitch I got the plug, I got whatever you need, but I ain't got no love\nGot something to say? I don't hear it, I can't understand\nYour chatter don't make it across the Atlantic and I'm out in Europe\nI'm wit' all my niggas, I never take this shit for granted\nThe cards have been handed, deuces is wild\nDeuces is power, deuces like two hundred twenty two thou\nDeuces for love, Cut it though deuces I'm out\n\nI'm out\nI'm out", "image": "https://images.genius.com/a672d085777f459db6e18f274036a084.500x450x1.jpg", "year": "2014-01-28", "title": "Ceelo With the G’s", "album": "Revenge of the Dreamers "}]}