{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Not Your Man (Remix)", "image": "https://images.genius.com/e2498ebfb1bf16a3aa20d4001b9f08d1.1000x986x1.jpg", "lyrics": "[Intro: Thabo]\nI gave you my everything, guess that didn't mean anything\nTo you, cause I'm not your man\nAll the nights I spent with you not making love, just making do\nOoh, I'm not your man\n\n[Hook: Thabo]\nI'm swimming way out of my depth\nI'm in way over my head\nI wish she never showed me her bed, bed, bed\nI wish I could forget\n\n[Verse 1: Professor Green]\nWhat you take me for? What you take me for? Gave you everything\nYet you're still looking at me like I could've gave you more, gave you more?\nI ain't got anything left to give, somebody better notify my next of kin\nCause the stress is killing me, either you're feeling me or not\nEither way I ain't gonna be spending any more money on Tiffany\nI'm done with that, what do you think I rap for?\nTo buy you a bag? Are you mad? I'm a catch\nThe type of man women normally go mad for\nSick of love, sick of you, wish I was but I ain't though\nChanged like a boy in trance, anything you ask for\nI can't say no, don't give but you take loads\nThe dinners and taxis, I ain't ever been attracted to anybody as much\nI am in love with you so madly, ain't ever treated you badly\nBut no matter what I do, you're unhappy\nIs it cause my dick isn't as big as Dappy's?\n\n[Hook]\n\n[Verse 2: Dream Mclean]\nYoung nigga flexing, I never learn my lesson\nNo texting, just sexing, but it's headed the wrong direction\nShe's telling me she needs me more and more\nBabe I'm not your man, why you getting feelings for me for?\nI told her \"ain't no you and me, ain't no me and you\"\nI ain't with you, I ain't seeing you\nI just give you a seeing to\nOh, I never took you out for dinner, still I\nHad you on your knees looking like a sinner\nDon't pray for me, love, just praise the lord\nThat your boyfriend's got the money to pay for these jugs\nTitties ain't real but they're real big\nReal shit, make a broke nigga feel rich\nStill it's clear that I am\n\n[Hook]\n\n[Verse 3: Cas]\nShe's rich and I'm common\nWe ain't got much in common\nShe keeps giving me the \"come on\"\nShe tells her friends I'm a wrong-un\nWe don't speak the same language\nI might as well be foreign\nShe thinks that she looks like something hanging in the Tate Modern\nI can't help but look solemn\nShe got me burning plants that come from Holland\nStressing on rumours that I've read in the gossip column\nTryna be tolerant, chasing her around\nLike she's got a warrant\nIt's one way it's becoming apparent\nOr maybe I'm just paro'\nTold me her dad was a surgeon\nAnd she don't need eggs\nUnless they come from a sturgeon\nNo slag but she's no virgin\nShe been gassing me up but\nHer true character's emerging\nI knew this weren't love\nSo I'll just keep searching\n\n[Outro: Thabo]\nI wish I could forget\nWish I could forget\nI remember\nEverything\nI gave you my everything, guess that didn't mean anything\nTo you", "year": "2014-09-22"}]}