{"songs": [{"image": "https://images.genius.com/e8f9be6df36a6370218e9971d5cb2867.640x640x1.jpg", "title": "Grindin’ (Remix)", "album": "Lord Willin’", "year": "2002-08-20", "lyrics": "[Hook:  Clipse]\nWhat's the size of them rims on that car nigga?!\nCan they see that chain from afar nigga?!\n(Grindin!) whatcha game be like?\n(Grindin!) whatcha chain be like?\n(Grindin!) so whatcha name be like?\nMa, it don't get more ghetto than this\n\n[Verse 1: N.O.R.E.]\nSee I'm grimey-minded, you've been blinded\nLookin for a beat like mine you can't find it\nYou hear the Clipse and N.O.R.E. gotta rewind it (*BEEP BEEP*)\nNowadays you get on that run and get finded\nYou know I got guns, why you actin like my daughters?\nYou know I got sons\nNah, we won't speak fam, aiming atchya collar bone\nHitchya in ya cheek fam\n\n[Verse 2: Pusha T]\nFrom ghetto to ghetto to backyard to yard\nI sell it whip on whip, it's off the hard\nStand on that table, nigga, spit that Cris, nigga\nThrow that chair, make em recognize this: raw\nPlaya looka here, I'm great in the kitchen like Corning cookware\nUncle Jemima, with my braids wrapped\nAnd 3-minute recipes for cookin flapjacks\nCoke priced through the roof, SL flew the coop\nMy niece askin how my rims bigger than a hoola-hoop\nCuzzo, I make the block holla, take it back to childhood\nHow the scale teeter-totter, as I evolve\nWeight grew heavy, it was kinda like my buddy just fell off the see-saw\nBricks in the muffler, Mack-11 touch ya\nVirgina's hustler, I'm here motherfucker\n\n[Hook:  Clipse & Birdman]\nWhat's the size of them rims on that car nigga?!\nCan they see that chain from a far nigga?!\n(Grindin!) whatcha game be like? (MONEY!)\n(Grindin!) whatcha chain be like? (MONEY!!)\n(Grindin!) so whatcha name be like? (STUNNA)\nMa, it don't get more ghetto than this\n\n[Verse 3: Birdman]\nBig Tymin in a bubble-eye Lex, so fly (so fly! so fly!)\nI cook/cut crack, that's the sizing\nThem big, big rims on tires, and, we shinin\nMe and Weezy (holla holla) gold rims can't see me (holla holla)\nNew Benz on tweezies (holla holla)\nCadillac truck beamin, fo sheezy\n\n[Verse 4: Lil' Wayne]\nFrom hood to hood, bitch nigga, yard to yard\nHey I'm your \"herr-o\" cause I've got that heroin and that raw\nCheck the rims on my car\nNaw, don't check em, though, cause they stuffed with blow\nWeezy Baby, still in the kitchen\nJust put a little curve on the shit I'm pitchin\nYou need a hit, I'm Mark McGwire, come holla\nI watch the base at home, I'm umpire\n\n[Verse 5: Pusha T]\nGrin-ding, you know what I keep in the lining\nNiggas better stay in line when\nThey see a nigga like me shinin\nGrin-ding, you know what I keep in the lining\nNiggas better stay in line when\nWhen you see a nigga like me shinin (Grinding!)\n\n[Verse 6: Malice]\nTook 13 South, cross the Bay Bridge with it\nRing the triangle, dinner bell, come and get it!\nThe time in the kitchen, I dare not mention\nWhen my cell phone echo, I swear they listening\n'89 was my beginning, y'all\nYoung snot-nosed, pack yams in a tennis ball\nCops swore we was playing catch, no!\nWe was adding stretch, no choice, beg till you outta breath\nI ducked the Feds, they seen my weight grow\nStreets love Malice for his comeback ratio\nIf they got popped, we made sure they made bail\nCause if not, we be scared they gon tell\nPattycake, that's me, bake the pies\nPyrex, mixed that, scrape the sides\nGrindin, Glock-9 in the lining\nMay God strike a nigga dead if he lying"}], "artist": "Clipse"}