{"songs": [{"year": null, "title": "Out The Park", "image": "https://s3.amazonaws.com/rapgenius/1374583262_saigon.jpg", "lyrics": "[Verse One]\nWe seen Suge still thug in the game\n2Pac shoot a cop, beat the rap now we lovin' his name\nSeen Pun spit fat like his stomach\nHim and Joe packin' a Mac in the back of the black 600\nWe crowned Rakim the king\nCause he was callin' us 'Gods' and 'Earths', then niggas came with the bling bling\nIt was a very sad thing\nI seen an eight year old with cubic zirconia's in his ring\nCallin' some little girls \"bitches\"\nBy the look on they faces, it made that little simple word sound vicious\nI told shorty \"apologize\"\nWhen he said \"why?\"\nThe little girl with the braids she had started to cry\nI said, \"When you grow up, what you gon' be?\"\nHe said, \"A Pimp like C\"\nWhat happened to Trapper John MD?\nY'all fuckin' with the wrong MC\nI'm on a song with MJB cause none of y'all stronger than me\n\n[Hook]\nI love hip hop\nSet out in the park\nWe used to do it out in the dark\nAny place that said my name, it rang an alarm\nOtherwise known as little Saigon\nI love hip hop\nSet out in the dark\nWe used to do it out in the park\nEvery place that said my name, it rang an alarm\nOtherwise known as little Saigon\n\n[Verse Two]\nI said I did it again\nCame with a new way to spit it again\nAnd shit it again\nLyrically you can not compare a nigga to them\nI was on another level since The Roc was a pebble\nBack when the Aftermath was just an argument\nSince Das EFX/Def squiggidy squashed shit\nI was hot when you wasn't\nI was hot when Slick Rock shot his cousin\nBefore the fake thuggin'\nBack when niggas was still eatin' that other meat\nBack when Kid N Play was kickin' each other feet\nI was a snotty nosed kid runnin' the street\nJust kickin' my little raps with my son on the beat\nLike {beat boxing}\nI used to rap with no track, just a couple of that\nIn the huh, something turned me into a thug\nAnd to this day, I don't know what it was", "album": null}], "artist": "Saigon"}