{"artist": "Ice-T", "songs": [{"title": "Rap Games Hijacked", "lyrics": "Yeah\nToo many hardcore muthafuckas out here in this business\nAin't gettin their proper loot\nYou know what I'm sayin?\n(Right)\nCheck the technique\n(Aha)\n\n[ VERSE 1 ]\nEverybody talkin 'bout the way hip-hop ain't the same\nSuckers kidnapped the game\nI know the biggest in the business, and no joke\nHalf of em broke - and none of em smoke\n(Bust the facts, loc)\nI got into this hip-hop game\nJust to try to get a girl and get some light-weight fame\nThere'd never been no cash made in it\nSo who thought you could get paid with it?\nJust crash the club with my crew and then I'm outta there\nHit some skins, act bugged, that was a rap career\nThen Run-D.M.C. jumped the fuck off\nGot mad paid, word, kicked the bucks off\nThere wasn't many rappers out there rockin the streets\nWhen hip-hop was just cuts and beats\nI seen _Wildstyle_, dug the scene\nI wanna be an MC, rock, rock on - know what I mean?\nI started crashin rap contests\nShootin hardcore rhymes through wack MC's chests\nI signed on the lines of a wack contract\nDidn't even read it, fuck that\nThey gonna put my record out\nI'm gonna be large, know what I'm talkin about?\nIn the first 2 years I made about 300 bucks\nYo, this business sucks\nBut I got another chance and I came correct\nGot a lawyer and accountant, now my shit's legit\nBut many won't get no second chance\nAnd get fucked in this biz without a kiss or a dance\nThe game is to exploit young ghetto kids\nA straight pimp game, and there ain't no shame\nAnd the shit's gone too far\n100 hip-hop labels with all white A&R's\nThe game's hijacked\n\nThe rap game's hijacked\n\nLet me tell you how it happened\n\n[ VERSE 2 ]\nNow while every MC in the game\nWas worryin about a white boy gettin the fame\nThey dug out the foundation\nNow let me give a demonstration\nSay you got a dope group from the hood\nTalkin mad shit like they're up to no good\nYou take em to a label\nNow who sits behind the table?\nSome jewish muthafucka that don't know shit\nTryin to tell y'all what's a fuckin street hit\nThe shit's way off course\nIt's like me tellin Johnny Cash how to sing about his horse\nYou go on tour, the white agency says you're wild\nTone down your style\nThe radio jocks are all pop\nSo how the fuck this nigga know what shit to rock?\nThe shit that make your face turn green\nIs when you get dissed by a kidnap magazine\nI give a fuck about these muthafuckas\nI'm doin this jam to save my hip-hop brothers\nGet your paperwork straight, kid\nGet a lawyer and accountant just like I did\nDon't blow your dough, cause you will see g's\nBut this game has no guarantees\nLearn about publishing points, so you won't be blind\nLearn to read everything you sign\nThen you might have a chance\nIf not, bend over, pull down your pants\nThe game's hijacked\n\n(Yeah\nI don't they hear you, brother)\nYo, the rap game's hijacked\n(Word)\nI'm talkin 'bout a hijack\n(Say it one more time, baby)\nThe rap game's hijacked\nCheck it\n(Break it down for these niggas)\n\n[ VERSE 3 ]\nYou can go gold and still owe the record label cash\nYo kid, check the math\nLearn about the word 'recoup', troop\nAnd stop walkin round all hyped and souped\nYou ain't nothin but somethin to be used and worked\nYou ain't nothin but a sucker to be duped and jerked\nCause the fuckin record label don't love ya, pal\nThey didn't love ya on the street and don't love ya now\nThey're out to make an end, friend\nCause every dollar you make, they damn near make 10\nThey'll take you for everything you got\nOr else they'll sign you and they put on the shelf to rot\nI'm tryin to tell you what's up\nYou best to listen to this record even if you hate my fucking guts\nCause I just can't stand around and watch rap get done\nAnd my brothers ain't gettin none\nA nigga like me has gotta spit game\nNigga, get that cash flow. fuck that muthafuckin fame\nCause the white man's rippin us off once again\nReal hip-hop, my man\n\nFool, the rap game's hijacked\nYou need to listen, nigga\nThe rap game's hijacked\nNeed to play this record about ten times\nThe rap game's hijacked\nBlack people don't own shit\nThe rap game's hijacked\nCheck it\n\nR&B's hijacked\nBlack acting is hijacked\nJust being black is hijacked\n(Build, my nigga, build, my nigga)\nNigga\nStupid muthafuckas, they rippin us off\nYou better get a end..\nWhile the money's there, boy\nSilly-ass bitch runnin around with a gold chain\nAll niggas gotta get some real estate\nMuthafucka\nCome up\nFuck a bitch\nBetter get somethin you can own, asshole\nWhite man ain't givin up shit\nWord o' life\nAlthough I got a white engineer\nBut he's gettin minimum wage\nSo it's cool...\n\nYeah\nShit's been hijacked", "image": "https://images.genius.com/8794c719c37c748d62c37145c9babe1a.700x700x1.jpg", "album": "VI - Return of the Real", "year": null}]}