{"songs": [{"image": "https://images.genius.com/26cbfb78ac2d23d5f55e1141ac78978a.600x600x1.jpg", "year": "2007-01-01", "lyrics": "[Echoes]\nYo\nIt's a blind world\nYo\n\n[Verse 1]\nWhat is the world coming to?\nThe way I feel about my life right now is as if I don’t\nDo something quick that I might end up sick or homicidal\nAppreciate the blessings lingering in my vibrato\nAdministrate the lessons I’m singing in my recital\nGive it another title, call it the daily bread\nA special formula you fix to get the baby fed\nIt's brain food, that kind they ooze into a baby’s head\nSo he won’t be misled and when the baby’s dead\nBury him where they buried Terry just to grow a tree up\nThey cutting down the rainforest looking for space to free up\nAnd paving paradise with parking lots where buildings be up\nWhat is the world coming to? It’s really messing me up\nI got a brand new nephew in about a year\nHis lungs will be older than he is from the cloudy air\nNot saying cloudy like the molecules of H20\nI’m talking about the factories and fumes, whatever you know\nAnd every time I’m driving, I’m thinking \"I’m such a culo!\"\nMy contribution of pollution isn’t very cool though\nBut what am I to do though? I got to work to live\nAnd if I happen to be living where my working is\nThen will I ever learn to celebrate it through my kids\nOne day I’ll have 'em maybe but first I need a lady\nAnd will I give her all my time and will she really love me\nAnd will she give me shelter when the storms are up above me\nI know sometimes it be my personality is ugly\nAnd no amount of make up can make up for that\nBut know I recognize a game and when I’m up to bat\nI’m gonna put a little change into the thinking cap\nBecause to change the world you gotta change your mind\nWe can’t go on living wrong inside of the same design\nIt gotta be that you and me agree to make a difference\nPut up a canvas and manipulate the color pigments\nTo paint a portrait of tomorrow full of broader figments\nIn your imagination could you imagine nations?\nAt peace and harmony instead of genocidal warring\nWhere borders don’t exist and nobody’s considered foreign\nMother Earth is respected, animals are protected\nSociety perfected, Capitalism's rejected\nWhat is the world coming to? Almost the end of us\nAnd it’s the evils in the world today we tend to trust\nHow could we let the ashes crumble till they come to dust\nI guess that’s what is meant to happen if you blind enough\nIf you ready for what is coming, then come on with me\nFollow my voice, if you can hear it let the song lift me\nInto the graces of Heaven’s hugs, to learn love’s embrace\nAnd share with every beautiful face\nI place my right hand on my heart\nAnd say, let me be the start\nI pound my fist on my chest and request\nAllow me to be the test, and when I’m at my best\nI can make a Catholic priest confess\nCause guilt is worse than the parasite in his flesh\nAnd the flesh is weak but the pride is strong\nAnd it can make a little lie last a little bit longer\nThan it was ever intended by whom ever intended to send it\nWatch the evil manifest that it rendered\nAnd I hope you remembered your place in this\nLook up at a shooting star, go 'head and make a wish\nHopefully it will be granted by the gods\nAgainst all odds you’ll be wise enough to see through the facades\nWhat is the world coming to? I wish I had a answer\nBetter than seeing human beings as a living cancer\nBetter than being what I’m seeing hope I have a chance to\nRaise the consciousness\nPeace ya’ll and god bless\n\n[Echoes]\nBlind World", "title": "Blind World", "album": "Now-Again Re:Sounds (Vol. 1)"}], "artist": "Aloe Blacc"}