{"songs": [{"title": "Forest Whitaker", "image": "https://images.genius.com/3182079976c5fe2aecd2434bc3e4155b.899x899x1.jpg", "lyrics": "[Intro]\nAnd yo, whatever comes up comes out\nWe don't put our hands over our mouth\nAnd whatever comes up comes out\nWe don't put our hands over our mouth\nWhatever comes up comes out\n(Please mister bass-man lay it on me)\n\n[Verse]\nAyo, depending on the day, and depending on what I ate\nI'm anywhere from twenty to thirty-five pounds overweight\nI got red eyes, and one of 'em's lazy\nAnd they both squint when the sun shines, so I look crazy\nI'm albino man, I know I'm pink and pale\nAnd I'm hairy as hell, everywhere but fingernails\nI shave a cranium that ain't quite shaped right\nFace type: shiny, I stay up and write late nights\nMy wardrobe is jeans and faded shirts\nA mixture of what I like, and what I wear to work\nI'm knock-kneed and got a neck full of razor bumps\nI'm not the classic profile of what the ladies want\nYou might think I'm depressed as can be\nBut when I look in the mirror, I see sexy ass me\nAnd if that's somethin' that you can't respect then that's peace\nMy life's better without you actually\nTo everyone out there, who's a little different\nI say damn a magazine, these is God's fingerprints\nYou can call me ugly but can't take nothing from me\nI am what I am doctor you ain't gotta love me\n\n[Interlude]\nIf you would please turn in your bible\nTo beauty tips according to Forest Whitiker\nIn the third chapter of the third line\nBrother Ali would you please read to the choir for me son\n\n[Hook]\nI'mma be all right, you ain't gotta be my friend tonight\n(You ain't gotta love me)\nAn I'mma be okay, you would probably bore me anyway\n(You ain't gotta love me)\nI'mma be all right, you ain't gotta be my friend tonight\n(You ain't gotta love me)\nAn I'mma be okay, you would probably bore me anyway\n(You ain't gotta love me)\nI'mma be all right, you ain't gotta be my friend tonight\n(You ain't gotta love me)\nAn I'mma be okay, you would probably bore me anyway\n(You ain't gotta love me)\n\n[Outro]\nIt's Forest Whitiker y'all\nForest Witiker y'all\n\n\"Goddamn that boy can sing!\"\n\"You must be crazy.\"\n\"He good!\"\n\"You must be crazy.\"", "year": "2003-05-02", "album": "Shadows on the Sun"}], "artist": "Brother Ali"}