{"songs": [{"image": "https://images.genius.com/712c594b3f23a8d2ecd1d19175b138a7.200x196x1.jpg", "title": "Lookin’ Good to Me", "album": "Until the Day", "year": null, "lyrics": "(intro)\nSexy, brown, brother, sexy, brown, brother\n\n(verse 1)\nSaid I'm lookin' for brains, good looks and skills\nStep on up if you think you fit the bill\nI know what you look like but looks can be decieving\nLet me tap the brain so I can justify the reason\nWhy I'm callin' your name in my sleep\nWhy I memorised the tag number on your jeep\nI think your skills is something that I wanna check\nJudging by your looks and your thighs when you flex\nI been askin' around tryin' to figure what to do\nI know all the names of the fellas in your crew\nI ain't playin' no game I'm for real\nThe cards is on the table so I think you know the deal\nI bet you if I got closer you wouldn't doubt it\nEverything would be clear and not clouded\nBut I don't want to get deep yet\nI wanna make you feel all the love you can get, yeah\n\n(chorus)\nYou're lookin' good to me\nYou're lookin' good to me\nYou're lookin' good to me\nYou're lookin' good to me (w/ ad libs)\n\n(verse 2)\nI gotta come correct, make it clear, state me claim\nI want you to know you're drivin' me insane\nNow I don't wanna press, but I must confess\nThat it won't take long 'fore the lifting of the dress\nBut that's the ways, damn that I know you're fine\nPlus I gotta know that you're gonna be mine\nBut check this out, do you have any kids?\nEven though, I gotta say I wouldn't mind if you did\nBut with the kids comes the ex-girlfriend\nAnd then I wanna know, is she still tryin' to blend?\nCause I ain't one to be fightin' in the streets\nTryin' to duck flyin' bottles every time that we meet (from a dumb ass\nBitch)\nSo tell me when the coast is clear so I can get near\nFell your soft lips when you whisper in my ear\nCause ain't no reason to hide when you ride\nI wanna scream your name when you holding me tight (in the middle of the\nNight) yeah\n\n(chorus)\n\n(verse 3)\nSo what's up? Can we do this or not?\nI'm ready to give eveything that I got\nI'm waitin' on you to make the next move\nBut I hope you move quick or you're gonna knock the groove\nThe green lights flashin ready, set, go!\nEverything I think you need, yeah you know\nSexy little buggar, heart strings tugger\nTell me where she at cause I wanna thank your mother\nI don't give a damn about the rules that I'm breakin'\nStep onto your face, straight up with no fakin'\nYou're killing me softly so I'm pressed for time\nWhy don't you just say that you're gonna be mine\nCause ain't no other in the world for you lover\nAnd that's what you are, a sexy brown brother\nI'm keepin' it real so you know how I feel\nCause I want to be with you and just chill\n\n(chorus till fade...)"}], "artist": "Nonchalant"}