{"songs": [{"image": "https://images.genius.com/a751544c0f22d3c1f71ad541d8b0be66.1000x1000x1.jpg", "title": "Feeling Myself", "album": "The Pinkprint", "year": "2015-05-18", "lyrics": "[Intro: Nicki Minaj]\nYo, B, they ready\nLet's go\n\n[Chorus: Beyoncé]\nFeelin' myself, I'm feelin' myself, I'm feelin' my\nFeelin' myself, I'm feelin' myself, I'm feelin' my, feelin' my\nFeelin' myself, I'm feelin' myself, I'm feelin' my\nFeelin' myself, I'm feelin' myself, I'm feelin' my\n\n[Verse 1: Nicki Minaj]\nI'm with some hood girls lookin' back at it\nAnd a good girl in my tax bracket (Uh)\nGot a black card that'll let Saks have it\nThese Chanel bags is a bad habit\nI-I do balls, Dal Mavericks\nMy Maybach, black matted (Uh)\nBitch, never left but I'm back at it\nAnd I'm feelin' myself, jack rabbit\nFeelin' myself, back off\n'Cause I'm feelin' myself, jack off (Uh)\nHe be thinking about me when he whacks off\nWax on? Wax off\nNational anthem, hats off\nThen I curve that nigga, like a bad toss (Uh)\nLemme get a number two, with some Mac sauce\n\"On The Run Tour\", with my mask off\n\n[Chorus: Beyoncé]\nI'm feelin' myself, I'm feelin' myself, I'm feelin' my (Uh)\nFeelin' myself, I'm feelin' myself, I'm feelin' my, feelin' my\nFeelin' myself, I'm feelin' myself, I'm feelin' my (Uh)\nFeelin' myself, I'm feelin' myself, I'm feelin' my\n\n[Post-Chorus: Beyoncé]\nChanged the game with that digital drop\nKnow where you was when that digital popped\nI stopped the world\nMale or female, it make no difference\nI stop the world, world, stop—\nCarry on\n\n[Verse 2: Nicki Minaj]\nKitty on fleek, pretty on fleek (Uh)\nPretty gang always keep them niggas on geek\nRidin'-ridin' through Texas (Texas), feed him for his breakfast (Uh)\nEverytime I whip it, I be talkin' so reckless\nHe said \"Damn, Nicki, it's tight,\" I say \"Yeah, nigga, you right\" (Uh)\nHe said \"Damn, bae, you so little, but you be really takin' that pipe\"\nI said \"Yes, daddy, I do, gimme brain like NYU\" (Uh)\nI said \"Teach me, nigga, teach me, all this learnin' here is by you\"\n\n[Pre-Chorus: Beyoncé]\nI'm whippin' that work, he diggin' that work\nI got it, 36 of that real\nPanky full of that bounce baby\nCome get you some of that bounce baby\n\n[Chorus: Beyoncé]\nI'm feelin' myself, I'm feelin' myself, I'm feelin' my (Uh)\nFeelin' myself, I'm feelin' myself, I'm feelin' my, feelin' my\nFeelin' myself, I'm feelin' myself, I'm feelin' my (Uh)\nFeelin' myself, I'm feelin' myself, I'm killin' my\n\n[Bridge: Nicki Minaj & Beyoncé, (Nicki Minaj + Beyoncé)]\nCookin' up that base (Base), lookin' like a kilo (Kilo)\nHe just wanna taste (Taste), biggin' up my ego (Ego)\n(Ego, ego, ego, ego, ego, ego, ego, ego)\nRidin' through Texas (Ridin' through Texas) (Ridin' through Texas)\nSmoke it all off, talkin' bout that high-grade\nBaby hold up, I can kill your migraine\n(Migraine, migraine, migraine, migraine, migraine, migraine, migraine, migraine)\nRidin' through Texas (Ridin' through Texas) (Ridin' through Texas)\n\n[Verse 3: Nicki Minaj & Beyoncé]\nBitches ain't got punchlines or flow\nI have both and an empire also\nKeep gettin' gifts from Santa Claus at the North Pole\nToday I'm icy, but I'm prayin' for some more snow\nLet that ho ho, let-let that ho know (He in love)\nHe in love with that coco\nWhy these bitches don't never be learnin'?\nYou bitches will never get what I be earnin' (Uh)\nI'm still gettin' plaques, from my records that's urban\nAin't gotta rely on top 40, I am a rap legend\nJust go ask the Kings of Rap, who is the Queen and things of that\nNature? Look at my finger, that is a glacier, hits like a laser\nRrr! Drippin' on that work, trippin' off that perc\nFlippin' up my skirt and I be whippin' all that work\nTakin' trips with all them ki's, car keys got B's (Uh)\nStingin' with the Queen B and we be whippin' all of that D\nCause we dope girls we flawless, we the poster girls for all this (Uh)\nWe run around with them ballers, only real niggas in my call list\nI'm the big kahuna, go let them whores know (Uh)\nJust on this song alone, bitch is on her fourth flow\n\n[Outro: Nicki Minaj]\nHahaha, Rrrrrrrrrr!\nYou like it, don't'chyea? Snitches!\n(*Laughter*)\nYoung Money"}], "artist": "Nicki Minaj"}