{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Hook]\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(What you talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(That's what I'm talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n\n[Verse 1]\nMan, I ain't talking about the Prop, I ain't talking bout the Roc\nI don't talk bout mine, why will I talk on what you got\nWhat you talking bout? Cause you ain't talking about a lot\nAnd nigga, I'm from the ghetto so I talk about the block\nThey say in every rhyme that I talk about my Glock\nBut I squeeze for real and don't do no talking when I pop\n\"Punta maricon, cabron\" then you drop\nAnd I stand on my own, I don't be talking to no cops\nAnd I ain't talking for Chris and I ain't talking for Neef\nAnd I ain't talking for Sparks and I ain't talking for Free\nI ain't talking for Crakk, I got words for Oschi\nBut I ain't talking bout that, I'm talking for me\nB Sig the sequel, better yet, the prequel\nNever fear for war, this hog know I squeeze still\nFor that thing of ours till we D.I.E\nMy brothers keep it like Nino and G\nThat's what I'm talking bout\n\n[Hook]\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(What you talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(That's what I'm talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n\n[Verse 2]\nI'm a grown-ass man; I don't sit on niggas' laps\nAnd I ain't looking for no gifts outta Santa Claus' sack\nSanta ain't real, let alone is he black\nCatch him coming down my chimney and the Mac'll go Vrack!\n(You scared) Get a dog, get a cat\nI bet the cat put the tongue on you rats\nNiggas extend their hands, put their hands in their lap\nScared to face the man in the mirror: Mike Jack\nThe mere sight of Beans raise the hairs on your back\nNiggas talking \"compared to Sig you wack\"\nScrap, I know you ain't wanna talk about that\nBut since niggas talking, let's talk about facts\nFrom the city where it's long dark nights here\nWhere hard knock life's real (MJ, Annie are you OK?)\nI'm so bad, I'm a smooth criminal, I'm a thriller\nHolding a snub with a glove that don't glitter, nigga\n\n[Hook]\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(What you talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(That's what I'm talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n\n[Verse 3]\nThis ain't a diss record, this a real record\nHow it feel to get exposed? Don't you feel naked?\nI was the fly on the wall, the shit I witnessed\nI could say shit that make B look at you different\nAnd my gangsta wasn't never on trial\nBut I was, I stood up tall, no snitching\nBut the rapper Shawn called the police on me\nCause I was front row at the Blueprint 3\nI just wanted to see him MC\nAnd reminisce when we was the R.O.C\nBut he called on the C.O.P's\nNot only that, he brought in the F.E.Ds (snitch)\nSo that's telling me \"F.U. Sig\"\nSo F you too and F Bleek 3\nSee, whether I rap or riddle out this motherfucker\nPack a Gat keep a pistol out this motherfucker\nCrack a brick down the middle out this motherfucker\nMy name good in every hood out this mother fucker\nMotherfucker\n\n[Hook]\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(What you talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n(That's what I'm talking bout?)\nI ain't your average cat\nFuck rap, I'm trying to make cream, and that's that\n\n[Outro]\nReal rap\nSee, I think I held my tongue long enough\nAbout this whole Roc-A-Fella situation\nI was the realest thing that happened to the Roc\nThe Roc was just a rock\nI brought the fellas to Roc-A-Fella Records\nHot 9-7, stay proper, y'all remember\nI brought the street cred to that\nThat thing etched in stone\nI fought all them battles, me, that's who\nJadakiss, Nas, Dipset\nAnybody you would've told me to go after\nMatter of fact you ain't even have to tell me\nI front line for that Roc\nFor that finger guard\nFor that diamonds that people was throwing up\nI'd a took a bullet for Roc that day\nThis ain't about a dollar\nThis ain't about me hating on you cuz or anything\nCause I never asked you for a dollar\nWhen I came home from jail\nHome, out here in the day\nWhen you ain't come one day to come see me\nNot one picture, a letter\nI went to the office and asked you\nLet me off Roc-A-Fella Records, out that situation\nCause somebody, no man no blame, wanted me\nAnd they wanted to give some real money\nAnd you bounced that tennis ball around in your office for a hour\nAnd went back and forth with me and told me you ain't wanna let me go\nYou remember that don't you?\nYou even asked me did I want some money and I told you I don't want your money\nBut you was in a position to make me get my own money\nAnd you couldn't do that\nBut Sigel so real\nAnd you will never go to jail again cause you knew I would shoot\nIf my life was a movie, Sigel be the sequel\nYou ain't fit for war\nCause Sigel's in the field\nIt's etched in stone\nMy gangsta ain't never been on trial\nBut guess what:\nHow 2Pac say? I ain't mad at ya\nI understand, everybody can't go\nAnd you are already old\nOh, and don't get it fucked up\nThis ain't the green light for everybody to start making \"diss Jay-Z\" records\nNah, I still got love for the nigga\nThis me taking my brother in the yard for 5 minutes\nCause I got a knot in my chest that need to get unloosened\nAnd you got love for a motherfucker don't go away that easy\nSee, many people gonna walk in and out your life\nBut only real friends leave footprints on your heart, dog\nBut I think yours fading in the sand\nAnd that's real rap\nAnd if me and you don't never talk again, dog\nAnd I gotta holla at you via MC on this mic, what up?\nHow you say? Scream at me\nThe richest man ain't the one with his first dollar, dogg\nIt's the one who still got his first friend\nRoc-A-Fella for life, nigga\nIt's the Roc", "image": "https://images.genius.com/5e28fd593f7ac425eb03fe3ffd9d9b7e.690x690x1.jpg", "year": "2009-10-30", "title": "What You Talkin Bout? (I Ain’t Ya Average Cat)", "album": "Roc Boys"}]}