{"songs": [{"title": "Urge To Kill", "lyrics": "[Intro]\nDo you ever just have the urge to kill?\nDo you ever just have the urge to kill?\nDo you ever just have the urge to kill?\nDo you ever just have the urge to kill?\n\n[Verse 1]\nRiddle me this, riddle me that\nIf murder runs the globe and this we know and accept\nWhat do we expect but mass murders to live happily\nThose who really fight for freedom to face tragedy\nWhen you really look at the world, do you feel a sickness?\nCouple dead kids in the world, its just business\nArm sales economy, added to the GDP\nMaybe its just me, maybe I’m naive\nThough I’m not Siamese, I do feel your pain\nAnd I do believe, though maybe I'm insane\nThe state murder is still murder, it's still murder\nThere’s no fight that’s big enough to conceal murder\nLets make a movie and celebrate our real murder\nPay a rapper to glorify, nigga, kill, murder\nBut never question your oppressors or suggest murder\nShould be directed in your betters that invest murder\nI wonder is it absurd that we protest murder\nCause clearly they haven’t heard that we detest murder\nHowever much we detest, we cannot deny\nThat murder has both helped and harmed you and I\nAnd anybody, everybody has a human right\nTo defend themselves from oppressors with a greater might\nI look around this world, such a bloody sight\nI wanna know\n\n[Hook]\nDo you ever just have the urge to kill?\nWhen you realise that peace can't work cause they don’t respect peace\nOh the feeling is so real!\nWhen you see that murder’s legal when it’s done by police, the beast\nDo you ever have the urge to kill?\nWhen you see a child’s body like a dog in the streets, believe\nOh the feeling is so real!\nWhen there is no justice and we can't breath\nDo you ever have the urge to kill?\n\n[Verse 2]\nTerrorism is its own religion practices by millions\nObviously not just Muslim but also Jewish and Christian\nAtheist, Hindu, Buddhist\nSince when has belief\nEver stopped human beings\nFrom being bullies?\nThey pretend one terror is worse terror\nEven while they sponsor their terror it works better\nEven while they bomb their countries and burn them up\nEven while they colonise them with no letter\nAnd we, what do we do? Pay tax to them\nMaybe I’m a coward\nNo war was ever won by dickheads with a mic shoutin’\nRappers can't bring you liberation\nJust articulating do you share these frustrations that I am facing?\nAre you one of these arseholes like me\nThat believes there’s a better world that we could be?\nBut knows that it won't come so easily\nAnd revolutionary love there needs to be\nEveryone has the right to defend the one they love\nAnd no uniform gives you the right to shed my blood\nIf the courts systematically denies what we’re legally due\nWhat should we do? (tell me)\nShould we pray to heaven and wait for better and hope that it comes true?\nOr, defend ourselves from you\n'Cause it’s only when you aim your violence at your oppressors that it's taboo\nI wanna know\n\n[Hook]\nDo you ever just have the urge to kill?\nWhen you realise that peace can't work cause they don’t respect peace\nOh the feeling is so real!\nWhen you see that murder’s legal when it’s done by police, the beast\nDo you ever have the urge to kill?\nWhen you see a child’s body like a dog in the streets, believe\nOh the feeling is so real!\nWhen there is no justice and we can't breath\nDo you ever have the urge to kill?\n\n[Verse 3]\nNations and nuclear bombs and colonisers\nApplaud us for our silence reward us for non-violence\nWhile supporting old tyrants\nCalling them all clients\nThey bought them with a fortune a slice of the empire\nOf course they haven't taught them torture is a science\nTo which you should resort to kill frauds and defiers\nFeel the force of the fires\nPetrol poured on the tires\nBet it more than retires\nWhoever's caught in the wires\nSeveral daughters in silence\nWhichever mothers are crying\nJustice is just like anything\nIf you can't afford to buy it then you starve\nThis is our world that I'm describing\nIt's too much!\n\n[Hook]\nDo you ever just have the urge to kill?\nWhen you realise that peace can't work cause they don’t respect peace\nOh the feeling is so real!\nWhen you see that murder’s legal when it’s done by police, the beast\nDo you ever have the urge to kill?\nWhen you see a child’s body like a dog in the streets, believe\nOh the feeling is so real!\nWhen there is no justice and we can't breath\nDo you ever have the urge to kill?", "year": null, "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}