{"artist": "Yung La", "songs": [{"album": null, "image": "https://images.genius.com/73d3eb385a58a8f20d3bb41c789f9d55.480x322x1.jpg", "year": null, "lyrics": "YUNG L.A\nYa got to know the boy futuristic, ain't it?\nMy work can make the J's do the jump, man can't it?\nYou got to know this the remix right here\nGrand Hustle baby it's the kings right here\n\nYou got to know we gwappin' pockets extra sloppy\nDon't I love my vegetables extra cheese and broccoli?\nDon't Yung L.A. like to kick it like karate?\nDon't I be with J-money serving everybody?\n\nAin't we up in magic city throwing up the broccoli?\nAin't me and Tip taking off like a rocket?\nAin't my, ain't my, ain't my, ain't my, ain't my money long?\nAin't I, ain't I, ain't I, ain't I still putting on?\n\nAin't I, ain't I, ain't I, ain't I, ain't I, ain't I, ain't I?\nAin't I smoking strong? Ain't I putting on?\nAin't I rocking yays? Ain't my money long?\n\nAin't I, ain't I, ain't I, ain't I, ain't I, ain't I, ain't I?\nAin't I in the ville? Ain't I on the hill?\nAin't I on a pill? Ain't I, ain't I real?\n\nOkay, my rims so big I'm at the tip top, ain't I?\nChoppers in the trunk will make you do the Macarena\nPull up to the flo', yeah mothafucka ain't I?\nAll black coupe, I can buy a Benz, can't I?\n\nRemix Yung L.A. and T.I., this a banger\nDro, you on that thang? You don't hear me Trick, ain't I?\nBig Rolls Royces, ain't I got 'em nauseous?\nWe be in Ferraris, the cars with the horses\n\nAin't I on a pill riding down Bentley\nIced 30 below minus the wind chill\nAin't I packing chrome? Ain't I blowing strong?\nAin't I, ain't I, ain't I, ain't I got it going on?\nYoung Dro\n\nAin't I, ain't I, ain't I, ain't I, ain't I, ain't I, ain't I?\nAin't I smoking strong? Ain't I putting on?\nAin't I rocking yays? Ain't my money long?\n\nAin't I, ain't I, ain't I, ain't I, ain't I, ain't I, ain't I?\nAin't I in the ville? Ain't I on the hill?\nAin't I on a pill? Ain't I, ain't I real?\n\nRalph Lauren, purple label, ain't I fresh as I could be?\nMade it through my situation, ain't I blessed as I could be?\nAin't I laughing at these haters tryna take a shot at me\nThey don't know which way to go, I make it easy, follow me\n\nHonestly, ain't I insane? I think that's the way I gotta be\nAin't I so so super fly? Boy ain't nobody hot as me\nAin't T.I. all on TV when he wake up and go to sleep?\nEverywhere they notice me, ay for yourself just go and see\n\nMy community I'm serving though they hope I don't succeed\nHear me speak they so intrigued, a-ain't he snitching? No indeed\nYou come with that common flow, yo show I have to commander\nSince I see you can't take over I'll just have to volunteer\n\nA-ain't I yo superior? Listen here bruh you not up here\nI'm so zone 1 till it ain't funny twice the G that I appear\nRep Bankhead so loud and clear, go be gone for 'bout a year\nSo Paper Trail you gotta hear but ain't that Ain't I outta here? Ay!\n\nAin't I, ain't I, ain't I, ain't I, ain't I, ain't I, ain't I?\nAin't I smoking strong? Ain't I putting on?\nAin't I rocking yays? Ain't my money long?\n\nAin't I, ain't I, ain't I, ain't I, ain't I, ain't I, ain't I?\nAin't I in the ville? Ain't I on the hill?\nAin't I on a pill? Ain't I, ain't I real?\n\nAin't I, ain't I, ain't I, ain't I, ain't I, ain't I, ain't I?", "title": "Ain’t i - main voc up"}]}