{"artist": "A$AP Rocky", "songs": [{"title": "Celebration", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg", "album": null, "lyrics": "[Intro: A$AP Rocky]\nYou know what this is\nIt's a celebration bitches\nGrab a drink, grab a glass\nAfter that I grab your ass\n\n[Verse 1: A$AP Rocky]\nBitch I hustle every day, you could check my resumé\nBad Spanish bitch, one kiss'll take your breath away\nI could bag your girl in a broken down Chevrolet\nSwag do the talkin', I ain't even gotta decorate\nI was 21 when I bought my mom a condo\nA guitar and a gift card down at Costco's\nIt's a cold winter when it's blowing past my goggles\nPenthouse, top floor, window with the gargoyle\nPerformance down at Santos, Phantom suicide doors\nPaparazzi slide-shows, showers with the slide doors\nOne night, five shows, two-seater, five hoes\nEyes closed, I can see them hating through the blindfolds\nNiggas better switch it if the business ain't the convo\nI'm all about my chicken nigga you could call me Roscoe's\nIf I wasn't spitting I'd be probably flipping waffles\nI suppose God knows I coulda been a snot-nose\nDAMN\n\n[Chorus]\nGet money every day (Every night we celebrate)\nGet money every day (Every night we celebrate)\nBitch I hustle every day (Every night we celebrate)\nEvery night we celebrate, Every night we celebrate\nGet money every day (Every night we celebrate)\nGet money every day (Every night we celebrate)\nBitch I hustle every day (Every night we celebrate)\nEvery night we celebrate, every night we celebrate\n\n[Verse 2: A$AP Rocky]\nFuck is all the talk about? Fuck these niggas talking 'bout?\nShit I know it's us cuz we the only thing to talk about\nI been down to ATL, I seen how they walk it out\nCali Crip Walk it out, show 'em what New York about\nWhat these niggas hating for? Fuck these niggas hating on?\nI'm what they debating for, I'm what they been waiting on\nOut there tryna take it slow but taking slow been taking long\nKnow I'm on the paper trail until I get my paper long\nWhen I'm in the kitchen, catch me with my apron on\nAnd it's back to business, A$AP is where they belong\nAnd we on the grind, that's until I get my paper long\nSee your nigga's face every time you turn your cable on\nMami why your leggings on, face down ass out?\nTylenol and codeine got a nigga 'bout to pass out\nCatch me on a grind and now a nigga 'bout to cash out\nGet money, hella cake, every night we celebrate\n\n[Chorus]\nGet money every day (Every night we celebrate)\nGet money every day (Every night we celebrate)\nBitch I hustle every day (Every night we celebrate)\nEvery night we celebrate, every night we celebrate\n\n[Bridge]\nWhen the boys roll, pull up on the block\nStill we hustle, 'cause we run the spot\nI'll be on my grind, every night dawg\n'Til the coffin close, and my lights off\nI hit 'em up, like my name's Shakur\nCount my dividends, I'm allergic to poor\nI hit 'em up, like my name's Shakur\nStack my paper up, I'm above the law\nI hit 'em Up\n\n[Chorus]\nGet money every day (Every night we celebrate)\nGet money every day (Every night we celebrate)\nBitch I hustle every day (Every night we celebrate)\nEvery night we celebrate, every night we celebrate", "year": "2012-01-15"}]}