{"artist": "Prodigy of Mobb Deep", "songs": [{"album": null, "title": "My Big Ass Meal (Excerpt From Commissary Kitchen)", "image": "https://images.genius.com/d18050987bd2343e1afe5f9c4c3cb7ef.300x300x1.jpg", "lyrics": "I loved when I had visitors, especially my family. A few friends came too, but whenever my family made that trip, I made sure my uniform was tight. I’d “iron” the uniform under the bed. That’s where everybody ironed their clothes.\n\nYou get two uniforms, so you keep one under the bed for your visit, so by the time the visit comes, it’s nice and fresh because you been sleeping on it all week. That’s like your visit uniform. During the rest of the week, nobody cares. On the visitors’ floor, when my kids used to visit me with my wife, they had vending machines where you could get snacks and chips and everything that they don’t have in commissary.\n\nPeople couldn’t wait for the visit because then you could have like, hot wings you could put in the microwave! They got ill shit you could get in the vending machine. They had hot sandwiches and other food you could put in the microwave: ill snacks, doughnuts, a lot of things. Just things they don’t have on the inside. They had this spicy chicken sandwich, and the name of it was Big Ass Chicken Sandwich. That was the name of it, yo! It was a spicy chicken sandwich like the one at Wendy’s.\n\nIt was a spicy chicken patty, it had real jalapeños on it, and it really was a Big Ass Chicken Sandwich. It was about $4 or something like that. That was my favorite thing to eat. At every visit, I would get the Big Ass Chicken Sandwich. They also had the Big Ass Burger too. It would say it right on the package – Big Ass Burger.\n\nYou can’t sneak it back up, though. They gotta strip search you. They gotta look in your butthole and all that. You gotta lift your nuts, cough, all that shit.\n\nAfter a while, I told my wife not to come because it was an 8-hour drive – four hours up to Mid-State and four hours back down. I didn’t want her doing all that driving, you know what I mean? So I was like, “Don’t come. Just come when you feel like it, holidays or whatever. That drive is too long.” Plus in the wintertime, it’s bad up there. It’s crazy. You know how many times after visiting the prison, people’s families would be like, “Yo, we got into a car accident and our car flipped over!” I used to tell them, \"Don’t come up here. Come if you really feel like coming. Don’t come thinking I need a visit, because I don’t give a fuck. I don’t need it.”\n\nSo this producer me and Havoc did music with named King Benny, it just so happened that motherfucker lived in the town where the jail was at in Utica, and he’d come and visit me every weekend. He lived five minutes from the jail. So I had a visit every weekend, and a Big Ass Chicken sandwich every weekend, sometimes a Big Ass Burger. It was crazy.\n\nHe hooked me up with real kicks too. We could order sneakers, but they was corny. They had bootleg Jordans in jail. They had a bootleg catalog with fake ass Jordans, fake Timbs, fake everything, because you can’t have nothing that’s over $50. They want to see the receipt from the store it came from.\n\nSo he used to kick sneakers under the table for me. I would buy them fake joints and wear them, he would come to the prison with new real J’s on in my size. And while we were sitting, we’d kick the shoes to each other under the table—I’d put on the real J’s and he would put on the fake ones.\n\nOne time we did it, and we almost got caught. My man Benny is sitting right there in front of me, his back to the guards. I had to sit facing the guards. So I gotta look normal while I’m taking off my sneakers and look like I’m not doing nothing. I kicked my sneakers off, gave it to him. He kicked his sneakers off, kicked it to me, and one of the sneakers went flying to the side, almost to the next visiting table! I’m like oh shit!\n\nMy boy tried to kick it over. I thought we was gonna get caught! We didn’t though, but I looked pretty sus tryin’ to act like nothin’ was goin’ on. But didn’t matter, because I got some new J’s. And I had a Big Ass Chicken Sandwich.\nFrom commissary kitchen: my infamous prison cookbook published by Infamous Books.\n\nYou can download the audio version of commissary kitchen: my infamous prison cookbook for free on Amazon", "year": null}]}