{"artist": "Papoose", "songs": [{"album": null, "title": "I Give it Up", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "Yeah\nHere go my footsteps again, I'm still coming\nY'all know what it is\nYo, check it, yo\nI give it up!\nNiggas coming at me sideways\nI give it up!\nIn front of the club on Fridays\nI give it up!\nThe Bed-Stuy do or die way\nGive it up,what! x2\nGive it up!\nNiggas talk about sticking him up. Yeah right\nThem niggas know how I give it up\nOut of town niggas talking bout hitting him up. Yeah right\nThem niggas know how I give it up\nThese industry niggas talking bout spitting for bucks. Yeah right\nThem niggas know how I give it up\nVerse:\nI use to grip a razor\nCut niggas in any situation\nI'll walk away from em, give em a ripaway scar\nIf I seen something I wanted I'm sticking bae pa\nKept my shorty in the getaway car\nYou stash the drugs in your cleavage\nI'mma stash the guns in my penis\nBefore we do a jux, we plan it (planet) like Venus\nI caught your man on the Ave, he was drunk and weeded\nThat nigga got stuck up like he conceited\nThem Brooknaw niggas treat drama like stickers\nThen check em like Nikes. Give em shells like Adidas\nBed-Stuy, Brownsville, don't fuck with these blocks\nThem Boyz put the pump to your ass like Reebok\nTo the unawared, I'm leaving niggas running scared\nY'all better come prepared\nCause I be toting gunz and paying\nFor school I never cared\nFuck making As and Bs\nI wanna make Gs and be the nigga selling keys\nAt ease I squeeze, selling them nickels and them trees\nInstead of them leaves, I grow my money from the trees\nY'all know the story then, I keep drama like auditoriums\nThen I clap at it just like a muthafucking audience\nWord on the street, niggas slanging what I'm slanging\nBetter ss-sling it swinging,cause I ain't swinging when I'm bringing\nNow they out of line, it bout to be a violent crime\nStuck the ox in my pocket, in case I gotta face some Island time\nFilling my boots with extra lead\nCause fuck it the bad boys in blue, can be the bloody boys in red\nPremed, I cock my gun and grab my keys\nBut the left the back door open cause I ain't try to freeze for no D's\nWe breeze, only the automatic fifth in me\nGuess it wasn't no mystery, I was bout to make them niggas history\nDeep under pressure they put two and two together\nBut they ain't clever, I keep my fifth Beretta filled with four\nBetter forever bop. Toting my trigger through the Glock\nI blew him in his knot, and made the nigga do the Wop\nUncertain. I seen a shadow lurking peeking through a curtain\nMy gun starting bursting, I left her hurting with her head squirting\nPunks was coming out of thugs\nBut niggas was trying to form on me cause I gunning out of slugs\nRunning like adrenaline they was coming like the Gremalins. Dipped behind the car. Remembering I stuck my Timbalands\nStarted sparking and bucking\nThe symbolence surrendering\nEmptied all their pockets and left them muthafuckas trembling\nI bust mines,and all you sons can't harm me\nY'all little and scrawny\nI'm a one man army\nPapoose!\nKay Slay:\nWe tried to warn y'all niggas...y'all just wouldn't listen...\nDang!", "year": null}]}