{"songs": [{"album": "The Warm Up", "year": "2009-06-15", "title": "Can I Live", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg", "lyrics": "[Verse 1]\nYeah\nPussy my passion, never been a fan of flashing\nProbably cause I never could\nSaid if I had it, never would\nThen I got my first little taste of paper and I splurged\nI guess it's just a nigga urge\nThis is The Boondocks\nI swear, yo, I’m like Huey mixed with Riley\nThursday I be tryna save the world, and then on Friday, I hit the club\nHoping that my dick get rubbed by some fat asses\nNiggas get to scrappin' then you hear the gats blasting, damn\nHope them niggas ain't got no problems with me\nMy momma told me to speak like you got a college degree\nYou see, I can, but I won’t cause I’m saying what I want\nPlus this slang that I speak don't change that I'm deep\nAs the throat on a certified freak, will she choke?\nAs we headed to the crib, yes, I let her give me head\nSo she won't 'member where I live,  my game is tight\nBaby, no need to bring pajamas, you ain't staying the night\nNo disrespect, I just say it polite\nI drop her off before I sleep, I be praying for life\nLike Hov said it, can I live?\nAy, dear Lord, can I live?\nHey, now am I living to get paid, just slaves for a wage, are we?\nI can't do no 9-to-5, told my momma sorry\nI can't do no suit and tie, no I want the glory\nIf you knew me, know my life is like a movie starring me\nPardon me, if it seems that I'm following my dreams\nI ain't reading off the script that they picked for me\nI ain't pissed, nah, couldn’t give a shit hardly\nI'll be shitting on them niggas that was shitting on me\nWill I live or will I die before they get to know me?\nIf I go, I know the ones that’s pouring liquor for me\nAnd I know them fake niggas really hating on me\nKnew that I was 'bout to blow, so they was waiting on me\n\n[Bridge]\nBut oh no, Lord\nYou see, I'm smarter than they know\nSo hold on, Lord, cause I ain't quite ready to go\nCan I live?\nSomebody told me that it's only one shot\nSo I'll be goddamned if I'm ever gonna stop\nPromise to my momma I'ma make it to the top\nSo I'ma keep climbing 'til my heartbeat drop\n\n[Verse 2]\nLike the phone when she heard the news\nHer sister on the other line talking to her shoes\nThe only son, what a thing to lose\nMore blacks singing more blues\nMore niggas pouring more brews\nPoor dude, he was young like 21, straight up out that city that I'm from\nA real smart nigga, but his niggas, they was dumb\nHe ain't even get a chance to run\nBefore it landed in his lung\nGod, breathe nigga\nHis partner screaming “Don’t you fucking leave, nigga!”\nTook off his shirt, tryna stop the bleeding nigga, “Don’t you go!”\nBut his life fading slow\nDid I tell my mom I love her, do she know?\nDid I tell my baby sorry from before?\nWon't get to see my son grow\nLord, I ain't ready to go\nCan I live? Can I live? Dear Lord, Can I live?\nCan I live?"}], "artist": "J. Cole"}