{"artist": "A$ton Matthews", "songs": [{"title": "Maneuvering", "image": "https://images.genius.com/cc6a6f9d32fccb50484d7b3ce3f33244.723x719x1.png", "album": "Chapovelli", "lyrics": "[Intro]\nWait Wait Hold Up (Gimme all that)\nWait Wait Hold Up (I need all that)\n\n[Verse 1]\nI put moncler up on my body, know the price on the coat\nI got some niggas using benzocaine to stretch out the coke\nMy name ring bells from Westside Barson, Northside of the Beach\nThem bullets aiming at your noggin with the sand at your feet\nBoy don't be stupid, don't be foolish, drop a pin and we at you\nBend yo block through all them bandos, bet them looneys gon' crash you\nFuck how you feel, boy you ain't never where its real\nGo hand to hand up in the field before my baby miss a meal, whats the deal?\n\n[Bridge 1]\nAYE AYE AYE AYE\nYou Know\nNiggas really touch down in New York really havin' it nigga\nBig gas, Big drank, you smelt it before you seen it, You Dig!\n\n[Verse 2]\nHallelujah, that ruger bend up your medulla\nWrist on Bobby Boucher ain't no spittin' in the cooler\nYou know they watch how we maneuver\nIn that Lexo moving slimey through the sewer\nBussin' plays, corner of the brick look like filet-o\nDuck my bitch before I ever duck a fade -oh\nHunger games, taking anything that come with fame\nMoney, Power, Pussy, Power, bitch its all the same\nAll that talking, it don't mean nothing if you never show me\nMask up on me, like Mick Foley\nBenji's on me, Bring it to me, lil baby never leave you lonely\nI'm just playing'\nJust got you wrapped up in that shit I'm sayin, Super Saiyan\nTurn that shit to Armageddon, far from heaven\nMaking due with all the cards I'm given\nReally playin' mouth piece frozen like the Himalaya's\nMy niggas on that 55th with all that Junior Seau\nFire packs, dodging snakes, you know we slaughter rats\nYou paid your way to claim the gang now what they callin' that?\nNow how the fuck I'm suppose to honor that?\nAye, Aye, Aye\n\n[Bridge 2]", "year": "2018-05-08"}]}