{"artist": "Porta", "songs": [{"album": "Reset", "title": "Etiquetas", "image": "https://images.genius.com/0786171922516cdb77f0f7ea0149854a.953x953x1.jpg", "lyrics": "Na nara na nara nara na nara..\nNara na nara nara na nara na nara\nNos escondemos detrás de una imagen, de la apariencia\nY podemos modificarla según nos convenga\nSolo se trata de moda, cada uno con su correspondiente etiqueta\nMira!\nTienes que ser mas listo obligado y si eres español (Dios!)\nTendrás que hacerte el Americano\nHablar con acento hermano brother con tu gorra plana pijo te ganas un nobel!\nEn tus videos salen veinte tías provocando me piden que\nNo les llame warras pero se lo están buscando lo están pidiendo a gritos!\nMas mis papacitos! Misma mierda se juntan un mismo bando\nOs Juro que lo intento respetar pero no puedo dame\nMas gasolina a ver si con ella te prendo fuego\nVuestras letras son puras inspiración sobre saltar mensaje de\nComo follar a la ves que das un masaje\nLos tracks iguales aburren muerte al auto tune los ritmos son clones y tu un payaso mas del YouTube..\nPerrea Perrea a ver si te mareas si con tanto rose te entra Diarrea\nTus camisetas hasta las rodillas los pantacas cortos hasta los tobillos tu nombre grabao en la hebilla..\nTus letras no pegan con tu rosario que brilla una de dos o eres tonto no se si es tonto lo pillas\nAsí van cuande malas saca las garras pa mantener a su macho\nMientras su macho busca otra warra la que te descuida esta hace un bombo\nSerá con otra y toma otro bombo así es como se hace un combo\n\nCon las apariencias y exigencias va la imagen\nImporta lo que piensan tu secta y su linaje\nVives una moda pasajera y no me nombra el personaje\nTe sigues es posible que no encajes!\n\nCon las apariencias y exigencias va la imagen\nImporta lo que piensan tu secta y su linaje\nVives una moda y una estética salvaje pijo\nTirao reggaetón tocan y pa mi es un ultraje\n\nTu forma de hablar y de escribir es irritante\nVas de cachas (bah!) quítate la camiseta de tirante\nSi eres un tirilla eskani, la cambi ajustada\nY que se vea bien grande que Uskan y Ombu son Armani!\n\nEl piercing bajo el labio que no falte, t\nU moto trucada de cincuenta que te lleva a todas partes\nEl tatoo de moda y que mola la estrella en el codo\nY los cordones y anillos orteras que llevas de oro\nDomina pa tu fleki le hago Rap modo peineta\nAlza tus brazos hacia el cielo cuando escuchas maquineta\nTe teme todo el planeta conocido en toda discoteca\nAcabare en mi briza debe ser tu única meta\nJúntate al Gimnasio y al kin Boxing a Full!\nNo te gusta los perros pero quieres un pitbull\nJuegas al Call of Duty, Al Pro y al Need For Speed mas casual que los niños que solo tienen la Wii\nTomas speed sueñas con ser Brad Pitt en el club de la lucha\nTe vendes como el que entiende a las chicas y las escucha\nY te la suda ponerme los cuernos quieres un coche\nTuning descapotable para lucirlo en pleno invierno\nSus pibas son clones de amywen house\nPero con el tanga subido y el pantaca mas apretado\nSiempre que hay muñecas en grupo te creses\nSi vas solo no se como lo haces que siempre desapareces\nEres el mas popular el que saca mas malas notas\nTu consciente intelectual basado al alcohol que tocas\nJuegas al football-Como todos- Oyes Flamenco-Como todos- te quieres a ti mismo como-\nComo coño encuentras el Modo!\n\nCon las apariencias y exigencias va la imagen\nImporta lo que piensan tu secta y su linaje\nVives una moda pasajera y no me nombra el personaje\nTe sigues es posible que no encajes!\n\nCon las apariencias y exigencias va la imagen\nImporta lo que piensan tu secta y su linaje\nVives una moda y una estética salvaje pijo\nTirao reggaetón tocan y pa mi es un ultraje\n\nY Retirao esta de moda y hacer trapis salir de raber\nLlenarte de tripis que no se a pagado el papi\nVe de Hippy no sea Tekis mikis que vean que eres real\nVas de pobre pero tu no sabes lo que es vivir mal\nFuma tu gorra plana y ya que estas di\nQue la única música que escuchas es ReggeRap y Bruman Bassi\nVan de respeto (Bah!) desde una ironía a la hora de la verdad veras que te faltara compañía\nLlevan el panca roto y ten cuidao\nQue nadie se entere de que has estudiado en un cole privado\nRápate media cabeza o hazte rasta no dirás de donde sale\nPero cuando sales siempre llevas pasta\nTu cambias de la noche a la mañana fúmate ese pyti bébete el cacique y ya eres lesbiana\nPlanta marihuana de la buena fúmate ese peta hecha un buen polvo y wala!\nYa estas como nueva..\nTu de la vieja escuela dime porque no lo asumes si\nEmpezaste con Porta dirás que fue con CPUB todos de vendido nada representa mas\nQue salir al Rato y escuchar Rap de los Ochenta\nHasta tus piercing todos rotos Alto!\nDéjao para la foto quéjate ante toda prohibición y que se ocupen otros\nTirado en el parque con el calimocho y de hecho\nDeberías pasar hambre de verdad para apreciar tu techo!\n\nCon las apariencias y exigencias va la imagen\nImporta lo que piensan tu secta y su linaje\nVives una moda pasajera y no me nombra el personaje\nTe sigues es posible que no encajes!\n\nCon las apariencias y exigencias va la imagen\nImporta lo que piensan tu secta y su linaje\nVives una moda y una estética salvaje pijo\nTirao reggaetón tocan y pa mi es un ultraje", "year": "2012-05-07"}]}