{"songs": [{"image": "https://images.genius.com/5cf926857ea50a9127019d93750f202f.642x642x1.jpg", "title": "A Song For Twitter", "album": null, "year": null, "lyrics": "[Verse: Nasty_C]\nLemme see you put 1, 2 3 up 4 this 5 star nigga\n5 star flows and they're 5 stars realer\nI'm hard. These rappers is styrofoam\nI stack em up and break em in 3s when the mic is on\nThis rap's in my cytrosomes, I write these songs with zero effort\nAnd make em lean, cos I write in Italics font\nAnd I right my wrongs in this audio\nGirls that meet me say “I like your song, and you're out of your mind, but you nice for sure”\nThen they always go for da taller guy in designer clothes, a whip and a lot of dough and probably has a lighter tone. I'm just some unemployed rapper in a cloud of smoke\nSo he can take em on dates. All I can do is write a poem\n\nChea, but fuck it this is as real as it gets\nI'll loose focus when every fibber in me forgets. I'm a blessing to here rap game. Puke if hate. I'm disregarded. But this here is God infusing with fate. I come across as proof in debates. That hip hop's living still. is it not vivid still? I'm the future, its late\nSo bow to me, this is real buddy. See I rap like an android I am legend, but they still never Will touch me\nI'm willed to kill something\nI'm filled with real-ness\nI'm instilled with steel toughness, my mental is still suffering\nEvery word emitted is a pond that accumulates\nI annihilated my competition still in my cruising state\n\nThe Fuck I gotta say to prove I'm great?\nWin a brawl with the devil without a bruise or scrape, and take his ruler's place?\nI Impose a threat, like the black consciousness, yet my conscious is a mess\nI'm am nothin less that prominent\nBut they couldn't take it like giving a mac to an Amish chick\nBitch I'm dominant, rhyming is in my chronics, I'm positive. Proud of me?\n\nA fucking psycho, I know\nLights go off when I rhyme and your lives are lost\nI light souls up like the ghost rider; Ghost Rhymer - toast yall\nTold yall I ain't the one to poke jokes about\nI'm at bottom of the favorite list, but the top of the food chain\nPyramids, Tru story, Bar game on 2 Chainz\nShit ain't going smooth with the Mrs. lately I need to Vent\nShut up and listen, since you're here now I need a friend\nI think I'm lost, I'm serious man I need a den\nLet me contain my contain myself and tell her how I feel again\n\nI took a step back n out of my being for second\nThought maybe I'd get a cleaner perspective\nMaybe the way I view us isn't what's real\nMaybe the scene was deceptive\nBut maybe not, cos I can feel that connection\nSo its confirmed, I fuck with you and you leave me senseless\nI got two arms, ears, and a heart for you, you need em; text me\nI said forever and meant it, you tried to count the minutes\nMa If time is money, I'm investing, let's work out the interest, I'm talking somewhere around fifty\n\nChea, cos something's gotta give\nBlame all of this, on this illegal substance that I sip. Shit\nThank you all for listening\n@Nasty_CSA, follow or go missing bitch\nPrice City, I'm a citizen. You care to visit me?\nEnvision this: Blacksun; Erick Rush;  Zyne Mac; Kyle Cain; Teddy Maxx; Justin Will; Trigga Beatz\n#TeamCZZLE\n\n[Hook/Or Whatever]:\n\n(Whoo I just had to do it)\nThis a song for twitter bitch\n(Yea, I just had to do it)\nThis a song for twitter bitch\n(Whoo I just had to do it)\nThis a song for twitter bitch\nI might put the link on facebook but this for twitter Aayo"}], "artist": "Nasty C"}