{"artist": "Fashawn", "songs": [{"year": null, "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Intro: TL Cross]\nOh, oh, oh, oh\nOh, oh, oh, oh\nOh, oh, oh, oh\nOh, oh, oh, oh\n\n[Verse One: Fashawn]\nNow she complain all the time\nHow I'm away on the grind\nDoing days, every state, all the places I fly\nOut the rise, nationwide with my niggas who down to ride\nIf I ain't, multiply my numbers then never mind!\nL.A.X. every weekend don't be surprised\nAll she do is give me seat-back love, help me recline\nAh, this is the life! I hope it last\nJust a high school drop out, sitting in first class\nOn my way to Osaka, champagne and some pasta\nDamn shame, a youngn' make his way out the projects\nThis baby I remember nights before the flashy lights\nOnly flights I ever saw was a pair of Air Nikes Shawty!\n\n[Hook: TL Cross]\nOh, all I really wanna know\nAll I really wanna do\nIs spend a little time with you\nAs long as you know!\nBaby, that I'm worldwide, I'm worldwide\nI know you know, yeah, yeah\nBaby, that I'm worldwide, I'm worldwide\nI know you know, yeah, yeah\n\n[Verse Two: Fashawn]\nJFK every weekend you wonder why\nAll she do is ask a nigga to stay and I decline\nI realize I'm worldwide with my niggas who're down to fly\nIf it ain't about that money, Shawty pay it no mind\nPeople say that I live such an expensive life\nAll I need is a passport and a Samsonite\nA G4, I'll probably land in Japan tonight\nWiFi on the flight, hit the fam on Skype\nAnd touch down in the city, every town on my grizzly\nI get around lifting nowhere to be found\nDid you miss me baby? I've been on my hustle\nPaper is what I'm chasing\nAnd for your information, I've never been on vacation\nI'm just saying though!\n\n[Hook: TL Cross]\nOh, all I really wanna know\nAll I really wanna do\nIs spend a little time with you\nAs long as you know!\nBaby, that I'm worldwide, I'm worldwide\nI know you know, yeah, yeah\nBaby, that I'm worldwide, I'm worldwide\nI know you know, yeah, yeah\n\n[Verse Three: Fashawn]\nWhat if I would have stayed in my hood?\nProbably be up to no good\nSaying goodbye to the ghetto and hello Hollywood\nStill puffing in public, I wouldn't change if I could\nUsually out there for paper, remember those back woods\nI got a custom in customs, drinking vodka in Russia\nI go shopping in Harlem and make you stop at the rucker\nTequila in Tijuana got a queen in Rwanda\nAnother one out in Ghana, pieced out my piece out in Compton\nEazy E in OE, the only thing we got in common\nThe chick in Chi city that we blow\nWe call them Windy oh, oh\nHe's back at it, the iron lung never asthmatic\nAnd you're acting as you've never seen the atlas, Shawty\n\n[Hook: TL Cross]\nOh, all I really wanna know\n(And I know that you know\nThat is international F and I'm back in effect)\nAll I really wanna do\nIs spend a little time with you\nAs long as you know!\nBaby, that I'm worldwide, I'm worldwide\n(You should know)\nI know you know, yeah, yeah\nBaby, that I'm worldwide, I'm worldwide\nI know you know, yeah, yeah", "title": "Worldwide"}]}