{"songs": [{"album": "G.O.Y.A.", "image": "https://images.genius.com/fb7ecaddc1d29cc6370534f44a6e9ae8.1000x1000x1.jpg", "year": "2013-10-01", "title": "Compra", "lyrics": "[Verse intro: Tony Touch]\n\nWatch me do the compra\n[repeats underneath talk]\n\n[Verse intro talk: Termanology and Shortfyuz]\n\n- Yo Fyuz, what up man?\n- Oh, what up nigga?\n- About to go do this compra, man\n- I feel you\n- Got this EBT\n- Whooo!\n- Hopefully I'll see this fine bitch I seen in there last week\n\n[Verse 1: Termanology]\n\nFirst things first man, you're fucking with the worst\nI be plotting on these old ladies, looking at their purse\nCause I know they probably got a gang of money and some credit cards\nI'm here shopping with this EBT debit card\nReally make me sick. Let me get my shit:\nFirst off, I'mma need some baking soda I can mix\nTurn a couple oz's to a couple bricks\nAnd I'm having people over, let me grab some Chex mix\nAisle six. Let me get some dip and some chips\nI see this shorty bent over, damn, look at them hips\nBut yo, let me not get sidetracked, yo where the wine at\nI got a fine dime rack with a fine back-\nSide coming over late night, right after the club\nHer breath will smell like Patron, let me grab her some gum\nTwelve pack of Red Bulls, make them sugar-free\nCouple Pepsis, ginger ale and iced tea\nThis bread's looking stale, probably why it's on sale\nFor real, I wouldn't eat that shit if I was in jail\nBut for real-- why homie grilling me?\nI'm about to make him spill ketchup on his white T\nFuck that, let me worry about this cheese homie\nYou know me, you know I love my greens homie\nSpeaking of that, where the Febreeze homie\nWith all the weed I smoke they probably call the po\nMacaroni, Rice-a-Roni, and some Beef-a-Roni\nFrozen pizza for after the frozen margaritas\nHold up. Papa frita, and papa majada\nGonna get some manteca cause you know the cuddy's calling\nShit. But damn, look at them cheeks\nHold up. I wanna put my salami up in the roast beef\n\n[Verse intro: Tony Touch]\n\nWatch me do the compra\n[repeats underneath talk]\n\n[Verse intro talk: Tony Touch and Doo Wop]\n\n- Yo man, where's your beer at, man? Yo pai. You got beer, bro? What kind of beer you got, man?\n- Frozen White Castles? Fuck out of here. Crazy\n- Yo man, what kind of sandwich you got? Let me have that cheese. Chicharrones too. Let me have that cheese, cheese sandwich\n- Bitch, I will drive all the way back to the Bronx for four cheeseburgers from White Castle. That's my word. Hate this fucking place\n\n[Verse 2: Doo Wop?]\n\nWatch me do the compra. Spinning like I'm Oprah\nWalking through this bitch, big rope like aloha\nFlip flops, cargo shorts, yeah I'm in the burbs\nWhere I'm comfy but the prices absurd\nThis is not 183rd back in the Bronx where the top\nOf the line chips were Bon Ton, word is bond\nNo Goya section, only thing you can get\nIf you want some Spanish food is an Ortega taco kit\nTest that bullshit, but fuck it, it was my decision\nTo leave the hood and make a better life for my children\nBut I can't lie, I miss it already\nFrom them chocolate Yoo-Hoos to that bitch Little Debbie\nI'm homesick. Shopping cart filled with some-- yo what's this?\nMonterey pepper jack, mami where that cheddar at?\nLow-fat yogurt, oh my God, that's a no-no\nStraight to the Breyer's and Haagen-Dasz rocky road\n\n[Outro: Tony Touch]\n\nWatch me do the compra\n[repeats underneath talk]\n\n[Outro talk: Doo Wop]\n\nYou guys accept food stamps, right? That's all I got is the food stamps\nYeah yeah, put that on my tab. Naw? Put it on my tab man, you know I got you next time"}], "artist": "Termanology"}