{"artist": "Plies", "songs": [{"album": "Da REAList", "title": "Co-Defendant", "image": "https://images.genius.com/a97af29ec97ef69b9b1d54a68b3f8f10.500x500x1.jpg", "lyrics": "[Intro]\nBruh, I do NOT.. fuck wit a lot of niggas bruh\nThey see me they gon' see me solo bruh\nThese pussy-ass niggas out here too creep for me, bruh\nThese niggas is not gon' snake me, bruh\nYa'll call them niggas y'all homeboys\nCrackers call y'all organization\n\n[Hook: repeat 2X]\nStay in my own lane, mind my own bidness\nHit my own licks, and get my own pennies\nKeep these niggas from 'round me cause I ain't friendly\nYou'll never slide up under me and be my co-defendant\n\n[Plies]\nTime to do bidness, drop niggas off\nNever run to them crackers on me 'bout what ya saw\nNever snake me, and get me knocked of\nNiggas like hoes, love to run they fuckin' mouth\nSpeak to 'em in the streets, won't bring them to my house\nI don't trust na'an bitch, north or the south\nWon't be around me tryin to scope it out\nThat super friendly shit, ain't about\nI don't know him, keep him from 'round me\nTryin to peep somethin? What you tryin to see?\nNever get that close to find out where I be\nI don't know that nigga, get him from 'round me\n\n[Hook]\n\n[Plies]\nNiggas come around, guess what? I stopped talkin\nHolla at'chu niggas later, grab my shit and start walkin\nFuck that shit, I done seen too much\nIt seem niggas scope niggas and gettin niggas touched\nGet in friends wit niggas, turn 'round and set 'em up\nEven my own dogs talk to 'em bout certain stuff\nMy own friends come around, nigga I hush\nOutside of courtrooms, nigga I done seen enough\nTime to get money, I'm Solo\nFo' deep doin business, that's a no-no\nCause what a nigga thinkin, you will never know\nBut do my own time nigga if I have to go\n\n[Hook]\n\n[Plies]\nI don't fuck wit no nigga, who got a lot of friends\nCause you never know, who that nigga want to win\nYou vibe wit too many niggas you spread yourself then\nAnd them the type of niggas, know everybody business then\nNigga too friendly, no tellin who he with\nYou niggas fuck wit any nigga you thank do it big\nGuaranteed you will never slide up under kid\nI keep my eyes open, and my fire hid\nThat's how I stay away, from all the fuck shit\nI gotta couple homeboys but I don't run with clique\nThe least a nigga know, the less he can snitch\nI run solo, so I don't have to kill a bitch\n\n[Hook]", "year": "2008-12-16"}]}