{"artist": "Wrekonize", "songs": [{"lyrics": "[Chorus 1: Wrekonize]\nThe time we had, the lies, the laughs\nThe fights for cash, the miles of broken glass\nI will, I will let me let (go)\n\nThe beast, the war, the need for more\nThe dream to tour and leave this at your door\nI will, I will let me let (go)\n\n[Verse 1: Wrekonize]\nLet me just go, get it going\nHow can it be even when you're screaming in my dome?\nStab me with a needle, now I'm bleeding on my palm\nShoulda known you was a clone from day one\n\nShooting stars now get this comet on the phone\nTell her this ain't worth even the skin up off my bones\nHead is but a speaker and your feature's nearly blown\nStress? No. Hey pharaoh, get grown!\n\nHold lone star riding on a soul train\nDirt up off your feet keep falling on my own name\nSinging out of key probably praying that the tone change\nSwinging from E to a canopy of cocaine\n\n[Bridge: Wrekonize]\nThis is a minimum no show\nBouncing pogo stick keeping it low pro\nFeeling of \"Oh no, shit, he gon' leave\" so\nGrab a hold of any piece of me that you can bleed slow\n\n[Chorus 2: Wrekonize]\nThe TV set, the cigarettes\nThe disrespect for a little get-get gone\nI will, I will let me let (go)\n\nThe deadly cold, the debt we owed\nCos you were on that blow\nI will, I will let me let (go)\n\n[Verse 2: Wrekonize]\nLet me just go, get it going\nHow can it be treason if I'm seated in the throne?\nBring me into Eden while I'm bleeding all alone\nShoulda known you was a clone from day one\n\nI met you back on some matter of fact\nFriend of a friend let's get together and chat\nShe had eyes like a sorceress, better than that, so\nWe got it locked and now you can't seem to let me (go)\n\nRing the alarm\nI been burned by a snake with a similar charm\nGot to learn my escape, keep a vigilant arm\nAnd run 'til I see the sunrise over the morn, I see it\n\n[Bridge: Wrekonize]\nThis is a minimum no show\nBouncing pogo stick keeping it low pro\nFeeling like \"Oh no, shit, he gon' leave\" so\nGrab hold of any piece of me that you can bleed slow\n\n[Chorus 3: Wrekonize]\nThe time we had, the lies, the laughs\nThe fights for cash, the miles of broken glass\nI will, I will let me let (go)\n\nThe beast, the war, the need for more\nThe dream to tour and leave this at your door\nI will, I will let me\n\nThe TV set, the cigarettes\nThe disrespect for a little get-get gone\nI will, I will let me let (go)\n\nThe deadly cold, the debt we owed\nCos you were on that blow\nI will, I will let me let (go)\n\n[Outro]\n(Go)\n(Go)\n\nLet me let go (go)\n\n(Go)", "title": "Let Go", "year": "2010-08-30", "album": "A Soiree For Skeptics", "image": "https://images.genius.com/d23b689edc521146ac84672312449010.700x700x1.jpg"}]}