{"songs": [{"title": "Anotha Killin’", "image": "https://images.genius.com/639621ffcdb92dfd5ebdf7c9c9fb2995.500x500x1.jpg", "lyrics": "[Intro: Brotha Lynch Hung]\nIt's me and Snoop Dogg, Kurupt and Daz, nigga\n(Another killing)\nIt's another motherfucking killing, nigga\nIt's another killing\nWe had to put this together (another killing)\nJust had to be\n\n[Verse 1: Snoop Dogg]\nThey laid one of my homies down, two of my enemies\nI grab the heat and creep up the street and squeeze\nI'm in your neighborhood, so what the fuck is up?\nAnd if I catch you I'mma pop you, nigga that's whats up!\nWe can talk about it, nah, I don't think so\nAnd I'mma catch you when you're creeping with that pink toe\nYou tryna creep up out that mink store, get you a drink\nSo when I hit you, you won't even trip to think so\nCross your heart, double dot your eyes\nYellow tape you, make you a homicide\nStretch you out like a Red Vine\nHalloween is your deadline, beddy bed time\nI zag your zig, I put a fork in the pig\nI cock the Glock and pop you my nigga, you dig?\nI open you up and leave you leaking by the face\nIn ghetto we ain't got no time to be catching no case\nToo slick, too sly, plus I'm too high\nI'm too fly and I do die, I do die\nI love to shoot an intruder, I mix the purp with the budda\nLove Chicken and Beer like the homeboy Luda\nBig Snoopy D-O-Dub, I'mma killa cuz\nI'm draped up like a steela of gorilla (dub)\nSacramento no, pedal to the floor\nAnotha killing for realer, my nigga let it go\n\n[Verse 2: Daz]\nWe on the corner a hundred (deep), blue rag the fuck up\nAnd word on the street they got blast the fuck up\nNow it's feuding and shooting and I'm running your life\nI'm in it for the stripes, nigga don't fuck up my night\nBandana, banana-clips, ready to trip\nYou niggas is assed out, see you bet' not trip\nI see some buster ass niggas at the bus stop out of bound\nWe bang the gang bang them niggas from The Dogg Pound\nChop 'em, rock 'em and stop 'em, we mashing\nEverytime we see you niggas we clashing\nD.P.G down with 24th Street\nSiccmade nigga down with them 21st g's\n(Motherfucker) Brotha Lynch Hung my motherfucking nigga\n\n[Verse 3: Kurupt]\nListen to me\nOne for the flame, and two for the trigga\nAnd three of these hollow point teflons nigga\nWhen I came in this motherfucker I had a plan\nI'll sock all you motherfuckers where y'all stand\nI'm gang banged out, riders on a mission\nWe can catch fades, nigga fuck the pistols\nPiranhas is loose in the septic tank\nWe do what you can't, I am what you ain't\nDon't even try to provoke me cuz\nLoccing, smoking, slipping, smoke me cuz\nI'll beat your ass on the low so fast\nBang on your homies, spread through your hood\nRelease these toxins like mustard gas\nScrape the Chevrolet, it's all to the good\nMy nigga Brotha Lynch, Kurupt, Snoop and Daz\n(Keep it hood, nigga)\n\n[Verse 4: Brotha Lynch Hung]\nNigga this G block, trust me\nDump on any nigga with the rusty old trusty\nSacramento yes, catch him in the chest\nRight by his tour bus left a bloody mess, yes\nIt was none a cuddy left\nCoathanga strangled him, aimed at him\nHe don't know what angle I'm coming from\nTangled him, spiderwebs all over his cranium\n(That nigga has spiderwebs all over his cranium, nigga)\nMe and Crooked I know, niggas be talking too much\nNigga shut your pie hole, everybody know you do suck\nThis ain't a reality show, hungry niggas do touch\nMothafuckas two clutch, giving niggas who cuss\nGot an army of niggas, I'm Strange, it ain't a rumor\nWe giving niggas brain tumors, hit 'em with the Luger\nI'm doing the rapping and this nigga is the shooter\n'Yay got a mask on but nigga he's a shooter\nYou'll never see his face on a computer\nSpiderman Jr. Oklahoma chewmer\nPoke a ho with two cuts\nThis motherfucker said he about to do what?\nGet chewed up, it's Dinner and a Mova'\nDeuce-Four, nigga", "year": "2010-03-23", "album": "Dinner and a Movie"}], "artist": "Brotha Lynch Hung"}