{"songs": [{"lyrics": "[Produced by Ski Beatz]\n\n[Intro: JAY-Z]\nHa ha, ha ha\nWhat.. '96 and forever\nRok-A-Blok, Roc-A-Fella\nYeah, keep it realer than most\nMarcy, Brooklyn... yeah\n\n[Chorus: Mecca]\nI'm feeling it, fill the glass to the top with Moët\nFeeling it, feel the Lex' pushing up on the set\nI'm feeling it, feel the high that you get from the lye\nFeeling it, if you feel it raise your L in the sky\n\n[Verse 1: JAY-Z]\nI keep it realer than most, I know you feeling it\nCristal's on ice, I like to toast, I keep on spilling it\nBone crushers I keep real close, I got the skill for this\nOn my back the flyest clothes, looking ill as shit\nTransactions illegitimate 'cause life is still a bitch, and then you die\nBut for now, life, close your eyes and feel this dick\nSince diapers, had nothing to live for like them lifers but\nMaking sure every nigga stay rich within my cipher\nWe paid the price to circle us, success, they turned my mic up\nI'm 'bout to hit these niggas with some shit that'll light ya life up\nIf every nigga in your clique is rich, your clique is rugged\nNobody will fall 'cause everyone will be each others crutches\nI hope you fools choose to listen, I drop jewels, bust it\nThese are the rules I follow in my life, you gotta love it\nJiggy-Jigga looking gully in the joint\nIf y'all niggas ain't talking 'bout large money, what's the point?\n\n[Chorus: Mecca]\nI'm feeling it, fill the glass to the top with Moët\nFeeling it, feel the Lex' pushing up on the set\nI'm feeling it, feel the high that you get from the lye\nFeeling it, if you feel it raise your L in the sky\n\n[Verse 2: JAY-Z]\nEven if it ain't sunny, hey, I ain't complaining\nI'm in the rain doing a buck 40, hydroplaning, what, shorty?\n(Where you disappear to, son?) Maintaining\nPutting myself in a position most of these rappers ain't in\nI'm living, the ill streets' blues got you hunger pang-in'\nNothing to gain and a whole lot to lose, you still singing, fool\nI'm thorough, in every borough, my name be ringing\nWarming it up for the perfect time to hit your brain, and\nYa feelin' it? To all the girls that bought a girdle to conceal my bricks\nNo doubt, they can vouch my life is real as shit\n'95 South and Papi on the Hill and shit\nAnd all the towns like Cambridge that I killed with, shit\nAnd all the thorough-ass niggas that I hustle with\nThrow your joints in the air one time and bust your shit\nThese fake rappers can't really know I'm loving it, you feeling it?\n\n[Chorus: Mecca]\nI'm feeling it, fill the glass to the top with Moët\nFeeling it, feel the Lex' pushing up on the set\nI'm feeling it, feel the high that you get from the lye\nFeeling it, if you feel it raise your L in the sky\n\n[Verse 3: JAY-Z]\nWhat, y'all ain't heard that nigga Jay hot?\nThe Cristals they keep me wet like Baywatch\nI keep it tight for all the nights my momma prayed I'd stop\nSaid she had dreams that snipers hit me with a fatal shot\nThose nightmares, ma, those dreams that you say you've got\nGive me the chills but these mills, well, they make me hot\nY'all don't feel me, enough to stop the illing right?\nBut at the same time these dimes keep me feeling tight\nI'm so confused, okay I'm getting weeded now\nI know I contradicted myself, look, I don't need that now\nIt's just once in a blue when there's nothing to do\nAnd the tension gets too thick for my sober mind to cut through\nI get to zoning: me and this chick on the island and then we're boning\nI free my mind sometimes I hear myself moaning\nTake one more toke and I leave that weed alone, man\nIt got me going, shit\n\n[Chorus: Mecca]\nI'm feeling it, fill the glass to the top with Moët\nFeeling it, feel the Lex' pushing up on the set\nI'm feeling it, feel the high that you get from the lye\nFeeling it, if you feel it raise your L in the sky\nI'm feeling it, fill the glass to the top with Moët\nFeeling it, feel the Lex' pushing up on the set\nI'm feeling it, feel the high that you get from the lye\nFeeling it, if you feel it raise your L in the sky\nI'm feeling it, fill the glass to the top with Moët...", "title": "Feelin’ It", "image": "https://images.genius.com/fa6ec0082e028894f857f83ccd133a2d.500x502x1.png", "year": "1996-06-25", "album": "Reasonable Doubt"}], "artist": "JAY-Z"}