{"songs": [{"year": "2008-09-30", "image": "https://images.genius.com/58b64dded93b74665f808ed12bebf0d8.640x640x1.jpg", "title": "Intro", "album": "My Turn To Eat", "lyrics": "[Intro Dialogue: Lil' Duval]\nGood evening ladies and gentleman, this is Ryan Depressed\nOut here at the Grand Hustle, Grand Hustle album release party\nFor some guy, I have no idea who the fuck this nigga is\nBut it's gon get me closer to T.I., so I guess I gotta do it\nMatter fact, here he come right here\nWassup man, what's ya name man\nBig Kuntry\nI ain't ask ya how big ya was\nI'm just sayin' who are you\nOh that's ya name\nOh okay cool, so um what's goin' on\nWait, what's your name again, big, what\nI'll just call you T.I. friend\nAye check this out T.I. friend\nT.I. friend, how can I get down wit T.I.,\nHuh?\nThis about you\nYou don't realize no one gives a fuck, about you\nMan gon take yo ass in there, gon head wit ya little show ya finna do\nThis bitch is packed though\nGoddamn you got a lot of people at this motherfucker\nYou must have done told 'em you know T.I.,\nYou done put out a myspace flash, and say hey T.I. gon be here\nWhere T.I. at? he ain't here, what?\nThis all for you, I don't believe this shit\nI'ma have to go in here myself to see this shit\nYou have to show me playa, make a believer out of me\nShow me it's your turn to eat\n\n[Verse 1: Big Kuntry King]\nAin't no dick ridin' money makin' killers here\nI'm gon keep on killin' shit until a nigga get a mill\nNiggas talkin' down mayne, say that he ain't the south\nCome to the underground, you see them slaves walkin' out\nBricks we supplyin' them, bird watchers eyein' em\nHaters what we iron em, snitches we retire them\nAin't nobody fly as him, I'm picture perfect like HD film\nBig homie, yeah that be him, niggas try to copy, well that be them\nMy swag rollin' off through they ears, I'm so real when it come this here\nMy fans happy that a gangsta here, real life, trapper\nThese niggas ain't gangsta, they wanna be best rapper\nThey life ain't nothin' but microphone, when a real nigga tryna get the grind up\nNigga talk shit gettin' clapped up, yeah the trap'll sound like a audience\nYou already know you ain't hard to hit, show me you fake, you outta here\nWhen it come to the streets my heart is here, on the stage where they want me at\nLook at the arenas gettin' pack, security, they ain't movin' back\nCause the cocaine I'm spittin' that\n\n[Outro: Lil' Duval]\nDamn dawg, that there was tight as shit mayne\nNigga you is the next nigga to eat nigga\nI ain't tell you I rap did I?"}], "artist": "Big Kuntry King"}