{"songs": [{"year": null, "album": "Tell the World My Name", "image": "https://images.genius.com/13eeaa5fc1948dbfc3568cb96d5a1c08.400x400x1.jpg", "title": "Everybody Knows Me", "lyrics": "[Verse 1]\nWhen I first started, making records\nThey said I'd never do it\nI knew I could, but me, I had to prove it to myself\nSo as I grab the mic on the shelf\nI got some help from P and E, and Solo went for sell\nNow it starts, so many rappers scream my name out loud\nSuckers used to diss me, oh how they love me now\nI used to want to cry, they used to diss me like\nFriends, girls, even some family members\nWould say I would never get off the ground\nNow they tell the world my name as I hear my jam Spellbound\nSome yell, \"Oh, did you hear the new Solo's?\nNew record was playing on the radio rap show?\"\nSome that know me, say \"Nah, it can't be so\"\nFor the record Kevin Madison, is K-Solo\nI worked hard for so long, but people used to tell me\n\"No one wants to hear your song\", though I spoke\nAnd wrote, until I couldn't anymore\nKept rappin' and rhymin' til' my voice got soft\nThen it happened, one day I finally seen I got paid\nEntertainin' large crowds with the mic on stage\nBut what bugs me out about suckers who used to diss me\n'Cause now I'm makin' records, and everybody knows me\n\n[Bridge]\nNow everybody knows me\nNow everybody knows me\n\n[Verse 2]\nWhen I went to school, you know I played it cool\nI never played sports and I was no teacher's fool\nI like this girl a lot 'cause I thought she had charm\nBut she told me one day, I couldn't take her to the prom\nHer moms and dads said I wasn't her daughter's type\nIt really hurt my feelings black, and got me uptight\nSaid to myself, why are they treatin' me this way?\nThen I got fed up, and Solo said one day\nI'll make it with my music, you'll wait and you'll see\nYou'll be in line, with tickets, waitin' to see me\nPreform, all night long as I go through\nSong after song after song til' you see that I'm gone\nYou tell your friends now, K's big now\nYou like the way you're rappin', entertain the crowd\nAnd you were impressed by the way that I dressed and all\nGlitter on my fingers, and chains on my neck\nGet off me, girls stop ridin' me\nIn other words, don't even flip and talk about me\nYou didn't do it then, so why do it now?\nSee you yellin' my name, when you see my rock the crowd\nAnd be the girl that gotta get this, pointed at the door\nBy the bodygaurd, the door where we exit\nI can't be with it, I ain't stupid, I had one girlfriend before\nBut now my best friend is cupid\nI ain't goin' for it, so stop callin' me, honey\nAnd tell my so-called friends I ain't got no money\nIt's tied up, some are locked in a bend\nYo Key, where is everybody goin'? Thanks\nFor lettin' me know that you're those kind of friends\nWho want to hang on when I'm fat, but when I was thin\nYou weren't around, nowhere to be round\nYou were with your other crew and posse\nOn the other side of town\nNow you flip and want an autograph from me, see\nYou used to diss me, now everybody knows me\n\n[Bridge]\nNow everybody knows me\nNow everybody knows me\n\n[Verse 3]\nWhen I was just a young kid, and I wanted to rap\nI got down with this group, who got put on the map\nFor bein' I was so young, and they were so old\nThey used to say that I was crazy and a little bit too bold\nBut I always listened to the group I thank for gettin' down\nI even got my man named Jerry J and put him down\nBut they were jealous, they didn't want me to be the star\nThey kicked me out the group, and named the group\nThey would cheese me all the time and say \"Solo\"\n\"Did you hear our record without you on the radio?\"\nI was hurt, what could I say or do, when my best friend\nJerry J betrayed me and stayed with the group\nMy mom said \"Son, you'll make it and you'll see\nThey'll get nowehere fast, 'cause god don't like ug-uly\"\nI prayed, and kept my fate crossed\nAnd heard Tommy Boy, had cut this group off\nI wasn't happy to hear that, but that goes to show\nIt happened to them, because they probably dissed Solo\nAnd if they're listenin' to somewhere around me\nFellas, y'all used to diss me, now everybody knows me\nThere was another in the group besides me\nHe left, his name was Parrish, from EPMD\nSome got pissed 'cause Parrish got paid\nAnd his records went gold in like 30 days\nBut I wasn't jealous, and I was still gettin' down\nHis path crossed mine, and Pete put me down\nAnd now I'm makin' records, I mean G's\nSee? Everybody knows me\n\n[Bridge]\nNow everybody knows me\nNow everybody knows me\nNow everybody knows me\n\n[Outro]\nAlbee in effect, word up\nTo the posse and EPMD\nMy money's all tied up, now ev- now everbody knows me\nMy money's all tied up, now ev- now everbody knows me\n\"Yo Solo man, where you goin', man? You're Solo! What's up man?\"\nYo, get outta my face, man, or i'll punch you in the artery\nIt's like that \"Aw, it's out!\"\nMy, my, my-my-my-my-my money's all tied up, everybody knows me\nMy-my-my money's all tied up, everybody knows me\nMy money's all tied up, everybody knows me\nEverybody knows me \"Nobody knew you before\"\nGet the mack all mazed, word up\nEverybody knows me"}], "artist": "K-Solo"}