{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "I Do My Thing", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Verse 1: Nervous Reck]\nBig Nerve out of the bullpen with the assist\nWe going back to war tell them boys to re-enlist\nI got more shit you don't wanna be a vic\nI'm bangin' yall heads it's bout to be a bitch\nIt's bout to be a lick I'm feelin' very vigorous\nI'm bout to be set for life like I'm jigga's kids\nAll terrain music you know how real it is\nI got the beat an shit now look what I did\nMy man filthy told just grab my balls on it\nSo what did I do? Yeah I grabbed my balls on it\nWhat should you do? I say bet it all on it\nYeah thats my advice just bet it all on it\nDo what I say so I ain't talking for nothin'\nDon't take no from a holes yeah especially in public\nJ. Cole we way swoll either hate it or love it\nGot hoes we take those if you don't like it then fuck it\n\n[Hook]\nYou got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it\nYou got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it\n\n[Verse 2: Nervous Reck]\nLook at the product it's nice\nFuck with fire and ice\nCheated on my girlfriend until my tires got sliced\nJust got some x pills we gonna try 'em tonight\nHang on tight girl you going for the ride of yo life\nEverything was fine until she said I wasn't her type\nOh I get it all the time its because that I'm white\nShe was like \"nah I'm used to dudes packin' the pipe\nSo you can just drop me off if you ain't tappin' me right\"\nI hysterically laughed girl I ain't scared of yo ass\nI don ate more pies than even sara lee has\nSo when I get done with that you wanna marry me ha\nPlay in the backyard so I can bury the cash\nAnd I can bury the bone cuz I am heir to the throne\nI don't need no help see I can carry my own\nNo time for tricks bitch curly larry or moe\nI hit with a big stick it's only fair that you know\n\n[Hook]\nYou got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it\nYou got your feelings hurt?\nYou wanna talk about it?\nGuess what bitch, I don't wanna hear about it\nGuess what bitch, I don't wanna hear about it\nI do my thing and I don't care how you feel about it"}], "artist": "J. Cole"}