{"artist": "Andy Mineo", "songs": [{"title": "Ghost", "album": "Uncomfortable", "year": "2015-09-18", "image": "https://images.genius.com/9a23efdbe421de59647ed95b73952a34.1000x1000x1.jpg", "lyrics": "[Intro: SPZRKT]\nWhat you even come around for?\nYou ain't have my back even when I had yours\nWe said we'll take the whole world over\nYou couldn't even tell me what's wrong\nStill think about it though it's been so long\nThought we'd be down forever, now you're gone\n\n[Verse 1]\nI remember, I remember\nIt wasn't many days that we didn't chill together\nWe was hangin' in my dorm room, we would write them rhymes\nThen record 'em in my closet cause we was next to shine\nEven had our own handshake, fall into that hug\nAnd we was different colors, but we swore that we were blood\nAnd, uh, all of a sudden you deaded everyone\nI had to find out through the internet you had a son\nAnd when I text you won't hit me\nThis music took me all around the world, you were s'posed to go with me\nBut, uh, the thug changes and love changes\nAnd them best friends become strangers\nI knew what Nas said was true\nI just never thought it be about you\nBut, um, people come, people go\nAnd when they leave it's like they took a piece of your soul\nIt's sorta like a ghost\n\n[Hook]\nI didn't know you could walk through walls\nI didn't know you could float\nI didn't know you could disappear\nI guess you were a ghost\nGhost\nGhost\nWe used to be so close\n\n[Verse 2]\nI pray I don't get used to this feelin'\nThe closer you are, deeper the cuts, longer the healin'\nThese feelings and insecurity, they circle\nI just walk around like ain't a soul on this earth that's hurtin' me\nI do this for protection\nWhen I feel rejected I just dead 'em first, man\nSomebody bring the hearse in\nMy worst fear in life is that my wife would have the urge to leave\nLike everybody else start desertin' me\nI know we made vows, but I cannot believe when I see divorce rates\nYou know why I got doubts\nFear takin' control\nSeein' it, now I know\nTo truly love a person, the bravest act of the soul\nI could either get my heart again, put it in the open\nOr lock it in a box where it never be broken\nBut there it grows cold, lifeless and old\nNobody could come close but it's safe\nProtected from the ghost\n\n[Hook]\nI didn't know you could walk through walls\nI didn't know you could float\nI didn't know you could disappear\nI guess you were a ghost\nGhost\nGhost\nWe used to be so close\n\n[Outro: SPZRKT]\nWhat you even come around for?\nWhat you even come around for?\nWhat you even come around for? (let it go, let it go, let it go)\nWhat you even come around for?\nYou ain't have my back even when I had yours"}]}