{"songs": [{"title": "Don’t Stop", "image": "https://images.genius.com/069abf7637d0c6d1c2db910fd370ca65.500x500x1.jpg", "lyrics": "[Talking - C-Bo]\nFirst off we the mutha fuckin Thug Lords\nNow for all you niggas bangin, that mutha fuckin West Coast like nigga?\nYouknowhatI'msayin? And fa sho no lie\n29th Street Crip Gang nigga, C-Bo holdin nothin back\nYukmouth, Spice 1 and we do it live, for the world it's still fuck off\nYou know what and we in that you knowhatI'msayin?\nAnd this how we handle business, nigga\nFrom the early 80's to these 2 G's, boy\n\n[C-Bo]\nHuh, We blaze em up with AK's, double my clip and we dip\nSet trip and get hit, flip Crip or get zipped\nRun with the Crips, catch me clumsy in the 6\n6 rag invertable slide divertable, murder ya\nDead and gone never heard of ya\nNow we stuffin lead in the crome, bout to hurt ya\nPack ya down in the earth, we put work in like Mad Dirt\nOdainers twistin like the revolver or the earth\nFuck church, it's a must I burst and curse\nYeah I'm a West Coast Bad Boy but a thousand times worst\nDime piece, gun in her purse, one in her skirt\nCross me, bet ya life that my bitch burst\nGot me lockin down the world for the North Pole\nToo cold to hold lyrics froze my wrist and my hoes\nNumber one Thug Lord, fuck wit us!\nI won't lie the whole world gonna rush wit us, tell em\n\n[Hook - Yukmouth and Spice 1]\nThug Lord niggas boss up and don't stop\nThugged out niggas boss up and don't stop\nThug Lord niggas boss up and don't stop\nThugged out niggas boss up and don't stop\nBlow! Blada baba bo, blada baba bang bang\nSpice, Yuk and Bo we do the damn thang\nBlow! Blada baba bo, blada baba bang bang\nThug Lord niggas we do the damn thang\n\n[Spice 1]\nNigga you listenin to the B-O-S-S-I-L-I-N-I\nYukmouth and C-Bo you know they label us born to die\nBut I pistol slap you and two niggas like 3 Stooges\nWalk over to the bar and sip on Gin and juice\nIt's just the gangster in me, the thug in me\nMug in me and get yo fro pushed back like homie\nYou lil clown ass nigga walkin in bozo shoes\nWhile my niggas out here doin hits, makin the news\nWhat you think you gon' dodge these bullets like Matrix?\nLike a condom, I even lay teck on a bitch\nNow that's some cold shit, a low lick, a cold hit\nLeave a nigga at a funeral cryin with no bitch\nSome Thug Lord shit nigga shoot up ya coffin\nNiggas cross game get murdered by bosses\nCost's yo mutha fuckin life when you play with the rules\nThey got a n-uh-nigga still singin the blues\n\n[Hook - Yukmouth and Spice 1]\nBlow! Niggas boss up and don't stop\nThugged out niggas boss up and don't stop\nThugged out niggas boss up and don't stop\nThugged out niggas boss up and don't stop\nBlada baba bo, blada baba bang bang\nThug Lord niggas we do the damn thang\nBlow! Blada baba bo, blada baba bang bang\nSpice, Yuk and Bo we do the damn thang\n\n[Yukmouth]\nBitch, next up to bat, Yukmouth destroy the earth with rap\nImagine pain worse than that, my niggas coppin birds of crack\nServin track, cock back and burst the gat\nI want my turf back, I hurt that, work that, twerk that\nRolex speed spot like Joe Pesci\nAK ready, we deadly, bitch!\nI'm like Hannibal, rector eat MC's for breakfast\nI'm the hardest artist to sign to a label in Texas\nYes it's that nigga with the platinum grill full of princesses\nInvisible set, straight up herbal molescents\nIn less than 60 seconds I kill em leavin em breathless\nDon't fuck with bread, run outta state bit records\nWith chin checkers in Benz stretches who win cheddar\nWhen fakers scramble liquid hands on niggas with vindettas\nI'm like 10 fraredders bustin off at the same time\nPayed rhymes, I kick shit off when it's game time\n\n[Spice 1]\nBlow! blow, blididat, blididat!\nBlow, blow, blididat, blididat, blididat!\nBlow, blow, blididat, blididat\nBlididat, blididat blalalalat!\nBlada baba bo, blada baba bang bang\nThug Lord niggas we do the damn thang\nBlow! Blada baba bo, blada baba bang bang\nSpice, Yuk and Bo we do the damn thang\n\n[Brother Lynch]\nI'm hittin niggas so hard with these you would need Jesus\nBeleive these is yo last days I can see you cleavich\nThat's why I'm fuckin you with the 9 millimeter\nAnd I feed a nigga with the heater, he was a long bleeder\nAnd he taste good with fajitas, heat em up now eat\nMember me? Nigga that be eatin raw meat\nWith tiger claw feet so it's easy to creep\nYou leave me no reason but to leave niggas bleedin\nRecieve grievence with extra Season of the Sicc\nI pick em off like Brock Marion\nHe kept starin so I took care of him, shot him up with heroin\nLike malt liqour, to the liver hitter, to the river wit ya\nDip ya down deep, down deep\nWhere pirana heat they eat they meat\nHeat up they seats, they seats with metal from the Southside ghetto\nI swear I'll make y'all mutha fuckas yellow\nTired of diggin ditches like the GoodFellows\nNot good with mellow, I keep the meat\nKeep it hangin in the closet like pig feet\nDelete, come with the\n\n[Spice 1]\nBlow! Blalat! Blow, blow, blow blididat\nBlow! Blalalat! (ahah)\nBlow! Blididat, blididat!\nBlow, blow! Blalalalat! Blow (ahaha)\nBlow!", "year": "2001-08-28", "album": "Blocc Movement"}], "artist": "Brotha Lynch Hung"}