{"songs": [{"image": "https://images.genius.com/88ec3c681c282bee52d73da4d8bfcde9.512x512x1.jpg", "lyrics": "[Intro]\nGood morning sunshine\nGet your bitch ass up and get ready for work\nIt's a new day\nAh, coffee time\n\n[Hook]\nI'm trying to take it day by day\nYou see another rapper rhyming but he ain't like me\nMan, it's a brand new day\nIt's time to make the decision\nYou gonna spend today up in the kingdom or prison\nListen, I'm trying to take it day by day\nYou see another rapper rhyming but he ain't like me\nMan, it's a brand new day\nIt's time to make the decision\nYou gonna base your choices off of wishes or wisdom\nLet's go\n\n[Verse 1]\nKan City legend, blue belt in jujitsu\nAll I need is marijuana, coffee and my rent due\nAnd I'll be flowing so insane. Whoo!\nYou wanna see something sexy? Open up my brain. God damn!\nSexy like a March 1992 Sports Illustrated swimsuit edition centrefold with Kathy Ireland up on the top cover\nWhipping up some peanut butter cookies with the pot butter\nUsed to steal UFC VHS tapes out of Blockbuster\nRoyce Gracie was a monster, sick\nTriangle choke a motherfucker 'til his face turn bright-ass red like a lobster... dick\nI'm from Kansas City, home of Jesus\nAnd obese kids that eat way too many Reese's and drink too many energy drinks\nThe only way that I can fucking escape is to sit here and think\n\n[Hook]\nYou know I'm trying to take it day by day\nYou see another rapper rhyming but he ain't like me\nMan, it's a brand new day\nIt's time to make the decision\nYou gonna spend today up in the kingdom or prison\nListen, I'm trying to take it day by day\nYou see another rapper rhyming but he ain't like me\nMan, it's a brand new day\nIt's time to make the decision\nYou gonna base your choices off of wishes or wisdom\nLet's go\n\n[Verse 2]\nMy name is Mac, I hate pop music\nI love to sleep in all day and not do shit. Nap time, biatch!\nI'm feeling so priceless, have a fucking existential crisis as I write this\nGirl, why you acting like a stupid hoe?\nThe whole entire world is watching like the Truman Show\nYou never plant seeds, never have food to grow\nAll I want to do is read books and make stupid dough\nHoe please, that's the motif\nI never put you on no leash, but I promise that I'll love you if you make a little salad with some walnuts and goat cheese\nPop a beer and yell \"Go Chiefs!\"\nI used to take drugs to feel normal, now I feel high when I'm sober\nSometimes I think about my birth, sometimes I think about my death and all the time I wonder which one is closer\nBut it don't matter\nJameson whiskey up in my bladder\nSpent fifteen years trying to be a rapper\nNobody paid attention 'til I started mixing pancake batter\nNow they come to my shows like \"Go faster\"\nExercise, drink wine daily, make life sweet like a praline\nDrop down and get in to the modified Cobra\nAnd shoutout to the flexible bitches that do yoga\n\n[Hook]\nI'm trying to take it day by day\nYou see another rapper rhyming but he ain't like me\nMan, it's a brand new day\nIt's time to make the decision\nYou gonna spend today up in the kingdom or prison\nListen, I'm trying to take it day by day\nYou see another rapper rhyming but he ain't like me\nMan, it's a brand new day\nIt's time to make the decision\nYou gonna base your choices off of wishes or wisdom\nLet's go!\n\n[Skit]\nHi. I'm Hamilton. I'm aspargus, artichoke rising\nHi. I'm Lorace. My sign in spinach, it's the green pea rising\nHi. I'm Willie. [Oh really?] And I don't have a sign", "year": "2016-09-13", "album": "Congratulations", "title": "Day by Day"}], "artist": "Mac Lethal"}