{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/42281596b18a280da263b6c5dbe8f23e.540x540x1.jpg", "year": "2013-03-14", "album": "Trunk Muzik Returns", "lyrics": "[Intro]\nI've got a lot of things to do\nLike what?\nDoesn't matter, I don't want Pa to skin me alive like he's gonna do to you if he finds out\nPa said not to bother him. And if he's not gonna be home, how can I bother him?\nIt'd be better if you just forget about it\nWell I'm going to do it, and I'm gonna take Jack with me, cause Pa didn't say anything to him\n\n[Pre-Verse]\nWay down this country road in a holler\nWhere they make that moonshine still\nThere's an old man on the porch on a shack\nAnd the shack is where he lives\nRound the town they call him Pa\nIt's Pa from on the hill\nAnd every time Pa does slay a hog\nYou can hear that hoggy squeal\n\n[Verse 1]\nI’m from the belly of the Bible Belt\nThat motherfuckin' preacher daughter's son\nWhere you can't find no woman, no man\nNo cousin, no friend without a gun\nAlabama, that is my home\nBut the trailer park has got my heart\nOff in the hood, I'm at home\nWhen I play in the woods after dark\nYou won't find me sober much\nAlways got the bottle of Jacky O\nI take my sips, I talk my shit\nAnd I fight anybody that wants to go\nTall and slim, walk with a limp\nCause my nuts are oversized\nFuck your dope and your alcohol\nBecause your shit is overpriced\nHit the bootleg for 24 before I'm 21, math'matics\nGoing to jail cause I'm drunk at Piggly Wiggly, (dagnabbit)\nCause I be here and I do my time\nCause I can't make bail on minimum wage\nNothing to do in the country but get drunk\nAnd watch that pendulum sway\nBack in the saddle again\nThrow my middle finger up to the law\nI ain't gotta rob nobody tonight\nBut I might do it just because\nI'm a nut, I get bored\nDid some pills, but I want more\nFuck this world, fuck this town\nIf I fuck you once, I fuck you sore\nFuck, fuck, fuck, shit, goddamn\nPussy cunt, bitch suck a cock\nIf you want some of this rock-and-roll\nTake this pipe, suck this rock\nWhere's the fire, Super-Hot\nClean em' up, grab a mop\nCatfish on my shit\nFuck with me, you gonna get dropped\n\n[Hook]\nCatfish Billy, Catfish Billy, yea, yea\nCatfish Billy, Catfish Billy, yea, yea\nCatfish Billy, Catfish Billy, yea, yea\nCatfish Billy, Catfish Billy\n\n[Verse 2]\nYou don't want it with me, motherfucker\nI promise I'll put you with the piranhas\nInside of a shallow swamp\nAnd then make you follow a boat full of drinking-water\nAnd sing to you lullabies\nWhile I sip on Coronas under umbrellas\nGot a propeller\nSharp enough to eat through a two-footed root of a tree\nIf it's under me, then it's cool\nI keep movin'\nSo why do you think a fuckin' hater\nWould lay a log in front of my boat\nAnd put a stop to what I do? Buddy, whatever\nWhen I get up in the morning I think about\nWhen it's all over they can put my body up in the river\nWith everything I did for the culture inside of a book\nAnd light a candle for my mama\nWho got sick from the fucking fame\nImmediately\nMedia will follow me to the end of the river\nWhile the people around my body deliver\nRhythms and syllables relevant of my scripture\nI'm a sick son of a bitch, do you get the picture?\n\n[Interlude]\nMy fucking name is\nCatfish\nReally, though...\n\n[Hook]\nCatfish Billy, Catfish Billy, yea, yea\nCatfish Billy, Catfish Billy, yea, yea\nCatfish Billy, Catfish Billy, yea, yea\nCatfish Billy, Catfish Billy", "title": "Catfish Billy"}]}