{"songs": [{"year": "2016-10-19", "title": "Church / Liquor Store", "image": "https://images.genius.com/fd18d90f88a239743c1ad2caf0ed2a60.496x497x1.png", "lyrics": "[Intro: Akenya]\nOooh, ahhh\nOooh, ahhh\n\n[Verse 1: Saba]\nThey ask you, \"What's the cause and effect?\"\nOf doobies packed in they fat\nNow you callin' collect, they booby trappin' the trap\nThe police pullin' a pulley, you'll fall for it you silly\nPutty you outta shape, fuck runnin', you'll catch a case\nI can't relate to half of my relatives\nMy genetics is felony, buyin' low and resellin' it\nThey told me tell a story, I'm like. \"Why not mine?\"\nShit everybody takin' pictures, I'm like \"Why not Vine?\"\nAnd growin' from the ground up, it look like I'm a vine\nIt's rarity in my realness, yeah I'm a fine, diamond in the rough type\nRough type, roughhouse in a roadhouse like rugby\nLovely, when you hit a lick, little kick like Chun-Li\nFunny, kids that I hoop with all in county\nCounting, black bodies hunt 'em down look like bounties\nBound to, be on the block a little while longer\nThey your homies, this what home is\nWhat don't kill ya make ya stronger\nCall Obama, Jesus, Yeezus\nHe can save Chicago from the demons\nAnd the deacons when it's the end\nYeah, dodged precincts since pre-teens\nLet's pretend we privileged, not deceased, addicted\n\n[Hook: Saba & Akenya]\nIt look like funeral home, church, church, liquor store\nCorner store, dread-head, deadly, ditto\n10-4, ten foes from Cicero to Central\nWas told, \"Let it go,\" didn't know who to hit though\nNow that's church, barber shop, bottle I got\nFrom the liquor store on Cicero, I ain't 21, but he didn't know\n\n[Verse 2: Saba]\nBad habits of wrong places at wrong times\nA stray bullet'll take your first-born like the Tenth Plague\nI'm the new Pharaoh, my phone line\nForever open for prayer, the fallen soldiers ain't fell\nThey in my pen, and I do thank God\nThey say preach like Cooley High\nFrom beginnin' to end, that's Alpha and Omega\nMy city the same ghost that made Lupe cry\nSoon's you loosen up your grip, you lost then lose your life\nI loosen a dread from every time\nI gotta wash the cigarette smoke from outta my head\nLike how I'm not dead?\nGoing on 20 soon, they say I changed, that's a fitting room\nI'm still the same kid that didn't speak when we were in the school\nI just got a mic now, I turned to a real nigga\nI just knocked the white gal, and fuck who you think I sound like\nI'm a legend in the making like the director's cut\nOf I Am Legend and I'm fed up with the fuck comparison\nThese niggas don't got the truth that y'all want, do they?\nThink I'm lyin'? Then plan a trip to Chicago today\nI was 15, they was fucking with me\nThere's no logic in love, but there's no love in the streets\n\n[Hook 2: Saba & Akenya]\nIt look like funeral home, church, church, liquor store\nCorner store, dread-head, deadly, ditto\nSillou...-ette! Chalk outline, sketch!\nIt's not safe outside when they want your neck\nNow that's church, barber shop, bottle I got\nFrom the liquor store on Cicero, I ain't 21, but he didn't know\n\n[Verse 3: Noname]\nThey sold, they sold\nThey sold prison the way they pipeline, systematically lifeline\nErase all niggas, they so bulletproof from the law\nLaw abiding citizen shot, Willie Lynch do crack now\nMade the new letters shiny, now we pray King Kunta\nI hope the grave don't find me, I do my E&J kindly\nI do my time when it's timely\nSometimes the bible tastes like marmalade\nMy momma still sipping\nPolitician owe Donald Duck a quacking new kitchen\nThey kept the melting pot inside the slave plot, watch\nThey gentrified your neighborhood no needs for cops, watch\nLook at the yoga pants, coffee shops and yogurt stands\nConsumerism, holy land\nAnd on the other hand my momma land\n\n[Hook: Saba & Akenya]\nIt look like funeral home, church, church, liquor store\nCorner store, dread-head, deadly-...\n\n[Outro]\nMan, give them people hell bro...on life, let 'em know how you feelin', yo, let 'em know what's going on, bro\nFree us, every chance you get, free my nigga Marl\nFree Jimmy...Fresh, yo, Frillz, yo\nLet 'em know yo, keep us alive out there in them verses yo\nOn a real bro...aayt love bro, take care bro\nTell my brother, tell Fresh I said I love him\nTell him when you see Squeaky, tell him I love him\nTell your bro n'em I said wassup, I salute you bro\nYou sent old girl them pictures right? Aayt, flat bro, I love you bro, I'ma talk to you in a minute bro...\n**Hangs up**\nThe caller has hung up", "album": "Bucket List Project"}], "artist": "Saba"}