{"songs": [{"year": "2012-08-15", "title": "Home", "image": "https://images.genius.com/47d1f1ea5a1bc497fb550fbf7675009a.500x500x1.jpg", "lyrics": "[Chorus]\nHome, whoa, whoa, whoa\nWhoa, yeah, whoa, yeah\n\n[Verse 1]\nIt’s probably something that you used to, you got me\nSo stuck on you cause you that cool, baby\nBorn in the USA, I have to say it\nI wear my pride like a tattooed lady\n\n[Pre-Chorus]\nThe way these stars and stripes\nLight up the sky tonight\nCan’t seem to find a place\nLike where we at tonight, like where we at tonight\n\n[Chorus 1]\nSo much to see, so much to say, I mean this\nLand of the free and the home of the brave\nYou call this nation your own, this nation your place\nI call it good old times in the USA, we call it\n\n[Post-Chorus]\nHome, whoa, whoa, whoa\nWhoa, yeah, whoa, yeah\nFeels so good to be home, whoa, whoa, whoa\nWhoa, yeah, whoa, yeah\n\n[Verse 2]\nYou'll say \"Life’s a party,\" if you don’t know, I'll say it\nYou’ve come prepared? Well, I hope so, baby\nI’ve got a place we could all roll and later\nWe'll sneak off on the low, low, faded\n\n[Pre-Chorus]\nThe way these stars and stripes\nLight up the place at night\nCan’t seem to find a place\nLike where we at tonight, like where we at tonight\n\n[Chorus 2]\nSo many nights and so many days, remember\nJust being home and kissing my face?\nYou hate the times you were gone, could never erase\nThese good times that we had in the US of A, we call it\n\n[Post-Chorus]\nHome, whoa, whoa, whoa\nWhoa, yeah, whoa, yeah\nFeels so good to be home. whoa, whoa, whoa\nWhoa, yeah, whoa, yeah\n\n[Verse 3]\nSo welcome back, the troops that were gone\nTo every person flicking lighters went out, come home\nAnd if I’m lucky catch the red eye and make it home\nAnd we can do it all again in this place we call, we call\n\n[Outro]\nHome, whoa, whoa, whoa\nWhoa, yeah, whoa, yeah\nFeels so good to be home, whoa, whoa, whoa\nWhoa, yeah, whoa, yeah", "album": "OK Cool"}], "artist": "Sammy Adams"}