{"songs": [{"image": "https://images.genius.com/6438e249e54997f8504fca57219b4738.1000x1000x1.jpg", "title": "Black Zombie", "album": "The Lost Tapes", "year": "2002-09-23", "lyrics": "[Verse 1]\nUhh, yo, you believe when they say we ain't shit, we can't grow?\nAll we are is dope dealers, and gangstas and hoes?\nAnd you believe when they be telling you lie, all on the media?\nThey make the world look crazy to keep you inside?\nWhy you listen when the teachers at school\nKnow you a young single parent out struggling, they think you a fool\nGive your kids bad grades and put 'em in dumber classes\nKilling shorty future, I wonder how do we last it?\nUnderground in they casket, ancestors turning\nI'm learning something every day, there is no Lazarus\nWords like God is Greek or Latin\nSo if you study Egypt, you'll see the truth written by the masters\nMy niggas is chilling, getting high, relaxing\nEnvisioning, owning shit, yo it can happen\nWhat do we own? Not enough land, not enough homes\nNot enough banks, to give my brother a loan\nWhat do we own? The skin on our backs, we run and we ask\nFor reparations, then they hit us with tax\nAnd insurance if we live to be old, what about now?\nSo stop being controlled, we black zombies\n\n[Chorus]\nWalking talking dead, though we think we're living (black zombies)\nWe just copy-cat, following the system (black zombies)\nWalking talking dead, though we think we're living (black zombies)\nWe just copy-cat, following the system (black zombies)\n\n[Verse 2]\nAyo, we trapped in our own brain, fucked behind bars\nWe've already gone insane\nWe've already gave up, cut our own heads offs\nStab our own backs and dream too much\nWithout fulfilling reality; too greedy and\nCan't have one or two chains, we need three of them\nCan't have one or two guns without squeezing 'em\nOn our own people and, fuck black leaders\n'Cause whites ain't got none leading them, the rhythm is cosmic\nNas is divinity, the deity's prophet\nLet's all get down and get up\nVictims walking 'round with Down's Syndrome, all stuck\nFainting, shouting, catching Holy Ghost in church\nScared to do it for ourselves 'less we see somebody doing it first\nWe begged, we prayed, petitioned and demonstrated\nJust to make another generation - black zombies\n\n[Chorus]\nWalking talking dead, though we think we're living (black zombies)\nWe just copy-cat, following the system (black zombies)\nWalking talking dead, though we think we're living (black zombies)\nWe just copy-cat, following the system (black zombies)\n\n[Verse 3]\nYou scared to be yourself, 'cause you in a trance\nFeel free, hear the music and dance\nIf you cared what they think, why wear what they wear, just for you\nDumb niggas with long beards like they Arabs or Jews\nOr from Israel, Bismillah al rahman al rahim\nIslam's a beautiful thing\nAnd Christian and Rastafari, helps us to bring\nPeace against the darkness, which is ungodly\nSo what's the black man's true religion, who should we follow?\nUse your own intuition, you are tomorrow\n{*roaring*} .. That's the sound of the beast\nI'm a Columbia record slave, so get paid\nControl your own destiny, you are a genius\nDon't let it happen to you like it did to me, I was a black zombie\n\n[Chorus]\nWalking talking dead, though we think we're living (black zombies)\nWe just copy-cat, following the system (black zombies)\nWalking talking dead, though we think we're living (black zombies)\nWe just copy-cat, following the system (black zombies)\n\n[Outro:]\nWake up! Black zombies in a spell for more than fo'-hundred years\nGhetto niggas won't have it no mo', can I get a witness?\nWhy listen to somebody else tell you how to do it\nWhen you can do it yourself; it's all in you, do it, do it\nDo it niggas.. c'mon, uhh, peace..."}], "artist": "Nas"}