{"artist": "Boogie", "songs": [{"album": "Thirst 48", "title": "Bitter Raps", "year": "2014-06-24", "lyrics": "[Intro]\nYo it's a thin line between opinions and bitterness my nigga\nChoose wisely\nAyo this thirsty shit could be a real deadly thing bruh\nDon't be the next victim of Thirst 48\nUnless it's too late, I think it is\n\n[Verse 1]\nWhoa, uh, and I'm a witness (I'm a witness), shit\nI hate when niggas get to flexing\nJust to show off for some bitches (for some bitches)\nBut still ain't got none, hmm (and still ain't got none)\nYou smoke 'em out just for the kisses\nAlways asking for a shotgun\nYou need to kill that (need to kill that)\nWhoa, I know I always say I'm numb\nSo you should know that we don't feel that (we don't feel that)\nNo, we don't feel that (we don't feel that), huh\nBut we ain't on the same thing\nNo, we ain't on the same thing\nSo what you saying? (what you saying?)\nUh, I hate when niggas get grown up\nAnd outta nowhere get to bangin (oh, we bangin?)\nLike where you hanging? (where you hanging?)\nHmm, I wonder if them niggas know you\nAt the place that you be claiming (prolly not)\nOr you just acting (or you just acting), whoa\nAnd most you niggas is my sons\nShit, I should claim you on my taxes (on my taxes)\nIt's more than rapping (it's more than rapping)\nHa, but we ain't on the same thing\nNo we ain't on the same thing\n\n[Interlude]\nI love ya'll bitches twerk videos, though\nJust ya'll ego I hate sometimes, haha\nOh\nYeah\nAnd you niggas really gotta stop doing these gay ass poses\nAll over the social, what, tryna be models\nI don't know if niggas is models, rappers, or what\nThe fuck is going on bruh?\nReal rap, uh\n\n[Verse 2]\nSomebody help me (somebody help me), whoa\nI hate when niggas roll up weak blunts\nJust so they can take a selfie (take a selfie)\nGot me hot though (got me hot though), uh\nI hate when niggas pop a pill\nAnd start to thinking that they macho (oh, you thugging?)\nLike he a savage (who he think he is?), hmm\nI hate when niggas get to flexing\nJust to show off for some ratchets (for some ratchets)\nOh shit, I said that (oh shit, I said that)\nDamn, I guess I'm on the same thing\nI'm prolly on the same thing\nGo 'head and try me (go 'head and try me though)\nI hate how every LA rapper try to make a song like YG\nLike be creative (be creative), uh\nI hate when bitches call me bro\nWhen I've already seen them naked (seen them naked)\nWe ain't related (we ain't related)\nUh, damn man I hate it (hate it)\nMy most honest opinion?\nI feel like all you niggas wack (wack)\nTake this weed and roll it up up in these bitter raps\nI'm killing y'all", "image": "https://images.genius.com/6794914a8eb6758f79f0dc41ffbfa5f8.640x640x1.jpg"}]}