{"songs": [{"title": "Buy Out", "lyrics": "(Verse 1:)\nA 100 miles and running niggas gunning at the enemy\nNiggas switching sides giving up like its the end of me\nNiggas hollin' family but I know these niggas envy me\nPound game thugging to the muthafckin sentence me\n\nI'mma trending topic. Top down bitch im riding in the 'rarri\nIf u don't like me then I'm sorry\nSame OG, I'm just being me fuck a critic\nI rap about this shit cus I did it\n\nLife don't change, neither do the game\nNew niggas getting money but the rules stay the same\nWho I'm gon' sign with? Who I wanna grind with?\nThat's my only question nigga CMG I'm dying with\n\nCocaine Muzik , cars, money, guns\nEvery nigga I fuck wit done went to jail, I made they bond\nI never leave the house without my chain or my gun\nGot on my dope boy guccis or a fresh pair of One's\n\n(Talking:)\nYeah.. see nigga, see I feel like I'm one of the realest niggas that ever walked the face of earth, you know what I mean?\nAnd that ain't got nothing to do with getting no money or nothing like that nigga. That's just bein 100\nThat's being 100 with yourself. That's being 100 with the niggas who 100 wit u, you know what I mean?\nNigga I got a lot of young niggas around me nigga and it's straight up love like family nigga cuz we'll kill for\nEach other and that's on the real\n\n(Verse 2:)\nMurder was the case nigga, jump a hurdle win a race nigga\nThen I put it in ya face nigga. Took a face on my case nigga\nTold my lawyer go to trial, I'm doing it big in the meanwhile\n\nIf I lose, raise Mariah for me. If I die bust that fire for me\nPour out some liquor and get higher for me\nI'm doing this one for my homeboys, I'm hollin \"Oh Lord\". Some shit we can't afford\n\nI just be speaking from the heart but sometimes it rhymes\nAm I a real rapper or just a nigga with lines?\nI don't know, I'm confused. Do I supposed to be rich?\nYou know that ho ain't yo ho she just yo supposed to be bitch\nYo supposed to be clique. I don't want no allies\nIt's CMG homie and we don't franchise\n\nI get green guys, off those white pies\nDope in that pot and it get baptized\n\nHallelujah! Bless my shooters\nServe my Jay's up, watch him hit that shooter\nFuck this rap shit, I dont fit in\nAll these fuck boys, all these fake friends\n\nStreets on fire, plug on go mode\nStreets so damn dry, I might get a truck load\nFuck yo contract, I won't sign that\nLabels keep calling me but I won't call back !", "album": "CM7: The World Is Yours", "year": "2012-10-18", "image": "https://images.genius.com/3041aa877a139f9d730d0b4645a09c77.1000x1000x1.jpg"}], "artist": "Yo Gotti"}