{"artist": "Kid Rock", "songs": [{"image": "https://images.genius.com/8945e727a82d3353c8b6513ab26f1c97.500x500x1.jpg", "title": "I Got 1 For Ya", "year": "1998-08-18", "album": "Devil Without a Cause", "lyrics": "[Verse 1: Kid Rock]\nLit up like the 4th, I'ma happy drunk\nCome to papa big mama cause your daddy's drunk\nI wanna pump, pump it up like the Good Year blimp\nMake ya holla for a dolla, that's the way I pimp\nGold links and minks and shrimp dinners on the bayou\nThems are the things that I ain't gonna buy you\nIt's like one of them freak thangs\nHit it once, maybe every couple weeks thangs\nI got no love, I got no riches\nI don't roll vouges and I ain't got switches\nI got no game, I can't reward ya\nBut if you wanna long one, baby\n\n[Chorus: Robert Bradley]\nI got one for ya\nThis is your shot\nI got one for ya\nThis is your shot\n(Uh-huh check it)\n\n[Verse 2: Kid Rock]\nPeople always talkin' what they gonna do\nThey must want their face to maybe taste my shoe\nI can't understand all the push and shove\nAnd what the fuck to the peace and love\nWho planted that glove? Man I don't care\nI'm too busy running my fingers thru your mama's hair\nI got no time for the fakes and the phonies\nThe crooks and the creeps and the cops and the cronies\nAm I the only one on my side?\nTest my pride, I bet you run and hide\nYou think I'm weak so you looking for the kill\nBut there's sixteen shots in my ninemilly\n\n[Chorus: Robert Bradley]\nI got one for ya\nThis is your shot\nI got one for ya\nThis is your shot\n(Uh-huh check it)\n\n[Bridge: Kid Rock]\nJimmy Jimmy Ji-Jimmy Jimmy\nYeah... Yeah, lay it down brotha\n(Lay it down wit it baby)\n\n[Verse 3: Kid Rock]\nRecord companies stressing cause they all want hits\nAnd yeah I'm bout it-bout it so I make 'em like this\nThey say \"Hey there boy all we need is one song\nShorten up that hook we don't need it that long\"\nDon't wanna hear me cuss, don't wanna hear me brag\nSo I'm grabbing on my thingy while I let my pants sag\nNever been what I've written, just writing what I'm doing\nThey say they like my records but they're still boo-hooing\nMy choice always tight, my rhymes will floor ya\nHey Slime you wanna hit money? Ha ha ha\n\n[Chorus: Robert Bradley]\nI got one for ya\nThis is your shot\nI got one for ya\nThis is your shot\n(Uh-huh check it)"}]}