{"songs": [{"year": null, "title": "Face Off 2000", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "[Intro: Sauce Money & Jay-Z]\nSuace Money, Jay-Z, Clark world\n2000, and it goes like..\nUh huh, yeah yeah\n\n[Chorus: Jay-Z & Sauce Money]\nThis goes out to my Brooklyn crew\nLay my game flat, what you wan' do\nTalk all night, are we gon' screw?\nI'm talking 'bout me and you, and it goes like...\n\n[Verse 1: Sauce Money]\nI like to push up on chicks like it's the last record\nTake 'em to the telly get buck passed naked\nLet 'em feel the power, lick 'em if it don't taste sour\nHit 'em in the shower for an hour\nGive 'em that feeling, Sauce Money for real and\nLet her get on top if there's mirrors on the ceiling\nHit her so right that she wanna throw rice\nMy device makes her say \"Damn, that nigga's nice!\"\nKnow I got wifey lay my cards when I pivot\nPass your seven digits if you're with it\nSauce wanna give you the option for the boot knocking\nNine times outta ten it's on and popping\nAin't no stopping victory's in the air\nBring a friend next time let's do it again\nBring your whole crew if you see through me\nAnd we can meet on the BQE\nAnd it goes like\n\n[Chorus: Jay-Z & Sauce Money]\nThis goes out to my Brooklyn crew\nLay my game flat, what you wan' do\nTalk all night, are we gon' screw?\nI'm talking 'bout me and you, and it goes like...\nThis goes out to my Brooklyn crew\nLay my game flat, what you wan' do\nTalk all night, are we gon' screw?\nI'm talking 'bout me and you, and it goes like...\n\n[Verse 2: Sauce Money (Jay-Z)]\nHad this bitch bragging\nSauce had his tongue between my thighs lally-gagging\nHuh, could you imagine?\nShaking your tail just like a dragon here comes my worse flame\nIn the morning Hot 97 the first thing (deny it?)\nHell yeah y'all don't buy it\nI don't eat no kind of fish if you can't fry it\nBut who knows maybe one day I'll try it\nBut for now slow down too much Lil' Kim in your diet\n\n[Verse 3: Jay-Z]\nCan I get it what - get it wet?\nWhen he hit it first, can I get it next? Shit, you the best\nIt ain't wack to be with both of us, mami actually\nI'm Eddie Kane Jr., that nigga me!\nYou want me to feel what he feel when it's tight\nAnd I know, you don't be doing it right?\nBut it gets no liver than this, never lie on our dick\nShit, we got niggas rides on our wrists\nPlay your cards right you'll be driving the 6\nShopping all day, hopping out in the dist'\nPopping the Crist', shit hopping outta your wrist\nPopping your shit, New York's hottest bitch\nFrom the ghetto to the stilettos\nBut you gotta do it two times like an echo, you feeling that?\n(Feeling that?) This is how we run it down the line\nNigga Sauce goes first, Jigga next to rhyme\n\n[Chorus: Jay-Z & Sauce Money]\nThis goes out to my Brooklyn crew\nLay my game flat, what you wan' do\nTalk all night, are we gon' screw?\nI'm talking 'bout me and you, and it goes like...\nThis goes out to my Brooklyn crew\nLay my game flat, what you wan' do\nTalk all night, are we gon' screw?\nI'm talking 'bout me and you, and it goes like...\n\n[Verse 4: Sauce Money, Jay-Z & Both]\nI see you got a lot to get off your chest\nCoat, blouse, bra, don't talk me to death\nLike murder's on your mind mami, off the dress\nJigga ran game 'til I lost my breath, uhh\nLast thing I need to know is what it costs for sex\nWhat you need to know is if I lost respect\nDon't have to worry if you do Sauce correct\nI'ma bless that, bring my whole crew through, don't even sweat that\nUh, dime pieces I'm hitting\nFour in the morning, Frosted Flakes in your kitchen\nNow you want me to start tricking I suppose\nThat's when the first Face Off kick in\n\"We don't love these hoes!\"\n\n[Chorus: Jay-Z & Sauce Money]\nThis goes out to my Brooklyn crew\nLay my game flat, what you wan' do\nTalk all night, are we gon' screw?\nI'm talking 'bout me and you, and it goes like...\nThis goes out to my Brooklyn crew\nLay my game flat, what you wan' do\nTalk all night, are we gon' screw?\nI'm talking 'bout me and you, and it goes like...", "album": "Middle Finger U"}], "artist": "Sauce Money"}