{"songs": [{"year": "2001-04-03", "image": "https://images.genius.com/ec46798fa54e4b0eead636c38046b017.300x293x1.jpg", "title": "Mamma", "album": "Endangered Species", "lyrics": "[Hook: Tony Sunshine]\nMamma.. I don't understand\nWhy he had to fuck with me, now I gotta kill this man\nI said mamma.. now I'm on the run\nDear ma-mmahhhhhhh.. what have I done?\n\n[Verse 1: Big Pun]\nSomebody save me, I think I just killed somebody baby\nShoulda chilled but money was really tryin to play me\nCouldn't hold it no more so I showed him the four\nDuke was dissin my girl like she was hoein on tour\nAnd knowin I'm raw, money tried to play fly\n\"I said whassup to the bitch; why she couldn't say hi?\"\nThat ain't right! I had to put him in his place\nRemember them hollows I bought for three bottles?\nI put 'em in his face\nI didn't have to disgrace myself, I hate myself\nAHORA A TU *BLAH BLAH* Brace yourself\nThats the law the streets are like basketball\nSometimes you shoot, sometimes you pass it off\nCan't always take a shot, make one mistake you upstate for what?\nToo much hate, time to break the lock\nI hate the cops so I ain't tryin to see 'em\nI love a brother doin triple life but I ain't tryin to be him\nThat's why I be on the low, and keep my feet in the row\nCause they're tellin me as far as felonies\nYou get life for three in a row\nThen whadday'know? Last week at the flicks\nI had to kill somebody, for steppin on my kicks (STUPID)\n\n[Hook]\n\n[Verse 2: Big Pun]\nI can murder half the world laugh while the other side hate me\nBut hurt one hair on my mamma head and I'ma, cry like a baby\nShe my heart and soul; what Jimi Hendrix was to rock'n'roll\nMade me believe I could achieve the impossible\nNow you know one of my weaknesses, but Punisher keeps it glizz\nSo don't pull out cause when I pop oh what a relief it is\nSend you where Jesus is - hold up, that's the gas chamber\nThink before you put on that ski-mask and blast a stranger\nRelax the anger, don't be so hard on yourself\nThat's how you'll end up twelve years old;\nBein charged as an adult\nTerror Squad is here to help so you can learn from our mistakes\nCause power just makes you reject destiny and devour your fate\nHow many hours I waste, tryin to figure the shit\nUntil I finally realized, we're just niggas and spics\nThat's what they feel, what can I do but just stay real?\nKeep somethin in the stash in case I gotta make bail\nCause ain't no brothers, runnin shit in the system\nYou goin straight to jail if you colored and fit the description\n.. fuck you talkin about? I live here\nThis is my buildin nigga; fuck you nigga!\nThat's my daughter right there playin.. fuck off me!\nGet the fuck off!\n\n[Hook]\n\n[Bridge: Big Pun]\nI don't have much time so I'm only gonna ask you once\nTo please forgive me mamma; I love you and I'm sorry I broke your heart\nBut I ask you to do me a favor and take care of my daughters\nAnd raise them to be good respectable woman, like their mother\nGod bless her soul\nAnd raise my son to be a good man, a better man than me\nAnd for this I give you my soul, I love you\n\n[Hook - whispered; a woman cries out in agony]\n\n[Outro: Tony Sunshine]\nHeyyyy ma-ma-ma-mma..\nI just killed a man..\nMa-mmaaaa.. what am I to do?"}], "artist": "Big Pun"}