{"artist": "ILL BILL", "songs": [{"title": "Exploding Octopus", "lyrics": "Intro:\n[Female interviewer:] Don’t you think education should make people aware of the danger of the danger of technology instead of making them adapt more easily to any kind of progress and technology\n[Male interviewee:] Absolutely, absolutely, that we can no long allow technology to come roaring down at us, I think we must begin to say no to certain kinds of technology and to begin technological change because we’ve now reach the point that the technology is so powerful that it could destroy us\n\n[Verse 1]\nHe was accepted with Harvard at sixteen\nChild prodigy\nMath with specializing in complex analysis geometry\nEarned a PHD in mathematics early\nYoungest professor ever hired by UC in Berkeley\nA short-lived position\nHe resigned in '69 with no apology\nWithout an explanation given\nSocial anxiety multiplied silently\nDisconnected entirely from society\nBuilt a cabin, became a survivalist\nRejected electricity and modern sciences\nHe cooked his dinner in a fire pit\nAnd watched the stars from afar where Orion sits\nThe wilderness where the lions live\nPrimitive like the times of the giant pyramids the Mayans built\nThen something caused his mind to chill\nA course solidified successfully the very first time he killed\n\n[Hook]\nWhat would you do, how far would you go\nIf you thought that you can change the world for the greater good\nHow would you know\nWhat’s right or wrong\nTry to play God\nMail a bomb\nTo the CEO or the school or an airline\nDo you justify murder for peace?\nDo you believe that technology is the beast?\nImagine if your iPhone disappeared\nThat would be weird\nCould you function in a world without technology\nOr would you be scared?\n\n[Verse 2]\nExploding octopus, block buster in the 6 finger hand\nBooby trap a box to shock the populace with wishful plans\nInitially ignored\n\"Industrial society and its future\"\nThe manifesto of Kaczynski's war\nLife in seclusion\nRivals and bruises\nRifles and UZIs\nDevices with clues designed to confuse the FBI\nThrow 'em off plans\nBlowing off hands\nBlinding people first\nSoon the results were even worse\nBecame obsessed with teaching society a lesson\nWith home made weapons that reach society’s perception\nThe Washington Post and The Times finally printed his manuscript\nThat was the tipping point that notified his family\nWith suspicion leading to his arrest\nHis brother recognized his writing style and mission of death\nRan up in his cabin and discovered undeniable proof of his guilt\nSixteen bombs, twenty-three injured and three killed\n\n[Hook]", "image": "https://images.genius.com/3c85efb9b9e6e7efc21e7b0199174306.800x800x1.jpg", "album": "The Grimy Awards", "year": "2013-02-26"}]}