{"artist": "Cage", "songs": [{"title": "Come to daddy", "album": "Weatherproof", "year": "2003-07-29", "image": "https://images.genius.com/628200991dc702f6b351f57a7e9fc96e.600x600x1.jpg", "lyrics": "[Cage Verse 1]\nY'all fucked up, shoulda stuck me in ICU\nCause the type of shit that I'm on , when I see you...\nDollar fifty in your face, Tryin' to graze ya\nThe lead go in the bone and your face get stuck to my razor\nKick your shoulders from your head while you pleadin your case...\nAnd the little girls you with like: \"yo he's gonna eat his face!\"\nPull out 2 nine's and an eight, two for killin' one for drillin'\nHold metal to your face if you think you're supervillain\nTalk to women with sex and to God with a pistol\nFuck a married Mossberg, my barrel's stayin' single\nWith a pregnant pump I let shit jump out on the floor\nSee how it moves now I leave out with tools\nI'll leave out the school of robots by the chorus\nLike when I jumped off tour bus ran home and did more dust\nStick your hands up like the camera's upside down\nAnd you got pussy in your lap and you goin' fuck right now\n\n[Chorus: Camu Tao]\nAnd if you wanna get freaky and nasty\nWe can make good in the back of the cabby\nCome to daddy...\nThey wanna kill me in the club\nPut slugs in my mug, player I don't give a fuck\nCome to daddy...\nThese punks wanna jump\nCome to daddy...\nThese chickens gettin drunk\nCome to daddy...\nYou want me to put slugs in ya?\nCome to daddy...\nOk...\nCome to daddy...\nWhat?\nCome to daddy...\n\n[Camu Tao Verse 1]\nI fall in on that spot babe, I'm peepin' your game\nSwivel table round that ass girl it's lookin real good\nThese lame frogs try to play ball, I'm used to the pitch\nI'll put a screen on your dames body, scoopin' your bitch\nSo get played on that game called, losin' your shit\nCome redecorate your crib fast, movin' your shit\nI'm still peepin' out your dames ass, losin' the grip\nOn that neck head through the plate glass\nLoose shoots in ya' wig\nYo, Cadillac STS, with some tamed hash\nTanqa Ray, grape fruit juice, stained glass\nAnd I spend cash all night and clap off twice\nAnd pack bongs tight and sip martini's fast\nAnd get ass all night...\nAnd I can come and choke you up let's all hear it\nTellin' me not to do it when I swing you from the terrace\nMajor pain to the establishment\nMade famous in seconds...\nGet props and guest spots on black plots like checkers...\n\n[Chorus: Camu Tao]\nAnd if you wanna get freaky and nasty\nWe can make good in the back of the cabby\nCome to daddy...\nThey wanna kill me in the club\nPut slugs in my mug, player I don't give a fuck\nCome to daddy...\nThese punks wanna jump\nCome to daddy...\nThese chickens gettin drunk\nCome to daddy...\nYou want me to put slugs in ya?\nCome to daddy...\nOk...\nCome to daddy...\nWhat?\nCome to daddy...\n\n[Cage Verse 2]\nYou can't take shit too far? You can't take it far enough!\nYou'd think Colin Powell came and A&R'ed us\nPull out like pre-aids in front of your girl scandalous shit\nTake more strength out my finger to handle your chick\nAnd when I leave I'll bet she'll be up on your shit list\nThe best knockers I've seen was on a Jehovah's Witness\nSo if you're trunk look good I'll run the Caddy\nTil your chickens come to daddy now come with daddy...\n\n[Camu Tao Verse 2]\nYo, some ecstasy pills a bag of dope I'll make you spazz out at the wheel\nMakin' you smash into poles, get your head open then shatter your nose\nAnd get them bitches open crackin' laughin' at holmes\nWell it's on all up in the club Liberty City\nWith these stupid bitches sniffin' on kitty lickin' on titties\nAnd the problem stops, after the collars pop\nRoofies have you with some ugly bitches swallowing crotch\n\n[Chorus: Camu Tao]\nAnd if you wanna get freaky and nasty\nWe can make good in the back of the cabby\nCome to daddy...\nThey wanna kill me in the club\nPut slugs in my mug, player I don't give a fuck\nCome to daddy...\nThese punks wanna jump\nCome to daddy...\nThese chickens gettin drunk\nCome to daddy...\nYou want me to put slugs in ya?\nCome to daddy...\nOk...\nCome to daddy...\nWhat?\nCome to daddy..."}]}