{"artist": "50 Cent", "songs": [{"album": "War Angel LP", "image": "https://images.genius.com/ddcb110037c817943db4819e7ee6759a.600x600x1.jpg", "title": "I’ll Do Anything", "lyrics": "[Produced by Phonix Beats]\n\n[Intro: 50 Cent]\nThis for the bitches, nigga\nI'll, do, anything for you\nI'll do anything you want me to (I'll do do do-do do do do)\nI'll do, anything (anything for you)\n\n[Verse 1]\nMe? I done been around the world six times\nA bad bitch in every part of the world's been mine\nBut you can change me, baby, you can change me\nOh shit, look, I'm already not the same, see?\nShorty, you make me feel brand new\nI'm not running game, girl, I swear you do\nYou're too cold to hold and too hot to handle\nMe and you girl there's nothing we can't do\nYou like girls, I like girls too, we got something in common\nNow how the hell could that be a problem?\nShorty let's laugh, let's dance, let's drink, let's fuck\nRight here, right now, shit, we only live once\nI should not be reprimanded, I cannot be blamed\nMy lust on level 10, I'm trying to get it in\nI'll have you cumming down your candy walls\nGet it wetter than Niagara Falls 'til you climax, that's all\n\n[Hook]\nThey think I'm a fool\nCause I'd do so many things for you\nI'll, do anything, I'll, do anything\nBut they don't know the reason\nIt's why I do all the things I do for you\nI'll, do anything, I'll, do anything\nI'll do\n\n[Verse 2]\nI keep a bad bitch on deck\nWe retro drinking, yeah, sippin' Moët\nLook man, my shawty got ass for days\nI smack it, sit and watch it wave\nWhen it's stress on my brain the head games relax the pain\nSo good I get to buying her things\nLike tennis bracelets and chains, studs and diamond rings\nI'm giving her the finer things\nThat's why she don't complain\nI kinda got her open, mane, I stroke that thing\nOn different ends of the globe\nWe international now, whoa\n\n[Hook]\n\nThey think I'm a fool\nCause I'd do so many things for you\nI'll, do anything, I'll, do anything\nBut they don't know the reason\nIt's why I do all the things I do for you\nI'll, do anything, I'll, do anything\nI'll do\n\n[Outro]\nThat's me and you, you know? (I'll do)\nThey ain't supposed to understand it (I'll do do do-do do do)\nYou know I say some shit I ain't supposed to say\nBut you know how I feel (I'll do)\nI should be a asshole whenever I feel like it (I'll do)\nAfter - look at the shit I bought you, man (I'll do do do-do do do)\nC'mon man, don't give me no headache, man\nYou a bitch when you on your period, right? (I'll do)\nDon't come at me with that bullshit, man\n(I'll do, I'll do do do-do do do)\nDo anything for you, girl\nI'll do anything", "year": null}]}