{"artist": "Yung Joc", "songs": [{"album": "Hustlenomic$", "image": "https://images.genius.com/f12173011b96ac051c3c7821f51c6ed7.220x220x1.jpg", "year": "2007-08-28", "lyrics": "[Snoop Dogg] + (Yung Joc)\nYung Joc (sup?)\nWhat it do nephew? (You know what it is)\nAll brand new shit\n\n[Chorus: Yung Joc]\nIt ain't my fault (it's not my fault potnah)\nThat everythang you get, is, used (and you, you, you probably can't help that)\n(That, you know) And I buy all my shit brand new\n(I don't have a problem with spendin the money y'know?)\nWhen I walk into the room, they, choose (I mean heh, I'm Yung Joc man)\n(C'mon~!) Cause they know my whips, my ice is brand new\n\n[Yung Joc]\nFrom my fitted down to my shoes\nI enter the room and your bitch might choose\nLook me up and down from my head to toe\nThey point the exit then I tell 'em \"Let's go!\"\nS5, don't forget the fifty\nWhat it cost me? About a hundred fifty\nDAYUMN!! What's this? Why it's so sticky?\nThat's good kush, quarter cost you 'bout a hundred fifty\nSeal the leather, still brand new\nLookin at the sky through that panaromic view\nShe say she like my jeans, even like my sneaks\nThats the new Guccis, five hundred a piece (a piece?)\nI make her smile, when I smile back\nCheck the do's, Caddy stones, yeah I bought that\nBaby we can go to Paris or Toronto\nBrand new shades, who's that? Ferragamo\n\n[Chorus]\n\n[Snoop Dogg]\nNever drive the same car twice\nYou still buying chains; I'm into chippin ice\nY'know? Is it real or fake, how much a killa make?\nI'm 'bout ownin somethin, ya dig? Real estate\nI'm in the '08 Escalade, with brand new Gucci shades\nI'm flingin it, and singin it, while stayin up for days\nYou know my entourage, I does it extra large\nBlue bezels for my nizzles double what you charge\nSo whenever you see me you know I'm fresh to death\nFrench tip on my nails and now my hair is fresh\nIn some brand new clothes, with some brand new hoes\nIs them Phantom do's, on that brand new Rolls\nOn another level, blue rose petals\nAnd when I walk the block I make everyone wanna talk a lot\nTo brag and boast that ain't my style, to highside and profile\nI'd rather blow a pound with my Pound and do what you say\n\n[Chorus]\n\n[Rick Ross]\nI let her fantasize, I'm a fanstay\nShe couldn't fathom us fuckin on top of Phantom seats\nNow we worldwide, speakin different laguages\nMa, Puerto Deo, now can you hang with it\nI'm a boss girl, you lookin for a job?\nFuck me on your lunch break and you're sure to star\nGet a raise when that brain keep me in a daze\nCustom made suede Gucci shoes I'm on another page\nAnd my money so long\nMy money so long, I swear my money so long (ye ain't lyin)\nMurciélagos just for the car do's\nThis the main event, those niggas is sideshows\nWhere I reside ho, you're considerd a side ho\nAir train and peanuts, it's time to slide ho\nWhere I reside ho, you're considerd a side ho\nAir train and peanuts, it's time to slide ho\n\n[Chorus]\n\n[Outro: Snoop Dogg]\nThat's so cold\nYung Joc, what it do nephew?\nAll brand new shit, yeah boy!\nDig, yeah that's my nig\nI'ma smoke on out like that dere\nI'ma jump off in this brand new car I got\nBrand new shoes and brand new outfit\nThis brand new sack of chronic I got\nI'm lookin at this bitch like oh yeah I'm actin all brand new\nI don't even know you f'real\nThat's the business... see ya~!\nIt ain't my fault\nHehe, it ain't my fault!\nIt ain't my fault my nigga\nEverythang you got is used\nThat's a used chain, nigga had that chain on like fo' years ago\nThat's some used shoes you got, the automobile is used\nNigga you don't even... all that shit nigga\nYour bitch is used too nigga\nYeah, it's all hood though\nIt ain't my fault, we just gon' keep doin it\nSo brand new, oh-seven, yeah", "title": "Brand New"}]}