{"songs": [{"image": "https://images.genius.com/d1852ae7c57fec77e3a7100c014bd1ae.600x600x1.jpg", "title": "Hell Naw", "album": "Bad Hair", "year": "2016-09-24", "lyrics": "[Hook: Nasty C]\nAm I ever gonna quit?\nHell naw\nWill I dumb it down a bit?\nHell naw\nAm I running with the shit?\nFucking right I bring the levels to this bitch\nYou know you right my nigga\nEver gonna quit? (hell naw)\nHell naw\nWill I dumb it down a bit? (hell naw)\nHell naw\nAm I running with the shit? (I really am)\nFucking right I bring the levels to this bitch (it's all done)\nYou know you right\n\n[Verse 1: Nasty C]\nI'm making music for niggas in suits and ties\nThey all got a money and evil smile\nThats ending conversations with the \"I'll let my people call your people\" line\nI rap for the ones still in high school\nProbably my age and they think I'm cool\nFor the little ones calling me uncle\nShit you know I do it for the dimes too\nI'm tryna find out where mind at\nI don't think I'm crazy I'm beyond that\nEvery girl I'm with is either blessed or obsessed with dressing and looking like Beyoncé\nAnd I'm the jiggy Jigga, yea I'm on that\nThere's not a thing I hate more than a contract\nI been killing niggas since I was the kid that rushes home just to go play Mortal Kombat\nI'm too wavy like a format\nI could really bring it to your doormat\nI don't think you wanna get embarrassed by the young king\nAh-ah, no man\nI'm the leader, now just get behind me\nYou know you like my shit, you can't deny it\nBro, I came up like boom, boom, boom, dead silence\nSomeone get the bodies, get the bodies\n\n[Hook: Nasty C]\nAm I ever gonna quit?\nHell naw\nWill I dumb it down a bit?\nHell naw\nAm I running with the shit?\nFucking right I bring the levels to this bitch\nYou know you right my nigga\nEver gonna quit? (hell naw)\nHell naw\nWill I dumb it down a bit? (hell naw)\nHell naw\nAm I running with the shit? (I really am)\nFucking right I bring the levels to this bitch (it's all done)\nYou know you right\n\n[Verse 2: Nasty C]\nThe real ones listen to me when I tell my story\nThe fakes ones always wanna write it for me\nI never wanted to rain on your parade\nI started doing all of this for some white Jordans\nNow I made it, clear to the store manager nigga I want the shit delivered to me\nIt's like, all the niggas that you all praising, are just some other niggas to me\nAnd dumbing down is a motherfucking mission for me\nI know a couple that could use a couple lyrics from me\nI make all of my women look into a mirror for me\nAnd then I tell 'em would you please pick a pillow for me\nAh nigga would you please cry a river for me\nPut a pistol to your head and pull the trigger for me\nTell me do you want a kidney or a liver from me?\nIf you hate me then why do you login to Twitter for me\nAlright, isn't this a bitch tho\nA short nigga came and hit a switch hoe\nI'm doing every day and night shift\nJust to get it 'cause you ain't really hot until your wrist cold\nCan somebody order me some chill tho\nI really never ever had to chill bro\nBut I'm really giving everybody chills\nNigga chill, chill, chill\nCan somebody get the window\nDamn can somebody get the window\n\n[Hook: Nasty_C]\nAm I ever gonna quit?\nHell naw\nWill I dumb it down a bit?\nHell naw\nAm I running with the shit?\nFucking right I bring the levels to this bitch\nYou know you right my nigga\nEver gonna quit? (hell naw)\nHell naw\nWill I dumb it down a bit? (hell naw)\nHell naw\nAm I running with the shit? (I really am)\nFucking right I bring the levels to this bitch (it's all done)\nYou know you right\n\n[Outro]\nLook at all the hurdles that I overcame\nI told em as a youngin' they would know the name\nYou should pull up to the hotel, man it's so insane\nI'm kicking bitches out the trap house like I'm Tory Lanez\nLook at Look at all the hurdles that I overcame\nI told em as a youngin' they would know the name\nYou should pull up to the hotel, shit is so insane\nI'm kicking bitches out the trap house like I'm Tory Lanez\nYeah, I like my girls high like standards\nThey gotta pop like Jackson\nThey gotta be above average\nThey gotta take the dick like chances\nYou know you with it with your friends that don't know Jesus\nAnd that ass thick as thieves\nI'm just Adam tryna eat the apple bottom off Eve\nI'm tryna inspire man, do it for the youth\nSo I'mma cop a whip and say, Hell naw to the roof\nHell naw to the the ceilings, fuck limits\nThis ain't that kitty flow so I can't have you ducks in it\nI'm married to the hustle man I'm stuck with it\nIt's Bad Hair season nigga, fuck with it"}], "artist": "Nasty C"}