{"artist": "YBN Nahmir", "songs": [{"image": "https://images.genius.com/43e79354e0d6766234dd2725facaaaa4.902x902x1.jpg", "year": "2017-08-26", "album": null, "lyrics": "[Intro]\nAy, Ay, Ay, Gang, Gang\nAy, Ay, Ay, Gang, Gang\nAy, Ay, Ay, Gang, Gang\nHave you ever had a dream that...that you um...you..SHUT THE FUCK UP!\n\n[Hook]\nHave you ever had a dream that you was countin' up mills\nBut then you woke up hella broke so now you like what the hell?\nIma stack my money up and Ima chase my dreams\nAnd if a nigga in my way, He gon meet that beam\nI don't do a lot of talkin', play with me then I spark it\nAnd if you try to take my chain we leave you dead in a coffin\nAnd I'm just tryna stack my money and just chase my dreams\nAny nigga in my way, he gon meet that beam\n\n[Verse]\nAny nigga in my way he gon meet that beam\nThis uzi pop and hit a nigga its gon make him sink\nI be coolin' up in traffic riding with my team\nAnd for y'all niggas that be dissin', y'all ain't on a thing\nNigga run up try to rob me, With this Glock Ima pop him\nAnd if I don't got the blower on me, then Alonzo gon drop him\nI keep this money in my pocket, But I keep pocket rockets\nAnd all the bitches be up on me cause a nigga be flockin'\nYou know a nigga be flockin', And all these niggas be jockin'\nThey wanna copy my style so in my eye they be mockin'\nGotta watch the surroundings, You gotta always be caution\nCause niggas hate when you flexin', And now they ask when to off you\nSo Ima always be smooth, Ima always be cool\nWatch how I run up a check, Watch how I do what I do\nI'm the man in my town, And bitch I don't fuck around\nYou try to play with my money, Well bitch I'm knocking you down\n\n[Hook]\nHave you ever had a dream that you was countin' up mills\nBut then you woke up hella broke so now you like what the hell?\nIma stack my money up and Ima chase my dreams\nAnd if a nigga in my way, He gon meet that beam\nI don't do a lot of talkin', play with me then I spark it\nAnd if you try to take my chain we leave you dead in a coffin\nAnd I'm just tryna stack my money and just chase my dreams\nAny nigga in my way, he gon meet that beam", "title": "Have You Ever"}]}