{"songs": [{"year": "2014-11-19", "image": "https://images.genius.com/4cace15a466eedbf99c30386a0aa0049.500x500x1.png", "title": "One In A Million", "album": "The M.A.F.E. Project", "lyrics": "[Intro]\nLove it babe. Love it babe. Love it babe\nI know you love it babe. Love it babe. Love it babe (x3)\n\n[Verse 1]\nBaby you don't know, what you do to me\nBetween me and you, I feel a chemistry\nWon't let no one come and take your place\nCause the love you give can't be replaced\nCause no one else love me like you do\nThat's why I don't mind to spend my life with you\nWanna please you in anyway I can\nWanna share my world, don't you understand\n\n[Hook]\nYour love is a one in a million it goes on and on and on\nYou give me a really good feelin' all day long\nYour love is a one in a million it goes on and on and on\nYou give me a really good feelin' all day long\n\n[Verse 2]\nTurn me inside out, make my heart speak\nDon't want no one else, you're all I need\nPersonality(ty) in everything you do (do)\nMakes me love, everything about you\nCause your smile, your style is so fly I can't deny\nI got a crush on you, and that's true indeed\nI'm digging you, you make me believe\n\n[Hook]\n\n[Bridge: Aaliyah]\nI'll give you anything you want from me anything you want anything you need\nAnything your soul desires\nI'll give you anything you want from me anything you want anything you need\nAnything your soul desires\nAnything cause\n\n[Hook]\n\n[Breakdown]\nLove it babe love it babe love it babe\nLove it babe love it babe love it babe\nEverybody love that real R&B shit, shit, shit\nThat real R&B shit, shit, shit\n\n[Verse 3]\nIn the players club checking out your body babe\nSteadily tossing that cash flow babe\nCause you drive me crazy\nWon't you be my lady?\nBetcha I can make your body talk to me\nAll I need is my CD, a bag of weed and some Hennessey, yeah\nAnd I'm gonna strip you up and down, messing with your hair\nAnd when you leave up out my room, you'll be walking bow-legged\nI can keep your body coming like a CTA\nYou're dealing with a true baller babe\nGiving you the keys to my Mercedes\nAnd I'm not gonna stop 'til you scream my name\nYou say \"BJ, make me high, keep on jumpin' like an Impala\"\nYou slidin' that sexy ass down the pole like what, what, what\nCome and get some of this R&B thug babe\n\n[Bridge 2]\nI'm just a R&B thug babe, tryin' to get some ass babe\nDo you want a thug babe?\n(Do you want an R&B thug?)\nI'm just a R&B thug babe, tryin' to get some love babe\nDo you want a date babe?\n\n[Verse 4]\nTake my money, my house and my car\nFor one hit of you baby, you can have it all\nCause makin' love every time you do\nGirl it's worse than drugs\nCause I'm an addict of you\nAnd you know that I\n\n[Bridge 3]\nI can't leave you alone\nYou got me feenin'\nI can't leave you alone\nYou got me feenin'\nGirl I'm feenin' for you\n\n[Verse 5]\nLady I'm hooked on you\nThere's nothin' else I'd rather do\nSpend my last dime, for a drop of your time\nCause you're the girl without a doubt, you know you got me strung down\nI need you more than more\nCause you are my joy\nYou got my feenin'\nGirl I'm feenin' for you\n\n[Hook]\n\n[Outro]\nNow she was raised in Illinois\nRight outside of Chicago\nSome of the best cooking you've ever had\nAnd I miss her\nHey woman if you're listening\nSaid I miss you baby"}], "artist": "BJ the Chicago Kid"}