{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/330345c8e2f17c8bf3fe4a8ab26ca88a.640x640x1.jpg", "title": "Last Days", "year": "1995-10-24", "album": "Smile Now, Die Later", "lyrics": "[Intro: Dialogue]\n[Kokane] The whole fucking world is going mad. (*Laughter*)\nWell check this out\nWhat the fuck would you do if you only have five minutes to live?\nWould you do some evil shit?\n[Km.G] Hell yeah\n[Kokane] Or would you repent the name of your motherfucking soul?\nYo Frost\n[Frost] What's up?\n[Kokane] Tell these motherfuckers your last confession\n\n[Verse 1: Frost]\nThe murders, I never really planned them\nI just read through the telephone book chose them random\nMrs Jones, 215 South Michigan, Apartment 14, yo my victim\nI'm at home polishing my Chrome and rolling joints\nAnd put the silent knot in the tips of the hollow points\nDumb bitch, left the door unlocked\nNow I'm putting on my Ski mask and .45 is cocked\nTrying to stay quit, the front door is squeezed\nAnxious, I haven't seen blood of weaks\nKnown that cops wanna fold me\nThinking of some shit my psychiatrist told me\nBut fuck it, I wanted so that I taste it\nOne more fantasy for feeling this one life wasting\nAnd they said I have a fucked up view\nNow purpose through our head and here's your moment of true...\n\n[Hook: Km.G]\nWe have been to the last days\nLast equation, in this situation\nNobody seems concern\nAs the world turns, as the world turns\n\nWe have been to the last days\nLast equation, in this situation\nNobody seems concern\nAs the world turns, as the world turns\n\n[Verse 2: Cold 187Um]\nNow see it was once said, yo reap what you sow\nBut I guess I forgot what I was told\nUgh, I came deep yo, I can't sleep\nI'm having a vision of the homie laying dead in the streets\n\"who did it, who did it\"\nI don't know, kept peepers over this bitch\nOn the North side named sherk\nSo now we on the who-ride, to check that nympho\nPistol whipped, the ho for the Info\nMade her call that motherfucker up\nTold her tell him that you horny, tell him that you wanna fuck\nAnd when she finished, I told her have a nice day\nI shot her in the head twice, put her down the hallway\nRight about me, I heard a car pulled up\nYeah, hear coming the punk, but he about to get fucked\nUgh, knock, knock, I let the door slide open\nAnd let my Desert Eagle, do the smoking fool....\n\n[Verse 3: Km.G]\nI can exchanging, I can handling\nI still flow for all my partners\nCause suckers doing damage\nNow I'm on the other side, nigga is looking in\nShooting letters from the Pen, address in my kid\nWhat up, they just shouts to the 'Row\nChaos to the left, seven else to the rows below\nAnd we waiting for an appeal, so chill\nAnd they caping to put up a double meal tickets\nSo now we kick it, ooh I fucks up and I'm still doing wrong\nAnd trip while write these fly ass rap songs\nTeaching' to the balls as I steal\nCause doctor said we can't get the cheer motherfucker.....\n\n[Hook: Km.G]\nWe have been to the last days\nLast equation, in this situation\nNo body seems concern\nAs the world turns, as the world turns\n\nWe have been to the last days\nLast equation, in this situation\nNo body seems concern\nAs the world turns, as the world turns\n\n[Verse 4: Frost]\nLooking at my clock ticking in my cell\n11:55, five minutes to hell (*Clock Strikes*)\nSoon I will be deceased, taking to the priest\nHow did I become this caged up beast\nThe guard said open up cell block six\nI never really liked that son of a bitch\nJust the punishment fits the crime\nA boy said come on, Kid Frost it's time\nShackle, walking through the corridor\nThere were faces, that I never saw before\nInsert the prosecutor, and some from the press\nNo bly verse and no last request\nI've come strapped and my ankles and wrists\nHitting my eye shed not even resists\nAnd then I get the Grim Reaper kiss\nThe lights went dim and all you heard was this....\n\n[Outro: Spanish AD LIBS]"}]}