{"artist": "Boondox", "songs": [{"album": "The Harvest", "title": "Diggin’ Myself Out", "year": "2006-07-11", "lyrics": "(Verse 1:)\nSo many times i sit and ask myself why are u afraid to die\nWhat is this fear that blinds u\nIs it the thought of uncontrollable pain or\nSuffocating loss of oxygen to your brain\nIs it the people u have in your heart\nThe ones closest by your side when your soul departs\nIts just a question that haunts mankind\nWhere am i going? Is there an afterlife\nI sit and think about it and my blood runs cold\nThe mysteries of life and all the stories untold\nWhy we here? Where we going?Why do I exist?\nIs there a point or any answer to all of this?\nWill my spirit walk restless amongst the grave?\nHaunting generations in a vile of rage\nOr will my body just rot for maggot feast?\nGnawing on my bones while i rest in peace\n\n(Chorus x2:)\nWhen you die\n(will u) re-a-lize\n(what takes u) From this life i suffer\nDiggin' myself out this hole that they buried me in\n\n(Verse 2:)\nThe fear of darkness when they lower me down\nWill I be concious to the fact that im up under the ground\nAnd will i hearall the tears of the ones who attend\nAnd the dirt hit my coffin when they lower me in\nOr will I hover above lookin down on me\nRealize the situation and just what it all means\nA body laid to rest and a spirit left to fly\nNo instruction or direction or a sky when i die\nIs there a tunnel? Will I walk into the light?\nSee the people long lost who I knew in life\nWill my back spread wings as the choir sings\nA halo on my head that heavenly bling\nAnd in the blink of an eye will it be smashed away?\nPulled into the grips of hell my soul left to pay\nFor the sins of my fater and the sins of his father\nWill the demons leave me down like a lamb to the slaughter\n\n(Chorus x2)\nDiggin' myself out of this hole that they buried me in to\n\n(Verse 3:)\nAll the things that we ever knew\nMemories of this life coming back to you\nO we rocked deep inside of a shallow grave\nEyes closed forever in our final resting place\nWill we remember all the pain of being alone\nAnd how the juggalo world took us into their home\nAnd now this hatchet means more than a tat on my arm\nOr this charm ill serve u up some bodily harm", "image": "https://images.genius.com/9bc5140eadd19250a34c88748f1ddafa.500x500x1.jpg"}]}