{"artist": "Apathy", "songs": [{"title": "East Coast Rapist", "image": "https://images.genius.com/073ac226410c8abcffb60094f9a7e61b.700x700x1.jpg", "album": "Honkey Kong", "lyrics": "[Cut-Sample: From the film The Breakfast Club]\nWe think you're crazy to make us write an essay telling you who we think we are. You see us as you want to see us... In the simplest terms, in the most convenient definitions. But what we found out is that each one of us is a brain... and an athlete... and a basket\nCase... a princess... and a criminal. Does that answer your question?\n\n[Intro: Apathy]\nApathy. Honkey Kong. You say you on your grind like... that's something special. That's what you supposed to be doin' motherfucker. We rap, it's not like we build houses... or do rocket science. Y'all need to get over yourselves for real\n\n[Verse 1:Apathy]\nI’m body baggin' everything in sight, the site of a mass murder\nA White dude rippin' mic’s, rare as black surfer\nAp serve ya, do a surgical procedures on speakers\n'Til the EMT’s are pullin' off these emcee's sneakers\nI ain't grow up like Leave It To Beaver or Mike Seaver\nI’m from where the white trash invented the wife beater\nHallelujah, born in the sewer like Michaelangelo\nDonatello, and Splinter, then sent to earth with the antidote\nTo wipe out wackness, strike out fast as\nCobra fangs, blow ya brains, no remains just ashes\nThese days people get amazed by the mental\n'Cause I’m secretive as rituals in Masonic temples\nI don’t care if they from suburbs, or raised in the ghetto\nThey grab they pad and they pencil and start tracin' my stencil\nWhy you prayin' to god to get a taste of the devil\nHow you tryna be real when you made by Gepetto\nYou lil’ marionettes, swear your carryin’ techs\nI’ll incinerate your flesh… then bury the rest\nI’m east coast as is gets, any stage that they put me on\nCame out the womb with Timbs and a hoodie on\nEast… Coast… Rapist\n\n[Scratched Hook:]\n\"It ain’t hard to tell, I’m the East Coast Overdoser\"-The Notorious B.I.G 'Party and Bullshit'\n\"Got East Coast locked down, padlocked\"-Ol' Dirty Bastard 'Shimmy Shimmy Ya'\n\n[Verse 2:Apathy]\nI’ll make you curse the day you were born, the way you was formed\nMake you wish you was the stain on the page of a porn\nI don’t take the bull by the horns, I’ll rip the horns from his cranium\nI’m nuclear, urine test’s fulla uranium\nRadioactive, my radio’s massive\nLike I’m Radio Raheem, keep the police passive\n'Cause... Nobody want it, I’m hotter than fire feels\nKarate chop cop cars and punch thru riot shields\nI’m the bionic man, I’m Lee Majors\nSellin' crack in the 80’s with 3 pagers\nI’m the east coast beat killer and rapist\nPolice sketches identify our faces\nI murdered the mic in about 48 states\nWhat I do to mixtapes will catch me a rape case\nToo many faggots gettin' money, get your paper straight\nY'all are gay as a dude usin' a shake weight\nY'all are snake bait, rats in the boa’s tank\nSayin' you killin' shit, motherfucker you know you ain't\nI go in the paint, the defense scatters\nThe backboard shatters, the same exact shit I do rappers\nEast Coast Rapist", "year": null}]}