{"artist": "Wale", "songs": [{"title": "Day By the Pool", "year": "2016-06-18", "lyrics": "[Hook]\nLet me test your cool, can you take a stroke or two?\nIt's adult swim when I go up in, until the oxygen is through\nPut away your cool, spend the day in your pool\nIt's adult swim when I go up in it when we're lost in your world\nRun it back, let me test your cool, can you take a stroke or two?\nIt's adult swim when I go up in, until the oxygen is through\nPut away that cool, yeah, spend a day in your pool, girl\nIt's adult swim, if I drown in it, I'll be lost in your world, oh\nDown, down, baby, oh, girl I don't wanna float\nDeep sea, baby, soaking everywhere she go\nDown, down, baby, oh, there goes another, oh\nSqueeze both legs and oh, she'll never let me go\n\n[Verse 1]\nGot a thing for the nasty type today\nGot a thing for the classy type today\nSay she love it from the back or side\nBut hold back sometimes cause it be passin' by her ribs\nI don't care if she going both ways\nI don't care if her boyfriend is mad\nSittin' here with the noise in the room\nGuaranteed that she gonna have a splash\nSundresses in the moonlight\nSkinny dipping when the moon right, uh\nSomebody better call a life guard\nCause I'm liable to need revival\nResuscitated nigga, let me lay up with you\nWhen I'm going, hope you got a life saver with you\nRide with a nigga, just fly lil nigga and\nYa'll not like you got flight bookin' issues, hold up\nContinue, wild lil nigga finna drown in a minute\nLookin' like Skye Townsend, I'm flyin' in it\nHave you ever seen a fountain or pool this real?\nAny deeper then I'm going need scuba gear\nKinda sleepy cause I'm deep and I ain't cold or nothin'\nKinda sleepy cuz I'm deep and I can show you something\nWrite a poem or somethin, kiss you on the stomach\nEither way you wet, I got the pool this summer\n\n[Hook]\nLet me test your cool, can you take a stroke or two?\nIt's adult swim when I go up in, until the oxygen is through\nPut away your cool, spend the day in your pool\nIt's adult swim when I go up in it when we're lost in your world\nRun it back, let me test your cool, can you take a stroke or two?\nIt's adult swim when I go up in, until the oxygen is through\nPut away that cool, yeah, spend a day in your pool, girl\nIt's adult swim, if I drown in it, I'll be lost in your world, oh\nDown, down, baby, oh, girl I don't wanna float\nDeep sea, baby, soaking everywhere she go\nDown, down, baby, oh, there goes another, oh\nSqueeze both legs and oh, she'll never let me go\nDown, down, down, now, hey\n\n[Bridge]\nWalk tall with your chest out\nPaint your lips with the ruby\nTell Puff you ain't walking for the cheesecake\nIt's okay to be bougie\nSix inch heels, when you step out\nIf they a knife, you an UZI\nTell Khaled you the best now\nIt's okay to be bougie\n\n[Verse 2]\nI sent a text message to your fine ass\nYou left a wet spot to remind that\nHm, slow whine and rewind that\nNow forever on your mind, let me find out, hm, shit\nEvacuate the scene by that last scream\nCause she know it's wash day and these her last jeans\nTurn the pool to a lake if it gotta be\nAnd I keep her wheels turnin' 'til she tired of me, dive with me\n\n[Bridge]\nWalk tall with your chest out\nPaint your lips with the ruby\nTell Puff you ain't walking for the cheesecake\nIt's okay to be bougie\nSix inch heels, when you step out\nIf they a knife, you an UZI\nTell Khaled you the best now\nIt's okay to be bougie\n\n[Outro]\nIt don't matter, it don't matter\nIt's okay to be bougie\nIt don't matter, it don't matter\nI don't mind if you bougie", "album": "Summer On Sunset", "image": "https://images.genius.com/771651dda3c3975884151d0f829fc50c.1000x996x1.jpg"}]}