{"songs": [{"title": "Somebody", "album": "The Bigger Artist", "year": "2017-09-29", "image": "https://images.genius.com/7d94aecd396a79046cef20ef7fdead34.640x640x1.jpg", "lyrics": "[Intro: A Boogie Wit Da Hoodie]\nI know you been needing somebody\nMustard on the beat, ho!\nLook, I know you been needing somebody\nNobody really got me like I got me\nJust tell me what you really want from me\nIt's no problem, I'ma go see if I got it\nJust tell me what you really want from me\nWhat you really want?\n\n[Chorus: A Boogie Wit Da Hoodie]\nLook, I know you been needing somebody\nNobody really got me like I got me\nJust tell me what you really want from me\nIt's no problem, I'ma go see if I got it\nIf I got it, then you got it it's no problem\nHoes plotting, thinking that we don't know 'bout 'em\nI wonder what the fuck they want from me\nI know that you been needing somebody\n\n[Verse 1: A Boogie Wit Da Hoodie]\nI know your head sloppy\nYou really do it like you care about me\nAvianne got me feeling like I'm playing hockey\nRap money got me pulling up in big bodies\nBig bodies little niggas don't know shit about me\nCall me Artie I love to party, shooters beside me\nLeft the Rari' inside the parking lot oh I'm sorry\nEnded up with a Spanish mami calling me papi\nActing cocky when she really don't know shit about me\nThough they wonder why I always got my clique by me\nDon't touch me, you'll be lucky if you sit by me\nThey don't get it 'til they really see their bitch by me\nGot a trophy on my arm, I keep my wrist icy\nIf you want it, nigga, then you gotta get by me\nAlways wanted a Patek, now I can get like three\nIf you think it's too late, then it just might be\n\n[Chorus: A Boogie Wit Da Hoodie]\nLook, I know you been needing somebody\nNobody really got me like I got me\nJust tell me what you really want from me\nIt's no problem, I'ma go see if I got it\nIf I got it, then you got it it's no problem\nHoes plotting, thinking that we don't know 'bout 'em\nI wonder what the fuck they want from me\nI know that you been needing somebody\n\n[Verse 2: Don Q]\nWe can get it popping for the night though\nYou know my style, red bottoms, only the spikes though\nYeah, it's always a light show whenever the ice glow\nCouple more shots, ain't no tellin' where we might go\nTake it to Marriot or, we can take it to the trap\nSpittin' on my mic, shoulda put her on the track\nFuck around and have you butt naked on my Snap\nWith your legs on the air, got you shakin' on your back like\nWait, I think she catchin' a seizure\nAll my old hoes tell me I'm catchin' amnesia\nA different kind of beast, I'm not a regular creature\nDrop two-seater Bimmer, cranberry its features\n\n[Bridge: A Boogie Wit Da Hoodie]\nWhat they really want from the nigga?\nWhat you really want?\nWhat the fuck they really want from a nigga?\n\n[Chorus: A Boogie Wit Da Hoodie]\nI know you been needing somebody\nNobody really got me like I got me\nJust tell me what you really want from me\nIt's no problem, I'ma go see if I got it\nIf I got it, then you got it it's no problem\nHoes plotting, thinking that we don't know 'bout 'em\nI wonder what the fuck they want from me\nI know that you been needing somebody"}], "artist": "A Boogie Wit da Hoodie"}