{"artist": "Boosie Badazz", "songs": [{"album": null, "title": "America’s Most Wanted", "year": "2017-11-23", "lyrics": "[Intro]\nBoosie Badazz\nTake the Badazz the hard way\n\n[Chorus]\nHave you read those papers? (goddamn)\nAmerica's most wanted\nCouldn't get me when they got me\nNow they say I'm with the 'luminati\nAmerica's most wanted\nHave you read those papers? (who am I?)\nAmerica's most wanted\nSix bodies, two attempts\nSir you're lying, I don't do attempts\nAmerica's most wanted\n\n[Verse 1]\nSnipers on the roof at my trial\nProsecutor tellin' the jury he need to die\nAttempts but if you talkin' attempts then you a liar\nOn top of that Warner Brothers told me bye\nTried to give niggas deals, man they really tried to burn me\nSaid I had a bag of money on the district attonery\nThey tried to sink me, even set me up in jail dog, no charge\nNow they talkin' court cases, these are real go hards\nThey told my fall partner rat so he can hurt me\nOffered him ten and he was on seven murders\nSnatched up my kin, labeled my mama as a witness\nTen years for marijuana and I ain't never been convicted, dirty bitches\n\n[Chorus]\nHave you read those papers? (goddamn)\nAmerica's most wanted\nCouldn't get me when they got me\nNow they say I'm with the 'luminati\nAmerica's most wanted\nHave you read those papers? (who am I?)\nAmerica's most wanted\nSix bodies, two attempts\nSir you're lying, I don't do attempts\nAmerica's most wanted\n\n[Verse 2]\nCame home, they say I couldn't drink beer, this shit is real\nJudge read the verdict, the prosecutor in tears\nBeat a motherfuckin' life, I say I ain't have fear\nSend me straight to death row and I just had a couple years\nI got blamed for niggas' bodies I ain't even fuckin' know\nIn my cell, tears fallin' on the floor, I wanna go\nFeds comin' to my cell, frequent visits to the pen\nBitches sayin' if I win they gon' lock me up again\nHad me in bulletproof trucks when they take me to court\nElectric shocker on my body like where the fuck I'ma go?\nEvery song I talked about guns on, they brought it up\nHad God on my side, this wasn't luck, what the fuck\n\n[Chorus]\nHave you read those papers? (goddamn)\nAmerica's most wanted\nCouldn't get me when they got me\nNow they say I'm with the Illuminati\nAmerica's most wanted\nHave you read those papers? (who am I?)\nAmerica's most wanted\nSix bodies, two attempts\nSir you're lying, I don't do attempts\nAmerica's most wanted\n\n[Outro]\nA deputy woke me up and he told me I'll be glad when they electrocute your black ass\nAmerica's most wanted\nMy jury was anonymous, they stayed in hotels, they couldn't say they name, couldn't do nothin'\nAmerica's most wanted\nHomicide told me, we should've killed your ass when we had the chance\nAmerica's most wanted\nOne day they made my kids visit me in front of my cell, dirty ass cell\nAmerica's most wanted\nThey told me I want your fall partner to rat 'cause I know he gon' get killed, crazy\nAmerica's most wanted\nHad all my niggas on the chalkboard, had me on the top, boss man\nAmerica's most wanted", "image": "https://images.genius.com/681f4bb9ff46a631f887773f54f74156.1000x1000x1.jpg"}]}