{"artist": "ILL BILL", "songs": [{"title": "Billion$ On My Mind", "lyrics": "ILL BILL:\nI don’t wear a chain, I snatch and bring them to Jack at Albee Square Mall\nBig homie, bringing it back\nFarragut Road, Uncle Howie’s heroin habits\nNo competition, these other rappers they’re all faggots\nI keep it hotter than summer of 88\nJordan 3’s on my feet, right before they dropped “Do the right thing”\nBeyond that, I’m top rank\nHard beats, hard raps\nMillion dollar contracts, billions on my mind, man\nThe kid is prepared, always carrying pistols in pairs\nI calculate like a digital scale\nKept it fresh even after Non Phixion was staled\nCrashing Ferraris like Vince Neil after sniffing a rail\n“ILL BILL be the future” is real\nVolume 2: I’m Goon, homie, like an ice pick in your ear\nMy beats lock you up like I hit your face with a brick, you half-dead\nBut my lines is still making you think\nILL BILL, LCN, this felon is venomous\nAnd get more pussy like Hellen DeGeneres\nExtra-intelligent, relevant, degenerate\nFrom Canarsie’s cemetery to The Glenwood tenements\nHang with gangs, bang beats, bang with pistols\nAnything that I’m involved with bangs official\nIf she wants it like that, I'ma bang your sister\nRun up on the president’s wife and bang the system\nListen\n\nOh, y’all didn’t know I make beats, did you?\nThere is a lot y’all motherfuckers don’t know about me, man\n2007, ILL BILL, The motherfucking Cult Leader\nThe Hour of Reprisal, La Coka Nostra’s A Brand You Can Trust\nI don’t know if y’all motherfuckers is ready, you think they ready?\n\nSLAINE:\nYo, you wanna fucking drive for me, man?\nYou got to get drunk before you drive, what the fuck\nILL BILL is the future, I’m the past, I’m a never-was\nWhatever, let this shit play\nBanging shit, fuck it", "image": "https://images.genius.com/99ff63951f21bd5532d81bd64d3cbd69.800x800x1.jpg", "album": "ILL Bill Is The Future Vol. II", "year": "2006-10-13"}]}