{"artist": "Drake", "songs": [{"year": "2018-06-29", "album": "Scorpion", "image": "https://images.genius.com/2fee80dd9aec0717aef8e1eb7aaaae4c.809x809x1.jpg", "title": "8 Out of 10", "lyrics": "[Intro: Drake]\nToo rich for who? Y'all just got rich again\nWho grips the mic and likes to kill they friends?\nI've never been the type to make amends\nIf shit was at a eight, we like to, we like to, we like to—\nYeah, if shit was at a eight, we like to make it ten\n1da sent this in, I'm goin' up all the way\nI don't like to talk when there's nothin' else left to say (True)\n\n[Chorus: Drake]\nDrizzy 'bout to drop, the game is in disarray\nI'd tell you hear me out but we both know end of the day\nYour sister is pressin' play, your trainer is pressin' play\nYour wifey, your wifey, your wifey, your wifey— (True)\n\n[Verse 1: Drake]\nI gotta breathe real deep when I catch an attitude\nI got a whole 'nother level that I can tap into\nMax said they only blessed when they attached to you\nThe only deadbeats is whatever beats I been rappin' to (True)\nAnd the product is still the best though\nIt's only good in my city because I said so\nJust to fit the estate man, I had to Copperfield like presto\nVoilà, tada (True)\n\n[Bridge: Drake]\nNever a matter of \"could I?\" or \"should I?\"\nKiss my son on the forehead then kiss your ass goodbye\nAs luck would have it, I've settled into my role as the good guy\nI guess luck is on your side\nI guess luck is on your side\nAll sevens, no sixes, rest easy, get some shut eye\nHold on, hold up, but I—\n\n[Verse 2: Drake]\nMiss makin' 'em pay\nHelipad from Will Smith crib straight to the stage\nThree Forum shows but I played Staples today\nThe neighborhood is smokey, y'all stay safe in this place (True)\n\n[Chorus: Drake]\nDrizzy 'bout to drop, the game is in disarray\nI'd tell you hear me out but we both know end of the day\nYour niggas is pressin' play, your nanny is pressin' play\nYour wifey, your wifey, your wifey, your wifey— (True)\n\n[Verse 3: Drake]\nHad to go and hit reset, now we here\nI been on top for three sets of three years\nI can't be around the niggas you minglin' with\nI can't fly if I could sit on the wing of that shit (True)\nI try to pay it less mind\nThey been keepin' tabs on me like I'm payin' next time\nI think I sense a little fear from the other side\nWhite vans parked across the street, real subtle guys (True)\n\n[Bridge: Drake]\nYeah, never a matter of \"could I?\" or \"should I?\"\nKiss my mom on the forehead then kiss your ass goodbye\nAs luck would have it, I've settled into my role as the good guy\nI guess luck is on your side\nI guess luck is on your side\nAll sevens, no sixes, rest easy, get some shut eye\nHold on, hold up, but I—\n\n[Outro: Plies]\nHahaha, I can't argue with you, no! You mad!\nLook at you, you mad! You big mad! Haheheh\nI'm happy! Leave me alone!\nI just want some money, a lot of money\nI don't get paid to argue with you\nNo! Who is you? You ain't nobody!\nYou mad"}]}