{"songs": [{"album": "Bad Season", "image": "https://images.genius.com/0fb56636df878a9df9d4417d6e65d406.1000x1000x1.jpg", "year": "2010-12-23", "title": "Bad Season", "lyrics": "[Verse 1: Tech N9ne]\nEverything was supposed to be all Jesus\nCome ease us we really need to be free from evil deeds\nPlus negros, hide in thee weeds waiting to see us\nAnd we bust then they will bleed trying to seize us\nBad season, I'm ready to trip for that reason\nHow your beefin gonna last when your ass vegan?\nI ask trees when cash is fast, and weed then gonna have cheese stacks\nThen trash bags will have fees then\nYes sir that's why the milli is in thee dresser\nFor any motha f'er wanna test for Tech will get him wetter\nStep into death your ex messing with a keffer\nNever let your lover get put in less than a bed with a heffer\nThe mags breathing, these fags freezing cause cats teased him\nAnd they passed on that evening\nI flash B's, and sag my flags revving I blast heathins\nIf they had me in bad season\n\n[Hook: Tonesha Sanders] (2X)\nThese things must mean bad seasons\nAnd they must be for a reason\n\n[Verse 2: Krizz Kaliko]\nHardly time for no hardey ha no laughter\nWorking them hard I can't leave no starving bastard\nPardon me if you see a star in me it startles me\nAnd I ain't come to party but I'm always what inbottles me\nI'm living for the chips for the extra, got too many deaths\nAnd I'm trying to find the way out the selexta\nJokes folks telling me gotta to bless ya\nI ain't trying to Busta Rhymes, difference is there calling me Besta\nMy season is devil people receiving me\nThey party to my words but I don't think the motherfuckers is believin' me\nHalf the time I think my eyes are deceiving me\nFat boy that boy o'er there keep there hands in the air\nYou can do me like a new kid (New kid)\nRocket 'til it's putrid (Putrid)\nArticulate to prove it but motherfuckers is stupid (Okay)\nKali baby, and his thing never leaving\nRunning out of breathe cause I'm breathing the bad season (Bitch!)\n\n[Hook]\n\n[Verse 3: Nesto]\nAh! I think I'm out of my mind, they say I'm out of control\nTech let me go! This shit right here is a straight-jacket flow\nIt's nuts like pistachios, can't you tell? Lyrically I'm spraying shells\nWit my tongue, the devil's my son so I'm raisin hell\nYeah, yeah, say it twice, turn you to confetti with this machete\nI'm like Freddy, you'll die dreaming like Reggie White\nOh, oh, you in town? People shook when you around\nCut, they know the owner's well connected like unibrows\nBig, big, bad wolf, yeah, I came and blew it down (Pff)\nThis is my newest style, oh, yeah? I'm a mess\nY'all know, everyone got hard flows\nWhere they at? Cause I can never find them like Waldo\nClick, click, blaow! At your stomach feel the pow!\nHave you rollin' on the ground, bleeding pleading screaming OOOW!\nRest in peace, this a sad evenin'\nTech, Krizz and Nes will show you a bad season\n\n[Hook]"}], "artist": "Tech N9ne"}