{"songs": [{"album": "Special Effects", "image": "https://images.genius.com/0583f35f722baaaf32fff9f8683656e5.400x400x1.jpg", "year": "2015-01-28", "title": "Dyin’ Flyin’", "lyrics": "[Intro]\nIs it true, I can only fly so high?\nThen, then without wings, I truly die\n\n[Verse 1: Tech N9ne]\nIf you trace it back to the beginnin'\nI never sold a single piece of music before Mitch Bade\nThis laid, the foundation for me to get paid\nThis day, you can still hear that gangster on a sick page\nNow I'm flyin' high but dyin's, my\nFans that were buyin' I\nThey're cryin', \"Why\nDoes he have to get bigger and flow with artists from mainstream?\"\nGood music reaches all and he's creating a strange scene\n\n[Hook: Krizz Kaliko]\nHow, far up can I go\nBefore you say you love me?\nYou love me not?\nYou love me?\nYou love me not?\nI'm flying but I'm dying faster\nHoping you won't go away\n\n[Verse 2: Tech N9ne]\nHow the hell are you sayin' that all the records I'm playin'\nSince 2010 are not obeyin' the Strange Law\nRemain raw, give your happy and pain all\nSpit with a flame jaw with the teeth of a chainsaw\nThis what I do when I'm flyin' right off the shelf\nAnd when something musical helps\nYou can't keep it all to yourself\nIt grows and grows, always hard never tryin' soft\nSo how in the world you fix your face to say that you dyin' off\n\n[Hook]\n\n[Bridge: Tech N9ne]\nAHHHHHH\nFrustrated, cause I'm thinkin' that if enough hate it\nIt'll make remaining fans start feelin' their trust faded\n\n[Verse 3: Tech N9ne]\nI don't wanna die (I don't wanna die)\nI just wanna keep my lifeline\nAnd that's the family who recite N9ne's passages\nAnd back it just cause ain't no other like mine (tight rhymes)\nAnd even the people applaud\nThey still wanna bury hard, cause they don't wanna be a god\nI'm higher than the stars now\nThe bottom is too far down\nWhoever throws sand at the Nina\nYeah it kinda cuts but it ain't enough to take me down\nI've been so true, so things I do will go my way\nWith the power of the pen, the paper, the people do as I say\n\n[Hook]\n\n[Outro]\nMy fans are my lifeline, so it kills me to think how they can just cut off--\n\nThere can only be one\n\nThou shall only be me\nWhen the whole world's changing\nAll shall remain (x4)\n\nI'm flying higher more and more everyday\nBut lately, I've been feelin' like I should just fly away..."}], "artist": "Tech N9ne"}