{"artist": "Vast Aire", "songs": [{"title": "Da Supafriendz", "year": null, "lyrics": "[Verse 1: DOOM]\nGive 'em some skin, a real country bumpkin\nGet up off his property, the Villain, Fuzzy Lumpkins\nDumpin', enough raw lead to leave a forehead sunkin'\nWhen he's on tour, keep your paws off his pumpkin dumplin'\nTown village nympho, now it's all his though\nThe way she got down was far from privileged info\nBreak up to make up, wake up and smell the indo\nJust from how she liked to show her belly button ring tho'\nCouldn't tell em nothin', 5200, Atari, or Sega\nTest tube L's with the lid, Garcia y Vega\nHis tongue is like a sword that's mighty like a pen\nAnd you ain't seen nothin' like The Mighty Quinn\nAlrighty Then!\nSeal the deal with the shakin' of a hand\nPeople's catchin' feelings like it's Making of the Band\nVillain have your fake man, quakin' in his Vans\nWhen he do a jam, fans break dancin' in the stands\nChances are, he'll lose the battle and the war\nTryin' to go to shore with just a paddle and an oar\nOo, shucks, he should have known them two schmucks\nWould have came through the game\nLame ducks, off beaucoup bucks\n\n[Hook: Vast Aire]\nYo, Metal Fingers, fix the beat with fire water\nI advise all fathers to watch they daughters\nIt's goin' down tonight\nWe got monster's in the crowd, and they ready to fight\nMetal Fingers, fix the beat with fire water\nI advise all fathers to watch they daughters\nYou know we keep tricks up the sleeve\nComin' through with the Justice League (But you don't hear me though)\n\n[Verse 2: Vast Aire]\nI used to sew army patches on my favorite coat\nBMX got your guns, old folks got soap\nHomeless Sally from Cali cursed, cats in the alley\nSounds so foul, we washed our mouths out with soap\nI came up with cats, that never be smilin'\nI called DOOM he said meet him on Monsta Island\nWhere the girls look good\nAnd them MC's be whilin'\nYou can catch me in Valuer Suits, stylin'\nWith Lady Jaye holdin' hands with the Baroness\nStorm Shadow and Snake Eyes don't got nothin' on this\nI got them Go Go Gadgets\nSo when the Cobra-La come through the floor\nI'm puttin' snakes in baskets\n\n[Verse 3: DOOM]\nWe rhyme and do our thang\nHe's like Stymie from Our Gang\nGuitar twang, try me, and WHA DA DA DANG\nI don't think you want to know\nEven if you still do\nAnd want me to, I'll tell you\nBut then I'd have to kill you\n\"WILL YOU?\" Please\nIt's like a Grilled Cheese sammich\nGotta bring the butter or the bread'll get damaged\nFlip it, slice it, and give half to Vast Aire\nIf you ask nicely, and bring a glass\nWe'll share the last beer, here\n\n[Verse 4: Vast Aire]\nAfter the Cold Vein and Doomsday, we don't need no pop\nREVOLUTION, we hit cops with Judo Chops\nAll you see is red, black, and green\nKnow I'm down for my team\nThey killed Radio Raheem!\nNow I want to smoke a blunt, you know, blow off some steam?\nOpen my mouth like Godzilla, and all you see is light beams\nNow this rap shit ain't all that it seems\nYou can leave it to the Supa Friendz to spill the beans", "album": "Look Mom... No Hands", "image": "https://images.genius.com/ec5e65a416584a208b3230e59ddbdd2f.600x600x1.jpg"}]}