{"songs": [{"title": "One", "lyrics": "AKIR - “One”\n[Emcee(s): AKIR]\n[Producer(s): Southpaw]\n[Sample: Kenny Loggins ft. Stevie Nicks - \"Whenever I Call You ‘Friend’\"]\n\n[Intro: AKIR]\nYou know when something just feels right.  Nah’mean?  And you just got to make it right.  I’d like to dedicate this one to everybody who was here at one point and might have left but invested their time and energy and long, hard years of sweat to make this thing happen.  I’d like to thank everybody who ever supported us and understands where we’re going with this message in the music.  It’s like this, yo\n\n[Verse 1: AKIR]\nOne Enterprises comprises the artist and the sound\nThe pen and paper play my savior while I'm getting down\nPray for my neighbors as a favor for holding me down\nSlave for my papers as I savor the weight of their pounds\nIt's underground, but the blatant vibrations widely found\nFacing a nation, complacent radio stations now\nStop hesitating and contemplating the way we patient\nStart motivating and get them playing the shit we saying\nAin’t no delaying in this war that we’re getting slayed in\n'Cause time's a-wasting while we stand adjacent to abrasions\nTheir fouls is more than flagrant, and so I see the prisons’\nCages while I pound the pavement, looking for payment, saying\n\"Fuck enslavement!\"  Using the tools of old ancients\nAnnouncing my engagement to this music that we making\nAin’t no faking on tracks and we don’t never come wack\nYo, this is One Enterprises and that is a wrap\n\n[Hook: AKIR]\nOne love, one music\nOne people, one movement\nOne heart, one spark\nOne, One, One, One\nOne gift, one lift\nOne stance, one shift\nOne God, one squad\nOne, One, One, One, One\n\n[Verse 2: AKIR]\nWalking through the valley in the shadows of beats\nTalentful peeps balancing sleep, accounting for weeks.  Meanwhile\nHustling beasts rustle in streets, hushing the speech\nPeople rushing to see if we’s as tough as can be\nRemarkably deep, twenty thousand leagues up under the sea\nOver the trees, plan to keep a dance with that ease\nSuddenly, the vibration force a nigga to breathe\nWatching footprints in the sand blow away in a breeze\nGot on my knees and pray to God that we succeed together\nClever trendesetters with a vendetta to make it better\nNo matter the weather, we forever be wetter in all endeavors\n(One love, one music, one movement forever)\n\n[Hook: AKIR]\nOne love, one music\nOne people, one movement\nOne heart, one spark\nOne, One, One, One\nOne rhyme, one time\nOne light, one shine\nOne way one day\nOne, One, One, One, One\nOne love, one music\nOne people, one movement\nOne heart, one spark\nOne, One, One, One\n\n[Outro: AKIR]\nYeah.  Uh, uh, one love, one music, one movement", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}