{"songs": [{"album": "All 6's and 7's", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg", "year": "2011-06-07", "title": "Eenie Meanie Miny Ho", "lyrics": "[Intro: Tech N9ne]\nSay ho, can I ask you a question?\nWould you happen to have any great punan?\n\n[Verse 1: Tech N9ne]\nEenie meanie miny ho, choosing bitches at my show\nTryna get you at the mo, poppin' x and smokin' dope\nEenie meanie miny ho, come in here and close the do'\nOn the bed or on the flo', I'm about to let it go\nDo you solemnly swear to put that bottom in the air\nAnd do you promise it'll be bare so I can bop it?\nTwist it, pull it, hair is in my palm as we share\nPull off the magnum and teach prayer and then I get off it\nWho else wants some, who else wants some of debo?\nWhere'd she go, the one I saw shopping at the little bitty waist 38 double D though\nI've seen more H O E's go home with me, holy toledo\nI greet those thickest ones with the homeboy Frame and Krizz Kali-ko\n\n[Hook: Wide Frame]\nWhich one? Pick one! Anybody know?\nThis one that one if she wanna go\nIf she trippin' gotta let her know\nIt's 10 bitches right outside the do'\nEenie meanie miny, eenie meanie miny ho\nEenie meanie miny, eenie meanie miny ho\nEenie meanie miny, eenie meanie miny woah\nEenie meanie miny, eenie meanie miny ho\n\n[Verse 2: Krizz Kaliko]\nGirl gimme that, okay yeah I said it\nCome here let me fill you with some of this here unleaded\nShe's a magician cause nobody knows right where her head went\nI hate the strip club cause I never know where my bread went\nI'm the best thing since squozed milk, I told her, hold her\nLet me see one of them over the shoulder boulder holders\nAnd if she lite-bright then we might fight with the lights out (Okay)\nTell her I might bite her in the pine, take my slice out (Okay)\nKali baby I got chicks in different zip codes\nThey love the way I Busta Rhymes, like I'm from Flipmode (Huh!)\nI know I'm fat, I'm not trippin' girl get me exposed (Okay)\nIf you ain't with it I'm moving onto the next ho\nMove onto the next chick! (Hey) And get her ahh and ooing\nTake her to the room and she know what I really be doin' to her and\nLike an hour later, some now some later\nI know ya shake ya hips for tips but I'll be damned if I pay ya, tell em!\n\n[Hook]\n\n[Verse 3: Tech N9ne]\nEh, just got gnarly, cause one just said\nTo her friend I hope he don't card me\nYou're not invited to my swar-ee, SORRY\nI mean soirée (What's that?) Party!\nDidn't ya see, Weird Science bitch, we're the defiant clique\nBut we fear the lyin' chicks tryin' to get N9ne's dick\nOn to the next one step into my section\nGet some, flesh done, in bed I'm redrum\nI ain't even gotta cake these ladies, well I'mma cake a little\nSo I can lay these, but she don't\nRequire cake, straight wanna take D's\nSo I just said, Anna Mae just take the cake please\n\n[Hook]"}], "artist": "Tech N9ne"}