{"songs": [{"year": "2013-02-19", "title": "Micheal", "image": "https://images.genius.com/16e4369581459dc366b55de0957100fb.600x600x1.jpg", "lyrics": "[Verse 1]\nTeeth marks on the skin\nThe greatest trick the devil ever played was to take away my friend\nI got your face engraved into my flesh\nSo I can try to make amends with that day I won't forget\nIn Minnesota I flew in so that we could both record\nMe and Kristoff Krane were supposed to go on tour\nNobody answered, we were knocking on your door\nAnd when they carried out your body, I was staring at your shoes on the floor\nStill the answers never come\nYour funeral was beautiful, it captured what you loved\nI sat there in a stupor, fractured by the hugs\nThat I gave your family members, growing sadder by the months\nBut I won't dwell inside the ends\nAnd that's not what you would want, you would tell me find connections\nTo the world and to tell it my confessions\nThe hell that I invest in is a part of something bigger\nWords that you would write, they would carve into the center\nRight on target 'til they start to fill my heart up with the letters\nShadows have shadows and it's darker than remembered\nWhen this story has an ending to the part I had together with my friend\n\n[Verse 2]\nAbsence makes the heart grow fonder of the time before the absence\nAnd the nights spent trying to imagine\nWhen you played I was blinded by the magic you displayed\nI tried to reenact it in a way\nI need the dark today to see the stars decay\nCause if I can fall asleep, then I can dream we are awake\nAnother shot of Jameson and PBR to chase\nAnother conversation in a seedy bar to play, right?\nMan, this side of me's the worst\nWhen I'm terrified that all I'll leave's a dynasty of dirt\nBut you believed in me and I believed your words\nSo in turn, I believed in things when I would need the courage\nTo move on, on and on and on and on it goes\nWhen I'm nodding off an awful lot to songs that you had wrote\nI want to honor all the art and progress that you showed\nI miss my confidant and honest talks allotted on the phone\nWith you Mike -- I wish that I could hug you again\nIt's getting harder to pretend and I can't undo what's been\nThanks for being someone I could come to, a friend\nI hope I make you proud -- I love you, the end\n\n[Snippet of Micheal \"Eyedea\" Larsen, spoken]\nIsn’t a person just a collection of their mistakes, and also their, kind of, undoing of their mistakes? I mean, what else are you? You know, you’re always…you’re always just the reaction to the bad parts of yourself, I think. And I think that’s what is kind of like, a driving motivation behind any human being that’s…who wants to continue to grow and live life. ‘Cause they’re looking at their flaws and trying to, go beyond it. And I think that a person, you know, essentially dies when they think that they found themselves, ya know? Unless you want to admit that you, yourself, are not an individual, and are just part of a whole…movement of ideas, and thought, and culture, and humanity and, furthermore, the universe, and everything -- unless you really feel like that, and you’re walking through walls, you know, you are always trying to find yourself. And it’s usually a person who believes that they’ve found “the answer” -- found “the end” -- that there actually is a psychological end. And then what’s the point of, you know, doing anything after that?", "album": "Flowers For My Father"}], "artist": "Sadistik"}