{"songs": [{"lyrics": "[Intro]\n(Ayy, Southside, where'd you get all that drip?)\nBrr, hah, Asian Doll!\nUh, hollup, ayy, ayy, bitch!\n\n[Verse 1]\nReal street bitch from the South Side\nAny nigga test my gangsta, nigga bound to die\nYou ain't talking 'bout no money, don't see eye to eye\nSneak dissing on the net, you get no reply\nBitch, you broke, and you mad, can't get into you\nSay you know me, I don't know you, I'm no friend of you\nFreaky bitches, suckin' dick, the gang got introduced\nNiggas wanna catch me slippin', bitch I'm bulletproof\nI'm a real bitch, I spit real shit\nI sit back and let my niggas do that kill shit\nSince '96, I've been a product of my hood, bitch\nYou can see it in my eyes, I ain't gon' snake shit\nI got Percs, I got Xans, for the low-low\nMama broke, she was fiendin' for that coco\nDaddy told me, \"Baby girl, you ain't gon' blow-ow\"\nSigned to Gucci, now I'm gettin' it, bitch, I'm solo\nHottest female artist, girl, you look retarded\nWay these diamonds sitting up on my neck, it look like tardy\nI ain't talkin' no apologies, these niggas sorry\nPut that beam right to your head, while I'm gettin' naughty\n.40 make you burn, it make your motherfuckin' block hot\nAny bitch that want it, she gon' get it, I'm the top notch\nAsian, I'm the fizzle, wanna pop it on his pizzle\nMade him eat me like a Skittle, I got niggas, they some hittas\n\n[Bridge]\nWanna taste it? Just a little\nWanna taste it? Just a little\nWanna taste it? Just a little\nWanna taste it? Just a little\n\n[Verse 2]\nAyy, 50 bands in my pants, fly like Peter Pan\nI told that nigga I'm not fakin', I'm not with pretend\nMy bitch she bad, she a stylist, she came from Japan\nWhen I pull up, need my money, 'bout my dividends\nGhetto bitch, she Creole, now my nigga need more\nWhen my check account was zero, kids, they think I'm hero\nRun up, bitch, you stupid, I got shooters and they suited\nBitch you talkin', I'ma lose it, off the earth, I'm fuckin' zooted\nReal young street bitch, and I'm from the South Side\nCross my heart, and hope to die, these niggas, they bound to die\nI'm not with the sucker shit, I'm not with the fuckery\nMade it out, I'm born to be, my niggas split a hundred P's\nReal young street bitch, and I'm from the South Side\nCross my heart, and hope to die, these niggas, they bound to die\n\n[Outro]\nBrrrr, grrrah!\nAsian Doll, bitch\n1017 shit, fuck is y'all talkin' 'bout?\nHardest female in this shit, ha\nEskimo! Doll", "album": "So Icy Princess", "year": "2018-08-03", "title": "Southside", "image": "https://images.genius.com/041218418233476d7ebce34aad3d3544.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}