{"artist": "Canibus", "songs": [{"title": "Even The Odds", "album": "Full Spectrum Dominance", "year": "2018-06-05", "image": "https://images.genius.com/e46ac064e354d1b1540013198f5e0d71.1000x1000x1.jpg", "lyrics": "[Canibus]\nThe odds are the dark star's not very far off\nToxicology report said he had an elephant heart\nI'm like a Gollum with greasy hair\nAnd a creepy stare born on a leap year\nMeet me there, let me see if you care\nCrawl from the ocean onto the land\nComplete the plan, deeply tanned\nFace, feet and hand covered with beach sand\nFeed off freshwater seaweed\nMini stools looked like bb's\nStood on a throne of wreathed sea leaves\nNeti pot, clean flush, nasal confetti snot\nJust because I let her sit on my face, maybe not\nExercise alone eating cold stone ice cream cones\nMeasuring Yellowstone with temperature probes\nGrass dont grow, wack-o-mole, facial expression wax bold\nGamma radiation from black holes attack souls\nDrone pilots report they was attacked by giants\nI say every survivalist is Darwinism Compliant\nBruce Lee, brother Noon Sea on a Chinese junk\nWe could use the island over there where these beats came from\nI'm a dark radiant super-sapian grafted onto an alien\nWho cloned himself to listen to Germaine again\nCanibus Atticus Finch suspense thriller about to go to print\nIn bold ink, you cold-blooded old bitch\nCanibus, Thanos, my nigga Thirst the Howl that came over to armwrestle on a three-legged table\nMake America Mexican!\nMy A-team like Gregory Peck and em\nMr. T bodyguard the President\nMurdoch is Marduk, top gun like Tom Cruise\nMaking a bomb run on Kim-Jong Un!\nThis is real life, fool it ain't no cartoon\nGet a clue, hot barbeques and ice cold brews\nNothing new under the sun, but what if we got two?\nFull Spectrum Dominance bro, coming soon\n\n[Thirstin Howl III]\nThe odds are they fear the perfect(?) energy\nMove with the energy, they in the lead\nBut I stay grounded like a centipede\nThe teeth 2000, the housing, scanning all the hieroglyphs\nStuck in microchips, gas clocks kept him alive to flip\nMore flow than Poseidon, I do not ?\nHigher than a world of tyrants where they want your Gods silent\nIt's Beelzebub! Witness hell or bust, soon as he felt the scud\nDestroying humanity like the time that God held the flood\nThe country's fucked! Trump is creating an Elmer Fudd\nBela Lugosi celebrating over the smell of blood\nWise like the cyborg with global red eyeballs\nFighting with my human side shining when the light's off\nWar biochemical, airborne I will end you\nSuffocate till you're dead, tryna breathe through an inner tube\nAnd everybody call it conspiracy gossping\nBut you will see when you start paying for oxygen"}]}