{"artist": "Fabolous", "songs": [{"year": null, "album": "There Is No Competition", "image": "https://images.genius.com/514810c2ba4e1b9f387deef8c54f63f5.320x320x1.jpg", "lyrics": "And the winner is\nStreet, Fid-d-d-damn!\n[Verse 1: Fabolous]\nThis is a PSA, nigga I'm so fly\nWalk through and get searched by the TSA\nThis is me esse, I look Mexican\nI mean Gucci, green and red stripe me down\nI feel Boosie, somebody \"Wipe Me Down\"\nI shit loosely, hope y'all got a diaper 'round\nCause I, pull up to night clubs, shit beamin\nLike Phillip lightbulbs, and they schemin\nAs they should be, it's all good B\nMy money talks I don't think they understood me\nYeah, you niggas don't speak guap-anese\nStoppin me, is like tryin to stop a sneeze\nGesundheit! I won't, the goons might\nGet it poppin off like when a balloon's tight\nDiamonds like sunshine, moonlight\nOh, you forgot who in the room right?\n\n[Hook]\nThe Street Fam's in the building tonight\nOh what a feeling, I'm feeling life\nYou ain't even gotta bring your paper out\nWe the dope boys of the year, drinks are on the house\n(We in the house) Street Fam's in the building tonight\nLook at me chillin, I'm killin this ice\nYou ain't even gotta bring your paper out\nWe the dope boys of the year, drinks are on the house\n(We in the house... we in the house...)\n\n[Verse 2: Fabolous]\nLook, I'm so sorry; if you don't like\nWhat the boss say, you ain't got to stay Joe Torre\nCall me big shot baby I'm so Horry\nDiamonds dancin, gettin they Omari-on\nI'm so cold, I'm so cold, I'm so cold\nI hope you bitches dress warm\nIt's like 30 degrees on my left arm\nBelow zero with the SF charm\nGestapo get the doors on the car pulled\nI sips some spades, take a few cigar pulls\nBosses do V.I.P. never bar stools\nGet money blow through it like nostrils\nSmell me? That's creed cologne\nAccompanied by good weed and 'Trone\nA pretty young thing that knows how to fuck me\nHer sneaky-ass homegirl also wanna fuck me\n(And I'll fuck her too)\n\n[Hook]", "title": "Dope Boys"}]}