{"artist": "Wiley", "songs": [{"year": "2018-04-06", "lyrics": "[Chorus]\n01\nI ain't breddin' no one\n01\nWho am I? No one\n01\nI ain't breddin' no one\n01\nWho am I? No one\n\n[Verse 1]\nNo chains\nJust to show a brother they're my old ways\nFuck a wristwatch\nI used to cop 'em just 'cause I was pissed off\nYeah, nuff property (bricks)\nI got my money up and there's no stoppin' me\nI'm winning\nMy brother put the show on in the tent and now we're killing it (O2)\nYeah, BBK the team I rep\nEvery summer Ryanair and EasyJet (flyin')\nYou could see me flexing on your TV set\nYou should see the show if you ain't seen it yet (look)\nStage show, fireworks\nHere I go, I'll show you if the fire works\nI make magic\nNo more treating money like I've never had it\n\n[Chorus]\n01\nI ain't breddin' no one\n01\nWho am I? No one\n01\nI ain't breddin' no one\n01\nWho am I? No one\n\n[Verse 2]\nLet me go and do my ting in peace\nThen I step into the loudness (loud)\nThere's a bigger world if you're looking for it\nYeah, I know, I've been around a bit\nI'm a traveler, travel like I ain't got a home (where ya live)\nIt's obvious I grew up in a shotta zone (yeah)\nYour hotline was blingin' I had the hotter phone\nProper phone, yeah, I had the put man in the lockup phone\nEvery day is challenging\nI could get an A in Money Management\nI'm humble, but I grew up with the savages\nAin't nobody paying for the damages\nMy city's cold\nSo much pressure, got the youngers feeling old\nIt's a fast life\nBut without it bro I wouldn't have an archive\n\n[Chorus]\n01\nI ain't breddin' no one\n01\nWho am I? No one\n01\nI ain't breddin' no one\n01\nWho am I? No one\n\n[Verse 3]\nSpeed across the finish line\nShowed 'em I'm a winner with this given time\nMy brother got the link to the vis'\nNo more limits, bro, I'm going overseas\nI got that grimy, I give 'em what they haven't got\nYeah, I've worked in both digital and analog\nI'll show you a landslide, Atlantis to Travelodge\nNow just climb the ladder, stop one to Avalon\nI'm from the east side of the river Thames\nYeah, I got the knowledge, always dropping gems\nI've seen the crazy spitters, nothin' stoppin' them\nI could see myself floatin' to the top again\nNumber one, bro it's just begun\nI got a new lease of life, now I'm standing at the front\nTold them there's a level, they said \"what level?\"\nNow they see me rolling with my peers at the top level\n\n[Chorus]\n01\nI ain't breddin' no one\n01\nWho am I? No one\n01\nI ain't breddin' no one\n01\nWho am I? No one", "image": "https://images.genius.com/7c1266e2148d44530187bf27bca21dee.600x600x1.jpg", "album": null, "title": "01"}]}