{"songs": [{"lyrics": "[Intro]\nUh, Queens man\nHere we are\n2013 and beyond\nFuck all the talking\n\n[Verse 1]\nYo, I rock the AIDS walk hat, Smoke a baseball bat\nGet paid off rap, I copped an 8 all black\nHop out Laredo's, Equipped with the potato strap\nGet turned to home fries, That's by any means to see the dough rise\nIll! This bitch's pussy smell like low tide\nNo pride, Fuck it I'll just hold my breath\nSuplex a fiend at the Sizzler\nDamn shorty got a shitter\nMe and my father hit it back to back like Griffey\nBig black girl bad fake missy\nYou could catch me in a line for my SS\nI need some red sweats and a box of reds\nI make the consommé from the lobster head\nNow a days I'm getting lots of head\nUh, 635's drop with the aqua treads\n10 stacks for a dap, 20 just to look me in the eye\nBody'll shoot you in the thigh\nFlip outta the whip, dip, I'm out\nChange it up man\n\n[Verse 2]\nWe outta here with this one\nUh, Aw man\nThis is that, that beautiful shit right here\nI choose you, you fucking ho\nYo tilt the goblet, Staring in the middle of the cockpit\nSpanish bitch displayed up in some ostrich\nQuinceañera freak dancing\nGrant Hill's laced up with the x Helly Hansen\nFoggy night hustle til' the sun up\nStumbling anonymous\nFuck around find your leg by the Gowanus Bridge\nOver do it send your penis to your mama' crib\nThat's what happens when you open your vagina lips\nOnly focus on the merges and acquisitions\nCommas on accounts, robbin' 'em like Yount\nBoy you don't want no probelums, I got the opera lungs\nAndrea Bocelli, Hit the telly, Lift my belly\nCalled off the ?\nBaby there's no mistakin' my life is etched in granite, Sophisticated palate\nSweet, sour, salty, spicy, and umami\nI'm eating oysters off of diamonds in Hawaii with 3 dykes that play ball for the Liberty\nFinished the sequel now I'm lighting up the trilogy\nLike E-Honda when he's smashing up the Lexus\nLuger arms, baby it's all about accoutrements\nQueens shit, That's how we fucking do in London, Tim Westwood\nBam Bam Bronsolinio we out here!\nUh!", "title": "Tim Westwood Freestyle", "album": null, "image": "https://images.genius.com/4c92d833aae01e64b71a556bb1cb9f0b.990x660x1.jpg", "year": null}], "artist": "Action Bronson"}