{"artist": "Percee P", "songs": [{"album": "Perseverance: The Madlib Remix", "title": "The Woman Behind Me (Remix)", "image": "https://images.genius.com/2a35a027db5569f44b2dd82039db830a.700x700x1.jpg", "lyrics": "[Sampled]\n\nKeep coming back\n\n[Woman speaking]\n\nHere it comes again\nThose powerful winds of my mind\nBlowing me toward you\nYou keep appearing time, after time, after time\n\n[Percee's wife speaking]\n\nPerce we been together a long time\nThrough the ups, and downs\nBaby I was with you since you was on the come up\nBut now you're considered a legend\nYou didn't do it by yourself, so tell 'em\n\n[Verse 1 - Percee P]\n\nBack in the days when Perce met her\nI was the first ever, kid, did I rehearse? Never\nCats were laughing like, hyenas, I seen ya when I grabbed the mic\nAnd said: \"Yes, yes y'all\", to impress y'all\nWas hard, my God, it was a mess y'all\nShe said: \"Every time you flow\nThey dissing\", I know, \"what's missing?\nSo grow, listen!\" what\n\"you wanna shine put me, in your rhymes\nSpend lots of quality time with me\"\nYou'll be fine, master my, tricks or trade\nI'll get you paid, when you perform\nWatching people swarm like it's a raise\nSpend night and day in the shack\nWith her, to get her to lay on a track\nWhen I'm done I hit the streets, I'm playing her jack\nI let her show her ass, while I hold the cash\nLike a pimp, collecting from the people strolling past\n\n[Hook - Fredda Payne sample]\n\n[Verse 2 - Percee P]\n\nWhen I grab my steel mic, and do her, she's real tight\nFeels like I get a rush and ready to bust in her grill white\nLike twats when she's quite hot, I go down town\nHit corners and pump her in the right spots\nMore smaller acts yell ho, and call her fat\nBehind my back they be feeling her and all of that\n[?]\nSince day one, I stay sprung, she kept me away from\nCats in my hood that like to spray guns, they don't play son\nFolks be trying to insult me, hope P, cut her off for another\nBut this brother don't commit adultery\nI play her cheap, but she's hard to keep, from other's reach\nOnce in her creep, in the street, I peeped her passing in some nigga's jeep\nSome times I get bitter, like when I heard this kid did her\nAnd got a deal but I'mma still stick with her\n\n[Hook - sample]\n\n[Verse 3 - Percee P]\n\nSoon as I grip it then, stick it in\nShe got me busting quicker than a virgin hitting skins like I'm committing sin\nI'm blessed to say she takes my breath away\nLike when I did her on the song [?]\nWhen they dissed you, still I stayed with you\nDevoted, got me quoted, in The Source, 92's May issue\nThe way I speak and freak you to a beat\nI'm getting deeper, others don't reach\nTo leak, they bust blanks between the sheets\nThis song I ain't write for emcees\nIt's \"Dedicated to the one I love\", like the Temprees\nJust in case, any producer's in the place\nWant a taste, to catch her ear\nI need a snare, and kick the right bass to her\nSince this man had a G, ain't another man as bad as me\nTaught me a skill, and made a real man out of me\nUntil those cuties throw their drawers to me\nI'm staying faithful to my style, smile, yours truly, Percee P!\n\n[Hook - Sample]", "year": null}]}