{"songs": [{"image": "https://images.genius.com/630278294bd2db9a5d5107ffd410cbb3.500x500x1.jpg", "album": "Generation Gaming II", "title": "Battlefield", "lyrics": "[Verse 1]\nLook at my dog tag! You'll see D. Bull\nA heavy hitter from the midlands like Led Zep have reformed\nI don't need the Marine Corps, I'm lethal\nFrom 3,000 miles off the eastern seaboard\nColder than Trebor mints, Nee Naw\nK People step away from the keyboard\nI wanna see your heads bopping see saw\nUp and down so speedy you're reeling from the G-force\nGive me a vehicle, a BMD or Super Hornet\nTroops are falling uniform superiors are fearful\nI'm really tearful\nSaline solution slides from my eyes at the same time I'm shooting\nSo maybe I just should let a Beretta do the talking\n'Cos after all, you're a dead man walking\nI walk in pull out my M1014 and end all these porkies\nAnd tall stories, with the ease of a nuclear attack\nI shout \"look behind you\" and shoot you in the back\nSuited up with flakjackets, flashbanging\nLeaving claymores in your path, need I say more?\n\n[Hook]\nThis is the Battlefield\nWhere if you lack the skill\nThen your cap'll peel back\nLike an apple peel, twat\nIn the Battlefield\nIf you lack the skill\nThen your cap'll peel\nLike an apple peel, so grab the steel\n\n[Verse 2]\nYou're a Super Soaker, I'm a SuperCobra\nSouping up my guns 'till I become a supernova\nI'll take you to the moon and over like a lunar rover\nI got a new limo and so, are you the chauffeur?\nI'm a human Yoda, no, a new Jehovah\nI do my flows with the devotion of a Jew to Kosher\nSo I shoot the charcuter and do him over\nI'll do to you've what you seen me do to SOPA\nI'll straight flush you like a full suit in poker\nAnd mutilate you leaving you like you're doing yoga\nResume control, assume the role of Henry \"Black\" Blackburn\nI'm coming for your guts like a freaking flatworm\nSoon as your back's turned, Blackburn'll blast murder fast\nI'm packing more heat than a massive thermostat\nI've got a certain knack to turn the gas and hurl a match\nSo if you'd prefer lack a burn, then stand further back\nAnd slap bureaucrats that I haven't heard the facts\nI'm rapping more original than a fricking Werther's Pack\nI mix hardcore, nerdcore commercial rap\nAnd stay on top of the beef like a burger bap\nI'm a soldier, but not the sort to traverse Iraq\nI'll come first in any match on 30 racks of server stacks\nI serve a purpose that you might find confusing\nDicing right through the digital illusion of the\n\n[Hook]\nBattlefield\nWhere if you lack the skill\nThen your cap'll peel back\nLike an apple peel, twat\nIn the Battlefield\nIf you lack the skill\nThen your cap'll peel\nLike an apple peel, so grab the steel", "year": "2012-05-28"}], "artist": "Dan Bull"}