{"songs": [{"title": "Doo Wop (That Thing)", "album": "The Miseducation of Lauryn Hill", "year": "1998-07-07", "image": "https://images.genius.com/6bf881c206187e0e36114cd7db2a751e.800x800x1.jpg", "lyrics": "[Intro]\nYo, remember back on the Bully\nWhen cats used to harmonize like\nYo, yo, my men and my women\nDon't forget about the deen\nSirat al-Mustaqeem\nYo, it's about a thing, uh, yo, yo\nIf ya feel real good wave your hands in the air\nAnd lick two shots in the atmosphere!\n(Put them up, put them up)\n(Put them up, put them up)\n(Put them up, put them up)\n\n[Verse 1]\nIt's been three weeks since you were looking for your friend\nThe one you let hit it and never called you again\n'Member when he told you he was 'bout the Benjamins?\nYou act like you ain't hear him then give him a little trim\nTo begin, how you think you're really gon' pretend\nLike you wasn't down and you called him again?\nPlus, when you give it up so easy you ain't even foolin' him\nIf you did it then, then you'd probably fuck again\nTalking out your neck, sayin' you're a Christian\nA Muslim, sleeping with the jinn\nNow that was the sin that did Jezebel in\nWho you gon' tell when the repercussions spin?\nShowing off your ass 'cause you're thinking it's a trend\nGirlfriend, let me break it down for you again\nYou know I only say it 'cause I'm truly genuine\nDon't be a hard rock when you really are a gem\nBaby girl, respect is just a minimum\nNiggas fucked up and you still defending 'em\nNow, Lauryn is only human\nDon't think I haven't been through the same predicament\nLet it sit inside your head like a million women in Philly, Penn\nIt's silly when girls sell their souls because it's in\nLook at where you be in, hair weaves like Europeans\nFake nails done by Koreans\nCome again\n\n(A win win, come again\nA win win, come again)\n\n[Hook]\nGuys you know you'd better watch out\nSome girls, some girls are only about\nThat thing, that thing, that thing\nThat thing, that thing, that thing\n\n[Verse 2]\nThe second verse is dedicated to the men\nMore concerned with his rims and his Timbs than his women\nHim and his men come in the club like hooligans\nDon't care who they offend, poppin' yang (like you got yen!)\nLet's stop pretend, the ones that pack pistols by they waist men\nCristal by the case men, still in they mother's basement\nThe pretty face men claiming that they did a bid men\nNeed to take care of they three or four kids\nAnd they face a court case when the child support late\nMoney taking and heart breaking, now you wonder why women hate men\nThe sneaky, silent men\nThe punk, domestic violence men\nQuick to shoot the semen, stop acting like boys and be men\nHow you gonna win when you ain't right within?\nHow you gonna win when you ain't right within?\nHow you gonna win when you ain't right within?\nCome again, come again\nCome again, come again\n\n[Bridge]\nWatch out, watch out\nLook out, look out\nWatch out, watch out\nLook out, look out\nWatch out, watch out\nLook out, look out\nWatch out, watch out\nLook out, look out\n\n[Hook]\nGirls, you know you'd better watch out\nSome guys, some guys are only about\nThat thing, that thing, that thing\nThat thing, that thing, that thing\nGuys, you know you'd better watch out\n'Cause girls, some girls are only about\nThat thing, that thing, that thing\nThat thing, that thing, that thing\n\n[Skit/Outro]\nClass!\nHey, we’ve got some very intelligent women here, man\nDo you think you’re too young to really love somebody?\n(No! No, no, I don’t think so)\nI say it for me, uh, I’m an adult I say, wait\n“You’re too young to be in love, this is silly\nYou’re infatuated or whatever, you got nice jeans\nYou wear fancy Adidas”, I mean, it might be something I don’t know\n(It's the difference from loving somebody and being in love with somebody)\nWell, you tell me. What’s the difference?\n(Okay, You can love anybody but when you’re in love with somebody you’re looking at it like this: You’re taking that person for what he or she is no matter what he or she look like or no matter what he or she do)\n(You’re crazy! You fall in love, you can fall out of love)\n(You might stop being in love but you are not gonna stop loving that person)\n(Maybe they ain’t never been loved before or been in love before, they don’t know what the feeling is to be loved)\n(She poetic)\nShe killed it, we could end that conversation with that, right?"}], "artist": "Lauryn Hill"}