{"songs": [{"image": "https://images.genius.com/093524f55308e0c3a99f8d6f7746a3bf.1000x1000x1.jpg", "title": "Paralyzed", "album": "Mansion", "year": "2015-03-31", "lyrics": "[Verse 1]\nWhen did I become so numb?\nWhen did I lose myself?\nAll the words that leave my tongue\nFeel like they came from someone else\n\n[Chorus]\nI'm paralyzed, where are my feelings?\nI no longer feel things, I know I should\nI'm paralyzed, where is the real me?\nI'm lost and it kills me inside, I'm paralyzed\n\n[Verse 2]\nWhen did I become so cold?\nWhen did I become ashamed? (ohh)\nWhere's the person that I know?\nThey must have left, they must have left, with all my faith\n\n[Chorus]\nI'm paralyzed, where are my feelings?\nI no longer feel things, I know I should\nI'm paralyzed, where is the real me?\nI'm lost and it kills me inside, I'm paralyzed\n\n[Bridge]\nI'm paralyzed\nI'm scared to live, but I'm scared to die\nAnd if life is pain then I buried mine\nA long time ago, but it's still alive\nAnd it's takin' over me, where am I?\nI wanna feel somethin', I'm numb inside\nBut I don't feel nothin', I wonder why\nI'm in the race of life and time passed by\nLook, I sit back and I watch it\nHands in my pockets\nWaves come crashin' over me, but I just watch 'em\nI just watch 'em\nI'm underwater but I feel like I'm on top of it\nI'm at the bottom and I don't know what the problem is\nI'm in a box, but I'm the one that locked me in\nSuffocatin' and I'm runnin' out of oxygen, ah!\n\n[Chorus]\nI'm paralyzed, where are my feelings?\nI no longer feel things, I know I should\nI'm paralyzed, where is the real me?\nI'm lost and it kills me inside, I'm paralyzed\n\n[Outro]\n(I'm just so paralyzed) I'm paralyzed\n(Yeah, I'm just so paralyzed) Where are my feelings?\nI no longer feel things (I have no feelings)\nI know I should (Oh, how come I'm not moving? Why aren't I moving?)\nI'm paralyzed (Ay, yeah)\nWhere is the real me? (Where is the real me? Where is the real me?)\nI'm lost and it kills me, (I'm paralyzed) inside (I'm paralyzed)\nI'm paralyzed (I'm paralyzed)"}], "artist": "NF"}