{"artist": "A$AP Ferg", "songs": [{"title": "Pups", "image": "https://images.genius.com/76b60a2aa94efd1c96d591477aed8840.640x640x1.jpg", "album": "Floor Seats", "lyrics": "[Intro]\nArf, arf, arf\n\n[Chorus: A$AP Ferg & A$AP Rocky]\nWhere my dawgs at? (We right here, dawg)\nWhere my dawgs at? (Right here, dawg)\nWhere my dawgs at? (We right here, dawg)\nNow where my dawgs at?\n(Frankie Mothafuckin' P)\n\n[Post-Chorus: A$AP Rocky & A$AP Ferg]\nI said get at me\nI'm talkin' to you niggas with that rap beef\nGet at me\nOstrich-skin seats like it's acne\nGet at me\nNever tacky, jeans made by Acne\nFuck Governor Pataki and Patakis\n\n[Verse 1: A$AP Ferg & A$AP Rocky]\nIt's about to get uglier than Balenciagas\nFelt bad I never finished college\nNow we fuckin' cuties with booties in Dapper Dan silk pajamas\nLivin' the dream, open up your eyelids\nMe and Flacko on a island with a few bad bitches\nHow my cousin make a mil' off a du-rag business?\nAll my dawgs with the shit, you with a few cat litters\nAll the yellow with the black like the Wu back (Su)\n\n[Verse 2: A$AP Rocky & A$AP Ferg]\nBack when I was rentin' beds, I was still catchin' head\nIf I was bussin' dishes, I'd be still fuckin' bitches\nBoof pack, gift wrapped just like Christmas\nGone for a minute, now I'm back, did you miss me?\nHad the whole Harlem World wearin' Under Armours\nUnder the armors, I'm a pretty mothafuckin' comma\nGorgeous comma, pretty much about to fuck your mama\nKinda runnin' late for this meetin' with Obama\nI ain't mean it to rhyme, but call me when your mind right\nMeet me with your romper, CC me when the vibe right\nMore money, more problem, more chopper, more drama\nAnd I got these hoes, feelin' like Mo Bamba\n\n[Chorus: A$AP Ferg & A$AP Rocky]\nWhere my dawgs at? (We right here, dawg)\nWhere my dawgs at? (We right here, dawg)\nWhere my dawgs at? (We right here, dawg)\nNow where my dawgs at? (We right here, dawg)\n\n[Verse 3: A$AP Rocky & A$AP Ferg]\nWho gon' do what? My dawgs gon' tool up\nNigga, look out, 'cause look down like one, two, fucked\nAnd we don't give two fucks\nWhere I'm from, you lunch, you food\nNiggas called your bluff\nPockets Warren Buffett, security guard too buff\nI like my songs screwed up\nI own a gold toothbrush, I get my gold tooth buffed\nI'ma stomp a nigga out in Timberland nubuck\nYoung Buck, too buck, Benz truck, new truck\nBig horns, tuba, more good than Cuba\nThey tried to hit us like Huey with the armpits up\nBut we swerved through the bullets, get your targets up\nHood Pope up in this bitch, in Trap Lord we trust\n\n[Chorus: A$AP Ferg & A$AP Rocky]\nNow where my dawgs at? (We right here, dawg)\nWhere my dawgs at? (We right here, dawg)\nWhere my dawgs at? (We right here, dawg)\nNow where my dawgs at? (We right here, dawg)\n\n[Post-Chorus: A$AP Rocky & A$AP Ferg]\nI said get at me\nI'm talkin' to you niggas with that rap beef\nGet at me\nOstrich-skin seats like it's acne\nGet at me\nNever tacky, jeans made by Acne\nFuck Governor Pataki and Patakis", "year": "2019-05-09"}]}