{"songs": [{"album": "Down With the King ", "image": "https://images.genius.com/bfc7d65a3c5f16d272808f97615ac5f6.360x360x1.jpg", "year": null, "title": "99 Problemz (But Lil’ Flip Ain’t One) Freestyle", "lyrics": "[T.I. talking]\nLive and direct from the traps of the A-town, nigga\nWest side, Bankhead, nigga\nPimp Squad Clique, nigga\nGrand Hustle, pimp\nSay I'm mad, huh?\nYour faggot ass gon' be mad in a minute (Sissy ass nigga)\n(Hey, let's go, nigga) I'mma hit your faggot ass in the mouth when I see ya, nigga\nFuck what you heard, homie, leprechaun ass nigga\n\nKing of the place called home of the bass\nHe emerged at the trap, from the zone of the flake\nCaught a case, and he still keep a chrome on his waist\nFor the haters in the face gettin' thrown in the way\nLike a pussy nigga named Lil' Wesley, tryna test me\nOn your best behavior what your faggot ass best be\nChoose words carefully when you address me\nYou ain't gotta like me, but you're gonna respect me\n(Or else) or else you get wet like a jet ski\nTake ten of these and live, that'll impress me\nSay I wanna rap on your songs but you ain't let me\nSee you on the front of The Source, like that upset me\nFuck you in the ass, I ain't mad 'bout shit\nTry Tip, shot quick, that's all your ass gon' get\nAnd I ain't finna put a mask on, Flip\nI'mma empty out the clip and your ass gon' flip\nBet your mom and your dad gon' trip\nBut them the consequences try to mash on Tip\nNigga, lyrically I'll murk you, physically I'll hurt you\nYou ain't never ran the streets, you had a curfew\nPussy nigga playing with me, you'll be in the dirt soon\nLook you in the eye see you sweet like perfume (muah)\nSo go on, keep running you dick suckers\nI'mma swing, show the world that you just a big sucker\nDaddy shoulda got some head, bet he wish he woulda worn rubber\nBut he didn't, so now I guess the world gotta suffer\nYou the kind of wanksta, gangsta's done had enough of\nSo I'mma take pride when I ride through and bust you\nTip will be the reason for the saddest day your momma seen\nWhen I let this K slay a nigga like the Drama King\n\nBetter find a nigga to try, nigga I ain't the one\nI got 99 problems, Lil Flip ain't one (ha, hey, hey)\nI got 99 problems, Lil Flip ain't one\nThis pussy nigga wanna beef well he find him some\nI got 99 problems, Lil Flip ain't one (ha, hey, hey)\nI said, I got 99 problems, Lil Flip ain't one\nFuck, boy you wanted beef, well you found you some\nI got 99 problems, Lil Flip ain't one\n\n[Lil Flip]\nScarface the king of the South\n\n[T.I.]\nPussy nigga, shut the fuck up\nI'm cool with Face and even he know that you're a sucker\nPaul Wall runnin' Texas along with Slim Thug\nMike Jones, ESG, and Z-Ro some real hustlers\nNever been a Botany Boy, you just a buster\nNever been seen outside on the Southside\nSucka nigga puttin' on like you run shit\nAfter Third go to jail with this leprechaun shit\nHalf the time you don't like what I'm saying then buck\nNigga, swing when you see me, nigga, I don't give a fuck!\nCause I know you just a lame and your partners ain't tough\nKnow your aim ain't shit and know your fight game suck\nSo I couldn't image you what G's would wanna listen to\nJust some kids, women, and a lot of homosexuals\nI'm a stand up guy man I'm into principle\nAll you do is lie, and everything you say is fictional\nI demand my respect, I'll die about that\nBut I'mma hit you with the tek, and let you lie about that\nSo keep me out your raps or this shit ain't done\n\nI got 99 Problems, Lil Flip ain't one (come on)\nI say, 99 problems, Lil Flip ain't one\nPussy nigga wanted beef well he found him some\nI got 99 probelms, Lil Flip ain't one\n\n[T.I. talking]\nLil who?\nSay fuck, nigga\nI heard you talking about me, nigga\nYou wanna see me, nigga? Come see me, nigga\nATL, Westside, Zone 1, you understand that, nigga? (Bankhead)\nMattafact, I'll come see you, nigga\nIn the suburban area of Houston, nigga, I know you can't come to the city, nigga\nFuck boy\nNigga, wasn't you a janitor in highschool?\nYou sucka ass nigga, you thought we forgot?\nNigga Hump said he made you put on the mothafucking leprechaun suit, nigga\nYou talkin' bout you got rich off that shit, nigga\nYou ain't even get no car nigga till this next album\n(You lil' bow tie wearing ass nigga)\nAnd it's leased too, nigga\nYou better not go over 20,000 miles, nigga, that's fifteen hundred extra\nYou know what I'm saying, you sucka ass nigga\n(Top hat wearing ass nigga)\nNigga, how I'm livin'? Nigga what? Nigga, nigga\nYou rented that mo'fucking house in Galveston, nigga for six thousand, nigga\nYou think I didn't know about that, don't ya, nigga?\nI'mma expose yo' pussy ass nigga\nYou ho ass nigga\nWait till I see ya, I'mma slap you in them white gold teeth you got nigga\nThat ain't no mothafucking platinum, 30 g's my ass, nigga (ha)\nNigga, you must've forgot, nigga, Paul Wall made grills, nigga, that's my mothafucking partner, nigga\n30 g's my mothafucking ass, nigga\nI'mma get a grill, nigga, just to show yo' motherfucking ass what 30 g's look like\nFuck boy (ha)\nLil Flip, man, how dare you, for real, man\nKing of the mothafucking South, nigga\nThe audacity of this ho nigga, man can you believe it?\nLil Flip, man, will you get me one of them bow tie's and one of them top hats, nigga, please, I need one\nA glitter bow ties, and one of them top hats\nI want... This halloween I wanna be the leprechaun, this halloween\nCould I please get a glitter bow tie and a top hat, please?\nAnd my very own pot of gold to squat over like a little bitch, you sucka ass sweet boy nigga\nNigga, I'll mothafucking beat yo' ass, man\nYou gon' make a nigga do somethin' to yo' little pussy ass\nKeep on talkin', nigga\nI'm done with you for now, nigga, I'll be back, though\nI'm done with you for the moment\nHa (gunshot)\n\n[Lil Flip]\nAnd I'll adore you, I'll treat you like milk\nI'll do nothing but spoil you"}], "artist": "T.I."}