{"songs": [{"year": "2012-02-21", "image": "https://images.genius.com/356f10af62b8119c07edb8d71580c5d3.320x320x1.jpg", "title": "Dream II", "album": "Pineapple Now-Laters", "lyrics": "[Will Smith]\n\"I've never really viewed myself as particularly talented. Where I excel is ridiculous, sickening work ethic, you know? While the other guy's sleepin', I'm workin'. While the other guy's eatin', I'm workin'. I have a great time with my life and I wanna share it.\"\n\nMost people wake up if you ever turn the (lights on)\nCause it mess's up their dreams, they get mad like a (python)\nJust like you, I'm tryna live my life (right)\nAnd in the fight of life turn on the (lights)\nAnd if you do that, then you'll be fine\nCause I remember dreaming, dreaming as a kid of me getting older\nAnd exactly what I'mma do\nI had to get ready cause I didn't know what time or place\nTo make my dreams come true\n\nThen later onnnnnn...\n\nI learned that you can't talk to losers bout winning\nIt ain't their language, they ain't never gonna get it\n& Anything I can think of, I can make it come true\nJust look @ me now I'm on DREAM II\n\nMy nigga Rico Love said turn the lights on\nCause you can see the truth a whole lot better with the lights on\nDon't be afraid to turn the lights on\nI've learned to dream with the lights on\n\n[Will Smith]\n\"I want my life, I want my work, I want my family to mean something. If you are not making someone else's life better, then you're wasting your time.\"\n\"The first step before anyone else in the world believes it is you have to believe it. There's no reason to have a Plan B because it distracts from Plan A.\"\n\nYou just gotta find\nJust let your ?\nSo I'll take it from here\n\nAnd I've learned you can't tell everybody your plans\nCause sometime your dreams are bigger than them\nYou just gotta find your own place to grow\n& just let your actions show them\n\nSo take it from me\n\nI learned that you can't talk to losers bout winning\nIt ain't their language, they ain't never gonna get it\n& Anything I can think of, I can make it come true\nJust look @ me now I'm on DREAM II\n\nMy nigga Rico love say turn the light on\nCause you can see the truth a whole lot better with the lights on\nDon't be afraid to turn the lights on\nI've learned to dream with the lights on\n\n[Will Smith]\n\"Greatness, is not this wonderful, esoteric, illusive, god-like feature that only the special among us will ever taste\nYou know? It's something that truly exists, in, all of us. It's very simple, this is what I believe, and, I'm willing to die for it. Period. It's that simple\"\n\"I know who I am, I know what I believe, and that's all I need to know.\""}], "artist": "BJ the Chicago Kid"}