{"artist": "Professor Green", "songs": [{"album": "Alive Till I’m Dead", "title": "Do For You", "image": "https://images.genius.com/03dd13269b9289e452bde3eb7d1a6577.1000x1000x1.jpg", "lyrics": "[Verse 1: Professor Green]\nThere ain't much that I ain't been through\nI used to sell drugs for a living\nAnd even though I changed my career\nI'm still stuck where I'm living\nCertain man are livid, don't wanna see the progression\nSee the professor and wanna teach him a lesson\nThey wanna strip me, their girls wanna see me naked\nI flow hot but they don't wanna see me make it\nIt gets deep on these cold streets\nI always gotta worry bout my old beef\nSame way I still dance through the bits\nJeans still sagging with a half of the piff\n\n[Pre-Chorus: Professor Green]\nYou wanna see me down\nIf only you could see me now\nToe to toe, let's go, I've got no fears\nJust know that I'll be here when the smoke clears\n\n[Chorus: Sunny]\nWhat can you do to me that I can't do to you?\nWhat do you want me to do for you?\nWhat can you do to me that I can't do to you?\nWhat do you want me to do for you?\n\n[Verse 2: Professor Green]\nI am completely confused\nAnd somewhat amused by the fact\nThat you think anything you could do\nOr have done to me, I couldn't do back\nEye for an eye, shot for shot\nYou might have, but I've not forgotten where I am from fam\nSo don't bred it if you're not fam\nShould probably call you woman cause you're not man\nCertain man are telling too much lies\nTook a shank cause I got too much pride\nRather that than kick though, it was a bit close\nLucky me, I'm still alive to get dough though\n\n[Pre-Chorus]\n\n[Chorus]\n\n[Bridge: Sunny]\nI, I see\nA look in your eyes I've seen before, telling me love don't live no more\nAnd you know I see\nThere's a thin line between love and hate and once you cross it, it's too late to come back\n\n[Verse 3: Professor Green]\nFew people'd tell you that I ain't shit\nStill mistaking their jealousy for hatred\nI wonder if it would've changed\nIf it wasn't for the game, either way I wouldn't change shit\nMight give a little, but I take none\nI am the difference, I ain't trying to make one\nSuck out, you think I give a fuck bout\nWhen any of these pricks run their mouth?\nYour speech long, say what you like\nBut take it as a fuck you when I don't respond\nSo passed, I'm beyond, lickle man be gone\nBefore you're playing havoc with my ambience\n\n[Pre-Chorus]\n\n[Chorus x2]", "year": "2010-07-16"}]}