{"artist": "Ice-T", "songs": [{"title": "Home Invasion", "lyrics": "Artist: Ice-T\nAlbum: Home Invasion\nSong: Home Invasion\n\nAll right! When we go up in this goddamn house\nAll I want is the motherfuckin' kids!\nAs far as pops I don't give a fuck what you do...\nBust him in his motherfuckin' head!\nIf he got any money, take it!\nIf there is money there, rob the motherfuckin' joint!\nAs far as moms bust her in her goddamn head!\nDumb bitch, that's the reason we're going up in there!\nShe don't know what the fuck she's talkin' about!\n\nEveryone get back, this is a rap jack\nI'm takin' your kids' brains, you ain't gettin'em back\nWith a move of perfection, my dissection\nSome call it lethal injection\nI'm gonna fill'em with hard drums\nBig drums, bitches, hoes and death, come on and get some\nI'm not the nigga that you want to leave your kids alone with\nCause I got my own opening-dome kit\nAnd once again I'm gonna put them under my fuckin' spell\nThey might start givin' you fuckin' hell\nStart changin' the way they walk\nThey talk, they act, now, whose fuckin' fault is that?\nThe home invader...\n\nYo, moms you can basically just suck my dick!\nThis is a home invasion...\nYo, pops that shit you talkin' is noise! Word! You full of shit!\n\nCheck this out, moms, I said time bomb\nAnd they sit in your house and remain calm\nTill you feed'em lies and the flip\nStart talkin' crazy shit (Fuck you!)\nMight call you and pops a fool\nTell ya that's why they hate school\nBeen offensive and askin' questions\nGive your brain indigestion\nWhy? Why? Because I have indoctrinated the youth\nYhey're mentally intoxicated with truth\nSo they know the noise you talk are lies\nPretty damn soon they'll be by (I'm outta here)\nThey listen to me and I give'em the real\nAnd every night caps get peeled\nAnd every night a ho gets smacked\nA fool gets jacked\nNow, whose fuckin' fault was that?\nThe home invaders...\n\nYo! Yo! Yo!\nAll that shit you taught me, mom, was full of shit!\nKnow what I'm sayin'?\nHow the fuck you gonna tell me to run my motherfuckin' life?\nBitch! You dont even know who the fuck you are!\nYou talkin' about you don't like rap, you don't like how I dress!\nYo! Fuck you and pops! I'm outta here!\nBoth of y'all can kiss my ass...\n\nAll cops want me, so does the F.B.I\nBecause my rhymes are fly\nThey still tryin' to stop me, shut me down, block me\nMake motherfuckas boycott me\nBut that will never happen, it's impossible\nI move straight through all obstacles\nThey say I'm fuckin' up the minds of little kids\nBut half of my fans are in college\nP.M.R.C. suck my dick, please\nYou can kiss my ass while you're on your knees\nWord! You're listening to the verbal assassinator\nE's the crossfader, your factual updater\nUntil your cranium grows like uranium\nHard as titanium, parents, I'm blamin'em\nFor teachin' you lies about life, racist viewpoints\nAnd other trite bullshit they learned back in the day\nWhile I learned about death from an A.K\nBut they'll never quite understand\nBam, bam, bam, no gat is the Walkman\nBoom, bash, yeah, yo, it's goin' down\nMe and Ice Cube are in town\nBut the fuckin' pigs cancelled the concert\nThey're just scared of some niggers that do work\nWhat they do? What did I do?\nJust say truth motherfucka and it's comin' through\nI tell you what we did: we stole your fuckin' kids\nThe home invader...\n\nAll right! we got the motherfuckin' kids!\nWe outta here! C'mon...", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}