{"songs": [{"year": "2016-12-09", "image": "https://images.genius.com/56dcd774941c815f709198d835639fd7.960x960x1.jpg", "title": "Bonnie und Clyde 2016", "album": "Hoodtape Volume 2", "lyrics": "Kollegah (Clyde): \"Okay Baby, los gehts!\"\nBonnie: \"Okay\"\n\n[Verse]\nAh, Sie macht sich die Nägel mit den Füßen auf der Armatur\nDer Motor qualmt, ich fahr' runter von der Fahrbahnspur\nSie macht die Motorhaube auf\nEin Wagen hält neben ihr\n\"Gut dass Sie da sind, Mister! Ich kenn' mich mit sowas doch nicht aus!\"\nSie macht sich an ihn ran\nAus dem Gebüsch nebenan, spring ich rüber, zieh' ihm eins über mit dem Griff von der Gun\nGeschickt nimmt Sie dann Ihre Nylonstrümpfe\nUnd wickelt ihn um 'nen Laternenpfahl\nEr weint und blickt sich um\nIst verzweifelt, winselt rum\nAber Sie stopft ihm dann, damit sein Geschrei endlich verstummt, ihren Seidenslip in' Mund\nIch öffne den Kofferraum\nHol Geld und Shotgun raus und pack' es auf die Ladefläche seines Dodge-Trucks drauf\nLeere 'nen Benzinkanister auf unsrer' alten Karre aus\nSie schnippt 'n Streichholz und der Wagen geht in Flammen auf\nIch lass den Truck aufheulen\nWir fahrn' vorbei an Laubbäumen und sehn' im Rückspiegel die kleiner werdende Rauchsäule\n\n[Hook]\nWir ham' was wir brauchen\nPistolen, Cash und Dope!\nUnsre' Fahndungsfotos hängen an der Motelrezeption\nWir beide sind im Rausch\nSie zündet sich 'ne Kippe an\nDie Beine streckt Sie aus dem Seitenfenster raus\nKeiner hält uns auf, wir sind frei oder tot\nWir feuern Bleipatronen auf die Highway-Patrol\nUnd die Sonne, sie scheint\nDie Story geht weiter, yeah 2016, Bonnie und Clyde!\n\n\nBonnie: \"Endlich zu Hause!\"\nKollegah (Clyde): \"So, da simmer' wieder zu Hause.\"\nBonnie: \"Hurra!\"\nKollegah (Clyde): \"Eeehm, pass auf Schatz! Bring du doch schonmal den ganzen Scheiß da ins Haus!\"\nBonnie: \"Eh, eh, okay?\"\nKollegah (Clyde): \"Genau\"\nBonnie: \"Eh, warum?\"\nKollegah (Clyde): \"Ja, ich muss nomma' los!\"\nBonnie: \"Du willst doch nicht schon wieder zu dem Dicken, oder?\"\nKollegah (Clyde): \"Ja, ich hab, ey guck ma', ich hab dem gesagt: 'Nimm' ab Junge! Mit deinem scheiß Warsteinerbauch. Mir reichts jetzt!'\"\nBonnie: \"Boah Schatz, scheiß doch auf den!\"\nKollegah (Clyde): \"Doch. Ne, is' mir scheiß egal!\"\nBonnie: \"Schahatz, Schaaatz, du musst sowieso noch zum Sport erstmal!\"\nKollegah (Clyde): \"Bwoaah, weiß ich..weiß ich nicht.\"\nBonnie: \"Herr Blume!\"\nKollegah (Clyde): \"Jaaaaaaaaaaaaa\"\nBonnie: \"Du hast um 17 Uhr MMA!\"\nKollegah (Clyde): \"Ja stimmt. Ja fuck. Ja gut, dann geh ich dahin und danach is' er aber dran der Dicke, das sag ich dir! Is' mir scheiß egal\""}], "artist": "Kollegah"}