{"songs": [{"year": null, "title": "I Know This Game", "image": "https://images.genius.com/ee6deec2a6b188f48e17b9ef35762adc.350x350x1.jpg", "lyrics": "[intro]\n… it forced a lot of dudes I’ve seen that used to work at the record labels is out here grinding now, and its hard for them! Because they don’t really understand how to do it! You know, they be like, “damn yo, the labels closed down, like I’m really supposed to do this …\n\n\nYeah... I know this game!\nI know this one right here\nIf anything i know this\nAfter these years\nCheck it out\n\n[Verse 1]\nI know the game from the inside\nFirst person, actual facts\nI got actual plaques\nSee the disappearance now of the wack\nSome fell through the cracks\nThe labor of love, broke their backs\nSome work ethics was lax\nCouldn’t afford the hot tracks\nSome bubbled and they blew through they stacks\nSome took it to the streets with the jacks\nWound up in Clinton Max\nSome fell ‘cause they didn’t pay tax\nMake songs that were glossy as shellac\nTook a e-pill & wacked\nThe God he is sharp as a tack\nFrom the days of backpacks\nWhite people and black\nOutlasted a lot of acts\nFrom New York to North Cacs\nYou stealing from Saks\nReeling from attacks\nNothing about you attracts\nGot a suit but old slacks\n\n[Verse 2]\nPromoters send half and a plane ticket\nTo get to their city and they want you to kick it\nI’m asking, “Is everything alright?”\n“We gon be good tonight?”\nIf they say they need to holla\nThey done fucked up the dolla\nThe venue, the menu, problems at the door\nBlame it on the law\nThey did this before\nFifty dollar tickets in a twenty dollar space\nIn a hotel room they pleading their case\n“This ain’t never happened!”\n“We did shows with rapping!”\nTwo or three promoters, who’s the fucking captain?\n“Yo I’ll take care of y’all”\n“I swear in a week”\n“You want some more Henny?”\n“You want that freak?”\nNah motherfucker, I want all my bread\nI’ll take another drink, but I’m good on the head\nAnd let me hold a watch and a chain instead\nI got bills, you trying to keep me in the red!\n\n[Verse 3]\nA label?\nYou do better working for cable\nLabels is dead and the grind is instead\nI know some A&R’s who now wash cars\nThey was signing rap stars when they was in power\nSony fired everybody, everybody’s sour\nNow rap moguls gotta blend with the locals\nWhat was that fly shit you said about my vocals?\nA former label head lives right on my block\n“You still rock with hip hop?”\n“Nah straight rock!”\nNo label is able to stop me\nPush they head right down where my cock be\nThe independent grind is mine and that’s fine\nRemember saying label was a hell of a line\nNow they left behind like the dinosaurs\nThey shitted on niggas\nFirst week sales and first week figures\nIt didn’t add up, they was pullin them triggers\n“Yo this shit looks like it’s gonna brick”\n“Let’s pull out this shit now and save ours”\n\n[outro]\nAs you get older man, you see man, like, it ain't gonna pay man, just do the show, get the dough, and go\nThat be the motto…", "album": null}], "artist": "Sadat X"}