{"artist": "Apathy", "songs": [{"title": "1:52 A.M.", "image": "https://images.genius.com/073ac226410c8abcffb60094f9a7e61b.700x700x1.jpg", "album": "Honkey Kong", "lyrics": "[Verse 1]\nIt's 1:52 AM, looking at my watch\nStaring at her house from this vacant parking lot\nIt's right across the street and the street light's blinking\nI'm sinking deeper into all this crazy shit I'm thinking\nLike I never want another man to touch her like I touched her\n'Cause I'll find the motherfucker and I'll make 'em both suffer\nMaybe suffocate him, fuck I hate him, feels like they mocking me\nI'll shoot her, take her purse, and make it look like a robbery\nOh shit! A car passes by slow\nBut I ducked, did they see me? Fuck, I really don't know\nI jump out, close the car door, jog up to her house\nLoaded .38, duct tape for her mouth\n\n[Verse 2]\nIt's 1:52 AM and I'm staring at my clock\nDid I lock my front door? I better double check the lock\n'Cause this crazy motherfucker doesn't understand no\nShowing up, blowing up my phone, calling me a ho\nI'm looking out my window, the street lights are flickering\nIt's creeping me the fuck out, I swear I keep listening\nFor any little sound, God I wish I could sleep\nHe got it twisted over something that was never that deep\nI text message who I'm dating, said my ex got me paranoid\nJumping and investigating every time I hear a noise\nLOL, hope I make it through the night\nCome and see me if you're up, make sure I'm alright\n\n[Verse 3]\nIt's 1:52 AM and I just got a text\nFrom my girl all upset 'cause of her psycho ex\nWhen I pull up to the house and notice the broken glass\nI open up the front door and see this bright flash\nHeard a loud blast, holy fuck I'm shot!\nLooked down, see my stomach leaking and my body drops\nGirl starts screaming, didn't know it was me\nShe had a gun her father gave her in case of emergencies\nThis other dude never even made it in\nHe broke the glass and she thought I was him\nI'm passing out, can't believe I'm shot\nI see this car pulling out the parking lot\n\n[Samples from The Pharcyde's 'Passin' Me By']\n\"I'm shooting for her heart, got my finger on the trigger\"\n\"Finger on the trigger\"\n\"Hope she gets the picture\"\n\"I'm shooting for her heart, got my finger\"\n\"I'm shooting for her heart, got my finger on the trigger\"\n\"Finger on the trigger\"\n\"Hope she gets the picture\"\n\"I'm shooting for her heart, got my finger on the trigger\"", "year": null}]}