{"songs": [{"image": "https://images.genius.com/e8f9be6df36a6370218e9971d5cb2867.640x640x1.jpg", "title": "I’m Not You", "album": "Lord Willin’", "year": "2002-08-20", "lyrics": "[Intro: Pusha T]\nNo, no, no!\nI told you!\nI ain't up here just rappin' and tappin'\nSpittin' and skittin' and shit\nNaw, uh-uh\nNot me\nI'm not you, I'm not you, rapper\nI'm not you\nPusha\n\n[Verse 1: Pusha T]\nI keep that ziploc bustin at the stitches\nCulinary chemist, I serve the malicious\nTo break the fiends fixes, one give you the sniffles\nThe other leave you with the itches\nTransport airport with the vaseline, so I can\nFulfill my dreams of pastures that's green\nMore cash then ya seen, with an Aston that's green\nMe driving up fast with the lean\nZonin' family, keep youngins in them rented Camrys\nDoor panels full of shit and I ain't full of shit\nReckless ass, God forbid they don't crash\nFrom the panel to the dash, it's four pounds of slab\nNah, bitch, we don't believe in air bags\nCars turn tricks like them Ringling Brothers skits\nWhether bitch hop out, or the Glock pop out\nYa know what I'm about, blow to ya sinus 'til the snot drop out\n\n[Verse 2: Jadakiss]\nWhoever said birds fly south for the winter's a damn lie\nGot em right here, and if I don't like you the grams hide\nTake it or leave it, soon as a fiend taste it they need it\nMake 'em smoke it right in front of you to make you believe it\nProlly think I won't murder you the way I smile\nBut I'ma take a lot of shots, A.I. style\nAndJada, the name is filthy, but so what?\nThe motherfuckin game is filthy, you know what?\nMy mom and my pops really did a good job\nBut it was the manteca, and the 'caine that built me so I\nCould never hate on another brother\nGod is great, the devil is a motherfucker\nWhen you broke but they think you got money\nCrackers start showin you love, your own people act funny\nI tear niggas heads off, I don't discriminate\nWaves, cornrows, or dreads, I will eliminate\n\n[Verse 3: Roscoe P. Coldchain]\nI'm far from a noodle nigga, I stab up block reps\nAnd turn quiet streets into hot sets\nNigga that's funny, you say you a killa how?\nWhat is it, the return of the killer clown?\nAkhi, you put no fear in my heart\nI make ya people say wow that didn't look like my man\nThey flipped upside down, the coroner did what he can\nHe got hit with ten rounds, at point blank, and point blank\nColdchain left that nigga stankin\nHalf static and face I got the wrinkling, slugs all in it\nI had my eyes on his mink and I didn't give em a chance to blink\nWhen I jogged up on em, pressed the forty up on him shocked 'em\nMade his head stand on end and like a baby, I rocked 'em\nThe Coffin the cradle, you can't bite the hand that made you\nThat's the beginning of the end, and you a thug that pretends\nCall Coldchain \"Super-Nigga,\" I got X-Ray vision I see through men\nAnd squeeze triggers with bullets that go through men\n\n[Verse 4: Styles P]\nFuck with S.P., that's ya date with death\nGot bullets that'll break ya chest, No sleep\nLike I hate to rest, I'm in the hood like its my fate to rep\nI hold it down, any place I step\nAnd I love getting slept on, 'cause I'm rawer than dope\nFresh out of Africa that never been stepped on\nDog, I'ma clap at you the minute that you rep wrong\nHoliday, the Ghost the main reason why your set gone\nWhy I love riffing 'em poor, you wouldn't understand\n'Cause my God is different than yours\nIf the world spin in a circle, I want to learn to move backwards\nKill niggas the first minute they jerk you\nWhat you keep the toaster for, creeping through the hood and\nShit ain't really good, but I'm deeper than the ocean floor\nHigher than a plane and meaner than a bull\nI want ya insides out so I mean it when I pull\n\n[Verse 5: Malice]\nRappers is talking to me as if (come on)\nWe in the same boat I tell them quick, no, I move Coke! (uh-uh)\nAnd you and I don't share no common bond\nSo forgive me if I don't receive you with open arms (No)\nIt shames me to no end\nTo feed poison to those who could very well be my kin (uh-huh)\nBut where there's demand, someone will supply\nSo I feed them their needs, at the same time, cry\nYes, it pains me to see them need this\nAll of them lost souls, and I'm their Jesus\nDeepest regret and sympathy to the streets\nI see them pay for they fix when they kids couldn't eat (so sorry)\nAnd with this in mind, I still didn't quit\nAnd that's how I know that I ain't shit (I ain't shit)\nMy heart bleed but that's aside from the fact\nI live for my kids and theirs and them youngins after that"}], "artist": "Clipse"}