{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/0fc160efa6b9e963313301478ef55789.1000x1000x1.jpg", "title": "Honey Bun", "year": "2014-12-30", "album": "Heart Of The Projects", "lyrics": "[Hook]\nShe Sweeter Then A Honey Bun, Ima Call Her Honey Bun\nI Been Looking For You, Baby Where You From\nI Been Searching For You, Where You Been? Girl Where The Hell You Been\nDon't Make Me Be Your Man, Cause Man I Catch Feelings It Be Slipping Right Up Out My Hands\n\n[Verse 1]\nGirl I Don't Want To Wife You, But If You Want Me To That's What I Might Do\nI Been Looking For Anyone Just Like You, You My Type Boo Damn I Think I Like You ( I Do )\nYou From Another Universe, You Not From Planet Earth, Cause I Been Single and Mingling and Still Ain't Find Nobody Similar\nMan, Where She At Cause I'm Missing Her, I Hit It But I Ain't Quitting Her\nMy Ex Hating On The Low She Trying To Get To Her, I Made A Wish For Her.. Is It Her? Cause I'm Sipping Syrup And My Vision Blurred\n\n[Hook]\nShe Sweeter Then A Honey Bun, Ima Call Her Honey Bun\nI Been Looking For You, Baby Where You From\nI Been Searching For You, Where You Been? Girl Where The Hell You Been\nDon't Make Me Be Your Man, Cause Man I Catch Feelings It Be Slipping Right Up Out My Hands\n\n[Verse 2]\nShe Popping Like Some Bubble Gum, Call Her Winter Fresh\nIm A Dead Man Walking I'm Fresh To Death\nWe Body To Body I Be All Down Her Neck, Running Up A Check She Call Me Haitian Fresh\nI Fall Up The Steps, Call It Blues Clues Cause I Was Trying To Find You But I Didn't Have A Clue\nJaguar XF When I Ride Through, Searching Through My GPS So I Can Find You\nWhere The Hell You Been You A GODDESS, I'm A Project Baby I'm Just Being Honest\nFlow Sick So Sick, Make You Vomit, I Can't Catch No Feelings Baby Ima Drop It\n\n[Hook]\nShe Sweeter Then A Honey Bun, Ima Call Her Honey Bun\nI Been Looking For You, Baby Where You From\nI Been Searching For You, Where You Been? Girl Where The Hell You Been\nDon't Make Me Be Your Man, Cause Man I Catch Feelings It Be Slipping Right Up Out My Hands"}]}