{"artist": "Ice Cube", "songs": [{"title": "Bend A Corner Wit Me", "lyrics": "[Chorus 1 2x: Ice Cube]\nI see you, Over there, Lookin like somethin wrong\nCause I'm over here, Sittin on some chrome\nShotgun to the dome\nBend a corner wit me\n\n[Verse 1: Ice Cube]\nWhen shit get boring, I jump in some foreign\nExplorin through my neighborhood, All to the good\nAin't the finest order riches\nStill got ordinary bitches to jehovah's witness\nTryin to get wit this\nKnow I got the green thumb, Hustler you never seen one\nExtreme fun, Wit this mean one\nBut you'll never get none fuckin wit them broke hoes\nPinnochios, Fuck around and get a broke nose\nThat's ya fate when we congregate\nIt's the great writer, Exponium big spider\nTighter than virgin cocks, At the mall like dispurge a lot\nLike these niggas servin rocks\nBut I'm servin rhymes, Two cds at a time\nLike it's weight, Ice cube the great\n\n[Chorus 2: Mr. Short Khop]\nBend a corner wit me, We can ride to the store\nDo it like friends do, What I'm into?\nEverything on the menu, Wit extras on it\nCmon baby and jump up on it\n\nChorus 1\n\n[Verse 2: Ice Cube]\nThis one is strictly, For niggas rollin 750s\nAnd it's polished from the 60s\nBumpin that cube shit, Do shit, I bet the wheels fall off\nBefore the skills fall off\nThrow up the dub, Got more cocks to rub\nAnd if you don't, I done got this far without yo love\nHoes want the nigga in the t-shirt and rolex\nAnd y'all still get the .9 up out the kotex\nGot the o.z., And the x.o\nBroads get fatal, And don't wanna let go\nIncredible, Nigga who you rap like?\nCome out the movie, Who you act like?\nIt's the don, Still rappin 2000 and beyond\nTryin to come up on another million\n\nChorus 2\nChorus 1\n\n[Verse 3: Mr. Short Khop]\nFrom the gate, Khop want the whole plate\nWant my drink and eat the whole cake\nAnd won't wait until another nigga say go\nI lay low wit the tweed and the yayo\nAnd play po, And stop niggas knackin\nStill keep the set crackin\nAll about the cheese and how it's stackin\nAnd plus, It's mo cheddar down the line\nAin't no better time for me and a gang of niggas on the grind\nTryin to get the income, And then some\nStash a little bit and spin some\nKeep it poppin till the end come\nCan't stop it, Then shawties wanna grip\n24/7, Money got a nigga whipped\nChip after chip, But if I slip\nHave the homie send me o.t. and work the flip\nCause the world is payola\nSilk the spot and left connect on ya wall in a black crayola\n\nChorus 2\n\n[Mr. Short Khop]\nCmon baby and jump up on it\n\n[Ice Cube]\nCmon baby and jump up on it\n\n[Mr. Short Khop]\nCmon bitch and jump up on it\n\n[Ice Cube]\nCmon bitch and jump up on it", "image": "https://images.genius.com/60e90004532c6fe18acbb79643391367.500x500x1.jpg", "album": "Featuring... Ice Cube ", "year": "1993-12-16"}]}