{"artist": "Andy Mineo", "songs": [{"title": "Uptown (Dj Official Remix)", "album": null, "year": "2015-11-07", "image": "https://images.rapgenius.com/56bcd5377444b7548a2faf0513d9778e.500x500x1.jpg", "lyrics": "[Intro]\nNew York to the heart\nWe got love for all\nUptown baby, Uptown baby\nWe get down baby\nFor the crowd baby\n\n[Verse 1: Andy Mineo]\nWe in love with the invention, we don't love the inventor\nOn a quiet block, they puff the loud, it be smellin' like it's Denver\nAnd they hit you with the fake smile, I ain't talkin' dentures\nStarbucks on the corner, pushin' bucks for that rent up\nDippin' in all black like I'm venom\nKeep it G, I'm not a star, but I'm raw like this denim\nThem dope boys push the big body, Jerome Bettis\nI got Santería hexes from my exes, but I'm protected\nYou heard that man got shot for his necklace?\nThat's a 1-8-7 up on 1-8-7\nYou know that uptown lifestyle reckless when they eatin' mangú and fried cheese for your breakfast\nBaby, how you gon' complete your life checklist spendin' every night watchin' Netflix?\nTime is so precious, gotta invest it where you spend it\nIf we prisoners to comfort, we judge our own sentence\nI be uptown\n\n[Hook]\nNew York New York\nI was born in the New York City\nThis is the way we walk in New York\nWelcome to Washington Heights\nThe neighborhood where its full of working people\n\n\n[Verse 2: Andy Mineo]\nI wake up in that mornin', gettin' that café con leche\nDoña, hold that azucar, my stomach been showin' lately\nPlus the crossover crazy, don't get caught out here sleepin'\nThat's why they call me Allen Irishman when I ball at Cabrini\nI'm throwin' swishes\nThis right here that new school vintage\nI been spendin' money tryin' not to spend up all these minutes\nAnd I ain't been present, man, look at what my gift is\nSome push the white cause they ain't have the privilege\nLet's get it!\nAin't no other city like the one I'm in\nI got that Bustelo in my cup again\nJim Carrey with this here, I'm goin' dumb again\nMe, myself and I, the only thing I'm up against\nNew York stayin' lit, rent high, payin' it\nLa Marina by the water, date night favorite\nMy bodega on the corner, I ain't even sayin' it\nThey already know my order, they just started makin' it, woah!"}]}