{"artist": "Yukmouth", "songs": [{"album": "Thugged Out: The Albulation", "image": "https://images.genius.com/6dcb01d30774cfc257eef87de8bad453.500x500x1.jpg", "year": null, "lyrics": "[Intro]\nThe motherfucking saga continues\n\n[Eazy-E:]\nIt's the world's biggest dick\nDon't matter just don't bite it\nIt's the world's biggest dick\nDon't matter just don't bite it\nBut does she suck a good dick?\nDon't matter just don't bite it\nShe swallowed it...\n\n[Skit: Erotic Conversation]\nAwww shit, I want to come, turn... turn around\nI want you to sit on it, sit on it...\nGODDAMN! - I said ride my dick not bend my dick, SHIT!\n\n[Narrator 1: Husband]\nDoes your bitch know how to ride your dick?\nWould you consider your bitch to be a stallion?\nWell, my bitch didn't, so I went out and bought the newest Smoke-A-Lot booklet\nThe Art of Riding Dick!\n\n[Narrator 2: Wife]\nLesson 3 first you straddle the rock hard dick\nGetting ready for positioning\nNow, it's time to shift gears; face down, ass up\nAs he begins rocking in, out of your wet pussy\nPushing back harder, urging him to fuck your harder\nAnd before you know it: SPLASH!\n\n[Verse 1: Tech N9ne]\nKick it slow, is the tempo, and Tech is gonna flow\nAs I engaged I wrote this page to let you know\nHow the nigga be runnin' the game on these dames like ahh...\nNigga, with the money and women and the...\nAll with the motherfuckin' dick better...\nGreetings, better ???\nSeriously speakin, for the 99 I'm reachin'\nSeeking, got the number and now I'm wonderin' if she bogus\nNow my focus, just to pop her just like Orville Reddenbacher\nCheck it out, she was a thick ass young up in Timberland\nHooked up with her Thursday night, the bitch acts strange\nWore her sweat suits, so she can hide that good\nI'm tryin' to get it up in that hog, like Tiger Wood\nSoccer shit, I listen to an every problem down my dick\nIt's hope, she stick in the bop in time to hit\nI put her close and told her I'll be there\nShe got a man, I got a woman, but now I'm playin' with the coochie hair\nNow it's on, now it's on, fuck the phone\nCause when I'm hittin' the stresses are all gone\nNow, she's begging me to knock her pussy dead\nI already got my plan, just cause I'm a take her to the bed\nThen I'm a give her a show here, then I'm a run that ass down like a procaire\nNow, she is askin' about multiple dicks\nShit, I'm on some more Manson manipulative shit\nYou're best be friend...\n\n[Hook:]\nLate night, when you're rollin' in the streets\nCreepin', call on me alone\nStallion, baby, I'm need of your love\nCreep with me, cause you know, you're my good friend\n\n[Verse 2: Yukmouth]\nAiy, aiy, aiy, once I was kickin' it at the drive-in\nLeft the car full of motherfuckers drove-in\nYo, at first I thought they was going to start some trouble\nBut no, four niggas smoking weed inside a brand new Tex' Bauble\nNow, what you niggas think? - they got me chronic and that's slogan\nAll I see is niggas chokin'gand that fuckin' window smoking\nAnd I'm over here having a fit, cause this bitch that I'm with\nGot me smoking on that Bama of weed shit, I'm like damn!\nThey need to walk over to the GS\nTo purchase up sack of chronic instead of fuckin' with this 3S\nSo I told that bitch, that I'm with\nThat I'm goin' to get some more cigars\nThen got the fuck out the car\nWent to the next corner, looked through the window\nIt seemed they're smokin' Indo with some bitches I knew\nThey let me in y'all, and my turn was like next\nI snatched their Moét and guzzled their shit, like overtry from the Sess\nHere it go ahead, hit it, hit it\nPassed me the weed, she snatched my dick up out my drawers\nThen gave a nigga some Head-To-Toe with it\nI didn't cum for that shit that she does\nThen break her scrikkie scratch nikkie, cause she shiest out\nPinky bitch sciddie caver\nSpigotty splash goes the cum, as I bust nut\nBust nut, all in her face, suck a blunt up then raised the fuck up\nBack to the car pretend I never sinned\nYou can be my stallion and play girl I'll be your friend\nYou're best be friend...\n\n[Hook]\n\n[Verse 3: MC Ren]\n90 percent of these bitches still want to nut\nOne and two, what the fuck would you niggas do if that shit was you?\nBitches be all in a nigga grill, want to sneak to taste\nWant the niggas to nut all up in their face, I fuck these whores any place\nThe villain don't be havin' to fuck them when I let them see it\nWhen I open they shit and start gabblin, so be it\nI get loony, I make they mouths all yucky\nIf she wanna love me long time when the suckie suckie\nWith the attitude, this is part three\nPart four be the shit when your bitch look for me\nUgh, Villain be watchin' these whores jumpin' like crickets\nTryin' to find a nigga hotel so their ass can lick it\nThis is for my nigga E, this is how the shit supposed to be\nTalkin' about these stanky hoes constantly\nBut the Villain keep the nigga shit goin'\nLong as my motherfuckin' dick keep growin'\nUgh, Ren and Yuk, really don't give a fuck, with that nigga Tech N9ne\nHe'll freeze up your spine, tryin' to fuck with mine\nUgh, all my niggas shit\nCause this bitch sucked that hellified dick\nShakin' that ass like the soul shaker\nNow, she is dancin' on the floor with a skirt no panties on\nI saw her hangin' in the alley\nBragging to her friends how she whoring in the valley\n\n[Hook]\n\n[Narrator 3: Wife]\nThere you have it, a job well done\nYeah, awww shit, (Moaning)\n\n[Outro: Erotic Conversation]\nTake it, take it, take it to the Tech N9ne and take it back on\nThen I want you to Yukmouth and take\nAnd take MC Ren and take\nTo join the whole fuckin' basehead\nYeah, yeah, give me, give me...", "title": "Stallion"}]}