{"artist": "Bhad Bhabie", "songs": [{"lyrics": "[Intro]\nD.A. got that dope!\n\n[Chorus: Bhad Bhabie]\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes ’cause they messy (Messy)\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes 'cause they messy\nGo bestie, that my muhfuckin’ best friend\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend\nThat my what? That my muhfuckin' best friend\n\n[Verse 1: Bhad Bhabie]\nGo best friend, that's my best friend\nThat's my main bitch, that's my fuckin' best friend (Best friend)\nIf you got a problem then we got a problem\nIf she got a problem then you got a problem (Bitch)\nShe gon’ twerk, twerk, twerk, twerk, twerk that ass\nLike it’s her fuckin' birthday, bitch twerk that ass (Twerk that ass)\nThat’s my best friend, that's my fucking bestie\nCan't fuck with you hoes 'cause you messy\nPull up to the party, I got everybody lit\nI could brag about my best friends, everybody rich (We rich)\nDouble dutching with the money, I be playin’ with the bands\nBirkin bag, Fashion Nova, Cartier on the lens (On the lens)\nEvery time we pull up, bitches pissed off (Pissed off)\nMake the whole club jump like Kris Kross (Kris Kross)\nI'm a bad bitch, poppin' like lip gloss (Lip gloss)\nWe be blowin' money fast like Rick Ross (Rick Ross)\n\n[Chorus: Bhad Bhabie]\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes 'cause they messy ('Cause they messy)\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes 'cause they messy\nGo bestie, that my muhfuckin' best friend (Go, go, go, go, go, go)\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend (Go bitch)\nGo bestie\nThat my what? That my muhfuckin' best friend (Go bitch)\n\n[Verse 2: Megan Thee Stallion]\nAyy, ayy, look\nGo bitch, go bitch, go bestie (Go bitch)\nRun up, and get done up, so you bitches better not test me (Bow, bow bow)\nBig ol' ass poppin', yeah I'm bad and she bad too\nClique full of haters, yeah you mad, your friend mad too (Ah)\nI ain't fightin' with these hoes, I'm a rich bitch (Bitch)\nHair long, nails long, VVs on my neck bitch (Necklace)\nIf you wanna beef with me, I hope you got that fee for me\nFoot up on they necks, make it hard for hoes to speak to me (Shh)\nYour hoes better not fuck with my best friend\n'Cause if she don't like you bitch, then I don't like you either (Yeah, ah)\nI know some hoes talkin' shit but quiet when we see 'em (Shh)\nThey try to act like they ain't like me, now they wanna link up, ah\n\n[Chorus: Bhad Bhabie]\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes 'cause they messy ('Cause they messy)\nGo bitch, go bitch, go bestie (Go bitch)\nCan't fuck with these hoes 'cause they messy\nGo bestie, that my muhfuckin' best friend (Go, go, go, go, go, go)\nGo bestie, that my muhfuckin' best friend\nGo bestie, that my muhfuckin' best friend (Go bitch)\nGo bestie\nThat my what? That my muhfuckin' best friend (Go bitch)", "image": "https://images.genius.com/f2526544aa29bc5744e055f862220840.500x500x1.jpg", "year": "2019-05-03", "title": "Bestie (Remix)", "album": null}]}