{"songs": [{"year": "2010-06-22", "image": "https://images.genius.com/094639b25f790dc7c57451247197cfd7.360x360x1.jpg", "title": "Monster Inside", "album": "Gang Rags", "lyrics": "[Verse 1]\nHe walks with a grin, he grows from within\nHe lives off fear and he eats off sin\nHe wants to control a body and soul\nIf he had a heart it'd be black as coal\nDeath's at his hands, plottin' gang plans\nIt's all predetermined by the grains of sand\nAnd the hourglass break drop as the hours pass\nAnd he relives the excitement til the last glass\nHis rage is displayed with a gauge to your stomach\nIt lives in a chef as he chops at the veins\nPress human patties' at blood soak bay\nIt's all that remains at the end of his day\nHe's a nightmare in the night air with a cold stare\nYou could be the one caught in his sick glare\nNow ya chosen, and ya frozen, oh its mine\nIt'll break itself free if only in due time\n\n[Pre-Hook]\nPain, torture, kill, destroy\nThat's all I wanna do\nThat's all that brings me joy\nI am the monster within taking control\nAnd once I am out I am never letting go\n\n[Hook]\nThere's a monster!\n(That lives inside me!)\nThere's a monster!\n(Somewhere inside me!)\nThere's a monster!\n(it lives inside me!)\nThere's a monster!\n(always inside me!)\n\n[Verse 2]\nGotta stay locked away, if he came out to play\nFeel his lust to kill and then everybody pay\nHis thirst is much worse and his craving its a curse\nHe likes scrambled eggs til the eyes burst\nAnd pull off fingernails wit a set of vicegrips\nHe doused you all in gasoline after he takes a sip\nTortures you for sacrifice to feed his appetite\nHis ritualist God, his ritual is hot\nThe fear is immense, as insists by the screams\nAnd the sound that goes round is the thing in the streets\nRight before the kill hes crackin jokes like a jester\nGot you layed out on the table like you is death stained\nDon't kill quick, as he tends to enjoy it\nWhen hes in control the memory is a lil sorted\nPain is all that remains like a chain oh God\nI feel em again he's in my brain!\n\n[Pre-Hook]\n\n[Hook]\n\n[Interulde]\nIts not.. an easy thing to be a monster\nBelieve me I feel it\nI need to be alone, but I'm not alone am I?\n(Lady)\nHow do you need help from me?\n(Monster)\nCome closer.. close.-err..\n\n[Hook]"}], "artist": "Blaze Ya Dead Homie"}