{"songs": [{"title": "Shine On", "image": "https://images.genius.com/da56947cb42116f7c3b9f723d7df591a.470x470x1.jpg", "lyrics": "[Hook x2: Nikki Jean]\nDon't pay me no mind, baby\nShine shine shine\nDon't pay me no mind, sugar\nShine shine shine\n\n[Verse 1: Brother Ali]\nI had seen you when the hosted seated you\nIn a station of mine still I'm taking my time\nMade sure the moment got seized, made up my mind\nThrough a napkin over my sleeve, straightened my tie\nMind if I behold you through the fold of your menu\nCouture, all up against you, oh lord\nHow could I convince you? I just met you\nAnd I'm instantly listening to your instrumental\nPoor me, I poured water inside your glass\nFor a brief moment our eyes had kind of met\nI confess, I felt that inside my chest\nAlmost made quite a mess yet I digress\nI would guess you're meeting a date here\nI offer, she order hors d'oeuvres while she wait here\nShe brushed her bangs to clear off her face, yeah\nParted her lips and turned crab cakes to Shakespeare\n[Hook x2]\n\n[Verse 2]\nThe way the lady bait a trap, I'm afraid to ask\nMy imagination act, I run away with that\nRun away with me, I swear I'm not a maniac\nI'll give you that pretty diamond ring and last name to match\nI ain't saying that, I practiced waiting in the back\nI know I better make it fast before her date get back\nYeah, I place her order, grabbed the plate, relaxed\nHere, let me fix my face get my game in tact\nFear, I chased the clock as I can't make it stop\nI played the waiter job, made it to the table top\nTime to play your cards, ace got to take your shot\nBefore I could speak he showed up to devastate the plot\nHer real server showed up, my plan fell through\n\"Sir, are y'all together? Ma'am, can I help you?\"\nShe looking puzzled, I stand without words\nI'm sorry, I don't really work here - awkward\n\n[Hook x2]\n\n[Verse 3]\nLet me explain, you see I ain't much for wait and see\nSo when I seen you take a seat I played maitre d'\nShe replied angrily, \"Mister, I can't believe\nYou'd stand your grown ass in this place and play games with me\nCrazy freak, wait, how did you get all that food?\"\nI ordered from the table around the corner and brought it to you\nCan't say I thought it through, ma'am it's all sort of new\nBut when I saw you I sort of knew I had to talk to you\nAnd nothing in my arsenal seemed possible\nSo I called an audible Serve you? I'm honoured to\nI didn't mean to bother you, I just want to watch a few\nMoments of your life much like a fly on a wall would do\nNever mind me, the light from your unusually bright shine blinded me\nSo that was all I could see, I understand if you don't want to talk to me\nI'll just leave, pardon me, I'll just take this little broken heart and leave\n\"Wait, that was a stupid thing to do\nBut my date didn't show up and my table's set for two\"\nI pulled on my coat like, aw look at you\nThat's all I really wanted ma'am enjoy your afternoon\nI'm through", "year": "2012-02-23", "album": "The Bite Marked Heart"}], "artist": "Brother Ali"}