{"songs": [{"album": "I’m Good", "image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg", "year": "2003-01-01", "title": "Get By (Remix)", "lyrics": "[Intro: Mos Def]\nHistory, it's happenin' every day, y'all (right now)\nEveryday (live, right now)\nRight now (good mornin', Vietnam!)\n\n[Verse 1: Mos Def]\nListen! Brooklyn wins again\nIt's the Stuy, it's the Bush, them niggas again\nTa' Kweli, Mighty Def, and S. Dot on the guest lock\nKanye, you're the dopeman of hip-hop, now let's rock\nNow roll out, niggas, my hometown niggas\nI get it good in yo hood, so slow down, niggas\nWatch the speed though, mind your pedal and ease off\nOr screech off into a collision course with these walls\n(BAM!) They don't move, don't pray, don't lose\nDon't sleep, life passin', light flashin', life happens\nThat fast, part of done, black hands up in prayer\nBlack guns up in fear, dyin' wish is to touch the air\nSeekin' heaven that wasn't here\nEyes will not see another year, it's another day\nIt's the same fight, different round, sound the bell\nMix it up in victory, you live it up, the beat'll get risen up\nYou're knocked down, then get back and get it up\nGet off of queer street and get with us\nAnd get clear where we did it, from the heart, from the people\nFrom the top, from the jeep, from the gut, from the street\nFrom my soul to the mic to the essence\nSo in my absence you feel the presence, exactly\nI make contact, for short, I MC\nMe and mine we don't just get by\nWe get free and that's ready [(Mos, nigga!)]\n\n[Verse 2: Jay-Z]\nJust to get by\nNigga I sold coke, nigga I pushed lye, carried a fo' five\nClaimed I was ready to die, promised never to cry\nHeld it all inside, reality was too much to take, so I\nKept my mind fried, slept for most of mine\nSoon as I closed my eyes, then I woke up behind\nThinkin' either I load up these 9's, or blow up with rhymes\n‘Cause this flow of mine is like blow up but lines of coca\nAnd your folks think Hov' just wrote stuff to rhyme\nNah, I'm a poster for what happened seein' your moms\nDoin' five dollars worth of work just to get a dime\nSo pardon my disposition\nWhy should I listen to a system that never listened to me?\nPicture me workin' McDonald's\nI'd rather pull a MAC on you\nSorry, Ms. Jackson, but I'm packin', bye!\n\n[Verse 3: Kanye West]\nYeah! It's somethin' about that Nina Simone piano flow\nIt's like a Michelangelo painted a portrait of Maya Angelou\nAnd gave it to a sick poet for they antidote\nIf music get ya choked up, this is the tree and the rope\nThis is Chi, nigga, I'm Mr. All-of-That\nFuck a map, let's put this bitch on the almanac\nDice what they hittin' fo', lax what you sittin' on\nTracks who you spittin' on, rap 'til we get it on\nAnd don't let nobody with the power to sign\nEver tell you you ain't got the power to rhyme\nThey used to tell me, \"Toughen up, put some bass in your voice!\"\nThey used to tell me, \"Lighten up, put some Mase in your voice!\"\nLord willin' I ain't killed nobody\nBut I have a feelin' this album that I'm gonna make a killin'\nOr not a shilling, this is love-it-or-hate-it music\nBut—at least we made it music\nAnd we didn't make it industry, this is gon' be interesting\nThis'll be the end of me, or I'm finna be an entity\nKanye, Jay-Z, Mos Def, and Kweli\nWe are not makin' songs no more, we're makin' history\n\n[Hook: background singers + (Talib Kweli)]\nThis morning I woke up\nFeelin brand new, I jumped up\nFeelin my highs and my lows\nIn my soul, and my goals\nJust to stop smokin' and stop drinkin'\nBut I been thinkin' I got my reasons\nJust to get (by), just to get (by)\nJust to get (by), just to get (get buh buh buh bye bye)\n(Just to get by, just to get by)\n(Just to get by), just to get get buh buh buh bye bye\n\n[Verse 4: Talib Kweli]\nWe keep it gangsta, say 'fo shizzle', 'fo sheezy'\nDesensitized by the violence on the TV during the war\nKillin' each other is easy, its pourin' liquor for fallen niggas\nBelieve me, it's ghetto libation, seen it all before\nJust to get by, my people, we get fly\nMy people, we get high, fillin' cigars with the lah\nNigga, come on! Even Jesus was stoned\nBefore receivin' the throne\nI send a rest in peace to Nina Simone\n\n[Verse 5: Busta Rhymes]\nBack in the days we was used to doin' the shit\nI can't call it all in the streets\nWe was hustlin' fiends that asked for it\nI guess I was used to just standin' on corners\nWaitin' for paper bags with bundles of crack\nHopin' the week was good, so I could get money back\n(To get by, just to get by, just to get by, just to get by)\nWhen I was stressed I possessed a side of my strength\nThat made me angry and bleed\nWith the frustration havin' me smokin' Newports and weed\n(To get by, just to get by, just to get by, just to get by)\nThose be the times when I try to rely\nOn my niggas and street mothafuckas\nAnd reach out to wifey, and then I place a call on my mother\n(To get by, just to get by, just to get by, just to get by)\n*Ayo, Mom, pick up the phone, I gotta to talk to you, Ma*\nIf you was five percent instead of actin' stupid and guessin'\nYou had to go and study your lessons\nAnd know your math in the building in session\n\n[Hook: background singers + (Talib Kweli)]\nThis morning I woke up\nFeelin brand new, I jumped up\nFeelin my highs and my lows\nIn my soul, and my goals\nJust to stop smokin' and stop drinkin'\nBut I been thinkin' I got my reasons\nJust to get (by), just to get (by)\nJust to get (by), just to get (get buh buh buh bye bye)\n\n[Outro: Talib Kweli]\nSome people try, some people try\nJust to get by, for my piece of the pie\nWe love to eat and get high\nWe deceive when we lie\nAnd we keepin' it fly – yo, yo, yo, yo, yo\nWhen people decice to keep a disguise\nCan't see your eyes, see the evil inside\nThe best people you find\nStronger people in mind\nI stay readin' the signs"}], "artist": "Talib Kweli"}