{"artist": "Apathy", "songs": [{"title": "Doe Raker Check", "image": "https://images.genius.com/b57752a92a71efe68eafb568aa250d5b.800x792x1.jpg", "album": "Eastern Philosophy", "lyrics": "[Apathy]\nMy Nikes are real white, check one\nMy Nikes are real white, check two\nI'm a bastard that'll master ways to massacre the masses\nLike a massive meteor that smash your cities into ashes\nI'll bash these lil' faggots 'til your face is facin' backwards\nWait for you, I'm takin' you to quiet places in the backwoods\nWhere the hoes already thugs, sluggers waitin' very patiently\nThey travel through the chamber of the banger very gracefully\nAnd dance through your cranium, tangle with your brain stem\nSalsa with your cerebellum, quickly rearrange them\nExit through your earholes, firin' projectiles\nMy bullets are accumulatin' frequent flyer miles\nI'm Doe Rakin, cakin off multiple enterprisin businesses\nWith weight up in the rental keepin enterprisin business kid\nAnalyzin every possibility like physicists\nMy fist'll fracture faces faster than pistols can spit at this\nThe proof's when the album drop, crew run they mouth a lot\nBut Ap up on the mic is like Zeus on the mountaintop\nLightning thrower, mic exploder, most them rappers' lifes are over\nFight provoker, wifey stroker, rare exotic Nike owner\nVoodoo speaker, speaker blower, blow your momma, mind'll blow ya\nBrain it's all the same if you take it back and rewind it over\nOvertime, score tied, seconds are tickin\nFor recognition I be spittin 'til the records is skippin\nRespect the clique and everything'll be cool\nY'all better check if it's cool\nI'll just eject the feul in your record pool\n\n[Hook: Emilio Lopez] + (Apathy)\nWe some Doe Rakers, we some soul takers\nBut, all we tryin to do is get mo' paper\nWe some Doe Rakers, we some ho takers\nWhole clique flow sick, ain't no fakers\n(My Nikes are real white, check one) You know?\n(My Nikes are real white, check two) Geah!\n(Check one, check two, check one-two) You know?\n(Check one, check two, check one-two) Geah!\n\n[Motive]\nYo, yo if you heard of Doe Rakers then you already know\nI roll with a clique, that persists to flip that dough\nSee while you're at school tryin to play that tic-tac-toe\nI was with your lil' sis, findin how to hit that ho\nLet me talk to all these niggas wanna get at Mo'\nNo warnin, your peeps mournin cause they miss you so\nA clown nigga, lay down like six feet low\nCause y'all thought it was just a game when you spit that flow\nNo! Not on a throne yet, but I'm a known threat\nPlus I'm known for puttin somethin in pussies like Kotex\nI'm on some CEO shit, yeah your man's a boss\nKids sayin he's a myth like Santa Claus\nI got the, tools to provide with\nEither you ride or collide with my clique or choose a side to hide with\nMotive the live that's paid my dues, won't settle for shit\nNuttin to prove, none of these dudes on the level I spit\nShit's funny, I'm 'bout money but a beast on tracks\nSo watch y'all mouth, when y'all speak on wax\nCause beef with Ap, nigga then them heats gon' clap\nBelieve the facts cause I'll greet your whole, team with gats\nGive a fuck, if you old school rap or new crews\nThey don't spit sick, that's shit! You're doo-doo\nFuck all the talk son, the actin is done\nCome to your show, after you flow only thing clappin is guns\n\n[Hook]\n\n[Outro: Big Hoot]\nYo, this the hot shit kid\nIt's your boy Big Hoot\nA.M.E., Demigodz\nWe controllin it right now\nApathy smackin motherfuckers up\nAnd that Motive, bangin you out\nEmilio, knockin you out\nD.R. nigga, what?\nWhat nigga? Fuck you bitch! {*echoes*}", "year": "2006-03-21"}]}