{"artist": "Plies", "songs": [{"album": "Da REAList", "title": "Heard of Me", "image": "https://images.genius.com/a97af29ec97ef69b9b1d54a68b3f8f10.500x500x1.jpg", "lyrics": "[Intro]\nNot a typical nigga bruh\n(Have you heard of me?)\nBoy I think I'm fin' to go all the way on this one\n(Have you heard of me?)\nOne thing about me homeboy (have you heard of me?)\nI don't play no motherfuckin games (have you heard of me?)\nYou better understand me player\n\n[Hook]\nMay never see me on tha cover of a magazine\nCause I ain't willin to kiss ass and be seen\nCorperate mad at me cause they can't fuck me\nI'm who these haters hatin, I'm to third degree\nThey say I'm too gutter, homey for TV\nI'm who these white folks, don't want they kids to see\nBut I'm the new owner, of these fuckin streets\nGo by the name of Plies, have you heard of me?\n\n[Plies]\nKept it motherfuckin gutter from day one\nRight now homey the streets what I run\nHow am I this hot and a award I ain't won?\nCause I ain't a industry nigga, alright son?\nBut you will pay me for what I've done\nKeep the industry relationship cause I don't want none\nDon't want the fame of this shit, you can have it huh\nShoulda have just took the money, and then run\nThat ain't how a real nigga play it where I'm from\nStay and get the whole thang, and then some\nI done sold gold, what's next platinum\nAnd dold over a million records; ain't that somethin?\n\n[Hook]\n\n[Plies]\nNigga since me e'rybody claimin real\nMost you niggas pussy, that's how I feel\nTo be the best rapper, you gotta tell lies\nSo I couldn't be that, cause I don't fantasize\nHow you cookin dope? You wearin suit and ties\nThis industry a joke, choose who they publicize\nJust don't go to your parties you don't fuck with Plies\nTo all my fans, I apologize\nThey want me to cross over, but fuck that side\nI'm just a real nigga, out of Ft. Meyers\nI got principles nigga, that's what I live by\nAin't had a rap feature, and I'm still alive\nNot one, my third album, is you suprised?\nWorth my investment, ask {*censored*}\nAsk Atlantic Records, do I let shit slide?\nRing tone numbers, one point five\n\n[Hook]\n\n[Plies]\nCorperate scared of me, cause I ain't safe\nThey don't know what the fuck that I might say\nIn the type of game, that they play\nI don't wear tight jeans, and I don't rock shades\nI'mma trendsetter, I go my own way\nI that artist on the radio that the streets praise\nYou can stop countin on questions Eazy\nEver heard of a nigga that say fuck me?\nNigga either a rapper or he wanna be\nJust want me to kill 'em dog, on GP\nSay I ain't lyrical, well I'm sorry B\nDropped out of college, ain't earned my degree\nBut at my bank, they love me~!\nHis favorite rapper ain't hot, he mad at me\nI can make him hot for a small fee\nThe streets don't want him, I'm sorry\n\n[Hook]", "year": "2008-12-16"}]}