{"artist": "Yella Beezy", "songs": [{"image": "https://images.genius.com/8a11adeeb06c77cfb5bf5a477ebd48cd.1000x1000x1.jpg", "year": "2017-11-21", "album": "Lite Work, Vol. 2", "lyrics": "[Chorus]\nI got, big rocks, big chain, big watch\nBig beans, big Glocks, big bales, big blocks\nAll gold Rollie, no tick tock\nFuck your ho, in my flip flops\nKickin' this shit, no gym socks\nAsk about me nigga, I been hot\nIt ain't 'bout money? nigga kick rocks\nThat's all facts, no Xerox\nBust a couple shots, make it clear out\nYou pussy ass nigga, I don't hear about\nI'm up one, up one, up one, up one\nI'm up one, up one, I'm up one, I'm up one\n\n[Verse 1]\nI'm up one, don't make me bust one\nThis big chopper, he'll touch somethin'\nOrder now nigga, I'ma buck somethin'\nNigga think I ain't shootin', I'll sunk somethin'\nHop out the whip, hoes come runnin'\nMan that silly ass bitch, I ain't gon' fuck nothin'\nHo stop playin' games, come suck somethin'\nHey, bend it over, put it on your butt honey\nHey, watch presidential, get top in a rental\nHopped in a Sprinter, fly individual\nBig guap, thick knots, check my credentials\nKick back, keep it player, ride with the nigga\nCup full of mud runnin' up in my liver\nPray to God they don't put me in the hospital\nCan't touch me boy, I'm too hot nigga\nAll these little bitty bitches gon' bop nigga\nHad to hide these rocks on my jock nigga\nIf he playin' I'ma shoot him off top nigga\nBoy I spent thirty K on my watch nigga\nPut dick all in your ho crotch nigga\nPoppin' shit, poppin' shit, yeah I pop niggas\nGot a lick, got a lick, on a house nigga\nHell nah I ain't stuntin' you stank hoes\nStreet, yeah RIP Bankroll\n\n[Chorus]\nI got, big rocks, big chain, big watch\nBig beans, big Glocks, big bales, big blocks\nAll gold Rollie, no tick tock\nFuck your ho in my flip flops\nKickin' this shit, no gym socks\nAsk about me nigga, I been hot\nIt ain't 'bout money? nigga kick rocks\nThat's all facts, no xerox\nBust a couple shots, make it clear out\nYou pussy ass nigga, I don't hear about\nI'm up one, up one, up one, up one\nI'm up one, up one, I'm up one, I'm up one\n\n[Verse 2]\nPay big bank, take lil bank\nShe booted on the molly, I'm on a lil drank\nCome fly by me, I want a lil face\nThink about it, I don't want relations with the lil skank\nNot Tay-K but I'm on the race\nBig desert eagle, keep it on my waist\nMotherfuck a hater, yeah they gonna hate\nFall back lil bitch, nah I don't go on dates\nYeah I stay sippin' on the sizzurp\nGot a lot of ice like a blizzard\nWhat's crackin' nigga? what's the wizzard?\nIn the trap doin' magic like a wizzard\nSip me a four, nigga slizzard\nSmart ho givin' brain like a nizzerd\nI ain't gettin' money, what you say, come again sir?\nSucked off in the loft, gettin' top's where I been sir\nGettin' drunk, gettin' full of this Henn sir\nIn my pants, yeah I keep about ten sir\nI'm a loner, no I don't need friends sir\nGot about ten bad bitches in the Benz sir\nDon't ask me 'bout that ho house, I ain't went there\nBroke, been a long time since I been there\nBoy you niggas stressin' out, you got thin hair\nMy son ain't born yet but he got about ten pair Guccis\n\n[Chorus]\nI got, big rocks, big chain, big watch\nBig beans, big Glocks, big bales, big blocks\nAll gold Rollie, no tick tock\nFuck your ho in my flip flops\nKickin' this shit, no gym socks\nAsk about me nigga, I been hot\nIt ain't 'bout money? nigga kick rocks\nThat's all facts, no xerox\nBust a couple shots, make it clear out\nYou pussy ass nigga, I don't hear about\nI'm up one, up one, up one, up one\nI'm up one, up one, I'm up one, I'm up one", "title": "Up 1"}]}