{"songs": [{"image": "https://images.genius.com/d878e54b6766255010da413481db1471.1000x990x1.jpg", "title": "Champion", "album": "Til the Casket Drops", "year": "2009-12-04", "lyrics": "[Pusha T talking]\n\n[Hook: Pusha T]\nI'm a champion, shorty I'm a champion\nI been around the map, now I'm on my victory lap, hey hey\nSee, I'm a champion, shorty I'm a champion\nWhile other niggas crashing em, hey I'm just steady mashing em\nTell em what you told me, tell em what you told me\nTell em what you told me, tell em what you told me\nTell em what you told me, tell em what you told me\nTell em what you told me, tell em what you told me\n\n[Verse 1: Pusha T]\nThey say I'm shining dog, you see these diamonds dog\nThey say I'm shining so hard I like to blind em dog\nYou got a problem dog? Well you can bring it on\nI got at least a 100 shots and you can get 'em all\nHey! I did it! I really did it!\nI'm like the poster child for niggas that just get it, get it\nI'm supposed to smile for my niggas who ain't here to live it\nI'm putting money on they books so they can ball in prison\nAnd feel the spirit of a boss, dual pipe exhaust\nAll we know is to floss\nI'm cocaine Cassel and throwing bombs to Moss\nMy bitch keeps the newest and the latest\nA street nigga, she know I'm the greatest, hey, hey\nHold up that Rosé, pouring half the bottle out\nIf you from where I'm from, you know why I'm showing out\nOvercame the odds, so we overdue them cars\nWe done balled around the world\nNow we reaching for the stars, hey, hey\n\n[Hook]\n\n[Verse 2: Malice]\nIf only I had gotten what I had deserved\nLord knows, I would've been done left this earth\nOr either in somebody's jail, rotten, that's my word\nIf not yourselves, then you need to have them kids in church\nMistook my work for selling crack\nYou should've got more out of it then that\nMy Grandma would say \"boy you backwards as the hat\"\nRather in a trap, NFL draft pick or rap\nVirginia's for hustlers, hustlers get it back\nI thought that life was a bad bitch, bad car\nLife is with your kids watching Madagascar\nIn the headrest of the H3 with crash bar\nRocking Play Cloths, every day's a catwalk\n\n[Hook]\n\n[Bridge]\n[Pusha T]\nBeen there, done that, fell off, got back\nReal nigga shit, only champions can talk that\nEarn my respect, niggas hating cause they want that\nBeen to hell and back, only champions can walk that\n\n[Malice]\nTalk that, put yo money where ya mouth is\nTee off on the green, golf course is where the house is\nA long way from pumping out housing projects\nInvesting in real estate, weighing out my prospects\n\n[Hook]"}], "artist": "Clipse"}