{"artist": "Doughboyz Cashout", "songs": [{"title": "Intro", "album": "Boss Yo Life Up Gang (Artist: Young Jeezy, YG, & DBCO)", "year": "2013-08-13", "image": "https://images.genius.com/dfbbfa13d3472d5562b5e6a98cca0a59.500x500x1.jpg", "lyrics": "[Verse 1: Young Jeezy]\n\nIm kicked back, presidential roll ya hundred fifty stacks\nNiggas playing with the bag now what type of shit is that?\nHeard he been up in the club going hard with the stacks\nFront a nigga lil' some and he dont know how to act\nGot my niggas on deck, yea they do this shit for fun nigga\nCompton to the D, yea im talking bout my young niggas\nI been playing phone tag with that all day\nYG pull up on that nigga and see what he got to say\n\n[Verse 2: YG]\n\nI was fucking with Rico, he had the plug on the chico\nI had to cancel like nino, cause the deal wasn't finito\nI hit Payroll like \"Ayo got the plug on the yayo\nHe said its fresh off the boat, so charge him like San Diego\"\nTryna make a hundred thousand off of 15 racks\nYou know a nigga with 20 in the safe, get where he at\nAin't you the same nigga that been running from young?\nI grab my gun, he start to run POW POW missed him by luck fuck!\n\n[Verse 3: Doughboy Payroll]\n\nGot a call from my nigga YG, He said its a problem with the big\nHomie Young. 49 or the choppa, fuck it ima just grab all 3 guns\nHe parked out front, but them bitches in the trunk\nGloves on bout to leave a bitch nigga slumped\nI know Ques riding let me hit this nigga up\nBring yo 4'5, lets hit this nigga up\n\n[Verse 4: Doughboy Ques]\n\nSo I kiss my Jesus peace, lord forgive me for my sins\nI been down for too long, now its time for me to win\nSaid I wouldn't do this again, but you can't disrespect my partnas\nPlaying with the bosses money, YG go and grab them choppas\nTell Pay to grab them pumps, I know Kidd got them Nines\nSince he see us as some hoes we bout to rob this nigga blind\nMan this nigga lost his mind im killing him and his girl\n(Kidd) \"So now double homicide?\"\nHell yea its the world\n\n[Verse 5: Doughboy Kidd]\n\nMan you tripping listen, I ain't killing no kids, I ain't killing\nNo bitches now lets run up in this crip, we gone ramsack for that\nCheese, we gone search around for them keys, if we can't come across\nNeither put that to his dome then squeeze. So we out the truck\nTowing heat, 4 deep with YG, not a soul out in the street, its too\nQuite you ask me. Got a baby choppa and a Nine too, They say wait on\nDre, theres no time to. Wait wtf, got damn look, its a bunch of niggas\nWe ambushed\n\n[Verse 6: Doughboy Payroll]\n\nHe got more niggas, but we got more clips, im bout to hop out cause I\nAin't no bitch, kill em all I ain't got time for no snitch, when it come\nTo my fam, I dont take no shit. Shells not found, gunshots loud, I just\nHit a nigga now he laying on the ground, busting yelling bitch where the\nKeys and the pounds, I ain't stopping nigga til I run out of rounds\n\n[Verse 7: Doughboy Dre]\n\nPulling up in all black, I got the 40 I got the Mac, Pay done hit me\n10 times like nigga where the fuck you at. Hearing all these gunshots\nMad as fuck I ain't bring the choppa, remind me of this one time, we\nFirst took them couple of blocks, now we back up on that tip, fully autos\nLight tip. Bitch we taking all this work, now these pussy niggas hurt\nHallows all up in they shirt, hop in the caddy, nigga skirt\nCall Young up we at the stash house we got the money, we got the work\n\n[Hype Man]\nI have an announcement, its some new work in the streets, its a little more potent\nThan what you used too, some shit only bosses can handle, Detroit we on!"}]}