{"artist": "Waka Flocka Flame", "songs": [{"year": "2014-07-14", "lyrics": "[Intro:]\nI see you little bruh\n\n[Verse: Waka Flocka]\nHaha, numero uno\nCame from from nothing, now your pockets all sumo\nConflicted prediction, but shhh... what do you know?\nTime is ticking in that watch like a Hublot\nGot a weapon out in Texas\nIt's a celebration hundred bottles to the section\nNow the models undressin' and the dollars we investin'\nCount your money and your motherfuckin' blessin's\nI'm a real hitter, I salute a real hitter\nNow your bank account and mama's house a lot bigger\nMore sacks than my partners in the trap\nAnd all you haters and doubters can fall back\nS-C, that's the home of Ben G, squad\nJungle boy, two spoons gota eat, squad\nGod works in mysterious ways\nI just work to keep on living that luxurious way\nAnd the jury can say whatever they please, you can't judge me\nI'm the people so the real people love me\nTrust me, from Riverdale, ain't too many chances\nAin't too many choices, ain't too many answers\nWhole 'lotta questions, whole 'lotta stressin'\nI've been progressin' back to the S and\nMy bank account and my bitch, a pretty site\nWhite boys be like - Waka, dude, you really tight\nBeat a rapper up sometimes I think I really might\nJust to prove that we heavy and they really light\nLike\nShoutout the Rockhill\nI know my boy enjoying how the top feel\nStay focused work, hard, go and prove a point\nAnd let these haters run they mouth until they lose they voice\nVerizon man swag, can you hear me now?\nCan they see me now? Can they feel me now?\nI know what it's like to get criticized\nTo say he don't deserve it, but in my eyes\nYou see the pain, you see the struggle\nYou see the grind, you see the hustle\n\n[Outro:]\nFeel me?\nNigga it's draft day\nNumba one, numba one until my last day\nFeel me?\nIt's draft day\nNumba one, numba one until my last day\nSquad\nYPC what up?\nCurley, Mike D, AJ\nWhat up man?\nI said it's Clowney, they can't doubt me\nI said it's Clowney, they can't doubt me\nSquad\nFlockaveli 2 on the way motherfucker\nDraft Day\nSquad", "image": "https://images.genius.com/615016a72f645e322ab9388f4cca0404.500x500x1.jpg", "album": "I Can’t Rap Vol. 1", "title": "Draft Day (Freestyle)"}]}