{"artist": "Kevin McCall", "songs": [{"image": "https://images.genius.com/dc474965c85fc1ff8098634c82f6b64f.677x677x1.jpg", "title": "Waterbed", "year": "2015-05-27", "album": null, "lyrics": "[Verse 1: Kevin McCall]\nI believe in love right now and girl, I can’t hold back, gotta let it out\nLike a song stuck in my head, I wanna make love on this waterbed\nYou give me every reason to, to think about holding you\nTouching you, loving you, baby, yeah, yeah\n\n[Chorus: Kevin McCall & Chris Brown]\nYou got something special, I don’t wanna let go\nCannonball into my bed, we're loving on a waterbed\nHope you don’t get seasick, girl, aquafina under your body\nI'll stroke it, stroke it, are you wet?\nCan we make love on a waterbed? On a waterbed-bed-bed\nOn a waterbed-bed-bed, woah\nCan we make love on a waterbed? On a waterbed-bed-bed\nOn a waterbed-bed-bed, on a waterbed, oh, woah\n\n[Verse 2: Chris Brown]\nLike an anchor, girl, it’s going down\nMe versus you, baby girl, let’s go 12 rounds\nHold my hand, girl, I won’t let you drown\nAnd don’t it feel good right now?\nBaby girl, I'm looking deep in your eyes, your legs trembling\nI'm swimming in your body\nI'm your number one fan, girl\nI want you more than anything\n\n[Chorus: Kevin McCall & Chris Brown]\nYou got something special, I don’t wanna let go\nCannonball into my bed, we're loving on a waterbed\nHope you don’t get seasick, girl, aquafina under your body (you make m seasick, baby)\nI'll stroke it, stroke it, are you wet? (Get it, get, it, damn, haha)\nCan we make love on a waterbed? On a waterbed-bed-bed\nOn a waterbed-bed-bed, woah\nCan we make love on a waterbed? On a waterbed-bed-bed\nOn a waterbed-bed-bed, on a waterbed\n\n[Verse 3: Kevin McCall]\nOkay, my sex is like your next breath, so I know you need it\nYou on my waterbed, but I can't tell which one leakin'\nYou can let it spill like wine, this ain't no Tempur-Pedic\nSex so good, it'll have you screamin', \"Hallelujah,\" think you Jesus\nGuess the room pissed off 'cause it's gettin' heated\nJust let your bra slip off, you don't even need it\nLet me check your pulse, make sure you're still breathin'\n'Cause once you in my waterbed, it's killer season, believe it\n\n[Chorus: Kevin McCall & Chris Brown]\nHope you don’t get seasick, girl, aquafina under your body\nI'll stroke it, stroke it, are you wet?\nCan we make love on a waterbed? On a waterbed-bed-bed\nOn a waterbed-bed-bed, woah\nCan we make love on a waterbed? On a waterbed-bed-bed\nOn a waterbed-bed-bed, on a waterbed"}]}