{"artist": "Watsky", "songs": [{"year": "1977-01-22", "lyrics": "[Hook: Hall & Oates]\nYou´re a rich girl, and you gone too far\n´Cause you it don´t matter anyway\nYou can rely on the old man´s money\nYou can rely on the old man´s money\nIt´s bitch girl, but its gone too far\n´Cause you it don´t matter anyway\nSo money money won´t get you too far, won´t get you too far\n\n[Verse 1: Watsky]\nAm I the only one who thinks a bit of soul is nice?\nSome women suck it from you like the poltergeist\nCause I can tell the time of day without a diamond on my wrist, I give a __ about your rolly's price\nI like em bold, and I'll roll the dice\nCause I been crushing on all these crunchy granola types\nI'm over being over it and women on a mission got my heart melting like polar ice\nI might\nBe looking for a little bit of Bay\nA little San Francisco in these women in LA\nAshe\nNothing I can say\nAnd if you're being fake\nYou should be walking away\nI don't play babe\nDon't give a damn how low your earrings hang\nYour favorite brand, I don't need to hear it, dang\nCause Everybody's born naked and maybe later I'll be licking on your Gucci\nAnd you, rubbing my Vera Wang\n\n[Hook]\n\n[Verse 2: Watsky]\nSooner or later you'll figure out it's a hard world\nYou could get stronger doing arm curls\nBut this is a stickup and I'm coming saying break yourself, better give me that heart girl\nJust put it in the bag\nAnd if I give it back\nDon't put it in the trash\nCause I been looking for a partner with a passion saying\nDon't recycle\nDon't recycle me\nBut in this economy\nI don't really think it's cute for you to flaunt your property\nWhat about some modesty?\nThat would be a shock to me\nCause the only time you walk on the block is on a shopping spree\nMother-eff that song and dance\nBaby girl there's not a chance\nNot unless you wanna grab a coffee in pajama pants\nWe'll be looking like we just rolled out of bed together\nAll we really need is you and me\n\n[Talking]\n[Officer] You need to go to City Hall to get a permit\n[Watsky] Alright\n[Officer] You need to stop what you're doing\n[Watsky] How much would that permit cost?\n[Officer] I don't know, just go to City Hall and talk to a special events organizer and see if they can give you a special permit for that\n[Watsky] Okay\n[Officer] I'm really sorry\n\n[Outro: Hall & Oates]\nSo money money won't get you too far, get you too far", "image": "https://images.genius.com/15b416d55e0958076696e8b871573bd9.500x500x1.jpg", "album": "Nothing Like the First Time", "title": "Rich Girl"}]}