{"artist": "Willie D", "songs": [{"year": "1989-03-12", "lyrics": "[Intro]\n(Yo D man what's up with that cash register shit?)\nOh that's what the average ho see everytime she look at a modern day man\n(Ain't that the motherfuckin truth)\nYeah~! And these old fickle-minded ass niggas\nWonder why a ho be with them one day and another goofy motherfucker the next\n(I think it's time you kicked some more of that shit D)\nYeahhhhhhhhhh!\n\n[Verse 1]\nIt seems to be a lot of motherfuckers blind to the fact\nThat a ho is gonna be just that\nAnd this type of ignorance is the very\nReason why so many niggas in the God damn cemetery\nIntelligence is on call\nYou don't treat a ho like a queen, who behaves like a dog\nAre you the type who won't put a ho in front of a trigger?\nThen youse a hoe ass nigga\nGod damn hound, pound for pound\nYou knew the ho when she was fuckin' the whole town\nShe fucked you and gave your buddies a blow\nBut your trick ass fell in love with the ho\nTried to change her, make her be an angel\nYou keep puttin' your damn life in danger\nFrontin' niggas about that slutty-ass triflin' crow\nYou gotta let a ho be a ho!\n\n[Verse 2]\nHere's something that I'd like to know (what?)\nWhy you take that ho, everywhere you go?\nYou walk around the club wit' the ho in front\nTryin' to keep up with that nasty ass cunt\nYou say you're captain, but yo' ship she's sinkin'\nAs soon as you turn your back, the ho is blinkin'\nWinkin' her eye at another nigga\nBut you got her locked down, so you figure\nHo wears your jewelry every goddamned day\nBut nigga, you just got the ho on display\nWouldn't let her be herself, cause you's a goddamned wimp\nNow you know why ho's date pimps\nShe's a rhinestone freak 5 days a week\nBut you get mad when niggas pop on her ass\nGoddamned slutty ho, the bars are loaded\nDon't try to change her\nYou let a ho be a ho!\n\n[Verse 3]\nShe's a ho (D, how the fuck you know?)\nEvery time I see the ho she's with a new negro\nShe's the kind of ho that's bound\nTo wear shorts up her ass when your friends come around\nThe kind of ho that'll make you cry\nThe kind of ho you have to call, before you come by\nSo why you wanna kill when she says no more?\nYou ain't the first to be dumped by a God damn whore!\nCrazy motherfuckers fightin' over hoes\nStealin' for they asses and jumpin' out of windows\nIf a ho want out, I let her stanky ass go\nCause I'ma let a ho be a ho\n\nNow do y'all follow me so motherfuckin far? (YEAH!!)\n(Hell yeah I remember I let this ho named Kim use my car, man)\n(Bitch went to go see another nigga; I damn near killed that ho!)\nHa ha I fucked that ho man! (You motherfuckin lie)\nThat's bullshit, ask Bush.. man ask Bushwick and Red!\n{He went up in that bitch man}\n{On the f'realla my nigga}\nAkshen, man, I'm tellin' you, man!\n\n[Verse 4]\nI fucked that ho, before you even knew her\nMade her pussy go BBBRRRRR when I stuck my dick to it\nI knew she was a ho the first time I met her\nSo I got another ho and took her to the other level\nOf the game, got them high as a kite\nAnd fucked BOTH of those hoes that God damn night!\nThen I sat back and relaxed\nAs they 69'd, and ate each other's cat\nI dropped them off at home\nGod damn, look at this shit, my wallet's gone!\nThe hoes beat me but I left it alone\nAnd used that shit as a stepping stone\nI played it off the next time I saw the ho\nI just laughed and fucked her ass some mo'\nShe licked my ass, and sucked my balls\nAnd if I see her right now I can get them drawers\n\n[Outro]\nYeah buddy! Willie D ain't gonna let these hoes get him down\nI ain't cryin or dyin over none of you hoes\nI ain't buyin you no leather, I ain't buyin you no suedes\nNo jewelry, no contacts, no Lee nails\nAin't buy you no hair, no makeup, food\nNone of that good shit (tell 'em, D!)", "image": "https://images.genius.com/70353434f413cc254d7d1bea0c45a23e.320x313x1.jpg", "album": "Grip It! On That Other Level", "title": "Let a Ho Be a Ho"}]}