{"songs": [{"lyrics": "[Intro 1]\nWhy are we letting things in the outside of our physical penetrate our soul, penetrate our neural wiring system, our cerebral cortex, okay? Wh-what really is a thought? Can you control when a thought arrives outside of the brain? Can you or can't you? Is free will a-a real thing or is it the philosophy of free will, see 'cause scrip-ahaha…\n\n[Intro 2: Action Bronson]\nShit, sweep you off your feet\nLike Ryu in the corner\nShit, man, haha\nSmooth, man\nI'm a fuckin' smooth mover, uh\n\n[Verse 1: Action Bronson]\nYo, if I didn't say it's me, you would probably think it's Sting\nMy fish go bling, what, this old thing?\nI never switch up, my brother need a biscuit\nThen I'm gripped up, hangin' off my shoulder, fuck the bullshit\nNovember rain came the same day\nMy daughter taught me how to do the Nae Nae to Calle 13\nOnly compare me to Kevin Spacey\nOr Rubén Blades, the blunt fat like two Kamalas\nDo a world tour and scoop some dollars\nCome home and hit the pool hall\nI'm fishbowlin' new Impalas\nTwo Russian twins suck while I drive fast\nIt's me, man\n\n[Verse 2: Action Bronson]\nI'm the one that takes the wolf head, wears it on my own head\nWisdom from the old heads, you ain't gettin' no head\nYou ain't gettin' no bread, you ain't gettin' no shows\nYou ain't gettin' no dough, you ain't gettin' no hoes\nDawg, I hit the best of 'em, motherfuck the rest of 'em\nWell, now I'm nestled in the Tesla eatin' pretzels, huh?\nI should probably put a wetsuit on\nI'll be right back…\n\n[Verse 3: Rick Ross]\nYoung Renzel, line two\nYoung A.B., I got this you dig?\nYeah, yo (Maybach music)\nI love my rude bitches, end up as new bitches\nSkippin' school bitches, cookin' me food bitches\nAll my niggas down, we lookin' like Fu-Schnickens\nGot a few tickets for bitches who truly digged us\nCollege dormitories, fill 'em with smooth lyrics\nAir Max 95s, grey sweats, true menace\nKnown as a Jonas, complex on the phoner\nSimple individual, confident in the Lotus\nForeign ambitions, they go with my last wishes\nAs I open my eyes, surprised by seven figures\nBaking soda required, decided drug dealin'\nResidents is divided amongst the feds and children\nLet him keep totin' drugs if he willin' to plead guilty\nThe star state witness, they'll hit you up for that selfie\nDro can only help me, Backwood and I'm healthy\nI'm the label owner, I'm the only one can shelf me\nBiggest (Maybach music) boss\n\n[Outro]\nWhy are we letting things in the outside of our physical penetrate our soul, penetrate our neural wiring system, our cerebral cortex, okay? Wh-what really is a thought? Can you control when a thought arrives outside of the brain? Can you or can't you? Is free will a-a real thing or is it the philosophy of free will, see 'cause scrip-ahaha…", "title": "9-24-7000", "album": "Blue Chips 7000", "image": "https://images.genius.com/053c97f9c332b7747605c0a9913b6206.630x630x1.jpg", "year": "2017-08-21"}], "artist": "Action Bronson"}