{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/643d9675eedcaa5319fa306772e6375b.479x479x1.jpg", "title": "63 (Amaze 88 Intro)", "year": "2013-02-07", "album": "63", "lyrics": "[Sample: Sun Ra - \"The Creator of the Universe\"]\n\nWords\nYou can get books written by a white author, and it’s got- they even speaking some words they don’t even know what they mean\nYou know, they love words so much, and they just get so- they just- get rambunctious with words\nThey get carried away with words\nThey get drunk off of words\nAnd then they write the book and their own people don’t understand it\nBut because the words say well yeah “he’s an artist with words” and they come in and give him some kind of award\nJust for being good with words\nBut nobody understands the book\nNow, see when you [?] simplicity, it’s a different story\nTruth has been abolished, so any truth you say is not permissible in here, because it’s never done anybody any good\nNow I’m dealing with things can do you some good\nNow I’m telling you what it’s gonna have to be\nYou going to have to [?] in another realm, and a dimension of thinking\nBecause these people are not playing with you\nAnything you come up- anytime you bring up a righteous man, they going to oppose him\nNow, words are vibrations, so as you speak words, according to the rhythm that you speak those words in, and according to the language that you speak, you will become [?]\nEverything is throwing out music\nThis is throwing it out\nThis is throwing it out\nEvery object is throwing out music\nWhy? Because the wind is coming around the same way, and when the wind come around it makes a certain sound\nSo then that look like folks get so intellectual and everything and bypass [?], they going [?]\n‘Cause I told you, when I first came in this pad, if you got in tune with nature, you can get what you want\nBut they- they gonna have to respect the fact that they must start thinking about… not independence, but inter-dependence\n[?]\nInter-dependence. [sound of chalk on a chalkboard]\n[?]\nInter-dependence"}]}