{"songs": [{"year": null, "lyrics": "[Hook]\nIt's been a long\nA long time coming but I know\nChange gonna come\n\n[Verse 1: Charles Hamilton]\nPrisoner to my cerebellum\nSo I reach out to the listeners\nAnd my mission is I better tell 'em\nOur fear of a free mind is hearing\nYour spirit can die anytime\nYou need to cry and so you hide it deep inside\nReason why?\nHow can you change what was written?\nEasy, don't focus your brain on what they mentioned\nI got so used to tryna make due\nI feel like I'm cheating when I'm faced with a break through\nThe man in the mirror keeps saying I hate you\nI respond like lil nigga I made you\nSlay those sayin they could break you\nSo when I take a break I go ape come back and play fool\nWhen they think they won that's when I crush them\nChange is eminent I evolve so it's nothing\nWhat's the discussion\nCharles Hamilton\n\n[Hook]\n\n[Verse 2: Asher Roth]\nWe've been pompous ever since Columbus couldn't work a compass\nWe've accomplished what we've conjured up while conscious Unconsciously we've conquered all the eye can see\nConstantly concocting more options but jobs are still obsolete\nIt seems so odd to me, an odyssey\nHow honesty is honestly the rarest thing upon us\nIt's astonishing\nHow did all the honest people vanish from the planet?\nLeaving us a laundry list of problems to acknowledge\nWhile plotting with my phonics me and Conic and B.o.B\nNag Champa rises as I sit down and sketch my rhymes\nStretch my mind to figure out what's next in line\nThe next Em, Ye and Andre?\nNah homie its just been a long\nA long time coming\n\n[Hook]\n\n[Verse 3: B.o.B]\nWell as you listening to this track\nYou probably about to blog about it and maybe say its wack\nOr maybe compare the verses to see which one of us has snapped\nCompletely ignoring the fact that this is way more than rap\nCause I happen to be on a magazine you happen to see this issue\nSome people wish you well man some people turn against you\nSome people even call up to the station just to diss you\nYou bitch you, you only mad at your self here's a tissue\nBut that ain't even my focus man that hate ain't on my menu\nIm in a different city about to rock a different venue\nMy girl sent me a text message just to say \"i miss you\"\nIt won't be long before I'm home baby but the rent's due\nHa ha ha\n\n[Hook]", "title": "Change Gonna Come", "album": "B.o.B Vs Bobby Ray", "image": "https://images.genius.com/43ec171838184bac0a8baa89f9e6d0a9.600x600x1.jpg"}], "artist": "B.o.B"}