{"songs": [{"image": "https://images.genius.com/0e1f124f48c2edf75255aa6292bdf2b5.600x600x1.jpg", "title": "Brutalized", "album": "Die!", "year": null, "lyrics": "[Intro: Clip from Out For Justice]\n\n- I’ve noticed a lot of boxing memorabilia. We got some gloves over here. Pictures everywhere. Who’s the boxer?\n- Me\n- You’re the boxer?\n- Yeah\n- You a tough guy?\n- Yeah, tough enough\n- Really? What could you do?\n- To you?\n- Yeah\n\nYou getting brutalized!\n\n(Verse one)\n\nI’m a street fighter like M. Bison\nI might bite you like Tyson, trife with a license\nPut ice on the cut, doctors’ll be splicing it up\nRocky snuffed right to the gut\nI’m a Spartan, start beef my fists will harden\nYou punch like a girl but you ain’t Christy Martin\nYou get no love, hit you with no gloves\nDuff you like sure enough shove you no one’s above\nMy thunder and lightning, your eyes sting\nNo wonder you need Visine, not surprising, London Prize Ring\nYou felt were ill, your black belt ain’t shit\nWhen you’re attacked in your jail cell you fainted\nWhile you’re pumping dope in you I’m jumping rope\nThere’s no hope for you dope, chump, jealous lazy bum\nNo matter son I’m training whether it’s sunny or raining\nLike Sonny I’m reigning, you Patterson\n\n(Chorus)\n\nYou realise when I close up your two eyes you getting brutalized\nSize you up, prize fight shit, die what, you getting brutalized\nFake tough guys break and snuff no compromise, you getting brutalized\nSize ain’t shit, big guys victimized too, you getting brutalized\n\n(Verse two)\n\nYo I laugh at you fronters, a no-skill rider\nYou ain’t no ill fighter, you telegraph punches\nShots thrown from the hip your dome split open\nHemotobin, you should’ve known your shit\nDefence techniques from a knuckle-bone blitz\nYour knees buckle you’re weak sucker, don’t snitch\nDeal with it, real with it, it’ll heal quick\nThen I’ll run up on you again and bust open your shit\nTwice, three times, quadruple, rip apart pupils\nKick like marsupials hard and brutal\nThen watch how we get busy, you left dizzy\nLeft right hook where is he? Side step and you miss me\nWeapon the rugged ? for myself\nThug it, militants, weapons, our hands deadly, slug it out\nYou’re bugging out, drugged up, get knocked out\nYour mouth plugged up with stitches, you’re ugly now\n\n(Chorus)"}], "artist": "Necro"}