{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/770790566878699d43ed58ab69a253ba.1000x1000x1.jpg", "title": "Come With Me", "year": null, "album": "Priesthood", "lyrics": "[Killah Priest]\nAs I lay upon my bed, I stare at the ceiling\nThe feeling inside me is dead, what's that voice I'm hearing\nSo I reach for the spread, pull it back, saw demons\nMaking my wife give 'em head, I wake up screaming\nWhat is the meaning, am I dead?, Am I still dreaming?\nWill I wrestle with this devil whenever I'm sleeping\nWake up behind the metal of a federal precinct\nOr be found in the ghetto taking several of beatings?\nFrom policemen, will I die for what I believe in?\nWill I ride until I'm no longer breathing?\nI need to know until my soul is leaving through that hole, I see Him\nUp that road to meet Him and behold His kingdom\nAnd I stand before His judgement, my body a ghost\nI'm seeing dozens of my cousins, distant and close\nWhether relatives or friends, I remember them both\nThen I walk, what's that? my end, then a voice had spoke\nIt said..\n\n[Hook x2: George Clinton]\nCome with me, I'll take you there\nCome with me, have no fear\n\n[Killah Priest]\nAll I saw was fire and smoke and bodies that roast up\nYoung adults that were under a cloke\nAnd took a number of oaths 'til they hung from a rope\nI said damn, I saw my man pull a gun from his coat\nRan up before the preacher popped one in his throat\nI ain't scared because the chair share hundreds of volts\nAnd I know this is not the place that he wanted to go\nI want to leave because this place here is punishing folks\nSo I fell on both knees, face pouring with sweat\nWhen an angel approached me, placed a sword on my neck\nI cried with every bit of pride all on my breath\nThere I was strapped to a bed having war on my flesh\nThe priest threw holy water on me, called me possessed\nDoctors held me down but I tore through my vest\nPsychiatrists came, read the results of my test\nI threw up over the nurses, left the floor in a mess\nCome with me! Come with me\n\nChorus x2\n\n[Killah Priest]\nI dreamed of harm and blood, rusty chainsaws, bodies in tubs\nThat painted walls, saw armys of thugs\nSaw men made zombies from drugs\nEnemies from centuries fill my body with slugs\nThere I was in paradise, the marriage of Christ\nI saw nazarites, all gathered in white\nWritten down in the tablets of life\nWhat it means while the church at the Vatican fight?\nThere were flames, I passed through a traveling light, I was changed\nBecame a phantom of the night, the upper plain\nNo longer suffer the same, had enough of the pain\nFelt a rush in my vein, words stuck in my brain\nHad nothing to gain, everything to loose\nWhich cliques of the game do I claim to choose?\nSaw every ancient tomb and the saints in bloom\nHeard the sounds of the trumpets as the angels blew\nCome with me!\n\nChorus x4"}]}