{"songs": [{"title": "Forever Reppin", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "Lets do it\n\nAnd Im good\n\nYou keep countin' that money, I'mma kill these niggas\n\n[Big Sean]\nOkay, Im young and rich, and this the shit man\nWhat what, you you? you, you is a shit stain\nMe im connected like I switched planes\nAddicted to weed, bitches and big chains\nCar so big Id crash if I switch lanes\nSayin' you the man nigga, quit playing\nHow you winning If I ain't switch teams\nBitch I had the same dream since I was sixteen\nRippin' life out of the plastic\nTurnin' everything to platnuim\nGot six rings do I look like Phil Jackson?\nMeat Earl Mac and bunch of Tony Braxtons\nFill your cup to the f-f-fullest\nTell them if they actin' up and p-p-pull it\nHigh off money, weed and, p-p-pussy\nI didn't studder, so girl just d-d-do it right now\n\n[Hook]\nI used to seem to wonder what it feel like\nNow I do what the fuck I feel like\nForever Reppin' When Im gone\nI promise I'mma bring it back to home\nAnd have my mother fucking weed rolled up and my champagne popping\nI can't forget the girls, all around the world\nReppin' for my city, puttin' on with my crew\nAnd I'mma keep this money just to blow it with them too\n\n[Jwan]\nAnd when I see you and the last time\nI never lead a state where bags climb?\nAnd this my city when Im in it nigga stand down\nAll of my niggas, a lot of money and bad broads\nI stunt hard like I got a fucking sad car\nMoney will turn you evil, and that weed will have you nervous\nBut them bitches get you cute, and the pussy more potent\nBut I dont give a fuck, im stating callin hoes over\nMr. weedman meet me at my shows if you holdin'\nA lot of niggas want it, and a lot of niggas chase it\nBut a lot of niggas die before they make\nSo while im getting money im gonna blow it like my papers\nWhere the fuck my bottles, where my mother fucking waitress, sorry darling are we clear?\nIm standin' as a man till' im ruined\nThe worst thing you could do to me is shit I should be doing\nAnd if a niggas fronting I take two and put it through him\nIm no killer but I kill for what the fuck I am pursing. for real\n\n[Hook]\nForever Reppin' When Im gone\nI promise I'mma bring it back to home\nAnd have my mother fucking weed broke down and my champagne popping\nI can't forget the girls, all around the world\nReppin' for my city, putting on with my crew\nAnd I'mma keep this money just to blow it with them too. Hey"}], "artist": "Big Sean"}