{"artist": "King T", "songs": [{"image": "https://images.genius.com/4ecadf00855c55fe49bd112852218051.704x704x1.jpg", "title": "Bust Dat Ass", "year": null, "album": "Tha Triflin’ Album", "lyrics": "King Tee:\nI'm the man that'll bust dat ass, I'm the man that'll bust dat ass\n\nJ-Ro:\nNaw, I'm the man that'll bust dat ass, I'm the man that'll bust dat ass\n(say what?!)\n\nE-Swift:\nNaw nigga, I'm the man that'll bust dat ass, I'm the man that'll bust dat\nAss\n\nHook:\nI'm the man that'll bust dat ass, I'm that man that'll bust dat ass\n\nKing Tee talking:\nYo check this out. This is Tha Alkaholik crew. E-Swift didn't they say it\nCouldn't be done? They said King Tee couldn't bring out the Alkaholik crew\n(but we doin' it). Yo, it's the fresh shit. The dope shit for 1993. Tha\nAlkaholik crew. I'm gonna bust out like this, here we go, come on\n\nKing Tee:\nNow bust it, I'm a try to freak it with the drums\nAlkaholik funk, bass for the trunk\nAnd I'm kinda crazy, stupid and hey\nI can do the nasty and drink like a sailor\nI'm real smooth, free from germs\nEven walk away when my homie smokin' sherm\nCause this is how I kick it, hoes got to lick it\nIt's Tha Alkaholiks and J-Ro is wicked\nE-Swifts mad, cause he Got It Bad\nKing Tees phat and I sport a blue rag\nFor the little whips and the honey dips\nIt's gang truece so I put away the clips\nBaby baby baby I might flip\nGot to get it on, let my backbone slip\nIf I fall back then give me some gas\nIf you try to play me I'll bust dat ass\n\nHook (x4)\n\nJ-Ro:\nPut the mic down clown, you can't get down\nJump around stage like your name was Charlie Brown\nWhen the kid is played out your rap record is finished\nDiminish, you couldn't come strong if you ate a gang of spinach\nPopeye, you could never drop by, you can never stop by\nCause you can never top I\nI got to hold back now I'm out before your turf\nBecause I want it all like the nigga Greedy Smurf\nIt's time to scoop the wack up, E-Swift bring the track up (alright)\nPunk you better pack up, cause the unit got my back up\nYou're a mic stand, got a steady woman\nBut I been in more sheets than the Klu Klux Klan\nI'm the J to the Ro, and I want to make it clear\nThat you're rappin' like a queer so why don't you get on out of here\nWith the alley cat coat wearin', Hush Puppy shoe-wearin'\n[???] that seen you with (punk you ain't shit!)\nKing Tee and the Liks blowin' up like gas\nI bend your rhyme over, I bend your rhyme over\nI bend your rhyme over, I bend your rhyme over\nI bend your rhyme over, then I bust dat ass\n\nHook (x4)\n\nTalking:\nTha Alkaholiks, Tha Alkaholiks, I'm drunk, I'm drunk, Tha Alkaholiks\nStraight for 93. Rippin' shit up. Tha Alkaholik , now you join E-Swift\n\nHook\n\nE-Swift:\nI fiend to get busy like a bee, check 1,2,3!\nE-Swift and Tha Alkaholik crew with King Tee\nBangin' niggas out the box, drink my scotch on the rocks\nAnd I'm makin' more hits than the motherfuckin' Black Sox\nI'm kickin' lines like Tyson kickin' ass\nNiggas can't laugh, I put your neck in a cast\nYes, I\"m the man with the skills to talk shit\nAnd I'm back by the crew that none of y'all can get with\nSo back to the lab to fix your demo\nOr get played like Sega or Nintendo\nSimple as that, give me a beat that's phat\nAnd watch a nigga jump on a motherfucker like cheese and a rat\nIt's strictly, dirty underground ass funk\nThat's busting out the weak 15's in your trunk\nSo don't be scared, be prepared when it hits\nThe average motherfucker can't hand with the Liks\n\nHook (x4)"}]}