{"artist": "Wale", "songs": [{"title": "Black Heroes / Outro About Nothing", "year": "2013-06-25", "lyrics": "[Verse 1]\nNegativity, bet they pickin' me every day\nWhile niggas whine, I'm out crushing my 5 Grapes\nA good space, frame of mind til y'all came\nThey such a drag but naysayers Sheneneh\nStevie Wonder had them vision problems\nIt’s a wonder my 20-20’s can see tomorrow\nYou 20 something, his block is jumping like Vietnam\nHis mama be with the needle more than Nikko Hurtado\n\n[Chorus]\nAin’t no hope for a young nigga\nAin’t no goal for a young nigga\nToo short for a sport nigga\nIt gets horrific, we glorifyin' them drug dealers\n\n[Verse 2]\nYea, so where your keys at, Playboy?\nI sling hyperboles at a warped speed\nUsain Bolt runnin' from ready, set, bang, go!\nThird album of fate, nothing to bank on\nI paint for 'em, they lay em on it, I paint more\nThey ain't showing the same love, try to think through it\nI must influence some better music, let the hate show up\nWhen 'Le show up, we make noise, that that they can't ignore\nThis cold poet just throw up quotables to give 'em hope\nGo and slow up haters train of thoughts with brainstorms\nWe all niggas with dreams whether music or ball\nWhether hooping, a song or simply pursuing em all\nSince Paint a Picture, I been on a mission\nComing from the district everything but monumental\nI ain’t gotta mention all the little flaws\nWhere the stairs it’s the boys, find it hard to follow politicians\nAnd they Marion Barry, yea I have Barry Sanders\nNever wanna be gangster, put them dirty pads up\nThe man route, try and get my parents out\nFuck a stash spot, I was mastering the slant route\nFly Route, I write, double white out\nSince the rhyme route whole city taking my route\nTaking my route\nTell these niggas that it's my house\nBlack hero\nAin’t no black hero\n\n[Chorus]\nAin’t no hope for a young nigga\nAin’t no goal for a young nigga\nToo short for a sport nigga\nIt gets horrific, we glorifyin them drug dealers\n\n[Bridge]\nYoung nigga, ain’t no goals for a young nigga\nToo short for a sport nigga\nIt gets horrific, we glorifyin' them drug dealers\nAin’t no goals for a young nigga\nToo short for a sport nigga\nSay we all gifted\nWe all gifted aha\nAnd we all, and we all, and we all\nAnd we all gifted\nAnd we all, and we all, and we all\n\n[Verse 3]\nAnd I wrote this album without a care in the world\nBut the outcome as long as it’s an outpour of niggas who\nCame out they downfall like an overblown round ball before my sound off\nOr maybe this music will inspire a future mountain mover or two\nAnd if I ever rush more music out to you\nThen know that I’m overworking myself ‘cause my heart and mind into it\nAin’t been a black hero since Robert Townsend\nSo for meeting your man I hope you found something profound and enough to expand on before the sound falters\nHa ha, before the sound falters\n\n[Outro About Nothing]\n\"Yea, so yea, how come, uh…\nYea, I came in to do the album\"\n\"Right\"\n\"I thought we’re doing the album today\nHow come? What happened?\nWhen are we doing that?\nAre we still doing that?\nDo you wanna do it?\nAlbum About Nothing, when are we doing that?\nI thought we were doing that\"\n\"I just wanted to see if I can get you here\"\n\"I’m here\nI came here to do it\"\n\"I don’t really have much for you right now\nI don’t know what to do\"\n\"Well when are you gonna have it?\nWhen am I doing it?\nI’m ready to do it right now\nI wanna do it\"\n\"I’m not too sure, Jerry\"\n\"Well, who is sure? Who is in charge of this\"\n\"This is Gifted, this is The Gifted session\nThis isn’t Album About Nothing, this is The Gifted session\"\n\"Oh, this is The Gifted session?\"\n\"Yea, for the album that I got now\"\n\"Okay\nAlright then I guess I’ll come back\"\n\"Please\"", "album": "The Gifted", "image": "https://images.genius.com/576d9a38f7c0a68bab0b765a5187bb65.640x640x1.jpg"}]}