{"artist": "Young Thug", "songs": [{"year": "2018-12-18", "lyrics": "[Intro: Young Thug]\nWoo! (Jeffery!)\n*sips*\nBouncin' like a Tootsie Roll, aye, uh (yeahhh...)\n(Aye) Jeff! (I just wanna smash on the first date...)\nA-a-a-aye...\nUhh! Whatchu want?\nWheezy Beatz\n(Yeah!)\n\n[Chorus: Young Thug]\nI just wanna smash on the first date (huh)\nI just wanna smash on the first date (yeah)\nI just wanna smash on the first date (first, first)\nI just wanna smash, I’ma smash, uhh (smash, smash)\n\n[Verse 1: Young Thug]\nSmash like a smash gang, woo! (smash, smash!)\nSmash in my Balmains, woo! (Balmains!)\nSmash while I'm switchin' lanes, aye! (skrt, skrt!)\nSmashin’ your main ting, ah! (smashin' your main ting)\nWhen you smash you gotta maintain, ha! (when you smash)\nGotta spazz on your main thing, woo! (spazz on your main thing)\nFuck her hard like my main dame, aye! (main dame, aye)\nI'ma smash, I'ma remain, aye!\nThe best that she ever saw, the best that she ever did\nThe best that she ever fucked, the best that she ever kissed\nThe best that she ever sucked, the best thing she ever did (hah!)\nI'ma be the best thing she ever did (hah!)\n\n[Interlude: Young Thug]\nOh!\n(Woo!)\nOh! *sips*\nOw! (I just wanna smash on the first date)\n\n[Verse 2: Young Thug]\nPrince and Michael Jackson on my jacket, Gucci khaki, uh!\nShe bad, I make her badder, dead fresh without a casket, hah!\nHermes on my belt, no no no wrangling, no no ratchet, hey!\nSmith & Wesson Glocky, I'ma keep a fucking ratchet, aye!\nI just wanna smash\nBest thing is that I'm happy, yes\nBuy her everything, make sure she happy, yes (uh)\nRollie, ro-ro-rollie with the Patek, yes (Rollie, yes)\nGot her eatin' out of Nobu, then designer sex (woo!)\nI’m gon’ fuck you like no other, nothing like the rest (woo!)\nI'ma battle with you through everything with no flesh (yeah!)\nIf I promised I’ma marry you, you ain't gotta rush (I'ma ring you!)\nOw!\n\n[Bridge: Young Thug & Sonyae Elise (together)]\nI'ma make sure that you ball with your feet up\n(He gon’ make sure that I ball with my feet up)\nTurn you up, I never lost with your feet up\n(Turn me up, I never lost with my feet up)\nBuy you diamonds, pearls, and lobsters with your feet up\n(Buy me diamonds, pearls, and lobsters with my feet up)\nShe pregnant with my daughter with her feet up\n(She pregnant with your daughter with my feet up)\n\n[Refrain: Young Thug, Sonyae & Both]\nOh yeah... (Hahaha) with your feet up (slime) (Ohhh...)\nHah, aye... (Ohhh) with your feet up (yeah! slime, slime, slime)\nOh, aye... (Ohhh) with your feet up, nigga (slime, slime, slime)\nAye... (Ohhh, with my feet up) (slime, slime, slime) feet up\nOhhh, with my feet up (slime, slime, slime)\nOhhh, I'm with my feet up (yeah! tell'em! slime, slime)\nHelp me out, man, with my feet up (slime, slime, slime)\nWith my feet up (slime, slime, slime)\nFeet up! (feet up!)\n\n[Outro: Sonyae]\nYeah...\nSkrrrrtttt...\nWith my feet up, nigga\nHelp me with my feet up, yeah\nI be riding, riding, riding with my feet up\nThat's my nigga, he gon' make sure that they keep up\nHe gon' make sure that they always gotta catch 'em\nI don't fuck with niggas, we be out there catching, haha\nI be out and I be rolling, rolling with 'em, yeah\nI be gone, gone, boy I'm sipping gin and, uhh\nWith my feet up\nWhat happened? Hahaha", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "1st Date"}]}