{"artist": "Cam’ron", "songs": [{"title": "Come Kill Me", "album": "S.D.E.", "year": "2000-09-19", "image": "https://images.genius.com/61effe5c9676b450f29c101e5563907e.960x960x1.jpg", "lyrics": "[Skit]\nYo Weez wasup man\nYo word man, you hear them niggas man\nThem niggas is pussy man, word man\nWhat happened? What happened?\nYo them niggas is dead man, we gon kill them niggas man\nT-Today, I...\nStraight like that today man\nWe gon murder them niggas man\nAssed out man\nI heard they do they thing though\nSon don't worry about that man, we gon do our thing nigga\nYeah I'm feelin that let's go kill them niggas man\nNo doubt\n\n[Hook]\nYou wanna kill me come and do it I don't give a fuck\nDiplomats live it up, clak, clak, give it up\n\nYo check it out now, uh, yo, yo\n\n[Verse 1]\nYo, subliminal thoughts, 100 Centre Street, criminal court\nPissy drunk up in here, brought in gin to court\nIt's like a biscuit, judging my dick though, case acquitted\nFor this dough I'll do whatever it takes to get it\nSo, chain danglers, are in danger\nWhen I skate with your ice like the Rangers, assume later\nBoss bitch though, goin out like Tomb Raider\nBooth razors, a few blazers, who raised him\nHe speak Eboni-, me and my goddaughter C-Hanni\nCome through with the mean Tommy, ask you if you seen mommy\nAnd she three feet behind me\nWhy my whole life is like the repeat of Gahndi\nMe and G O D, from C O C, like got dough C O D\nA S A P, A S A P\nPlay me, you crazy, and your mother ass fat\nSo I laid her on her stomach bust your brothers on her back\nNever rubber on or cap, I'm a raw specialist\nMake me more devilish, me and my whores never kiss\nThough, motherfucker we was prone to die\nJeff Mob, green top, yo we own inside, motherfucker\n\n[Hook]\nYou wanna kill me come and do it I don't give a fuck\nDiplomats live it up, clak, clak, give it up\nWe gon ball till we fall, gon ride in the five\nKeep pies in our eyes, stay high til we die\nYou wanna kill me come and do it I don't give a fuck\nDiplomats live it up, clak, clak, give it up\nWe keep a clip in our shit, keep a brick on the trip\nKeep a chick in the whip, gettin licked the six\n\n[Verse 2]\nAyo they used to call me \"Work Out\"\nCuz before I brought my work out, I used to work out\nNiggas wanna make deals, na na I want work out\nNow murk out, before you get cursed out\nBangin they fun, same as the sun\nHidin from the church when you slang to the nuns\nChumps come through with giraffe and orangatang guns\nThe very best, you petty theft, you seem soft\nI'm seven judges up in Supreme Court\nMean thoughts all over a teen porch\nWait, don't have to tell you shit\nMatter fact, pat him down, who the hell you wit?\nYo you wack money, wait around all day for pack money\nGet a gold chain talkin bout you got the Ac' money?\nBut everything's gonna to be all right, why\nCause every ring's gonna be all ice and\nYou wanna kill me come and do it I don't give a fuck\nDiplomats live it up, clak, clak, give it up\n\n[Hook]\n\n[Verse 3]\nThis nigga with the ice mug stuntin? [He won't bust nothing]\nYo, talkin bout he gon' touch somethin [He won't bust nothing]\nYo sayin that he too much frontin [He won't bust nothing]\nYo, he just a fake thug bluffin [He won't bust nothing]\nAnd his man with the ice grill frontin [He won't kill nothing]\nYo, he outside with the mil frontin [He won't kill nothing]\nTalkin bout he some real somethin [He won't kill nothing]\nSayin yo I'mma kill something! [He won't kill nothing]\nNot a collecter of Picasso, but everybody in my scepter got dough\nNeglect a rock row, go to charve and not dough ho\nHector, Camacho, mi amigo rockin in the Saab bitch\nMarksmen in the mob, and Cam know it\nThat's why I keep the BLAM BLAM loaded\nClub grand open, next week we grand close it, come and kill me\n\nGet the fuck outta here! This shit is fuckin closed!\nGet the fuck outta here motherfucker I'll kill you!\n\n[Hook]"}]}