{"artist": "Pras", "songs": [{"album": "Ghetto Supastar", "title": "Wha’ What Wha’ What", "image": "https://images.genius.com/cf6a65fdae367a2af61e2514cba1f7cf.500x500x1.jpg", "lyrics": "[Pras]\nUh, yeah, huh, yeah\nYo, yo, yo, I'll do a double dish cleaner\nThe funny ass cats remind me of a skinner\nNow you listen up, now what, heat on spitter\nA renegade with my blade watch you get cut up\nSucker ass punk, you used to get beat up\nType of dude that'll smoke your weed up and eat up\nHold up, surrender your squad, it's a stick up\nFifty-two pickup, you high school drop-out, gives you enough float\nTo succeed or get tighter, what up, your block, get up\nShut up, or put up I'ma bout to let up\nLicky, licky here, two shots you gone lick up\nTake her to the news under: You should've eased up\nWha' What Wha' you got me fed up, get up or shut the f up\nYou done f'ed up, 8 or 9 enough even if she has seven runner up\nLike the fans, like your thumbs up, what up?\nI make them bowl like Shopper Ranks\nI'm the Captain of the Ship, make them cats walk the plank\nWhat the f you think I'm point, point blank\nTurn off my sound niggas, let... crank\n\n(Chorus w/variations)\nEast Side where you at, where you at?\nWest Side throw it up, throw it up\nNorth Side where you at, where you at?\nSouth Side throw it up, throw it up\n\nSee, blaze me above the game with no limit\nNiggas nowadays can slick and pull gimmicks\nCowber use roly well iced that been in it\nMines is loose rocks and the Beverly spin in it\nOnly place tin linid they cost a lot\nWhen no money on the game you sure talk a lot\nNever like a nigga car, you walk a lot\nSee I make cream a lot, while you niggas dream a lot\nCan't you see it's all real, bras want to do me\nGet it attached to me like I'm starrin in movies\nNigga Nor wanna do me, thing is I got none\nWanna be my main chick, chill I got one\nIf it's hot in a lady then I can cop some\nMost players all fall, tightly tint\nSee me fly through the window cause it's lightly tint\nBut its strongly minute got a fall so cats frequent\nHate weed peepin, best cats seekin\nWanna kill me in the daytime, look it won't happen\nYou ain't a thug nigga this is some girls is rap, what\n(Yeah you don't won't no problem)\n\n(Chorus w/variations)\nEast Side where you at, where you at?\nWest Side throw it up, throw it up\nNorth Side where you at, where you at?\nSouth Side throw it up, throw it up\n\nYo my M-O is S-O-L-O... hello\nShake like Jello bionics and nice fellow\nLong hair, pussy's and pussy head too\nIn a room with the doctor, how the hell I stop ya?\nThe Rolex topper long as ya coppin them yo\nIt means it's copper, don't need to stop ya\nWhen I'm speakin opera, which y'all don't understand\nThat it's my channel Boo-Bionic mister man\nWhy y'all play Tennis we sway inventists\nSo our house can finish, wait a minute\nChange the color of my whips, despite you bastards\nSpit it green-cold on it, like you won the masters\nFlow... faster, speed it up, heat it up why don't y'all just heat it up\nSpit it on some feeder bust, slow it up, make the beat that we blow it up\nYa niggas ain't mine, better pray you throw it up\n\n(Chorus w/variations)\nEast Side where you at, where you at?\nWest Side throw it up, throw it up\nNorth Side where you at, where you at?\nSouth Side throw it up, throw it up\nNow...\n\n(Pras)\nYo I keep my mind on my riches snitches get snitches\nCats on the low they all act like bitches\nSo what up, where you at with the nine-sin?\nFeel my triples please circle the violence\nLet me abolish this sh... like Nat Turner\nDrop by Tom Warner, peace to my crooked cop killers\nWith the six shooter while fake niggas getting drunk off of wine coolers\nYo, uh...\n\nYo she big on the game it's broke I wanna fix it\nMake hot... and get that down, we remix it\nHe speakin, here we go your beef is nice\nI'm from the gutter mother... best you think twice\nNow back to who's nice M-O-S-T-W-A-N-T-E-D\nYou niggas can't see me I'm glad that you turn\nPoke that out of space shit, I bring you back to Earth, what\n\n(Chorus w/ varaiations)\nEast Side where you at, where you at?\nWest Side throw it up, throw it up\nNorth Side where you at, where you at?\nSouth Side throw it up, throw it up\nEast Side where you at, where you at?\nWest Side throw it up, throw it up\nNorth Side where you at, where you at?\nSouth Side throw it up, throw it up\n\n(*Wha, Wha, Wha... echoes*)", "year": "1998-10-03"}]}