{"artist": "Ice-T", "songs": [{"title": "Pimp Behind the Wheels", "lyrics": "[Intro: Ice-T Talking]\nYo, shut up! This is Ice motherfuckin' T\nAnd I've been listenin' to a lot of DJ's get on the mic\nAnd try to get busy you know what I'm sayin'?\nBut can't no DJ get wrecked like my motherfuckin' nigga Evil-E\nSo right about now I'ma give you the motherfuckin' microphone\nI'ma get behind the wheels, and we gonna do this\nYo Evil, tell where the fuck it's comin' from\n\n[Verse 1: Evil-E]\nIt's comin' from the mouth of the pimp behind the wheels\nI make a bitch kneel, Evil E the great steel\nShows, hoes, junior pimp, spread out punk\nSo I can give your bitch the Evil-E junk\nI love you honey, shit listen up, listen clear\nAfter the show, yo ho hit the rear \"yeah\"\nBackstage pass, lick, stick tight on her right tit\nMy hotel, get lit, grab that ass and then hit \"hit\"\nHard, movin' walls, security will be knockin'\nWhile Evil E's rockin', Charlie Jam is tri-blockin'\nI'm a fuckin' mack that comes up by playin' the back\nAsk my nigga Alphie, Sean E. Sean and Sean E. Mack\n\n[Hook]\nE cuts the records and the yellow nigga gets loose\nE cuts the records and the yellow nigga gets loose\n\n[Ice-T] Yo E, tell them who the fuck you are\n[Evil-E] Yeah nigga I'm the pimp behind the wheels\n[Ice-T] Yo, man I don't think they heard you man\nI don't think the fuck they heard you man\n[Evil-E] Ay bitch, I'm the pimp behind the wheels\n[Ice-T] You the pimp behind the wheels right?\nThe pimp behind the wheels\n[Evil-E] That's right I'm the pimp behind the wheels\n[Ice-T] Yo jump off\n[Evil-E] Yo check this motherfuckin' shit out\n\n[Verse 2: Evil-E]\nSkin-hitter, no-quitter, I'll fuck your baby sitter\nQuickly get rid of airhead bitches that's bitter \"yeah\"\nI'm all that, fuck you if you don't think so\nTake your moms, make that bitch my main ho \"hah\"\nLet's go, let's go, let's go, showtime\nBelow the Syndicate sign while my nigga kick the dope rhyme \"yeah\"\nThat ass, yep, that's what I'm peepin'\nNiggas never sleepin', Evil-E I get deep in\nSome ass make you fatal, yo that's pimpin'\nNew city, new titty, Evil-E never be simpin' \"yeah\"\nDown with the Syndicate rippin' shit up at will\nMy yellow nigga Ice\nAnd I'm the pimp behind the wheels\n\n[Hook]\nE cuts the records and the yellow nigga gets loose\nE cuts the records and the yellow nigga gets loose\n\n[Ice-T] Yo jump off E, get busy dude\n[Evil-E] That's right, I'm the pimp behind the wheels\n[Ice-T] I don't think they hear you nigga\nI don't think they hear you\n[Evil-E] Yeah nigga, I'm the pimp behind the wheels\n[Ice-T] Motherfuckin' pimp behind the wheels, yeah\n[Evil-E] That's right, I'm the pimp behind the wheels\nYo Ice, break it down like this\n\n[Scratches]\nEvil-E my nigga dogs the wax\nThat's how I like to do work\n\n[Break: Evil-E Talking]\nYeeeeeeeeeeah nigga\nYo B, cut that shit up properly\nY'all never seen a MC cut shit up, right?\nMy motherfuckin' nigga\nWell check this shit out\n\n[Verse 3: Evil-E]\nEvil-E, the nigga that always gives a fuck\nAbout gettin' sucked, clockin' crazy bucks\nFuck your fine hazenoes, all it takes is a second \"second\"\nSyndicate weapon Evil-E and I'm kept in the background\nSupplyin' the sounds on stage\nCops in a rage that's why we always on the front page\nRippin' shit up, me and my yellow nigga\nThe mic is the gat and the wheels is the trigger\nGrab a hazeno in every every city that I rip \"rip\"\nGot crazy dollars cause I always keep a grip \"grip\"\nGet down with the Syndicate rippin' shit up at will\nMy yellow nigga Ice \"and who are you\"\nAnd I'm the pimp behind the wheels....\n\n[Hook]\nE cuts the records and the yellow nigga gets loose\nE cuts the records and the yellow nigga gets loose\n\n[Ice-T] Niggas don't know man, niggas don't know\n[Evil-E] Yeah nigga, I'm the pimp behind the wheels\n[Ice-T] Niggas can't hear you motherfucker\n[Evil-E] Yeah, the pimp behind the wheels\n[Ice-T] Niggas don't understand the level of this game baby\n[Evil-E] Ice is down with the pimp behind the wheels\n[Ice-T] Niggas, niggas can't deal with this shit\n[Evil-E] Ammo Dump's with the pimp behind the wheels\n[Ice-T] Awww yeah\n[Evil-E] LP's with the pimp behind the wheels\nBody Count's with the pimp behind the wheels\nThe Syndicate is with the pimp behind the wheels\nHen-Gee is with the pimp behind the wheels\n[Ice-T] Pimp behind the wheels, yeah\n[Evil-E] That's right motherfucker, 1993 style Home Invasion\nDedicating this shit to all the DJ's in the motherfuckin' world\n[Ice-T] This shit is fly E\n[Evil-E] And peace to all MC's in the world\nMy nigga Ice on the wheels of steel, you know what I'm sayin'\nTo all the hazenoes I ripped nationwide\n[Ice-T] Shit makes you wanna hold your nuts\n[Evil-E] You know what I'm sayin\n[Ice-T] ...when you're boppin' your head to this shit right here\n[Evil-E] And I'm outta this motherfucker\n[Ice-T] Shits kinda fly, pimp shit, Evil-E style\nAll the virgins thanks for nothing!\nWhat you know about this DJing here E?\nYeah, that's for all the DJ's out there\nY'all can suck my dick too, twice\n[Evil-E] I'm the pimp behind the wheels\nYeah I'm dedicatin' this record to all the DJ's in the entire motherfuckin' world\nThat's down with the Evil-E and my yellow nigga\n[Ice-T] That's me, ho\n[Evil-E] Peace to all the MC's in the house\nAnd peace to all the hazenoes all over the world\n[Ice-T] Yo E I think I'm hittin' a seminar in a DJ competition\n[Evil-E] And Evil-E is the fuck outta here", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}