{"songs": [{"image": "https://images.genius.com/b18964ef5b69e49e31ce590e8ed6ecd5.1000x1000x1.jpg", "lyrics": "[Intro]\nAyy, bitch, ayy, bitch\nAyy, wait, ayy, ayy\nRun it back, hey, ooh, ayy\nOoh, ooh, ayy, ayy\nThanks Ugly God!\n\n[Chorus]\nStop smoking Black & Milds bitch you nasty\nHow you smoking Blacks but actin' like you classy?\nWhy you smoking Blacks? Bitch you unattractive\nStop smoking Black & Milds, ho you trashy\n\n[Verse 1]\nStop smoking Black & Milds, with your country ass\nYou got shit around your mouth, with your crusty ass\nYou need to go and take a bath, with your musty ass\nYou need to scrub between your ass, with your dusty ass\nBitch your house got roaches, I ain't going, bitch I can't\nLast time we spoke, I smelled your breath, it made me faint\nBitch I hopped up in your Honda Civic, all I smelled was paint\nI waited 30 minutes for a jump so we could crank\nYou can't smoke no Black & Milds and be a fan of me\nThat ain't your hair I know its weave, bitch stop playing with me\nI heard your mama kicked you out, bitch you ain't staying with me\nWe coolin' now, but bitch in public you ain't friends with me\nBitch your Honda struggling with them dents all in the back\nYou can hit that head, but I won't let you hit no black\nYou ain't classy, you ain't shit, but a hood bitch\nWhy you spent your last dollar on that wood tip?\n\n[Chorus]\nStop smoking Black & Milds bitch you nasty\nHow you smoking Blacks but actin' like you classy?\nWhy you smoking Blacks? Bitch you unattractive\nStop smoking Black & Milds, ho you trashy\n\n[Verse 2]\nHeard the whole hood hit you from the back\nI heard the hood ran a train on your track (choo choo)\nI heard your daughter's only toy was a jump rope (yup)\nThat's the black bitch, stop flexin' like that's blunt smoke\n\n[Outro]\nAyy, stop smoking Black & Milds bitch\nAyy, stop smoking Black & Milds bitch\nAyy, stop smoking Black & Milds bitch\nAyy, stop smoking Black & Milds bitch", "title": "Stop Smoking Black & Milds", "year": "2017-08-04", "album": "The Booty Tape"}], "artist": "Ugly God"}