{"artist": "Apathy", "songs": [{"title": "Fear Itself", "image": "https://images.genius.com/073ac226410c8abcffb60094f9a7e61b.700x700x1.jpg", "album": "Honkey Kong", "lyrics": "[Intro: Clip from Excalibur]\n\nMerlin: What are you afraid of?\nArthur: I don’t know\nMerlin: Shall I tell you what’s out there?\nArthur: Yes, please\nMerlin: A beast of such power that if you were to see it whole and all complete in a single glance, it would burn you to cinders\nArthur: Where is it?\nMerlin: It is everywhere! It is everything! Its roar is heard in the wind! And its forked tongue strikes like… bright\n\n[Verse 1]\nKings fitted on, like I’m D-O-C\nDeadly on the mic, demi G-O-D\nBorn in a forest, raised by the wolves\nWalk amongst sheep rocking their wool\nSpeaking in tongues, well allow me to translate\nA secret society, just look at our handshakes\nHoodies on our head, dressed in all black\nSymbols on our rings and a pocket full of crack\nCameras on a street corner like a camcorder\nDip quicker than a Star Trek transporter\nThis is life on the bottom of the barrel of the belly of the beast\nOn the brutalist of blocks in the borough\nIn the East where I’m from Connecticut’s a wasteland\nChased by the devil, keep the metal in your waistband\nAnd we powerful as Kennedys\nMarch in a single-file line like centipedes\nIn Cape Cod to escape the commotion\nLate night yacht trips, bodies in the ocean\nA 40 ounce full of potion\nWe move by full moon light in slow motion\n\n[Interlude]\n\nThe only thing we have to fear is fear itself\n\nSo run for the hills, scream for help\nAin’t nothing to fear but fear itself\nSo run for the hills, scream for help\nAin’t nothing to fear but fear itself\n\nSo run for the hills motherfucker (fear itself)\nSo run for the hills motherfucker (fear itself)\nSo run for the hills motherfucker (fear itself)\nSo run for the hills motherfucker (fear itself)\n\n[Verse 2]\n\nWe on that cracker-ass shit, hoods and bank robbers\nSwitching up kicks quicker than Mr. Rogers\nSweater on my back dressed like a senator\nI’m Chris Hansen about to catch a predator\nNewport mansion peeking through your window\nJob at a country club just for the info\nDeep in the woods in a circle like a pagan\nA young caucasian studying Ronald Reagan\nSo we speak Latin fluently\nDrink OE cause I love it what it do to me\nFuck around, get a beat down brutally\nI’m like Judas, I’ll stab you for jewellery\nOG, ain’t a damn thing new to me\nPharaoh with a harem of hoes who love nudity\nRhymes designed in barbarian time\nCheck my crops, it’s all alien signs\nBelt buckle with the Masonic math\nBlack Starter Raider jacket, an addict to witchcraft\nI’m the Uzi carrier, groupie burying\nPass passwords to a secret librarian (shh)\nAccess to the Vatican scriptures\nWe posing for pictures with fingers on triggers\nAnd candle in cyphers, we tunnel under Rikers\nTo break out my brothers and them Outlaw bikers\nWe the righteous\n\n[Outro]\n\nScream for help, ain’t nothing to fear but fear itself\nSo run for the hills, scream for help\nAin’t nothing to fear but fear itself\n\nSo run for the hills motherfucker (fear itself)\nSo run for the hills motherfucker (fear itself)\nSo run for the hills motherfucker (fear itself)\nSo run for the hills motherfucker (fear itself)", "year": null}]}