{"artist": "Bankroll Fresh", "songs": [{"lyrics": "[Intro]\nThis street money nigga\nWho the fuck is this\nAy, this Bankroll nigga\n\n[Verse 1]\nYou ain't never seen this shit coming in a million years\nYoung nigga balling hard, nigga look at my career\nFuck how y'all niggas feel, fuck how  y'all nigga live\nI been doing this shit for real, I been doing it before a deal\nFuck a record deal, fuck a label, we is the label\nI'mma treat 'em right now on the kitchen fucking table\nCounting all this dough, WOOO, WOO, they love the name (WOO)\nIt's a good evening, WOOOO, shawty name\nThese bitches ain't 'bout shit, these niggas ain't either\nTold me I was gon' make it, fuck my 12th grade teacher\nThey ain't teaching me shit, you ain't teach me, bitch\nI'm going all the way in, this as real as it get\nReal as it is, you niggas ain't did years\nY'all niggas ain't shedding my tears, you niggas ain't live how I live\nI ain't had to face no fears, cause fear only is God\nAsk God 'bout who he is, and this is real as it was (fresh)\n\n[Hook]\nReal as it gon' get, the realest it gon' be\nFuck how y'all niggas feel, I'm being me\nRealest it gon' be, the realest it was\nNigga I been popping in the street, been had a buzz\nNever had no plug, I never had no plug\nGrinded out the mud, grinded out the mud\nGrinded out the mud, I never had no plug\nNever had no plug, I grinded out the mud\n\n[Verse 2]\nGrinded out the mud, I never had no plug\nKeep it real my niggas, nigga that's just because\nDrowning in a drought, working out the house\nAK on the floor, a birdie in the couch\nIn and out, in and out, in and out\nBacking in, bad bitches coming in\nCome here baby girl, whatcha wanna spend?\nOh, you nigga sent you this time?\nHear you wanna pay his tab?\nGuess who I'mma shoulder on a half, gimme that cash\nRealest shit, the realest in, it's Bankroll nigga\nAnd I'm balling out on all these stank hoes, nigga\nOh, you wanna give me some pussy cause my sauce buzz?\nHahaha, bitch you say you love me?\nRealest it gon' get, the realest it gon' get\nI'm about Bentley, Lamborghini sex\nOwn three of them on the same day\nCause I ain't had shit, nigga, and it made me\n\n[Hook]\nReal as it gon' get, the realest it gon' be\nFuck how y'all niggas feel, I'm being me\nRealest it gon' be, the realest it was\nNigga I been popping in the street, been had a buzz\nNever had no plug, I never had no plug\nGrinded out the mud, grinded out the mud\nGrinded out the mud, I never had no plug\nNever had no plug, I grinded out the mud", "image": "https://images.genius.com/10680bbd40b794ad811668d3a0820364.500x500x1.jpg", "year": null, "title": "Out Da Mudd", "album": "Life Of A Hot Boy"}]}