{"artist": "Young Thug", "songs": [{"year": "2019-04-27", "lyrics": "[Intro]\nWheezy outta here!\n\n[Chorus: Young Thug]\nShe want Chanel, go get it\nShe want Chanel, go get it\nShe want this Fendi, go get it\nShe want a Birkin, go get it\nShe want this Gucci, she can get it\nShe want this Louis, go get it\nLoubs with the spikes, she get it\nEverything I got, she gettin' it, yeah\nBentley sedan, she get it\nHop out the Benz, she gettin' it\nHop out the Lamb, she gettin' it\nThe Porsche Cayenne, she gettin' it\nHop out the coupe, she get it\nAshanti the shoes, she get it\nI put my kids on her titty\nAnything she want she can get it\n\n[Verse: Lil Uzi Vert]\nYeah! Woo! (pew, pew, pew, pew)\nShe want Chanel, let's get it (let's go!)\nShe want Chanel, let's get it (let's get it!)\nShe want Chanel, let's get it (let's get it, let's get it!)\nChanel cost more than a Honda Civic (huh?)\nBaby tell me are you serious, yeah (what?)\nThese drugs got me so on delirious (yuh!)\nBaby, you wet like Aquarius (yeah)\nI'm a Leo baby you Aquarius\nI took his bitch I’m not sharing\nShe fuck my side bitch she bi-curious\nNot no iPhone, let you know that I'm serious\nC-H to A-N to E-L\nOff-White on me it combine with the Vuitton\nShe told that she want some Fendi\nNo we do not rock that got Gucci on three times (three times)\nMy Gucci shirt don't got no \"i\"\nJust like the pussy we spread that shit real wide (gyah!)\nMe and Thugger we get too fly\nHundred bands on me Jumpman with the squola\nSilent ones hop by you two times\nTaking this acid boy I done lost my mind\nI'm a plant so this green is in my vines\nWouldn't tell you what I would do for my slimes\n\n[Chorus: Young Thug & Lil Uzi Vert]\nShe want Chanel, go get it\nShe want Chanel, go get it (Yeah! Yeah!)\nShe want this Fendi, go get it\nShe want a Birkin, go get it\nShe want this Gucci, she can get it\nShe want this Louis, go get it\nLoubs with the spikes, she get it\nEverything I got, she gettin' it, yeah\nBentley sedan, she get it\nHop out the Benz, she gettin' it\nHop out the Lamb, she gettin' it\nThe Porsche Cayenne, she gettin' it\nHop out the coupe, she get it\nAshanti the shoes, she get it\nI put my kids on her titty\nAnything she want she can get it", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Chanel (Go Get It) [Demo 1]"}]}