{"songs": [{"year": "2016-02-09", "album": null, "image": "https://images.genius.com/69973bcd03a17ffe91d2a010ed663c60.434x435x1.png", "title": "Freeway Ricky", "lyrics": "[Intro]\nWhen I think I'm the perfect one for this job that needs to be done because I mean, if you haven’t lived this life, it's like an experiment\nYou know, my life has been an experiment and had I not been through this experiment then I wouldn't know what happened\nYou know, most people don’t know what happened in the south east. They don't know how you get started selling drugs, they don't know how you get out of selling drugs\nThey don't know how you can go from being illiterate, at 28 years old, to being as literate as I am now. You know, basically I do law work. You know, like I said, I'm filing my paperwork today in my lawsuit.-Freeway Rick Ross\n\n[Verse 1]\nGet a sense of the pain tho'\nAny idea what the fuck that it really feel like\nThe infiltration and destruction of communities of colors\nTurn 'em into users, consuming, constantly covet\nAccustomed to coming up short, of course, when the rent is due\nDealing with inequalities, lower personal standards\nIndecent conditions for living, limited opportunities\nInsist for something better than what the fuck you were given\nLike public housing and government assistance\nA victim of circumstances\nNo silver spoon in your mouth\nOr a father inside the house\nIt ain't a stereotype when your life is like a statistic\nAttempted to do it legally, ain’t nobody that’s hiring\nCustomer service, minimum wages never inspire\nI'm tired of feeling affected, the product of this environment\nWhere violence ain’t a vice, it's an intricatal part of life\nWell the fit and strong will survive but the meek, we seem to struggle\nA plan to keep us in poverty\nNiggas don't ever vote so we see political policies\nSet in place for injustice\nFor judge and [?]\nAnd galavant with the D.A\nUncontrollable hypocrites, disenfranchising people that plead for equal equality\nLawlessly laying sentences, send 'em somewhere to suffer in a silent cell of seclusion\nAssume a [?] they giving with darker pigment\nPetition for peace, I feel I can’t breathe\nI am swimming in the deep\nAnd they giving badges to killers\nElected officials with bills that passing inside of Congress\n[?] cause hysteria, aiming at the incompetent\nA lack of education and knowledge, that's what the problem is\nStop and frisk but the reason is biased\nIt's off of ignorance, fear of someone that's different\nJudging off of appearance\nLike I know that nigga rolling with a pocket full of stones\nHe headed home alone, [?] attire he was wearing\nApparent police will profile\nThis ain't the Land of the Free, there's a fee\nAin't no where to flee from the scene I set, it's obscene\nIt's insane, we're seeing the same amount of hatred distributed to minorities\nBut most importantly these legal homicides committed by these people but they supposed to serve and protect\nIt's incorrect or [?] as I strategize for the rise\nHate [?] lies\nWe're witnessing genocide\n\n[Outro]\nI believe that they felt it was more valuable, to sacrifice, a particular sector, sector of America, and a race of people in America, in order to save the whole country. -Freeway Rick Ross"}], "artist": "K.A.A.N."}