{"songs": [{"title": "I Can’t Lie", "album": "Free Crack III", "year": "2015-11-27", "image": "https://images.genius.com/7e3e0fd0f795c92d1ea99308257f6793.800x800x1.jpg", "lyrics": "[Verse 1]\nYoung nigga spent every day up in the streets\nI ain't for the beef, I was out here tryna eat\nUsed to walk around with eight grams in my briefs\nNow I'm on planes, getting change overseas\nAll I had to do is use my brain and believe\nThink it's time to give the rap game what it need\nDo this for the city, I'm the one they let speak\nI'm the one that's giving all the game for the free\nDo this for the real niggas just like me\nMan if I get shot, is it Heaven for a G?\nHeavy in the streets, lot of threats sent at me\nSo I ride around, MAC-11 on the seat\nWon't they let a nigga be\nMade it out the streets, I'm a god, I'm a chief\nYeah, real talk I'm something else\nDoing all this shit with no help, real nigga what's up?\n\n[Hook]\nI won't lie, I can't lie\nBe in the street, put my life on the line\nI won't lie, I can't lie\nI won't lie, I can't lie\nI won't lie, I can't lie\nStill ride around with my gun on my side\nI won't lie, I can't lie\nI won't lie, I can't lie\n\n[Verse 2]\nI swear to all gods rap changed my life\nLuke told me, \"Go hard,\" he ain't have to say it twice\nGet a nigga murked, let me think, what's your price?\nGive my boys the word, they'll do the shit tonight\nAnd I got the shit locked\nWhoever thought I'd be headed to the top?\n‘Cause I swore I'd be caught by the cops\nEither that or probably get shot\nGotta watch your back ‘cause there's niggas like dissin'\nHeard you got the juice, now them boys out there pitchin'\nBeen around the world, now I see the bigger picture\nFeeling like Hova, Biggie or Mystik\nSoon as you make it, niggas gon' hate it\nWhen they see success niggas don't know how to take it\nYou just turned from nothing into something in they faces\nNow them niggas plotting on your money, tryna take it\nNigga, it's real\n\n[Hook]\nI won't lie, I can't lie\nBeen in the street, put my life on the line\nI won't lie, I can't lie\nI won't lie, I can't lie\nI won't lie, I can't lie\nStill ride around with my gun on my side\nI won't lie, I can't lie\nI won't lie, I can't lie"}], "artist": "Lil Bibby"}