{"songs": [{"album": "Stoic", "image": "https://images.genius.com/815db944cfd1552de023107589d7e376.1000x1000x1.jpg", "year": null, "title": "Going Off", "lyrics": "Man my shit be going off!\nPizzle!\n\n[Hook]\nMan my shit be going off!\nSuper early in the morning, I never felt so motherfucking important\nMan my shit be going off!\nEverybody wanna see me, they call me, and they text me, then they tweet me\nMan my shit be going off!\nWhat it do? Where you at? I’m coming through\nMan my shit be going off!\nI tell them not to bother me, don’t bother me, instead they calling me and calling me\nMan my shit be going off!\n\n[Verse : T-Pain]\n7:45 on a weekday\nI can rent a G5 with a week's pay\nI be dizzy, I be stressing\nLeave a message with my butlers: Benjamin or Felípe\nIf I ain’t got your number locked in\nYou can be expecting a text that say \"WHO DIS?\"\nAnd we’re about to make this party rock shit\nPut your name and your e-mail in this bitch and let's DO THIS!\nMan my shit be going off a lil' bit\nTexting me 911, I ain’t no officer bitch!\nSaw a picture in my contact she offer the dick\nIf I don’t feel like talking she get a cough like I’m sick (cough)\n\"You sleep boy?\nYou tired? You need something to eat, boy?\"\nYou know how much this data plan cost!?\nI guess it cost to be the boss\n\n[Hook]\n\n[Verse : T-Pain]\nMan I lost my phone a couple days ago\nNo contacts I lost like 80 hoes\nWay to go\nBut I'm just waiting on the right call by nightfall I'ma get me some fellatio\nFuck the ratio, I got my cellphone\nAin't no hoes in here, I take my ass home\nI be waiting on it\nI keep them Androids hating on me. Team Apple!\nThey say the blacker the berry\nBBMing bitches tell them start packing for Paris\nWe gon' be there for a while, how many bags can you carry?\nOr just throw 'em in the back of the Chevy\nDon't even try to call me unknown\nThat's how you get hung up on\nThat number better come across\nEspecially if you trying to call a boss\n\n[Hook]\n\n[Verse : Big K.R.I.T.]\nOff the chain, off the Richter, off the scale\nOff the meter when a diva dyin' to meet me, hit my cell\nOn the regular my cellular be jumping like a trap house\nEven since I bought a crib and brung the 'Lac out\nThey act out but now I'm falling through to blow their back out\nText me, don't address me when I got this cash out\nCall it how you want it but not collect\nI don't stress over pity texts, I'm about this check\nIn the meantime I'ma scream down, chopper blaze\nLeave your number at the beep cause I'm probably getting paid\nPistol on this plate, you can be about it, I never read about it\nMost of these haters do me favors when they tweet about it\nHating on the blog cause they broads love my music\nAsking for a follow just to DM that they choosing\nThen I hit 'em with the digits just to keep 'em flip and moving\nMy cellphone 808 booming\n\n[Hook]"}], "artist": "T-Pain"}