{"songs": [{"title": "Came to party", "album": null, "lyrics": "Paroles de la chanson Came To Party :\n(feat. Eminem, Jayo Felony, Niqle Nut, Sun, Tip Toe, Village Boo)\n\n[Sun:]\nLight up that marijuana\nPass me the bomb\nFill up my cup\nFill it up with Patron\nSun\n\n[Verse 1: Sun]\nWe just came to party\nAnd I'm feelin' good\nI got the Remy for any women that's feeling loose\nYour man grillin' and he just up on my tennis shoes\nI think we met, we gettin' checks like [? ]\nYou see her shinin' with diamonds, glass, a swimmin' pool\nAll the women drool, when they see the linen jewels\nThe way you drifted by, it really got me in the mood\nTake me to the room and blow me up like a inner clue\n\n[Village Boo:]\nI just came to party\nPulled up\nIn my old school, with the naughty\nValet park\nMy shit, next to 40's\nTip Toe\nIn the Coup, he look sporty (He ridin' three piece)\nAnd I'm tryin' to leave tonight, with at least three freaks\nHit the room, you know, until I skeet, skeet\nI hope these clowns in here ain't tryin' to start beef\nCause that'll be the reason that niggas kickin' your front teeth\n\n[Refrain: Eminem]\nWe just came to party\nWe ain't comin' hear to\nStart shit with nobody\nGirl, we just wanna see ya\nWork that, work that, body\nWith ya man lookin' like\nHe, can murk somebody\nWe just sipped a little\nBit too much Bacardi\nHe done tripped into this\nCup, and spilt it on me\nNow, he's startin' on some\nShit, this with the naughty\nHe's about to get the\nShit, kicked, [? ] out of him\n\n[Verse 2: Tip Toe]\nI don't got no time for these niggas that's playing games\nI don't take it as a diss unless you sayin' my name\nI'm a bad influence, I smoke weed in front of kids\nI crack a bottle open and ask 'em\nIf they wanna swig\nI'm the bad guy that touched your wife\nTip Toe ain't nothin' nice\nI rob Benz and still sport a gang of ice\nWe gettin' money, we ain't trippin' off you hoe niggas\nCause if we want you, we'll come show up at your show, niggas\n\n[Jayo Felony:]\nHe 'bout to get the\nShit kicked the fucked out of 'em\nThey call me\nOnce y'all killin', the Crips is lovin' 'em\nI split his fuckin'\nHead for the pushin' and shovin' 'em\nSo crazy\nI harass and embarrass him in public 'em\nJust sayin'\nHit a stick that get a guerilla pissin' me with that is Crip\nI could get sick as I wanna get, cause you know I'm the shit\nNever sound like an amateur, I damage niggas' brains\nThis buster\nCame to be a party pooper, I'm insane\n\n[Refrain]\n\n[Verse 3: Niqle Nut]\nGot a couple of handguns, feel like my block is ready\nAnd I'm livin' it Thug Life, like I was Makaveli and\nNigga, this Zoo Life, nigga, I ride for it\nI'll die for it and do federal time for it\nI'm a Inglewood nigga, just have it at any brother\nI ain't started gangbangin' because of my favorite color\nI done flip the whole brick\nI'm flippin' this cocaine\nGot socas in line, dancin' like it's Soul Train\n\n[40 Glocc:]\nThe party don't pop off, unless we pop up in it\nIf the drama jump off, the first to dive up in it\nInfamous G on it, baby, Shady, Aftermath\nI done started my own shit, some life about to crack\nBloods and Crips, they love me (I get my point across)\nBang on the nigga that's phony ([? ] sauce)\nPick up the phone with the police\nAnd he was tryin' to kick it, but nigga's got cold feet\nYAH!\n\n[Refrain x2]\n[40 Glocc:]\nZOO LIFE!\nINFAMOUS!\nG-UNIT!\nSHADY!\nAFTERMATH!\nBIOTCH!", "image": "https://images.genius.com/984165ebf38d211cd40e67d66d852a1a.300x300x1.png", "year": null}], "artist": "40 Glocc"}