{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "The Bumpy Johnson Album", "title": "Stronger", "image": "https://images.genius.com/05b40ef764ca6b43a79611a79d90bd0f.500x500x1.jpg", "lyrics": "[Chorus: Nina Simone & Prodigy]\nStrong enough to take the pain (Uh-huh)\nInflicted again (And again and again and again) and again\nWhat do they call me? (Know my name, bitch)\nMy name is Str-Strong (Uh-huh)\nStrong (Yeah, ayo)\n\n[Verse 1]\nThe moonlight shines on the New York skyline\nMidtown is lit up, the city is mine\nAs I drive across Queensbridge, I see it clearly\nFrom my P.O.V. (What do they), this is fact not theory\nYeah, that rapper got money\nBut that rapper can't walk through this concrete jungle 'cause he doin' it wrong\nNew York belongs to Don P\nYou could have the rest of the world, I'm good (Strong) with these streets\nSkyscrapers and housin' buildings\nI know about London but I prefer Brooklyn\nI know about Marseilles but I prefer Queens\nAnd while you hire cops (What do they), I prefer my team\nI got a powerful army, it's no need for a gun\nYou want hardcore rap? You fuckin with the right one\nThis is maximum strength, there's no need for drugs\nYou want reality rap, homie, you got the right one\nI'm\n\n[Chorus: Nina Simone & Prodigy]\nStrong enough to take the pain\nInflicted again and again\nWhat do they call me?\nMy name is Str-Strong, (You know what?) Strong\n\n[Verse 2]\nMaybe once every tangerine moon I'll be in the mood to paint the town red with your corpuscles\nAnd plasma, some violent art\nThese thoughts in the corners (What do they) of my mind are dark\nBut then the Times Square lights, they switch my whole attitude\nReminds me of billions, that loot\nI must persist, I must pursue\nThe rest of my success (Strong), I am not through\nThey tried to put my run to an end\nBut as sure as the point on the state buildin'\nI stand tall, wipe the dirt off my clothes when I fall down (What do they), I'm way too strong\nThis is my town, my subways and sidewalks\nI done ran through these gutters like a tunnel rat, pah'\nWaist deep, inside of the shit\nIn the midst of the action where people get hit, look\n\n[Chorus: Nina Simone]\nStrong enough to take the pain\nInflicted again and again\nWhat do they call me?\nMy name is Str-Strong, Strong\n\n[Prodigy]\nYeah\nYou ain't never been touched means you don't participate\nWithin the fuckery, you stay comfortably distant, from pain infliction\nMeanwhile I'm (What do they) flirtin' with Death\nShe put her lipstick on the collar of my shirt, next to my jugular\nI ain't tryin' to keep her, I just wanna fuck her\nWhen I pass through I'm too committed to life\nShe a bitch but I love her refuse to (Strong) part from her\nI'm destiny's child, I survived it all\nThe most high got a special plan just for me\nMy table is set,with cake for days\nI'm a lil' bit late but (What do they) it's okay\nMy future's so bright that I gotta wear shades\nI follow in the footsteps of LL Cool J\n50 and P. Diddy, my relentless drive\nTo thrive and prosper, made (Strong) me\n\n[Chorus: Nina Simone]\nStrong enough to take the pain\nInflicted again, and again\nWhat do they call me?\nMy name, is Str-Strong, Strong\nWhat do they\nStrong", "year": "2011-04-19"}]}