{"artist": "Fat Joe", "songs": [{"year": "2007-06-12", "album": "We the Best", "image": "https://images.genius.com/b5bab17504ed8e5f31199214ee062e10.700x700x1.jpg", "lyrics": "[Intro: R. Kelly, Fat Joe, Lil Wayne & DJ Khaled]\nWoo! Roxanne! It's Kells bitches (owwwww!)\nYou don't have to turn off the red light\nHahah, chea! (Scotty) Chea!\nI'm in the building! (Let's make it rain on this niggas)\nI see you Joey (Crack) Remix!\n\n[Hook: Lil Wayne, DJ Khaled, & Both]\nYeah, I'm in this bitch with the Terror\nGot a handful of stacks\nBetter grab an umbrella (Remix!)\nI make it rain, I make it rain\nI'm in this bitch with the Terror (We The Best)\nGot a handful of stacks\nBetter grab an umbrella (Let's go!)\nI make it rain, I make it rain (Oh!)\nMake it rain on them hoes (Remix!)\nI make it rain, I make it rain (Oh!)\nI make it rain on them hoes (Remix!)\nI make it rain, I make it rain (Oh!)\nI make it rain on them hoes (We The Best)\nI make it rain, I make it rain (Oh!)\nI make it rain on them hoes (Listennn!)\nOww!\n\n[Verse 1: R. Kelly]\nI be drillin' these chicks like Major Payne\nWhen I make it rain, they be like, \"Kells, do it again!\" (Oh!)\nFrom the club to the coupe, inside my gates\nUp in my bedroom, screamin' each others' names (Oh! Ugh)\nThey was purrty-purrty, and I was flirty-flirty\nLil' dro, lil' bub, now they gettin' dirty-dirty\nDon't ask me what my name is—stupid bitch, I'm famous\nYou gon' make me aim this, leave your ass brainless\nI'm tryin' to stay R&B, but these streets is a part of me\nSo don't get it twisted!\nYou see I order one bottle then I fuck with one model\nThen I order more bottles; now I got more models\nI'm from that city where them niggas don't play, man\nI take a chick to my room like cave-man\nSo ask your girlfriend my name, I bet she go:\n\"Skeet-skeet-skeet-skeet, weatherman 'bout to make it rain!\"\n\n[Hook: Lil Wayne, DJ Khaled, & Lil Wayne & R. Kelly]\nYeah, I'm in this bitch with the Terror (Remix!)\nGot a handful of stacks, better grab an umbrella (Let's go!)\nI make it rain, I make it rain\nI'm in this bitch with the Terror\nOne time for my homie, Sean Paul\nGot a handful of stacks, better grab an umbrella\nComing home soon, we miss you nigga\nI make it rain, I make it rain (Oh!)\nMake it rain on them hoes (We The Best)\nI make it rain, I make it rain (Oh!)\nI make it rain on them hoes (We see no bond)\nI make it rain, I make it rain (Oh!)\nI make it rain on them hoes\nI make it rain, I make it rain (Oh!)\nI make it rain on them hoes (Listennn!)\n\n[Verse 2: Lil Wayne]\nOww! Blat, blat, blat, blat! Ayy, Joey, let me get 'em\nIt's Young Money and we on like the television\nThe Weather Channel, but I do not broadcast\nI throw up more cash, and change the forecast\nYour boyfriend is lame, I make it rain on ya\nHe never make it rain, like Southern California\nWhere is your umbrella? Now get your raincoat\nBaby, I make it flood, now you gon' need a boat\n\n[Verse 3: Birdman]\nFresh to death on 'em (Believe that)\nWe throwin' money on 'em (Throwin' money on 'em)\nStay fly, 25s when we ride on 'em\n(That's how we ride on 'em)\nAlligator suede, custom with the shades (Stunna shades)\nMake it snow in the club, bitches know we paid (Rrrrrah)\nStay shine, rockin' Gucci in the Bentley (Super-fly)\nWhite Rolls for my broad on them 23s (Stay fly)\nGoin' to the club, nigga, in a new fleet (Yeah)\nAll red doors up, doin' it like a real G\n\n[Hook: Lil Wayne & DJ Khaled]\nYeah, I'm in this bitch with the Terror (Remix!)\nGot a handful of stacks\nBetter grab an umbrella (Diamonds, let's go!)\nI make it rain, I make it rain (Six City)\nI'm in this bitch with the Terror (Magic City)\nGot a handful of stacks (Rolex)\nBetter grab an umbrella\nI make it rain, I make it rain (Oh!) (Remix!)\nMake it rain on them hoes (remix!)\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes (Sue's Rendezvous)\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes (Get your money right)\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes (Listennn!)\nOww!\n\n[Verse 4: T.I.]\nCome and see me and Crack in the club flossin'\n.40 cal in my jacket, twenty stacks in my jeans\nKnow real boss niggas do real boss things\nWe 'bout that shit, you just talkin'\nYoung Sam Rothstein, out with my goons\nIn the 430, down the strip I zoom\nIn the drop in January but it feel like June\nBig Glock I carry make a real big boom (What!)\nMake moves like a young tycoon (Ayy!)\nI come through like a young typhoon (Ohh)\nCategory 3, don’t be categoryin' me (Geah, geah, geah)\nWith these niggas like they'll get a better salary than me (Oh)\nI'm, El Capitan, King, numero uno (It's the King, nigga!)\nI flood pussy clubs, ask any stripper you know (Ayy!)\n\n[Verse 5: Ace Mack]\nAce Mizzy get all the hoes (Yeah)\nGonna teach them shit they want to know (Yeah)\nLike fuck that pussy-ass 9-to-4\nGirl, make that bucket a pot of gold (Yeah)\nIt ain't no money like custom money (No)\nIt ain't no bitch like a hustle bunny (No)\nAin't no bitch gettin' none of my money\nThat why the money got a clip to protect it for me\nShe gotta ride for the A (Ayy), hop for the A (Ayy)\nLive for the minute or be out for the day (Day)\nHop on the metal and lookin' hot in stilettos\nGot a rock with a bezel on the trigger finger\nBoss bitch of the ghetto, my Spanish Trina\nTalk shit to a nigga with the blammer beamed up (Know why?)\nWhen I see her gotta handle my bid-nah\nI gotta give her one of these in the back of the team truck\n\n[Hook: Lil Wayne, DJ Khaled, & Lil Wayne & R. Kelly]\nYeah, I'm in this bitch with the Terror (remix)\nGot a handful of stacks\nBetter grab an umbrella (We The Best, remix)\nI make it rain, I make it rain\nI'm in this bitch with the Terror (Uh-Oh!)\nGot a handful of stacks\nBetter grab an umbrella (I make it rain)\nI make it rain, I make it rain (oh!)\nMake it rain on them hoes (remix, remix!)\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes (We The Best)\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes (I said We The Best)\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes\nOww!\n\n[Bridge: Rick Ross & R. Kelly]\n305 M-I-yayo, ay Khal', call Joe up\nLet him know I'm at the Rolex, I just ran outta money\nMake it rain, make it rain\nI need to borrow 50 thousand cash\nMake it rain, make it rain\nCome through baby, we make it rain\nMake it rain, make it rain\nE-Class on the way too, we got a hundred grand with him\nMake it rain, make it rain\nTriple Cs, oh, yeah, and it's the remix\n\n[Verse 6: Rick Ross]\nI be reppin' my city, blowin' hundreds and fifties (Yeah!)\nIf the head right, Ricky there e'ery night (Ayy)\nJoey I was listenin', pullin' up, spinnin' rims\nTime to spend some dividends, my money they swimmin' in\nRoss, I'm a boss (I'm a boss), I'm the mayor (I'm the mayor)\nWe make it rain (Make it rain), on these haters (On these haters)\nGet your umbrella, fella, cause we blowin' hella cheddar\nI'm the nigga that you scared of cause no one can do it better\n\n[Verse 7: Fat Joe]\nOwwww! Joe Crack, early 80s, crack babies' mama paid me\nMaybach, fly Mercedes, birth that, drop a baby\nThem purrty ladies (Yah), they drive me crazy (Yah)\nThem skies is hazy (Yah), I'll pop like 80\nSomeone tell Mr. Bentley to bring his umbrella\nKatrina, not! It's just the one fella (Crack!)\nWho got dumb cheddar, and need a brain surgeon\nGot me a designated thrower cause my hand's hurtin' (Ouch!)\nI make it rain (Rain!), it's Coca bitch! (Bitch!)\nIt's not a game (Game!), them vatos locos-rich\nAin't nothin' wrong with wantin' a little happy endin'\nAnd we don't need a hotel, we parkin' lot pimpin', bitch!\n\n[Hook: Lil Wayne]\nYeah, I'm in this bitch with the Terror (Remix!)\nGot a handful of stacks, better grab an umbrella\nJoey Crack, I salute!\nI make it rain, I make it rain, I'm in this bitch with the Terror\nLet's go!\nGot a handful of stacks, better grab an umbrella\nThrowin' 'bout a hundred grand, we at Prive right now!\nI make it rain, I make it rain (oh!)\nMake it rain on them hoes\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes\nI make it rain, I make it rain (oh!)\nI make it rain on them hoes (Remix! We The Best!)\nI make it rain, I make it rain (oh!)", "title": "Make It Rain (Remix)"}]}