{"artist": "Pusha T", "songs": [{"album": null, "title": "Filling My Self", "image": "https://images.genius.com/66e8896c8c1bb069880e68e1abc3f74f.900x900x1.jpg", "lyrics": "I'm feelin myself, Pause!\nOne more cup and I might take off\nSeems like haters never take a night off\nBut you know I'm a tell them that they can get lost\nCause I'm feelin myself, it's my world\nI'm spending money like a rich white girl\nI'm go ball like I'm 7 feet tall\nI don't know about ya'll, but I'm a get off, cause I'm feelin myself\n\nOh, what a feelin, the champagne is spilling\nAll this dirty money got me bathed in them millions\nCame out unscathed from the days of my dealing\nThe driver of that car was a?\nStill up on my nino, smelling like a kilo\nBut I'm down and fresh soft white like my pillow\nFeelin myself so if he know like we know\nCross that line and get shot like a free throw\nRather be on fire at the tables out in Vegas\nUnder bright lights, middle finger to you haters\nIn a perfect world, just my guns and my girl\nWe shine like diamonds and pearls, and I'm feelin myself\n\nI'm feelin myself, Pause!\nOne more cup and I might take off\nSeems like haters never take a night off\nBut you know I'm a tell them that they can get lost\nCause I'm feelin myself, it's my world\nI'm spending money like a rich white girl\nI'm go ball like I'm 7 feet tall\nI don't know about ya'll, but I'm a get off, cause I'm feelin myself\n\nBaby take your chance, never mind what you're hearing\nI can change your life tell me what are you comparing\nPut you on the red carpet tell them what you're wearing\nShop till you drop they say sharing is caring\nMore's in my winnings, we can share opinions, like baby steps\nWe can share beginnings, walk before you run, but she so independent\nAnd I could see us fly, the sky is the limit\nWe so real, got my own quarter mill\nCounting money on the bed, watching Deal no Deal\nIn a perfect world, just my guns and my girl\nWe shine like diamonds and pearls, and I'm feelin myself\n\nI'm feelin myself, Pause!\nOne more cup and I might take off\nSeems like haters never take a night off\nBut you know I'm a tell them that they can get lost\nCause I'm feelin myself, it's my world\nI'm spending money like a rich white girl\nI'm go ball like I'm 7 feet tall\nI don't know about ya'll, but I'm a get off, cause I'm feelin myself\n\nI propose a toast to every living kingpin\nSmart enough to deligate their work to their wing man\nKeep a bad bitch on the arm of my bling hand\nPlay my cards right, now I'm looking at a dream hand\nYeah, got you looking at my poker face\nNo joker see it, you can call me smoking ace\nIn a perfect world, just my guns and my girl\nWe shine like diamonds and pearls, and I'm feelin myself\n\nI'm feelin myself, Pause!\nOne more cup and I might take off\nSeems like haters never take a night off\nBut you know I'm a tell them that they can get lost\nCause I'm feelin myself, it's my world\nI'm spending money like a rich white girl\nI'm go ball like I'm 7 feet tall\nI don't know about ya'll, but I'm a get off, cause I'm feelin myself", "year": null}]}