{"songs": [{"title": "The Basement", "album": "Hump Days", "year": "2013-07-17", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro]\nWasup yo? let me preface this by saying this is not a Mac Miller diss by any means\nI actually like Mac Miller but, but right now he  probably is the most popular white rapper excluding Eminem\nAnd I'm just not even close so you can understand why I would rap over one of his beats\nI got a little bit of Kobe in me and if Kobe saw like Lebron he would wanna rap over his beat\nMetaphorically speaking, I know he ain't Lebron, but, but you get what the fuck I'm saying\nMaybe he's more of a Jo Johnson type of shit, no disrespect\n\n[Verse 1]\nFuck...this undergrad bitch tryn fuck\nAnd her chest deserves an A, like she handle da puck\nShe know D been bumpin' Drake like ya man a Canuk\nHomie even if it's May in LA...I'm so fuckin' cold\n\nRoll good on that Westside\nHoes cook like they country thick\nSo hood up in Best Buy\nController, D punkin' kids\n\nLoading up the used dishes\nRollin' up wit two bitches\nHope they old enough\nTo get folded up, I'm not bold enough to do prison\n\nI been drinkin' sippin' something so horrific, ya dig it\nBecause I tipped the bartender extra, then he put extra liquor\nIn dat shit. Goddamn. Das a misinterpreta-tion\nHate it when they stiff. Over-tipping 'cause I'm cak-ing\n\nTake in errything a mafucka say\nBeen about rap, figured out that from the basement\nI ain't talkin bout rap city on black entertainment\nTalkin bout the place I was raised in\nPlate full uh bacon\nMaking a bagel and bake on occasion\n\nBack then woulda made rap for grades\nNow a mafucka make rap for pay\nAnd them bitches too\nChickens that I'm bangin' so appealing\nThey been Shagging on ma balls, like they practicing they fielding and\nI Sorta make 'em pop off\nMake 'em take they socks off\nRound the fuckin' bases then get pounded like a walk off\n\nAw naw...\nThis a fucking statement I'm making\nThey been hesitating to give Lil David space at the table\n'cause they label a capable able Jew gay and too playful\nWatching cable naked, the AC blowin' major like Slater's dad\n\nWhy you hater's mad?\nMaybe I should get a couple tats\nMaybe I should get in trouble and be dumbin' down the rap\nLook at Mac\nWhite as fuck but lookin' thugger than a trap spot\nNeed another mac 'stead of luggin' round this laptop\n\nBlackballed\nFrom the muthafuckin' rap blogs\n'cause I rap odd, never talkin' bout a fuckin' black card\nIon't gotta play da black card, 'cause I rap hard\nIon't think it mean I gotta act hard\n\nFuck it tho\nDespite dat LD straight fucking hoes\nMa chickens stay hot, no buffalo\nMa hand been up in her bod, no Muppet ho\n\nWhatcha know bout a mafuckin' kid up wit a job\nCoulda fit in wit the mob, had a kid and a garage\nBut I didn't now I'm spittin' like a mothafuckin' slob\nDoin' shit up in garageband, better than the gods of the game do\n\nY'all better know ma name soon\nI ain't no clown, when you laughin' out loud\nDon't forget you getting down to a great tune\n\nMake room\nI'm coming for you muthafuckin rappers spittin' dog shit\nYeah I'm fuckin' funny, but this muthafuckin' dog spit\nAw shit...I could write a TV show tomorrow\nBut before I get dat Emmy I'ma make you bitches sorry that I'm gone\n\n[Outro:Lil Dicky]\nYeah, and once again no disrespect to Mac, Mac I actually follow you on Vine, I'm fucking with you, it looks like your having a pretty ridiculous amount of fun,\nSometimes your at a pool, sometimes your smoking weed and rapping\nWould love to be a part of it,if vine is any indicator your life is awesome\nOkay I got to go to work, see ya"}], "artist": "Lil Dicky"}