{"songs": [{"title": "Switch Sides", "lyrics": "[Intro]\nYou know\nThese niggas be ready for the switch up, you heard?\nShit fake man\nYeah\n\n[Chorus]\nWhy they be switchin' the sides from me?\nMy partner like you should be proud of me\nI feel like I won at the lottery\nI count up a bowl like a pile of green\nMy day one is switch up the side from me\nSwitch up the side from me, yeah (Yeah)\nSwitch up the side from me, should be proud of me\nSwitch up the side from me, should be proud of me\nYeah yeah yeah\n\n[Verse 1]\nMy day one s'posed to say he proud of me\nWe shot the gutter like it's poverty\nHe a cheese eater like commodity\nI can tell these niggas really doubted me\nI'm a felon, yeah my mama proud of me\nOn the long night my daddy died for me\nYeah you niggas ought to see the jealousy\nOn the low they tryna kill my melody\nYou been hatin', why you tryna sit with me?\nWhen your paper low, tryna fuck with me\nSee my blood brothers, yeah they stuck with me\nSee my blood brothers, yeah they love with me\nSee my blood brothers, yeah they duck with me\nWhen the shots come, in the cut with me\nI can't lose my life over jealousy\nMy lil' shooter shot, fuck a referee\nPlay it twenty times, you can't fuck with me\nOn some fake shit, you come up with me\nYou be hatin' dawg, and it's lame to me\nYou been hatin' dawg, and that's lame to me\n\n[Chorus]\nWhy they be switchin' the sides from me?\nMy partner like you should be proud of me\nI feel like I won up the lottery\nI count up a bowl like a pile of green\nMy day one is switch up the side from me\nSwitch up the side from me, yeah (Yeah)\nSwitch up the side from me, should be proud of me\nSwitch up the side from me, should be proud of me\nYeah yeah yeah\n\n[Verse 2]\nMy nigga tried to take my soul from me\nDid that money shot, and it's over for him\nYeah I prayed for it, it was choose for me\nWhere the money at, that you owe for me?\nYou a sucker nigga, you ain't from the streets\nMove the shade back, let it rain on me\nI don't trust you nigga, lot of pain on me\nI been gettin' money, never change from it\nSpent a couple dollars on my jewelry\nSee my real partners, they done cried with me\nMy hive, they gon' die with me\nMy fuckin' city full of jealousy\nExtended clip, I'm a felony\nA fine time just to check on mine\nI heard the lies you done told the streets\nDeep inside, you mean more to me\nWe was raised on the same street\nThat lil' money never changed me\nYou switched sides and it's shaming, yeah\nYou switched sides and it's shaming, ooh\n\n[Chorus]\nWhy they be switchin' the sides from me?\nMy partner like you should be proud of me\nI feel like I won up the lottery\nI count up a bowl like a pile of green\nMy day one is switch up the side from me\nSwitch up the side from me, yeah (Yeah)\nSwitch up the side from me, should be proud of me\nSwitch up the side from me, should be proud of me\nYeah yeah yeah", "album": "Bloody Summer", "year": "2017-10-31", "image": "https://images.genius.com/31a2e734c0a0d28c45d1ddea79b1ff28.1000x1000x1.jpg"}], "artist": "Young Greatness"}