{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Intro]\n\n[Verse 1]\nAfter pissy alleyway, side to the burnt building\nHeroin addicts and the rats are the size of small children\nChilling with a stinky ass dirty ham ho\nFat wigger white chick grinding me, giving me a lapdance to Luchini Camp Lo\nMy ex-girl mama used to call me white Sambo\nI'm like, \"bitch, I'm an artist, call me Vincent van Gogh\"\nI get Louis Farrakhan dating a platinum blonde\nI get skinheads bowing to Mecca and praying to Islam\nI can't afford Dre, Swizz Beatz, or a Timbaland track\nBut I can rip any rapper with just a kick and a handclap\nI punch fans, I punch kids, I punch females, I punch cops\nI spit punchlines, I don't need to punch clocks\nHip hop, I'm the verbal resurrection, you a sell-out\nTake them tight pants off and take the gerbil out your rectum\nHow you gone flip the script without having a premise?\nI'm a hooligan like James Caan's son with Alan The Chemist\nYou could get your teeth tooken out without having a dentist\nI'm a white man dingo, the white black African menace\nMy background dancers are both wack\nDrunk as shit doing the Pee-wee\nThey look like Joeski Love on crack, do it\n\n[Chorus]\nWelcome to the fun house\nThe fun house (what)\nLa-di-da-di, we like to party\nWe don't cause trouble and we don't bother nobody, nobody\nWelcome to the fun house\nThe fun house (what)\nLa-di-da-di, we like to party\nWe don't cause trouble and we don't bother nobody\n\n[Verse 2]\nYo, welcome to the world of the diseased, the disgusting\nThe death, the destruction, my world you get eaten up in\nStomping and murking them, I'm on a train like Colin Ferguson\nBringing the sleng teng riddim Ninjaman, I murder them\nMy trailer load a girls like Shabba\nYou fucking with them tranny bitches\nYour girl got testicles, an Adam's apple, look like Gaga\nI'm one of the best, my flow more fatal than the\nSlug that Marvin Gaye Sr. put in his son's chest\nApocalyptic when I'm popping the biscuit\nUnpopular, they won't be happy till I get shot, it's horrific\nWhat is you bitches smoking the rock or you sniff it?\nSlobbering cock when you hop on the block and you visit\nFuck it, any topic I'll rip it\nHit presidents with my shoe, that's how I do\nPork swallowing, I make bacon outta the swine flu\nI'll throw my dick to any female, I got so many bumps\nBlind bitches could touch my dick and read Braille\n\n[Chorus]\nWelcome to the fun house\nThe fun house (what)\nLa-di-da-di, we like to party\nWe don't cause trouble and we don't bother nobody, nobody\nWelcome to the fun house\nThe fun house (what)\nLa-di-da-di, we like to party\nWe don't cause trouble and we don't bother nobody\nWelcome to the fun house\nThe fun house (what)\nWelcome to the fun house", "title": "Laugh, Clown, Laugh", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}