{"songs": [{"lyrics": "[Hook x4]\nThis is lights out\nPull the pipes out\nWatch me (look out!)\nNo doubt\n\n[Verse 1] (Priest)\nWhen we come in man\nCome on man\nWe come off\nAirborne, it's the jump off\nIs it crazy baby?\nIt's amazing the way we\nSpray pages and blaze haze with Acey\nHP, I reinforce it, let the streets endorse it\nThe horsemen, on four cylinders\nDippin' the slauce and clippin' it off, flippin' off that\nPats ripple and triple, they trippin' off that\nIt's simple as that cat, back track, since Vincent Price\nWe been that nice, it's instant right\nMy instincts like that of an animal being hunted\nOut of your element, acapellas hella sick\nMind of an elephant, tellin' you I'll never forget\nPass your development, tellin' you I told y'all\nStomachs get turned to coleslaw, it's so raw, it's culture\n\n[Hook x4]\nThis is lights out\nPull the pipes out\nWatch me (look out!)\nNo doubt\n\n[Verse 2] (Sayyid)\nI flow with the rivers, giving niggas shivers\nKicking back in slippers, eating chicken livers\nA big rig coming at your wig to deliver\n'Til the guys zip you, reopen you with scissors\nHe was on the yellow bricks trying to find the wizard\nThat blew the blizzard 'til his pivot shifted\nSecond low as a midget, but still his body lifted\nNow relatives just visit\nWhile I kick back laughing like Robin Quivers\nYou trippers asking the assassin to pass you a ration\nHand you an aspirin, you assin' with a g-string and a mansion\nWhile these themes is campin'\nTrampin to dampen your chances of lampin'\nWith the champions\nBubbling, tumbling, hovering, governing, and prancin'\nWhy you standing, throwing tantrums\nI'm on Virgin Air to France and smokin' with Richard Branson\n\n[Hook x4]\nThis is lights out\nPull the pipes out\nWatch me (look out!)\nNo doubt\n\n[Verse 3] (Aceyalone)\nHey, Joe\nWhere you 'bout to go?\nWith that gun in your hand\nOff to Pakistan?\nNorth Korea, Iraq, see the men attack\nMe I got the same idea when I go to combat\nEvery step I take, every move I make is like, driving in the stake\nYou can't escape your fate, it's like\nWhy should I remind you?\nWe know where to find you\nYou look over your shoulder when there's no one else behind you\nWhy should I undermine you\nActually I find you, pretty cool, but unfortunately this contract binds you\nDecisions for the council, against you and your household\nLights will be shut down\nSoldiers will be cut down\nArrows through the heart we gun, barrels start to spark\nHeroes in the dark, not very effective\nI know they will all scream out\nWhen the place is cleaned out\nBut how will they respond when the lights are disconnected?\n\n[Hook x4]\nThis is lights out\nPull the pipes out\nWatch me (look out!)\nNo doubt", "title": "Lights Out", "album": "Love and Hate", "image": "https://images.genius.com/8aabb2266f1dc21cbed33421bd2b76e2.220x220x1.jpg", "year": null}], "artist": "Aceyalone"}