{"songs": [{"year": "2013-12-07", "album": null, "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Losing My Brain", "lyrics": "Didn't we just drop an album nebs?\n\nAnother album drop put that where the classics at\nHow many times we gotta prove we got that magic rap\nCaught up in the money, everybody turnin' on me\nI thought everybody proud 'til everybody want it from me\nIt's a funny thing I tell ya', I seen everybody dirty\nFavour after favour never nothin' in return and\nIt ain't even like I'm askin' im just waitin' on a thank you\nYour sussin' out my money, that ain't somethin' that a mate do\nI bet it breaks you, I'm stackin' up I'm holdin' bricks\nI learnt my lesson keep it separate never told 'em shit\nStill ridin' with my girl, got her decked out in that louis too\nCause she was there when i was poor, look where we're movin' to\nWater out the back, feel like swimmin' til i drown lads\n6 bedroom house and I started in a town house\nI got it down lad, i make my dreams come true\nYou stabbed my back, now you wishin' you could come too\nVisit to see Sero but they had him on a box visit\nHe touched the glass and told me dont you ever stop wit it\nHe said \"fuck 'em all\" kinda like he read my thoughts\nI could say a million things that we've both said before\nHe rang me up the other day, dialing me\nHe cracked a joke, the first time he's smiled in weeks\nHe knows i miss him on the truest we speech\nPlus now the crew is getting pumped up for Shue's release\n\nI'm waking up stressed, shit you talk about a workload\nHoldin' on my money, ain't no way you see me turn broke\nCause I been there, I ain't goin' back now\nThis new life, equal stress, i don't back down\nFightin' thru life, i feel stuck in a dump\nI miss Rates, we ain't spoke in a couple of months\nAnd I'm movin' on, I'm watchin' all this time fly\nThinkin' is my mind right, livin' in the lime-light\nRemainin' on my feet, thru all the fuckin' hatin\nNow them haters, when they see me man they tell me that i made it\nI can't help but to make my life all public\nThe fans seem to get it because they tell me that they love it\nThey breathe it, they need this\nThey need another way but I'm feelin' at my wits' man i swear i need a break\nWe top the charts, have me poppin' pills, whats apart\nWhere the happiness come cause i got the cash and lost my heart\nRealest on the mic here, need me then I'm right here\nI'm washin' down prespcriptions but I'm mixin' it with light beer\nI gotta find a way cause lately i've been stressful\nBut through it all, I am still the most successful\nHow's it work? Shit I'm losing my brain\nBut I keep getting bigger so the movement remains\nI've reached a million to date and tried to move it away\nCause black skies cover me 'til a human is grey\nI got a lot up on my plate now, considered as an icon\nBut then I'm told I'm here and i live my life wrong\nThis could be the realest shit that i ever wrote\nThis could be the realest thing that i ever quote\nI got a couple enemies, they want me in a cemetery\nThey can knock me off but they can not stop my legacy\nI keep movin' thru the depths of the flames\nI put my life on the line so you remember my name\nWhen I leave Aussie rap, thats a day off the map\nThats the way of my rap, no one sprayed it like that\nWho's around? Cause I'm feelin' on my own now\nYou missed my buddy but i guess the phone got thrown out\nYears ago you see me on a street with a beer can\nWalkin' with the headphones dreamin' to be here man\nAnd now I'm here man, no i don't fear them\nNow i got a clear head, thought you're gonna be there\nBut you not nah, but you not nah\nIn a hot car, screamin' what? what you got huh?\nI'm a live on the charts with the top ah\nSo sick that they needa call the docta\nBut you not nah, but you not nah\nIn a hot car, screamin' what? what you got huh?\nI'm a live on the charts with the top ah\nSo sick that they needa call the docta"}], "artist": "Kerser"}