{"artist": "Canibus", "songs": [{"title": "Authentic Level Of Greatness", "album": "Full Spectrum Dominance", "year": "2018-06-22", "image": "https://images.genius.com/e46ac064e354d1b1540013198f5e0d71.1000x1000x1.jpg", "lyrics": "[Sample]:\nLadies and gentleman\n\n[Verse 1: Canibus]\nI have faith that the youth has to save the day\nWe gotta let the chips fall where they may\nFeud Elvis paved the way, however I'm ashamed to say\nThe foundation just faded away\nI told the limelight bovine in the coalmine\nSometimes it gets so dark your soul can't shine\nWhat you do when justice takes years or more?\nBut your world is 24 hours from being destroyed\nNo time machines to tamper inbetween reality\nNo time for apathy or religious fantasy\nJust you against the dragon beast\nWhat you gonna do? (What you gonna do?)\nI dont know. That's why I'm asking you\nIma die on my feet like my favorite OG\nMy favorite OG ain't dead yet, blame it on me\nStay frosty, wake up like \"bitch, get off me!\"\nAnd I don't calm down till I taste my coffee\nThe blind man told Batman \"No rope\"\nThat's the only way to get outta this hellhole\nJust be honest, you made a false positive promise\nThe rap artists piling up like ocean garbage\n\n[Samples]:\n\n\n[Verse 2: Canibus]\nSo operative bullnose, full blown turbo flow\nYou motherfuckers don't deserve no dough\nThey got a U.S. Republic minority budget\nTo start a school for Hip-Hop, nonprofit or public\nYou see, anybody that tells you they coming to save you? Is lying\n'Cause you gotta save yourself\nNo matter what happens in the spiritual world of action\nThey wanna be compensated to hell\nWhen they deal with they own they pull the trigger too late\nBut everyone else get dealt with, they don't hesitate\nNo mercy, no time to marinate\nThey ain't satisfied till we all living in terror-state\nGuess what, we'll get used to it\nAin't nothing new to us\nAdapt to the just, that's how we used to do it\nDestructive humans, disruptive underground acoustics\nThey totally destroyed our music\n\n[Sample hook]:\n\n[Verse 3: Canibus]:\nStripped of our honor; laid down to rest in the garden\nMartyred, no chance of posthumous pardon\nToo bad, ragtop Jag, Sugar Hill swag\nRide around with the top down listening to jazz\n'Cause y'all act like y'all so much better than cavemen\nBut all that knowledge just brought you enslavement\nSentient awareness, removed\nDumbed down in a careless mood, I'm barely amused\nSo much more pressure than ever\nShould the predecessor be more or lesser than their successor?\nGood question\nUnapologetic regret, questions still go unaddressed\nHow we feel now is anybody's guess\nDuring this age of iron and widespread gun violence\nThe puppet masters strings are now wireless\nBlindfolded, one more cigarette\nWhat's your last request?\nMaybe that life can outlast death\nIn a metaphor turf war, the all time great work horse\nWar of the worlds, just for the sport\nOn the other hand, I got faith, the youth gotta save the day\nWe gotta let the chips gotta fall where they may\nThe elders didn't pave the way\nI'm ashamed to say, that our future is the future WE made"}]}