{"artist": "Problem", "songs": [{"album": "Mollywood 3: The Relapse (A-Side)", "title": "Automatic", "image": "https://images.rapgenius.com/067f61cd9f8d4bafeaa5ff6d90c81eb8.950x950x1.jpg", "lyrics": "[Intro]\nHell dawg it's time to boss up man let's put this play up\nMan you know what I'm sayin\n\n[Verse 1 : Problem]\nThey like boyy! Would you get back on that [?] shit\nIt's on to pull out to get blow with a turn bitch\nMy phone won't stop ringin', team won't stop gleaming\nSpar tree serve D at these Spike Lee's bitch\nBut I bust up and got that money\nFrom the hood but my life's good\nR.I.P. Icewood (whaddup doe)\nMade a gang of money (But I want more)\nAnd all my niggas too\nBall on bitch nigga, that's all my niggas do\nNeed to turn the bomb so I can call my niggas through\nFinesse for the plus, I get a rush when it touch\nPistol-grippin' if he trip, finger-fuckin' that slut (pow pow)\nMe and [?] don't give a fuck bout a [?]\nMake your bitch bust it open like when you first get that pack\nIt smells good don't it?\nMy spot you sure want it, but you can't have it\nSpike drinks, straight savage nigga\n\n\n[Hook : StoneyThaDealer]\nThis 9 on my waist it's ain't the only thing automatic\nSwear to God boy I gotta have it\nI said this 9 on my waist it's ain't the only thing automatic\nI swear to God boy I gotta have it\nAutomatic! (Automatic!)\nYeah boy I said I gotta have it\nI gotta have it yeah boy I said I gotta have it\nAutomatic!\nCause this 9 ain't the only thing automatic\nOn my momma boy I gotta have it\nAutomatic!\n\n\n[Verse 2 : Problem]\nAll these rappers out here rapping bout how they got that work\nThink I'm talkin' about dresses when I mentionnin' a skirt\nThink I'm talkin' about [?] when I mention the purps\nYou liars need to be silent like my messages in alert\nI been digits since the first, having bitches doin' dishes\nPuttin' bills up in their name, for the niggas takin' charge\nBut the charge into the game, that's the game he did chose\nAin't no bitchin', ain't no snitchin' till he land with the law\nNigga [?] to function, yeah I'm parkin' that Bentley\nRed cup full of Henny, paid niggas with me\nNo I didn't pay 'em, they payin' nigga you get it\nThat 26 that's drop, they like Chachi did you get it\n[?] That's only gang I will\nTakin' shots for my haters with the bangout skills\nMe and Lucky goin' dummy all on B-E-T\nStill got that bitch that feel the free [?]\n\n\n\n[Hook : StoneyThaDealer]\nThis 9 on my waist ain't the only thing automatic\nSwear to God boy I gotta have it\nI said this 9 on my waist ain't the only thing automatic\nI swear to God boy I gotta have it\nAutomatic! (Automatic!)\nYeah boy I said I gotta have it\nI gotta have it yeah boy I said I gotta have it\nAutomatic!\nCause this 9 ain't the only thing automatic\nOn my momma boy I gotta have it\nAutomatic!", "year": "2015-07-01"}]}