{"songs": [{"album": null, "image": "https://images.genius.com/2747d1dbded3ab46deeda76498bdcf2c.1000x1000x1.jpg", "year": "2012-06-06", "title": "SSL (Solid Sound Logic)", "lyrics": "[Verse 1: Terrace Martin]\nDoin' fifty on the shore, Range no tags\nPunch pulled up, Kendrick in the back\nA Da Bu$iness in that rag, Phantom on feet\nAnd Problem in the diamond light pushin' that GT\nHood niggas with class, give respect where it's due\nCame up with one boo and that was just to stay true\nTrue to my music and everything that I do\nInstead of practicing me you should focus on doin' you\nSo nigga fuck yo crew, what you wanna do?\nWack emcees never get no love I'm not enthused\nAnd you can save all ya non-creative point of views\nCause me? I'mma produce and you just reducing ya crew\nNow how I'm 'posed to work if I ain't gettin' paid?\nGotta call Terrace Martin if you can't call Dre\nNow with that bein' said there is nothin' else to say\nWas already understood, doesn't have to be explained\nIf it was never lost, how could it be saved?\nI do this for my soul, I do this for LA\nI do this for the love, man I do it for the game\nAnd the memory of Miles Davis and John Coltrane\nHow could you blame them bastards, when they ain't have no raisin'?\nThey don't want no higher learning, they stick to the basics\nAnd they don't wanna work for that white devil cause he racist\nNeglected of knowledge, that's all they know, how could you blame 'em?\nAnd I hate to say it but I had to as a man\nWe cooperated with 'em and fell victim to they plan\nAnd after losin' Malcolm and Martin they scared to take a stand\nIf I call 'em pussy it's some bullshit, when will it end\nSo I don't really care 'bout who they say who is the best\nAll I know is that it shows within my music and my checks\nI swear this is the best thing next to havin' sex\nGeek smashed on niggas won't let my foot up off they necks, yep\n\n[Verse 2: Problem]\nHuh, strap it on me and let me solidify\nAnd purposely intertwine, my positive thoughts apply in genocide\nCompton communists are, shiftily, in peace\nWhoever's in charge like Charles no sit-com\nBeat him like a kick drum\nRip a hole from his lips to where the nigga shit from\nCompton, Cali nigga!\nIt's all music, rule-less\nLike a Ali fight, pushin' Al Green or Barry White\nBoy this Cali life's amazin'\nPalm trees, bomb weed and bitches\nAll my aprons and rubber gloves went cookin' in hell's kitchen\nBustin' shots that could crack back spleens\nThe lil rapper that could commercialize the backpack scene\nWho sick? Boy, shit ... I'm vaccine on flight green\nPaper planin' on the plane in first class, mad?\nBecause I'm on the bubble of success\nStressed over life, street still pokin' out my chest\nBitches love my confidence, I wear it like a vest\nSippin' Rosé Moët, drinkin' 'til I'm lost\nHustlin' everyday, bail away my thoughts\nAnticipatin' the win but, ready for the loss\nGot her livin' like a boss; Tony Danza, been bananas\nSince the red rags of bustin' out a stanzas\nProblem, answer, not one found!\nMayweather couldn't box me into one sound, he wouldn't last one round!\nMy songs' clever, my pen's better, than ever\nA trendsetter with a vendetta...\nBig bag of chips on my shoulder standin' tall like a soldier\nSnakes in the grass I laugh dodgin' the cobras!\nScraped from the past, we amped wantin' the Kobra\n\"I'm far gone mommy,\" \"Relax baby, it's over,\"\nMoney pile coma, rovin' in the Range\nBe it dope takin' its toll please have exact change, MOTHERFUCKER!!\n\n[Interlude:]\nYeah, this is DJ Fuck Wack Emcees\nComin' to you straight off Crenshaw\nThat was Problem comin' straight outta Compton\nNext up is A Da Bu$iness, South Central's finest\nHe cold yo...\n\n[Verse 3: A Da Bu$iness]\nUh, salutations and greetings to all\nOf my celestrial stars, gather 'round, get one out\nWe 'bout to witness the Big Dipper\nIntergalactic astronomical avenue business man, finish him\nRaining fatalities cause I'm like Vegeta said\nLight 'em up make you feel like six million megawatts\nMy momma still wonder why I don't think straight\nRun this shit like a relay, run that back like a replay\nCome off the bench and will win and T balls like I'm Ebanks\nIs ya swagga hand-me-down, where'd you get that shit off eBay?\nBeen bleedin' 'em since we was orderin' Jordans off of Eastbay\nBang (*gunshot*) that's what the heat say, in the game call me EA\nDa billion dollar Bu$iness fuck the witness and the DA!\nLet's raise aware-wolves, vampires, like the shit gets spookiest\nMonsterous, zoo in the movie we call it the 'zoovie'...\nWhere they smart to come out he wearin' under that tool\nFrom a cold winter degrees that's hotter than juvie\nAin't new to gangbangin' so all that gangsta shit don't move me\nFuck yo tats, know inside you's a bitch\nAnd no matter how you dress we still sit through all of that shit\nSo fly I'm never taintin' you maggots still on my shit\nI need a pooper scooper!\nLittle Mario don't care if you off a flower\nNo star I'll take ya princess for ransom I'm King Kooper nigga!\nAnd this heat'll spit faster than a cheetah sprint\nDragonball, Super Saiyan on my Vegeta shit\nA fact-avist and I ain't talkin' no civil rights and shit\nKickstand leanin' in Secret Sundays, with a ratchet bitch\nI South Centralized the game with my hustlin' spirit\nAnd Terrace Martin mastered me, so I know you hear it...\nDa Bu$iness...\n\n[Verse 4: Kendrick Lamar]\nFive star general in a G ride\nGot my seat back, chiefin' like a Seminole, no centerfold\nBut picture that, picture me, picture Terrace, picture P\nTakin' shit from some nigga that shit right there sound dumb nigga\nWe gotta post stay in the street, take what we deserve and yeah I\nServe on any artist that's my word that y'all are targets\nI'm retarded on the mic, Special Ed.,\nAnd bitch I call you special when you give up special head\nI gotta feelin' it's gon' be a lot of killings Kendrick\nCause when I spit a verse I bring a hearse to every sentence\nAnd put it in reverse and try to decode it\nThey on my dick and deep-throat it\nThey don't know it but boy I am a henchman, for hire\nI require wack emcees, tell 'em that I'm burnt like 'Swap Meet' DVDs\nTell 'em that I earnt my respect on what you didn't do!\nAin't nothin' difficult your admiration's pitiful! Shame on you twice\nLife's a gamble so I'm comin' out the gate with tricked dice\n7-11, 7-11, backed on that\nIt's been a long time comin' since I bodied a track\nI'm back up in this bitch like the ass and pussy was fat\nI put my city on the map like I represent a post\nComp-town soldier, welcome to Iraq\nBe ready for combat, or die on your sofa\nBrains on the plastic, yo stains on the cabinet\nYUCK! And if I fell off goddamn I would prob'ly land in a deep thought\nA nigga need Spam for the shit y'all brought\nI go 'H•a•m' in the Brougham bank corners like I'm Moss, fuck!\nHeaded to the coroner\nI'm one of ya your run is up my gun is TEC I'm comin' for the\nCommon sense of commentators that say I don't love enough well\nY'all some haters tie 'em up and kill 'em later I am such a\nHorror-vator I am so messed up to be replyin' and\nWhatever favors mine are sick and hold up player I is fighting\nAny favors I invite in meaning lasers beaming off the\nSun until I have a son and see you later motherfucker..."}], "artist": "Terrace Martin"}