{"songs": [{"image": "https://images.genius.com/655b854c09fd20fcd932070d6fa0e912.640x640x1.jpg", "title": "Say No Mo", "album": "Price City", "year": null, "lyrics": "[Prelude: Nasty C]\nWoo! Woo! I already know bitch\nSkrrr!\nWoo! Woo! Woo!\nI already know bitch\nSkrrr!\n\n[Hook: Nasty C]\nSay no more\nSay no more(I already know nigga)\nSay no more\nSay no more (I already know nigga)\nAye you ain't gotta say no more\nSay no more (I already know nigga)\nSay no more\nSay no more (I already know bitch)\n\n[Verse 1: Nasty C]\nUh, I'm probably the youngest nigga in the V.I.P nigga\n(I already know bitch)\nI done had the summer caught it right in between my teeth nigga\n(I already know bitch)\nI'm finna get cardiac arrested the way I'm killin beats nigga\n(I already know bitch)\nI can turn the girl of my dreams to the girl on my sheets nigga\n(I already know bitch)\nI'm one of the very few niggas got an encore on radio\n(I already know nigga)\nOhh shit, I'm the very first nigga that got an encore on radio\n(I already know nigga)\nNow whats a role model? I'm just rollin papers nigga\n(I already know nigga)\nYeah if the devil wearing Prada, I'm the motherfuckin' tailor nigga\n(I already know bitch)\nI'm turnin down, 5 or 6 flavours everyday, this shit is killin me\n(I already know bitch)\nYou see me with a bottle of Patron but you askin what got into me\n(I already know bitch)\nYea. shout out to the underground dogs who fuckin up the industry\n(I already know bitch)\nWhy you acting like you losin it?\nYou ain't even lost your virginity\n(I already know bitch)\nYeah, last night pops said I'm gettin outta line man\n(I already know nigga)\nHe tryin to put me on a march, turn me into a lines man\n(I already know nigga)\nI love the nigga to death, I ain't even gotta lie man\nBut if I gotta disappoint just to prove a point, Imma do this shit whether he dead or alive man\n(I already know bitch)\n\n[Hook: Nasty C]\nSay no more\nSay no more (I already know nigga)\nSay no more\nSay no more (I already know nigga)\nAye you ain't gotta say no more\nSay no more (I already know nigga)\nSay no more\nSay no more (I already know bitch)\n\n[Verse 2: Erick Rush]\nI'm prolly the hottest nigga spitting I ain't even gotta say no more (I already know bitch)\nI'm still a motherfucking fool getting brain from a brain-no hoe (I already know bitch)\nNigga go ahead bust a motherfucking move if you wanna see your motherfucking tomb\nBoom!\nYou claim to be a thoroughbred but they don't really show this here\n''Erick Rush you the truth\" I tell em (I already know bitch)\nShit, tell me something that I don't\nOG, all or something niggas smoke (I already know bitch)\nShit, been a beast since I hopped out the post\nGot a Visa then I moved up to the north (I already know bitch)\nAs for the mula, be surprised how many times you'll prolly get it (I already know nigga)\nBoy I ain't even got one chain on, still riding round and getting it (I already know bitch)\nCheck it, it's mine I spend it\nI'm kinda condescending\nGot my niggas wearing masks like the Comic-Con attendants\nA nigga been a menace\nGot a problem, I'mma finish\nAnd get the fuck out my business (I already know bitch)\nYo, this shit is high definition\nThey told me stay out the devil's kitchen but I didn't listen uh\nThey want us all rotting in prison\nFree up to all my niggas locked in the system (I already know bitch)\nBig Z, Big Z, Big Z better tell em\nThem niggas spitting but we don't really feel em (I already know nigga)\nUh, you're never getting on my level\nYou too full of shit my nigga I can smell it (I already know nigga)\nYo this shit is free world music\nBetter stand for free when these boys deuce it\nThe whole squad in the building and these hoes choosing\nShe tryna get in my video but she won't use me\n\n[Hook: Nasty C]\nSay no more\nSay no more(I already know nigga)\nSay no more\nSay no more (I already know nigga)\nAye you ain't gotta say no more\nSay no more (I already know nigga)\nSay no more\nSay no more (I already know bitch)\n\n[Outro: Erick Rush]\nSay no more\nSay no more\nGoddamn, I already know nigga"}], "artist": "Nasty C"}