{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "{​Intro}​\n1 2 3 4!\nWHOO, You are a gorgeous man, Mac\nYeah, uh!\n\n[Verse: 1]\nYo, my name is Lethal, if you not familiar\nBig ball sack like a silverback gorilla\nRed leather jacket like it's Michael Jackson \"Thriller\"\nOn the first 48 I was an instrumental killer, yea\nI heard you actin' lazy, I'm bout to get you motivated\nWith my rappin', baby\nYou only get one chance to live, so do it passionately\nSee, you can get a little money and a black Mercedes\nI'm so excited, I can smack a baby\nMetallica, Slayer and Pantera, it's time to bring the goddamn terror\nIn your business meeting, tell 'em you're the boss\nGet paid, straight cash, homie, Randy Moss\n\n(Hook)\nCuz you're in last place, but you should be first\nBut you act like hard work makes your pussy hurt\nYou gotta take those bad feelings and you gotta toss 'em\nDon't be a little bitch, just be a lotta awesome\nJust be a, a fire breather, never be a quitter\nMotivate yourself to try to work hard and get bigger\nBe a flame thrower, big flame spitter\nRun up on your enemies, your finger on the trigger\n\n[Verse: 2]\nYou need that motivation, that shit is missing\nKid you ain't motivated, feel like you slippin'\nBut fuck it, go get naked, walk into the kitchen\nFind an electrical socket, homie, and stick your dick in\nGet excited, so fuckin' pumped, wow, say \"it's my big dick, I wanna fuck now!\"\nFuck yo enemies,they ain't as bad as you\nPMA, Pussy Massacring Attitude\nDo some push-ups, do a couple hunnid\nPick a fuckin' labradoodle puppy up and pun it\nDo a shot of whiskey, make a blackin' tan\nWalk in bank of America, with your gat in hand\nBang! Now listen, lady, you run a fuckin' cupcake business\nI ain't tryna grind y'all out\nBut you got anotha bitch that runs a cupcake business\nAs competition? Cut her fuckin' eyeballs out\n\n(Hook)", "year": "2016-02-04", "album": "YouTube", "title": "Fire Breather"}], "artist": "Mac Lethal"}