{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/08af0756a25a3c187081c44c9b11c0a4.390x369x1.jpg", "title": "​ay shawty 3.0", "year": "2013-01-30", "album": "D.A.I.S.Y. rage", "lyrics": "[Verse 1: Kitty]\nI should be less creepy and less easy sounding\nPlease could you freeze me up zero degrees, freak me\nEven though I'm greasier than pizza\nMore tweezers I need, Jesus, my teeth they just need bleaching\nI'll be sweet to you, always free, I can leave with you\nBirds and bees are a mystery, teach me?\nWith books thicker than Tolstoy, descriptive\nAnd most boys would liquor me up, poison trickery\nBut I predict that you're gonna see me and split\n'Cause you're dirty Sprite, hi I'm Kitty, your gold teeth are the shit\nAnd I'm Mary Jane and you're Petey, in the street, I'll invert you\nSo greet me with kisses, iconic and sweet\nWe aren't even acquainted but I'm gonna wait and listen\nI really want you to want me, I really wanna take off with you\nReally want you to want me, 'cause you're flexing in the trap\nEvery time I hear your voice, I have relapse\n\n[Hook: Kitty]\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy shawty\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy\n\n[Hook: Kitty and Lakutis]\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy shawty\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy\n\n[Verse 2: Lakutis]\nFirst off, I don't love 'em, I bag 'em, I gut 'em\nAnd, B, I don't know where I put 'em\nAngie Teresa look like Jalisa from BET, she came to see you\nI'm pleased to pieces but I ain't see you, no\nYeah, you see me at the party, I see you at the party\nYou said, you don't like to talk at the party\nLike I'm a fireball at a party, c'mon\nI can sit and smoke a ciga-cigar-gar from Cuba-Cuba-ba\nThis shit ain't a Mai Tai, it's Dirty Sprite, show you right\nSure you really really really really say you wanna be my lover?\nSay you wanna go home and watch cartoons?\nYeah, me too, but not with you\nRide around town like a mobster do\nHigh off weed and lots of booze\nMeat in her tail like a lobster do\nAnd she Dominican too, so I ain't fucking with you\nListen, mami, you really want me to want you?\nThen don't want me, I got you\nYou really want me to want you?\nTurn into a pack of bogeys\nIt's cool you thought you could know me but...\nNah\n\n[Hook: Kitty]\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy shawty\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy\n\n[Hook: Kitty and Lakutis]\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy shawty\nAy shawty, let me holler at you\nAy shawty, let me holler at you\nAy"}]}