{"artist": "YG", "songs": [{"image": "https://images.genius.com/ba2a73211e21ff3e11eba91f3f156e9d.1000x1000x1.jpg", "year": "2014-03-18", "album": "My Krazy Life", "lyrics": "[Intro]\nIt's that motherfuckin' gangsta shit, nigga!\n\n[Hook]\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back, bicken back\nBicken back, bicken back being bool\nI'm just bicken back, bicken back\nBicken back, bicken back being bool\n\n[Verse 1]\nPull up on the block, like, \"What!\"\nFuck the police, niggas better call the SWAT\nI ain't never played with the pot\nI was in your house tryin' to find a spot to extend my knots\nI went to jail for a flock, came home with a strike\nYou went to jail as a bitch, came home as a dyke\nNigga, yikes! I don't play that shit\nWifey like SEGA; I don't play that bitch\nI’m a real Bompton nigga with a motherfuckin' attitude\nWalk up in the spot, you would think that a nigga mad at you\nI was on the block chillin'; homies, what's the mission?\nCame back in a quickness, hoping there wasn't no witness\nAnd they came back shootin'\nMy homies went back shootin'\nAin’t nobody hittin' nothing, man, this shit getting stupid\nAnd my homies with the news, so they grabbed that tool\nThis all started from a day of niggas bicken back being bool\n\n[Hook]\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back, bicken back\nBicken back, bicken back being bool\nI'm just bicken back, bicken back\nBicken back, bicken back being bool\n\n[Verse 2]\nVerse two, the sun come down\nYou know when the sun come down them guns come out\nClick clack, bow, bow bow bow bow bow\nI used to rob niggas\nThat's probably why they try to rob my style\nAnd karma is a motherfuckin' biatch\nYou got your homie in jail, you sniatch\nAll in the court telling the judge who it is\nLike a bitch when you get to the pen, niggas on your wig\nNiggas be lurkin', bitches be slurpin'\nNiggas got caught up on them Nextels chirpin'\nDid some months in the county, I ain't have no patience\nMy bitch wouldn't come see me, I was in there masturbatin'\nSmoking on a bigarette, eating a bowl of bereal\nNiggas on the block selling O's like Cheerios\n\n[Interlude]\nAye, nigga, nigga, nigga\nI got a whole zone right now\nLike, right now, right now\nLike, what you tryin' to do right now?\n\n[Hook]\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back, bicken back\nBicken back, bicken back being bool\nI'm just bicken back, bicken back\nBicken back, bicken back being bool\n\n[Interlude]\nMeanwhile at a home invasion near you\nThese niggas was robbing your shit\n\n[Skit]\n“Man all the lights off around this mother fucking too. Lights finna be green right now on everything. I ain't got no gloves, i left them mother fuckers in the car.”\n\n“Man you better tear off your sock and use your sock nigga”\n\n“Man I’m trying to be in and out of this mother fucker like real fast this look funny out here”\n\n“Man, fuck it we in that bitch. (Door opening sound) Come on Cuz you too loud. You get a niggas to crack. Man we in this bitch.”", "title": "Bicken Back Being Bool"}]}