{"songs": [{"title": "Thought It Was A Drought", "album": "Free Crack 4", "year": "2017-01-12", "image": "https://images.genius.com/977ce8f2a06fdc6d78002a3fa6ed087e.400x400x1.jpg", "lyrics": "[Verse 1]\nI said I came from the mud and I'm really tired of tellin' them\nThat lean had me stuck, so I had to quit the medicine\nI post up on the block, I had seven for the dub\nSwear I had this shit on lock, 'cause my brother was the plug\nAnd these strippers mad, I won't throw no money in the club\nI got youngins doin' bids, every month I show 'em love\nI got hitters like the Cubs, and the killas is my cuz'\nI can't trust none of these niggas, if you with me then they blood\nLet me tell you how it was, trappin' in the trenches\nYour nosey ass granny, tell that bitch to mind her business\nMy lil brother grippin', you want that smoke I send 'em\nI say all my niggas hungry yeah you lookin' just like dinner\nStraight from the 'go\nFeds kick in the door\nBussin' the pole all my niggas get low\nShow me the cash, I give it and go\nI don't got a vest on, real niggas they know\nI'm screaming \"No Limit\" and that's to the grave\nI work like a slave, I got to get paid\n24 hours I'm on serving J's\nNo matter to me that shit got to get made\nI'm shippin' em out, that means there's never a drought\nI heard you been runnin' your mouth\nThese bitches is out, I know they here for the clout\nI just put dick in they mouth\nYou holding like niggas won't enter your house\nYou want some free smoke 'cuz I'm giving it out\nI get you murked for a little amount\nI do my dirt and go live in the south\n\n[Hook]\nWhen that new shit comin' out?\nYeah they thought it was a drought\nI get that work ain't running out\nYeah they thought it was a drought\nYeah they thought it was a drought\nSaid they thought it was drought\nIt ain't no real niggas out, so they though it was a drought\nWhen that new shit comin' out?\nYeah they thought it was a drought\nI get that work ain't running out\nYeah they thought it was a drought\nYeah they thought it was a drought\nSaid they thought it was drought\nIt ain't no real niggas out, so they thought it was a drought\n\n[Verse 2]\nThey like \"Bibby where you been?\"\nI've been huntin' for the cash\nAll these niggas chase some bitches but I rather chase a bag\nForty make my pants sag\nBalmain's on my ass\nAll these ho's disappear when niggas down 'till they last\nBut I'm up, bitches wanna fuck, keep on hittin' me up\nGot her ass, and she bad, but to me that's not enough\nI just use her for a nut, really I know she a slut\nI just hit 'er, then I send her to that brewfurd, he could cuff\nThey say we gon' go to hell, smoking out the bale\nMe and Will, 'till my lungs fail\nJewish lawyers, so I dodged jail\nYoungest 'bout that murder, gotta put on for the squad bail\nTook a lot of losses 'till I click up with the cartel\n\n[Hook]\nWhen that new shit comin' out?\nYeah they thought it was a drought\nI get that work ain't running out\nYeah they thought it was a drought\nYeah they thought it was a drought\nSaid they thought it was drought\nIt ain't no real niggas out, so they though it was a drought\nWhen that new shit comin' out?\nYeah they thought it was a drought\nI get that work ain't running out\nYeah they thought it was a drought\nYeah they thought it was a drought\nSaid they thought it was drought\nIt ain't no real niggas out, so they thought it was a drought, aye"}], "artist": "Lil Bibby"}