{"songs": [{"title": "Game Over", "album": "Free Crack II", "year": "2014-08-08", "image": "https://images.genius.com/6ab445e6a0d96f5a96b60b009e6c0463.500x500x1.jpg", "lyrics": "[Intro: Both]\nGang! You already know what the fuck it is man, NLMB\n150 Roc Block shit man\nYou know no niggas fucking with us man\nI tried to tell niggas man, it's over\nGame over shit\n\n[Verse 1: Herb]\nAll I know, get money fuck bitches and\nKeep it a 100 plus 50 with my niggas man\nNo Limit, 150, we them niggas, man\nHerbo, Lil Bibby, we at it again\n\n[Verse 2: Bibby]\nAll I know is get money and stack it\nIn the trap Lil Bibby make the pack flip\nChopper hit 'em, make a nigga do a back flip\nThese niggas, they bitches, they actors\n\n[Verse 3: Herb]\nBut they do it good, they can probably get a Grammy\nLike Fredo, niggas bitches, what you need, panties?\nDirty Crush, Pacquiao knock me out, Manny\nBad bitch, 5'5, light brown candy\n\n[Verse 4: Bibby]\nAll my young niggas hitta's, I ain't talking Sammy\nBaby .9 in the booth, yeah it come in handy\nLove red bones but I’ll fuck Brandy\nTryna' creep on this niggas but I had a crammy\n\n[Verse 5: Bibby]\nGot a .4-5, two Glock nines\nTryna' argue? I ain't got time\nPull up on a nigga by the stop sign\nSlide the doors back then it's shots fired\nIt's Chiraq, this shit serious\nJust bought a thirty clip for the SIG\nI'll kill bitch and I'll kill her kids\nIt all depends what her nigga did\n\n[Verse 6: Herb]\nWe're killa's, we don't show no sympathy\nMurder one or all my enemies\nI lost my niggas, I can't feel a thing\nAw, they deep? Lil' bro go clear the scene\nHe saw the shots but ain't hear the beam\nHe saw the shots but ain't hear the beam\nBeg my pardon, I been sipping lean\nRed or purple, I don't sip the green\n\n[Verse 7: Bibby]\nHold up, turn the beat off\nLil' bro do a hit then skeet off\nThese niggas keep hating, I just feed off it\nFo' fo' bulldog, tear the meat off\n\n[Verse 8: Herb]\nAR 15, tear his head off it\nYour money short, come with it, I'mma wear it off\nAnd every time I see the cops I'mma play it off\nI don't pay no damn note, bitch I pay it off\n\n[Verse 9: Bibby]\nReal black tints, I just hide in the whip\nNew M6, no miles on my shit\nCan't waste no time with a bitch\nMoney coming, I'm just piling the shit\n\n[Verse 10: Herb]\nIt keep coming now I can't get enough\nBitch suck me to death, now I can't get it up\nMy shooters on the line like Ginobli and stuff\nTwo fours in my pop, off the Kobe I'm stuck\n\n[Interlude: Both]\nThese niggas so funny man\nNigga wanna talk man then a nigga get dropped down one\nSay what you got to say, what they gon' say?\nNiggas already know what it is man\nWe been doing this shit man\nNiggas know we been the hottest, we been getting money\nWe been pulling up on whatever blocks, wetting shit, gang!\nI'm going back in, Free Crack 2, the mixtape\n\n[Verse 11: Herb]\nBefore this rapping we was playing with poles\nChasing back and we gon' take a soul\nKeep up with us cause niggas can't no more\nThey like: \"This another Play They Role!\"\n\n[Verse 12: Bibby]\nI'm getting money, all my cases old\nA nigga can't never say he told\nUsed to weigh the grams, now they weigh the gold\nRob who, fill his face with holes"}], "artist": "Lil Bibby"}