{"songs": [{"year": null, "image": "https://images.genius.com/92732fae03cf85278cf7ce2fec9e6f0e.400x400x1.jpg", "title": "Babylon", "album": "For the Fans", "lyrics": "[Intro: Bizzy Bone]\nYeah... uh, uh. That's what I'm talkin' about\nReady to do this shit? Let's do this\n\n[Hook: Bizzy Bone]\nI Be... I am what I am, a man from The Land, never ran [x2]\n\n[Verse 1: Bizzy Bone]\nWho lead the rebellion? Who the future? David Ruffen up in this motherfucker\nReady for restitution, execution up in this motherfucker\nYou know what I do and you know that I'm fully prepared to use it, 9 Millimeter up under the pillow;\nI guess that I'm just a bad influence\nIt's not that I'm givin' a fuck, but I never was Judas\nYou're lucky that I never told anybody what was goin' on wit a me Ruthless\nIt was ridiculous, very meticulous, true this\nThey don't want me and nothin with that I know what it is and I'm ready to do this\nI ain't givin' a minute to anyone, and anyone tried to get me\nStay in the streets; Even if they stuck me I got my people with me\nYuck, in embalmin' fluid incinerate me like chicken strips or butterflied like Filet Mignon with the grease oozin\n(Whoo!) Ghetto-traffical, metaphoric, it was mathematical\nAnd if it ain't no love then I guess we've gots to battle\nWhat? What rapper love the machine gun rattle\nEverybody scatter, dog, cause we compatible\nWho got that Babylon babble? Poverty! Fuck!\nI'm almost 30 and I needs to be in a castle but I'm stuck\nDon't nobody want to help to the pay\nSomebody's gonna feel my talent, of course you gon' feel the guage\nI'm a fuckin' slave Still the animal they can't contain\nA kid said he was mutilated, o master he not playin games\nAfter the rapture if I'm still in this bitch\nI pray to my baby's they just dissappear, I'll be repentant\n\n[Hook: Bizzy Bone]\nI Be... I am what I am, a man from The Land, never ran\nI Be... I am what I am, a man from The Land, never ran\nI am... Never ran\n\n[Bridge: Bizzy Bone]\nComin in with a Dolly with a muzzle over my mug\nGet together a party where the killas showin me love\nWe're together so we get on the level and pick it up they pick at the dust interrogator with metal cuffs [x2]\nPickin em out drink a bacardi we wicked now\nThe bigger the cup the quicker we figure to fill em up I'm sick in the mouth\n\n[Verse 3: Baby Phil]\n(7 Sign in the club, nigga)\nWhat? It's ready to get me so niggas, just come and get me with that 9 Milimeter with the seventeen shot clip\nPuttin' bullets up in your body, I'm makin' you bleed\nMotherfuckers is after reefer but nigga just please believe it\nJust a real killa, nigga\nI done told you motherfuckers ya'll can bring it on, bring the drama, cause I'm gon' bring it to you motherfuckers\nAny nigga put it down for the South side nigga, we gon' put this shit up in ya nigga\nJust bring on the drama, motherfucker cause any you bitches can feel this, nigga what?\nCause we keepin' it real and strong, marchin' with my soldiers all by my side gettin' it on, crunkin' up the spot, blazin' up your block, up this atmosphere\nGot this shit on fire like this motherfuckin' inhaler nigga\nCause we some killas, and we some boutin' ass niggas and we ready to ride\nUs niggas countin' real mad figures\nHundred and Benjamins\nNiggas better believe, cause, bring it on motherfuckers\nWe be real, bitch\nCause we be ready for your ass, hit you niggas with this hot steel\nGot to hustle cause I need to feed my kids a meal\nBut fuck that shit, I'm on a roll tryin' to get it on\nCome on Bizzy Bone, let's roll\n\n[Hook: Bizzy Bone]\nI Be... I am what I am, a man from The Land, ever ran\nI Be... I am what I am, I am what I am\n(7 Sign in the field and, nigga what? 7 Sign in the field and, nigga what?\n7 Sign in the field and, nigga what? These niggas raw, these niggas raw)\nI be... Soul spirits, Soul spirits, Soul spirits, Soul spirits, Soul spirits, Soul spirits\nI Be... I am what I am, a man from The Land, never ran\nI Be... I am what I am, I am what I am..."}], "artist": "Bizzy Bone"}