{"artist": "Moneybagg Yo & Yo Gotti", "songs": [{"album": "2 Federal", "image": "https://images.genius.com/ef27ad448ef739e5a0447c8415761b9f.1000x1000x1.jpg", "year": "2016-10-31", "lyrics": "[Intro]\nMan when I was a broke nigga I used to be like. When I get my money on, I'ma spend it on this, I'ma spend it on that. I always knew I was gonna get some money so I looked at it like practice. Like I was just getting ready for the bag, you know what I'm saying? Pratice you feel me\n\n[Hook]\nI'm money making Mitch, I need a money making bitch\nI spent 200 on the kit, 1500 on the kicks\nI'm money making Mitch, I need a money making bitch\nI spent 200 on the kit, 1500 on the kicks\nLook I just hit a lick, spend 250 on the whip\nAnother 50 on a trip just to fuck your bitch nigga\nJust got a check, that bitch got 2, 3, commas\nLook like an out of town number\nI'm going hard for 2, 3, summers\nI'm money making Mitch, I need a money making bitch\nI spent 200 on the kit, 1500 on the kicks\n\n[Verse 1]\nMargiela king nigga, Balenciaga don nigga\nI'm on my Blac Youngsta bitch when I'm young nigga\nI'm money making Mitch, Ace Boogie with the bricks\nI'm Calvin with the hits, I'll come and take a nigga shit\nSigned Blac Youngsta on a jet then I took him to the 'jects\nThen I gave the nigga a Lambo just to show him he was next\nI'm charging 80 for the 100 pack, 70 if you run it back\n60 if you triple that, if I say nickel that's a 50 pack\nI can talk dope all day, I can count money all day\nYou can fuck hoes all day, I'ma count it while y'all play\n\n[Verse 2]\nI'm money making Mitch, I need a money making bitch\nNeed her ass hella thick, need her hair always fixed\nLike my bitch's hips hella wide\nTell 'em fuck a dime we don't do the gym\nTell my niggas just keep it quiet, no back and forth gon' go and see him\nNiggas in the fed, niggas dead before I be a pussy before I go and join 'em\nNiggas acting tough on the internet, somebody better go inform them\n\n[Verse 3]\nThat I'm money making mitch, I got a whole lotta sticks\nAnd I'm really with the shit, yeah I'm really with the shit\nI'm with the shit, with the shit\nI just copped the Wraith out the dealership\nI just the stones in the Rolex\nI fucked on your sister, your ho next\nI look like the money, that's no flex\nI made a million off snow flakes\nI don't slow down in no time\nI be on gas with no brakes\nI be on gas with no brakes\nI be on cash and no hate\nI be on masks with AKs\nAnd I'ma pull up if you don't pay\n\n[Verse 4]\nCause I'm money making Mitch, I want 30 for a brick\nI want 100 for a show and I ain't got nothing for a bitch\nI ain't riding no more purses, I ain't do no more verses\nI ain't fucking with these niggas, have way more crosses than the churches\nThe doctors are the plugs and the trappers are the nurses\nIs everybody popping pain killers? Is everybody hurting?\nPerc, Zan, Perc, Zan, Perc, Zan, does everybody got anxiety?\nTrap house got variety, fuck wrong with society?\nI'm money making Mitch, I need a money making bitch\nI got a 30 in my clip and I'ma hit you off the rip", "title": "Mitch"}]}