{"artist": "Cadet", "songs": [{"title": "The Strict (Freestyle)", "album": null, "year": null, "image": "https://images.genius.com/9db2bc94a35881662088ec9ddd907bfe.1000x1000x1.jpg", "lyrics": "(Cadet)\nI saw an article about four black girls that couldn't get into the club\nSaw a picture and them girl were buff\nSo tell that promoter to suck his mum\nI bet that his family's black\nFuck everybody else that be living like that\nThese western clubs need to change their ways\nBut a'ight, cool\nLemme get this straight\n\nIf you're skin shade turned down, you get turned down\nIf you're light skin and turn up, you can turn up\nWait\nAnd if you're overweight, the night life is all over\nWait\nI don't get that\nNow I know you can't walk in hoodies, hats, trainers and all of this shit\nBut you're saying that I can't be black and I gotta be buff\nWhen did it get this strict\nReal shit when did it get District\nI'm just tryna understand\nHow is my colour wrong?\nYou're letting bout four people with a mad funny tan like\nI ain't here to start beef and I ain't riff raff, just coming off the streets\nMe, I'm tryna have fun, but what kind of criteria do I have to meet?\nSo because I don't lift weights in the gym, even if I wait, I can't get in\nBecause my girl ain't got the long hair, does that mean that she don't belong here?\n\nI'm sorry my eyes aren't green, they're brown\nKinda boring I know, but I swear I'm a nice person\nMy appearance has no effect on my soul\nSo bouncers and promoters, just please, come away from the doors\nCause the power trip that your on ain't even a trip\nYou're on a power tour\nNah I ain't saying that you're racist, but your judgement needs a round of applause\nCause you don't find her attractive, she can't get in a club that's not even yours\nNow I get that\nYou're a long ting, man I get that\nYeah I get that\nYou know buff on the outside must mean that you're buff on the inside\nSee I get that\n\nI'm sorry Mr Bouncer for coming to you with all this waffle\nBut next time let me know it's not a club and it's an audition for a next top model\nSo you put their nice eyes in the club and everybody with nice vibes in the club\nWell maybe I ain't right for the club cause something bout that ain't right in the club\nI'm gonna leave this alone now\nBut please dwell on this for a second\nI hope God ain't have the same attitude when it comes to letting you into Heaven\nYou know\n\n(Outro)\nAyo big man,big man, big man I beg you let me in there please\nNo? I didn't want to go in anyway\nI got AUX in my car init"}]}