{"songs": [{"lyrics": "[Intro: excerpts from news reports]\n\"The damage here along the Gulf coast is catastrophic\nThere's a frantic effort underway tonight to find survivors\nThere are an uncounted number of the dead tonight.\"\n\n\"People are being forced to live like animals.\"\n\n\"Please... send stuff here. We are desperate.\"\n\n\"No one says the federal government is doing a good job.\"\n\n\"...and hundreds and hundreds and hundreds of people ...\"\n\n\"No water... yeah, and I fought for my country for years.\"\n\n\"We need help. We really need help.\"\n\n\"In Baghdad, they-they drop, they airdrop - water, food to people\nWhy can't they do that for their own people?\"\n\n\"...the same idiots can't get a bottle of water into a\nMajor American city in three days are trying to win a war\"\n\n[Verse 1: Jay-Z]\nPeople was poor before the hurricane came\nBefore the downpour poured, it was like when Mary J. sang\nEveryday it rains, so everyday the pain\nWent ignored and I'm sure ignorance was to blame\nBut life is a chain, cause and effected\nNiggas off the chain, because they affected\nIt's a dirty game, it's whatever is effective\nFrom weed to sellin' 'caine, gotta put that in effect, shit\nWouldn't you loot? If you didn't have the loot\nBaby needed food and you was stuck on the roof\nAnd helicopters swoop down just to get a scoop\nThrough his telescopic lens, but he didn't scoop you\nAnd the next five days, no help ensued\nThey called you a refugee because you seek refuge\nAnd the Commander-in-Chief, just flew by\nDidn't stop, I know he had a couple seats\nJust rude Jet blue, he's not, jet flew by the spot\nWhat if he ran out of jet fuel and just dropped\nHuh, that woulda been somethin' to watch\nHelicopters doin' fly-bys to take a couple shots\nCouple portraits, then ignored 'em\nHe’d be just another Bush surrounded by a couple orchids\nPoor kids, just 'cause they was poor kids\nLeft them on they porches, same old story in New Orleans\nSilly rappers, cause we got a couple Porsches\nMTV stopped by to film our fortresses\nWe forget the unfortunate\nSure, I ponied up a mil' but I didn't give my time\nSo in reality I didn't give a dime\nOr a damn, I just put my monies in the hands\nOf the same people that left my people stranded\nNothin' but a bandit, left them folks abandoned\nDamn, that money we gave was just a band-aid\nCan't say we better off than we was before\nIn synopsis, this is my Minority Report\nCan't say we better off than we was before\nIn synopsis, this is my Minority Report\n\n[Verse 2: Ne-Yo]\nSo many times I'm, coverin' my eyes\nPeekin' through my fingers, tryin' to hide my\nFrustration, at the way, that we treat\n(Seems like we don't even care)\nTurn on the TV, seein' the pain\nSayin' such a shame, then tryin' to go on with my life\nOf that, I too am guilty\n(Seems like we don't even care)\nSo we send a little money, tell 'em it's alright\nTo be able to sleep at night\nYou will pay that price, but some of these folks\nHas lost they whole life\n(Seems like we don't even care)\nAnd then it wasn't on the nightly news no mo'\nSuddenly it didn't matter to you no mo'\nIt went on and almost nothin' changed\nWhat the hell were they there for?\n(Seems like we don't even care)\n\n[Outro - more news excerpts (Ne-Yo)]\n\nBush: \"Buses are on the way to take those\nPeople from New Orleans, to Houston\"\n(Seems like we don't even care)\n\n\"They lie\"\n\n\"People are dying, at the Convention Center\" (ohh)\n\n\"Their government has failed them\" (ohh)\n\nKanye West: \"George Bush doesn't care about black people\"\n\n(Seems like we don't even care)\n(Seems like we don't even care)", "title": "Minority Report", "image": "https://images.genius.com/4371d45b1c52d7dc87e4204ae0aa8373.900x900x1.jpg", "year": "2006-11-21", "album": "Kingdom Come"}], "artist": "JAY-Z"}