{"songs": [{"image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg", "title": "Anaconda (LA Leakers Remix)", "album": null, "year": null, "lyrics": "[Produced by Da Internz and Polow Da Don]\n\n[Intro]\nMy anaconda don't, my anaconda don't\nMy anaconda don't want none unless you got buns, hun\n\n[Verse 1]\nBoy toy named Troy used to live in Detroit\nBig dope dealer money, he was gettin' some coins\nWas in shootouts with the law, but he live in a palace\nBought me Alexander McQueen, he was keeping me stylish\nNow that's real, real, real\nGun in my purse, bitch, I came dressed to kill\nWho wanna go first? I had them pushing daffodils\nI'm high as hell, I only took a half a pill\nI'm on some dumb shit, by the way, what he say?\nHe can tell I ain't missing no meals\nCome through and fuck him in my automobile\nLet him eat it with his grills and he tellin' me to chill\nAnd he telling me it's real, that he love my sex appeal\nSay he don't like 'em boney, he want something he can grab\nSo I pulled up in the Jag, and I hit him with the jab like\nDun-d-d-dun-dun-d-d-dun-dun\n\n[Pre-Hook]\nMy anaconda don't, my anaconda don't\nMy anaconda don't want none unless you got buns, hun\n\n[Hook]\nOh my gosh, look at her butt\nOh my gosh, look at her butt\nOh my gosh, look at her butt\n(Look at her butt)\nLook at, look at, look at\nLook, at her butt\n\n[Verse 2: RiFF RAFF]\nJust got a collect call from Hector, I was on the phone\nOutside of my double decker, Margiela umbrella\nPop trunk in stormy weather, on who? Cinderella\nLobster for breakfast, necklace playin' checkers\nHold up that wrist, her thong red licorice\n[?] Alizé and prescription filled\nCodeine dreams, I lean like Stojaković\nI ain't top 5? What the H-E-double hockey sticks?\nMy left hand was an avalanche\nMy right hand, uh, 8 grand, finna traffic jam\nDoors locked, hundred K on the Porsche box\nMy socks, got glow-in-the-dark rocks\nLA Leakers, bustin' out the speakers\nKeep your mouth closed when JODY HiGHROLLER speakin'\nAss cheeks like two volleyballs\nNeon spandex turnin' heads at the damn mall\nI'll lay down 'fore I lift off\nIn this Lamborghini plane, seats sure are super soft\n[?] Versace lip gloss\nSo I pull up, Mike Myers[?] on the tires\n\n[Pre-Hook + Hook]\n\n[Bridge]\nLittle in the middle but she got much back\nLittle in the middle but she got much back\nLittle in the middle but she got much back\n(Oh my God, look at her butt)\n\n[Pre-Hook] (x2)\n\n[Hook]\n\n[Outro]\nYeah, he love this fat ass, hahahahahahahaha!\nYeah! This one is for my bitches with a fat ass in the fucking club\nI said, where my fat ass big bitches in the club?\nFuck the skinny bitches! Fuck the skinny bitches in the club!\nI wanna see all the big fat ass bitches in the muthafuckin' club\nFuck you if you skinny bitches, what?! Kyuh\nHahahaha RRRRRR\nI got a big fat ass (ass, ass, ass...)\nCome on!"}], "artist": "Nicki Minaj"}