{"songs": [{"title": "Six Hustles", "album": "Mr. Midnight", "year": null, "image": "https://images.genius.com/6659527e1d927b401e994eff3a8867ac.1000x1000x1.jpg", "lyrics": "[Intro]\nCardo got wings\nYeah\nCheck\nYeah\nMan\nAy, ay, ay\n\n[Chorus]\nHit me in the mornin', I got moves to make\nI got six hustles, I go hard and never break\nRunnin’ through these Ben Franks but it's never enough\nThey like, \"Larry, where you been?\" I been runnin' it up\nMy flip game stupid, my whips is the cleanest\nToday I might rock the Rolly for no reason\nAlkaline bust down whena nigga sippin’\nYou gotta really want it, gotta be eager to get it\nWhat's happenin'?\n\n[Verse 1]\nBaby, quit playin', nobody can do it better\nSilk button up on this customized leather\nShe gon' come runnin' back to me if I let her\nTwo thousand dollar peacoat, no labels or nothin'\nHad to throw her off, picked her up in my under\nLet her stay the night and I barely even touched her\nSex not everything, baby, I like money\nMy dick won't even get hard with no connection\nMonday, diamond district, new necklace\nYou got the watch but no whip? You niggas trippin’\nI’m walkin' through the SLS with about fifty\nCouple drinks, quick flight, we to Phoenix\nEighty-five thousand, made that in two meetings\nYou shoulda held it down while you could, you was sleepin’\nYou can call me anything but you can never call me broke\nPut this tape in the  deck and get a real P's hope\n\n[Chorus]\nHit me in the mornin', I got moves to make\nI got six hustles, I go hard and never break\nRunnin' through these Ben Franks but it’s never enough\nThey like, \"Larry, where you been?\" I been runnin' it up\nMy flip game stupid, my whips is the cleanest\nToday I might rock the Rolly for no reason\nAlkaline bust down whena nigga sippin'\nYou gotta really want it, gotta be eager to get it\nWhat's happenin'?\n\n[Verse 2]\nFacetime a nigga, baby, so I know it's real\nI'm eatin' crab, view of the bridge, right by the crib\nI like your style, what's your sign? Maybe we can chill\nHit it from the back, tell me how it feel\nLook, the pussy wetter than a baby seal\nMy numbers goin' up, I'm like, \"Fuck a deal\"\nSold out shows, no agent's deal\nTake my talents to the south, it's time to make a mill\nSold out first day with the hat deal\nMoms had me at fifteen, how'd I make it here?\nI got a whole lot of hustle in this ambition\nSince a young nigga I been chasin' chicken\nI love all women, but I keep it pimpin'\nTouched a half a ticket in these Scottie Pippens\nCrew neck, bucket hat, I just keep it simple\nRolex 36, it's a Presidential\n\n[Chorus]\nHit me in the mornin', I got moves to make\nI got six hustles, I go hard and never break\nRunnin' through these Ben Franks but it's never enough\nThey like, \"Larry, where you been?\" I been runnin' it up\nMy flip game stupid, my whips is the cleanest\nToday I might rock the Rolly for no reason\nAlkaline bust down whena nigga sippin'\nYou gotta really want it, gotta be eager to get it\nWhat's happenin'?\n\n[Outro]\nGod damn\nYou gotta really want it, ayy, ayy\nYou gotta really want it, want it, ayy\nI'm on the road for these pesos\nAyy, ayy\nI'm on the road for these pesos\nAyy, ayy\nI'm on the road for these pesos\nAy, you already know how I'm rockin', nigga\nEverything I do is organic, bitch-ass nigga\nYa know what I'm sayin'?\nSounds like Cardo\nYeah\nAy, ay, ay, ay, ay"}], "artist": "Larry June"}