{"songs": [{"title": "Battle Song", "album": "Rehab: The Overdose", "year": "2011-01-11", "image": "https://images.genius.com/f4cd18c738c90184c647f29ea90867c6.540x540x1.jpg", "lyrics": "[Intro]\nOh yeah! (Oh yeah)\nHere we go! (Here we go)\nA little rough! (A little rough)\nNo sweat! (No sweat)\nI can do it! (I can do it)\nYou can do it! (You can do it)\nOoorah! (Ooorah)\nLeft right...\n\n[Hook: Natalie Lauren]\nTell 'em bring their guns out\nSend my city up in flames\nAnd yea though I walk through the valley of the dead\nBut my hope still remains\nWhether dead or alive, this is do or die\nWhen Christ is the gain\nSo raise your torches up high\nTonight we fight for our King\n\n[Verse 1: Lecrae]\nI was Tailored to snatch the mic' Swiftly like Ye' did\nAnd lay it down for the king like a sleigh bed\nAnd they can kill us now, go get the yellow tape\nHey put me 6 feet in the ground and watch a great escape\nI promise, ain't a 6 shooter that can keep me down\nMy God's so official, that's a technical foul\nWas engineered in my mother's womb for Gods' glory\nPlenty faith in the persecution is inventory\nI been spit in the face, still exhibiting grace\nKicked out many a place, just for sharing my faith\nMy belt tight, shoes laced, plus a breastplate\nMy war helmet on now I got my head straight\nThe battle's on but the war is over when Jesus reigns\nAnd fo' His name I withstand the pressure and take the pain\nAnd if they drop us, this promise, we'll take it to the grave\nThat tonight we may die, but to die is our gain!\n\n[Hook: Natalie Lauren]\nTell 'em bring their guns out\nSend my city up in flames\nAnd yea though I walk through the valley of the dead\nBut my hope still remains\nWhether dead or alive, this is do or die\nWhen Christ is the gain\nSo raise your torches up high\nTonight we fight for our King\n[Sample]\nBout to be a riot, guns and fire, Somebody's dyin'\n\n[Verse 2: Natalie Lauren]\nBut it won't be us, covered in His blood, spillin' our guts\nBut even if it was, let our dust blow in the wind, we win when it's done\nChrist puttin' out thunder-raps with the nuns\nSo I am taking no prisoners, not-a-one\nNone, and no I'm not The One\nI just run solar in the power of The Son\nMy God's a m-m-monsta\nTreads on Black mambas defeats and conquers\n\n[Hook: Natalie Lauren]\nTell 'em bring their guns out\nSend my city up in flames\nAnd yea though I walk through the valley of the dead\nBut my hope still remains\nWhether dead or alive, this is do or die\nWhen Christ is the gain\nSo raise your torches up high\nTonight we fight for our King\n\n[Verse 3: Lecrae]\nYeah, ready to die, notorious for our martyrs man\nWe die daily and wake up and do it all again\nEither we certain or we certainly insane\nBullets riddlin' our frame, still we don't deny the Name\nMaybe we lost it, we vuelvo loco\nCause Heaven is my home homie I ain't local\nI'm so vocal\nChords of a chorus say we tied to the Lord like Chords\nOf course\nHey what a course, if I get to goin' in\nI'm going off like \"kill me\" I'm still goin' in\nGod, by all means possible\nGive me the faith to live and die for the gospel\n\n[Hook: Natalie Lauren]\nTell 'em bring their guns out\nSend my city up in flames\nAnd yea though I walk through the valley of the dead\nBut my hope still remains\nWhether dead or alive, this is do or die\nWhen Christ is the gain\nSo raise your torches up high\nTonight we fight for our King"}], "artist": "Lecrae"}