{"songs": [{"lyrics": "[Beanie Sigel]\n1-900-Hustler, Sigel, holla at your boy\nWhat's the problem shorty?\n\n[Shorty]\nYeah whattup man\nI'm the only nigga from Brooklyn out here man\nI'm tryin to lock the spot down, holla at me\n\n[Beanie Sigel]\nAlright; hold on - Hova, line one\n\n[Verse 1: Jay-Z]\nHere's a couple of suggestions of how you could finesse it\nYou find a dude in town, you send him a short message\nSay, \"Hey, I'm new in town, I don't know my way around\nBut I got some soft white that's sure to come back brown\nI get that butter all night\nCause most niggas don't know a brick from a bite\nThey keep buying hard white\nAnd if you free tomorrow night we can meet and discuss price\nFYI, I never been robbed in my life\"\nOr -- you find a chick, shit, you hole up in her crib and\nLet her introduce you 'round town like her man\nShake hands, make friends like it's all innocent\nThen -- before they look up you sellin the town cook-up\nOr -- gorilla pimp, come up on that killer shit\nTake a nigga brick, smack him, then you sell it back to them\nStill there Brooklyn?\n\n[Shorty]\nYeah yeah that's gangsta, I think I'mma roll with that one\n\n[Jay-Z]\nMake out a check for eight hundred dollars\nJigga Man, holla {*click*, *dial tone*}\n\n[Beans] 1-900-Hustler, Sigel, holla at your boy\n[Chris] Whassup Sig? This Chris out the Young Guns dog\n[Beans] Whattup?\n[Chris] I'm ready to smash these niggas in the rap game\nThe niggas takin too long with that advance money and shit\n[Beans] Yeah\n[Chris] Talkin 'bout chill, chill don't pay the bills\n[Beans] Yeah I feel that\n[Chris] I know you well connected dog\nLet me holla at somebody real\n[Beans] Aight look, I got the perfect person for you, hold on\nBleek, line two\n\n[Verse 2: Memphis Bleek]\nListen shorty, you wanna roll just give me the word\nI ain't got time for a sentence all that shit is absurd\nYou find a strip first, if you don't cook find a bitch first\nIf you don't hustle find a nigga who pitch first\nYou new in town, no red and blue in town, that's gangs\nDon't get fresh, let 'em know you small change\nThe strong move quiet, the weak start riots\nWe know you got a brick but sell 'em twenties til they tired\nWith no credit, you know you sick with that gotta eat fetish\nAnd other niggas who gettin it - DEAD IT\nMake 'em an offer that they can't refuse\nHe resists, box him in, til he can't be moved\nHere's the rules: chop it, bag it, stash it, stack it\nGet in, get out - that's a O.G.'s classic\n900-Hustler, you pass it around\nWanna speak to me direct, hit extension trey-pound, I'm out\n{*click*, *dial tone*}\n\n[Beans] 1-900-Hustler, Sigel, holla at your dog\nWhat seem to be the problem young boy?\n[MDKHN] Yo whattup, this Murder Def Kill Homicide Nigga\nI got two bricks\n[Beans] Yo watch your fuckin mouth man\n[MDKHN] Fuck you mean watch my mouth nigga?\nBeen on hold for about two hours nigga\n[Beans] I don't give a fuck how long you been on the line;\nShut the fuck up! Matter of fact, hold on\n{*click*, *classical type music plays*}\n[MDKHN] I know this nigga ain't just put.. put me on hold man\nThis bullshit-ass elevator music\n[Beans] Free, pick up line five\n\n[Verse 3: Freeway]\nFirst things first, watch what you say out your mouth\nWhen you talkin on the phone to hus-tlers\nNever play the house, think drought, keep heat in the couch\nWhen you sittin in the presence of cus-tomers\nNever hold out, pull out, throw heat and be out\nIf a nigga ever think that he touchin-ya\nLay low, get cake, whip all over the state\nStash dough, whip yay with, right amount of bake (ho!)\nNigga too close went right around his place (yo!)\nYou stoppin dough when we clutching the gas\nI know you heard \"Friend or Foe,\" this ain't different from that\nMake sure you got your four-four and he can slip if he like\nYoung, Jon Benet daughter missin tonight and yo\nUntil you up stay away from them dice and whores\nThree smuts, two straights and a dyke\nCause boys want three bundles two streaks and pipe for sure\nAnd if it's tight, then he might come back for more\nNine and four, everyday back and forth\nWinter to summer, 1-900-Hustler\nPass the number til you're stackin balls\nTell you how to weigh shit wet and package more\nI take cash or write the check out to F-R\nTwo E's, that'll be two G's\nAnd forget my money I'm comin for all your ki's, nigga\n{*click*, *dial tone*}\n\n[Beans] 1-900-Hustler, Sigel, holla at your boy dog\n[MDKHN] Yo whattup young, you put me on hold earlier man what happened\n[Beans] Yeah you stupid motherfucker {MDKHN: Watch your mouth man}\nYou talkin all reckless on the phone\n[Beans] Fuck you think this the\nGet-Indicted-Hotline or somethin motherfucker?\n[MDKHN] Yo, my bad man, my bad\nI know I was talkin reckless earlier about them two chickens\nYou get it, you know, two chickens? But listen\n[Beans] What?\n[MDKHN] Just tell me how to move this shit man\nI'm pushin hardly half a wing back nigga, holla\n[Beans] Get a job, holla at Perdue!\n{*click*, *dial tone*}", "title": "1-900-Hustler", "image": "https://images.genius.com/c91a9bc0eb9aaf290224ebeaabd243a0.640x640x1.jpg", "year": "2000-10-31", "album": "The Dynasty: Roc La Familia"}], "artist": "JAY-Z"}