{"songs": [{"image": "https://images.genius.com/2cbec7b745c109ceb67758132235acd9.600x600x1.jpg", "year": "1998-08-25", "title": "Handle Your Business", "album": "40 Days & 40 Nightz", "lyrics": "[Intro: Xzibit]\nYeah, uh, what, worldwide\n\n[Verse 1: Xzibit]\nYeah, I'm forever, ever lastin, spread the wealth\nProcrastination like masturbation, your fuckin yourself\nSo we gonna move on em quickly (what)\nNo chance to think about coming back\nChain smoke em, turn they lungs black\nSee I was raised to love black, but sometimes\nBlack folks wanna sweat you harder than the one-time\nNever participate in dumb, deaf and blind shit\nPlus I got my little man, so daily I'm reminded\nThe ride only gets rougher (right)\nBut I'll be damned if me and my niggas suffer\nSmuggle this motherucker with the raw shit, I'm blessed wit\nLookin at the world, burned for the young and the desperate\nShowed heart, but got cardiac arrested\nMore than a nigga with an image and a press kit\nThe wreck hits, creates desert land, desolate\nThe whole intent to rock the shit, keep the herb lit\n\n[Chorus: Xzibit & (Defari)]\nHandle your business before your business handles you\nMister X to the Z (and Defari Herut), one two\n(Remain true, regardless what we go through)\nYeah, handle your business so you can stand on you're on two\nHandle your business before your business handles you\nMister X to the Z (and Defari Herut), one two\n(Remain true, regardless what we go through)\nYeah, handle your business so you can stand on you're on two\n\n[Verse 2: Defari]\nEveryday I puts in down in LA, hustle in this\nAssassin lyricist, serious, muscle in this\nI call the bets, I know we got coordinates on more games to wreck\nWe blaze shows, never no Half Step\nTactics, B-Boys, no games no antics\nNo false images, no bullshit semantics\nWe planned this, for hundreds of thousands\nReignin' on they brains with lyrics, from the mountains\nDon't contemplate what you can't even demonstrate\nDefari lottery draft pick, never the second rate\nNigga who wanna hate but front like its all great\nI gots no time for these emotional niggas, I gots to motivate\nMoves to make, best rhyme straight\nThat's for the old school, this here's our year, it's time to elevate\nHandle this, don't hesitate got money to make\nPush maximum levels from the Golden State\n\n[Chorus: Xzibit & (Defari)]\nHandle your business before your business handles you\nMister X to the Z (and Defari Herut), one two\n(Remain true, regardless what we go through)\nYeah, handle your business so you can stand on you're on two\nHandle your business before your business handles you\nMister X to the Z (and Defari Herut), one two\n(Remain true, regardless what we go through)\nYeah, handle your business so you can stand on you're on two\n\n[Verse 3: Defari]\nThis combination's high caliber\nHaitians stay amazed and confused like this was algebra\nI'm scoutin the, best land for property\nNever sloppily, picture someone stoppin me\nFrom gettin mine, line after line\nAnd you wonder why I call these fake niggas Miller\nThey think they Genuine; I'm startin to shine, imported Italian\nWith a custom made Herut charm as my medallion\n\n[Verse 4: Xzibit]\nSeem like, I recite the same prayer every night\nWatch my folks, make sure my dogs stay tight\nAnd fully prepared to gunfight in broad daylight\nTill then, lick it to the chin, let it begin\nWe could break bread or break skin; and watch me send it\nTry not to break the law, sometimes I gotta bend it\nAnd my directions, suggest for your own protection\nYou motherfuckers keep it movin like an intersection\n\n[Chorus: Xzibit & (Defari)]\nHandle your business before your business handles you\nMister X to the Z (and Defari Herut), one two\n(Remain true, regardless what we go through)\nYeah, handle your business so you can stand on you're on two\nHandle your business before your business handles you\nMister X to the Z (and Defari Herut), one two\n(Remain true, regardless what we go through)\nYeah, handle your business so you can stand on you're on two\n\n[Outro]\nSerious business *scratched in background*\nFuck you, like that Mr. X to the Z, Defari Herut. Yeah, yeah right? Fuck you, like that Mr. X to the Z, Defari Herut. Yeah, yeah right?\nFuck you, like that Mr. X to the Z, Defari Herut. Yeah, yeah right?\nWhat, keep it movin like this y'all"}], "artist": "Xzibit"}