{"songs": [{"image": "https://images.genius.com/508b912f569b8bb0c6714a8272e0e931.400x397x1.jpg", "title": "All Hotties Eat the Jizz", "album": "Gory Days", "year": null, "lyrics": "You thought you're really dirty?\nNow try some of this filth!\n\n[Verse 1]\nYou got to douche your puss cause that shits stinky\nMy scum is screaming drink me\nMy cocks like a slinky, plus my pinky is kinky\nEssentials through ya mental, Club Confidential\nMy fallace shoved in the mouth of Yentle equals crazy potential\nHow 'bout I tear apart the vagina of Asia Carrera\nShockin' Asia, how 'bout I shove my cock in Tasia\nFrom Glenwood PJ's, she used to give me bj's\nThat bitch was tight, I sliced her panties off with a kitchen knife\nWhat'chu do to your tits?\nHad the silicone implant em', enlarge em', reduce em'\nNow them shits look like the gruesome two-some\nNo jive'in, I'm down with muff divin' at a drive-in\nI'll make a pig of ya, treat you like a slut from Caligula\nWith some cannabis sativa, my flesh cleaver\nWill be rippin' to pieces the trashy beaver of diva\nMy phone sex, will have you fucking your receiver\nThrough sex phone ads, I got sluts sucking my gonads\nYour tits are so big you could call the ones on Dolly small\nSuck them shits, C-cups bigger than fuckin' volleyballs\nFor me to grip my meat and beat it\nNo credit cards needed, my cock's a frankfurter heated\nHungry hooker here eat it!\n\n[Hook]\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\n[Verse 2]\nI hope you can digest my fresh flesh for real\nYou like t.v. dinners? My fuckin' cock's a gourmet meal\nI'm jerkin' off, ripped on hash hits\nPeepin' twats lick clits and flash tits\nI got a wide variety\nOf high society whores like Rosanna Arquette\nHer pussy's cheaper than food up in the Marquette, my star pet\nMushy shit like panties in her pussy lips\nGive her a spankin', and shove my shank in, and leave her tushy split\nHit up a honey's tunnel of Nestle\nI'll make a lesbian out of Lisa Marie Presley\nI'ma play John Leslie\nYou're dead if ya homely\nMy shits for adults over 8 years old only\nI ran mad game son on Jenna Jameson\nJust to name some, hookers that ate cum\nMy dick, Im'a make Mother Teresa eat it\nI'd like to treat Lisa Lisa sweet\nBitch Im'a fuck you like a piece of meat\n\n[Hook]\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\n[Verse 3]\nMake way for my wiener hits\nPounding ya' mound and it's double pleasure\nCause you got an extra treasure of a vagina between your tits\nThis D-Cups for ya', I'm filthy like Vince Voyeur\nShtuppin' 50 year old Erika Boyer O'Coller\nI'll leave Victoria perished, embarrased when I fuck her with carrots\nShe's the younger version of Mrs. Garrett\nMy speech is arrogant as I get sucked simultaneously\nBy J.R. Carrington and Christaro Barrington\nShove my dicky in Nikki Lynn fingerin' Nikki Sinn\nSo she'll be rockin' the sticky chin\nMy companion is Christy Canyon her cunt's like the Grand Canyon\nI'll strangle her tits with lanyid\nYou're wife'll bug when I suck her nipples\nAnd have em' point you like a rifle slug\nMy sex is a trifle drug\nEvery tit gets the same treatment\nI eat ya' puss you suck my dick it's an agreement\n\n[Hook]\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz\n\nAll hotties eat the jizz\nAll hotties eat the jizz"}], "artist": "Necro"}