{"artist": "Kokane", "songs": [{"image": "https://images.genius.com/e73eb27a7600d8b4d7ea7d1adf27e6ec.1000x1000x1.png", "title": "Mo’ Water", "year": "1994-04-12", "album": "Funk Upon a Rhyme", "lyrics": "[Intro]\nElliot beeswax\nAlcaphunk\nNo artificial flavors\nAlias b maximus\nA/K/A no additive preservatives\nSo get out my funk\nGet of my funk\nI'd watch out\nFor this is the season\nOf the Chrome syndrome\n\n[Verse 1]\nQuite nonchalantly, my name is Kokane\nI got the nickel sack of that potent rap crap\nAlmighty Jah, thank you for the buddha\nBut if you know this corp? doin coke\nThen I suggest that you can\nRolla-rolla feds on upon you know\nYo, my name is Kokane not Adee Do\nSo overfill an piss a funkaholic in my kizup?\nYou wanna see me vomit, or should I say throw up\nThrow up style, never hold a damn thing back\nI just had to re-up, and now I got the fat sacks\nIt's like 'Tini and Rossi, but don't mix\nBend over bitch and I'mma stick it with the quickness\nA-ha, a-ha, you got the right one, baby\nSay Mr. stucky lucky but I really don't wanna maybe\nBut baby, but baby, don't mean no harmin'\nSo I just skip to the lou, skip to the lou\nSkip to the lou my darling\n\n[Chorus 4X]\nNow I bet you got mo' water upstairs\nThan you got sugar on a candy cane\n\nWhere'd you get your funk from? (Repeat)\n\n[Verse 2]\nNow I come from the West, Cali-funk-i-a\nYou say, 'Let me borrow this style\nWe gotta pay you back on Tuesday'\nYou look like a base-head, see\n'Cause my style is the cavi, so try another cookie\nYo, I think that East battle West is like dumb\nAnd play my fuckin' video\nIt don't matter what coast I come from\nThree-wheel wicked, Chevy Impala\nIt's time to pick up a honey dip\nAnd rent a room at the Ramada\nAfter flauntin' my words I leave crush\nTook of the gears and time to have sex\nI'm all in them skins like bam bam\nSo won't you play like Red Hot Chili Peppers and\nGive it away, give it away, give it away, give it away, give it away now\nGive it away, give it away, give it away now\nShe said 'Death do us part?', I said 'Whatever'\nKnow I'm all in them p-u double crooked letters\nThere's a lot of MC who need to get smoked, fool\n'Cause you got a gang of baking soda in ya dope\nTalkin' 'bout you did drive-bys out your Regal\nKill a thousand niggas on one maxi-single\nNo, nope, not, not, the style don't fit\nAnd you swear that your motherfuckin' ass is the shit\n\n[Chorus]"}]}