{"songs": [{"year": null, "image": "https://images.genius.com/8f42b22ec5549467826fbd0c750ab571.450x450x1.jpg", "title": "No Mother, No Father", "album": "Who’s Hard: Gang Starr Presents Big Shug", "lyrics": "[Intro]\nYeah, this is going out to those who grew up without a mother or a father\nI know what I mean?\nIt's tough, but sometimes you got to hold your head up high\nYou got to do what you got to do\nLet me talk about my life for a minute\nYo pay attention\n\n[Verse 1]\n14 years old, the grown man\nHad to hit the streets and get the cream at Murderpan\nMoms bounced on the fam\nImagine this, now we're really in a jam, damn\nAt this time, pops duke wasn't thinking\nSpent his time sniffing coke and drinking\nAt one time for a seas this man will bleed\nBut now I proceed to take the lead\nI got brothers and sisters to feed\nSo Shug's coming, you best take heed\nAnyone could be a victim\nSo like an attack dog, I ha ha ha stick 'em\nSome would think it's life to be cool\nHanging out all night then get up and go to school\nFools, this shit was stressing\nEveryday fucked up, but I still count my blessings\nNo pops to tell me wrong from right\nNo moms to fucking hold my hand at night\nThey say I'm heading for trouble\nThey say I'll end up doing life, maybe double, hmmm\nSuspensions mean nothing to me\nCall my crib if you want to, no daddy\nI'm 16 with my own caddie\nIt's fucked up niggas stay mad at me\nWith no father or mother\nAdvice going one ear, then right out the other\nThis shit hurt bad, heartfelt\nBut you learn to play the hand you was dealt\nWith no mother\n\n[Hook]\nNo mother, no father\nWhere will I go?\nNo mother, no father\nWhat will I do?\nHow will I grow?\n\n[Verse 2]\n19 now, I had to get away\nI made moves and broke out to a land of GA\nHooked up with moms out that way\nTold me that she loved me, so we played it day by day\nAbout a month went by\nAnd to no surprise, she woke up and told me goodbye\nMy pops warned me of this move\nBut I ain't running back home, I got to show and prove\nI caught a job at Lenox Mall\nCause in the face of adversity, I stand tall\nI sold weed to make ends meat\nCause I loved to live nice plus I loved to eat\nParties every night, turned them out\nHooked up with my man, Guru, at Morehouse\nTalk of dreams of being a rap star\nFormed a rap duo better known as Gang Starr\nTold my pops about my dreams out of town\nBut like he did before, he shot this one down\nNo father\n\n[Interlude]\nYeah\nThis shit is real\nYeah, yeah\n\n[Hook]\n\n[Verse 3]\n23, I broke back to Bosstown\nBut when I came to town, crack came to town\nNearly blew my ass down\nMy pride and my dignity, nowhere to be found\nMy life, the epitome of hardcore\nI was robbing everything from Burger Kings to liquor stores\nYou want more? I was out of control\nGot bagged 8 to 10, with 3 to serve at [?]\nMy life was no joke\nAt about this time, pop duke caught a stroke\nMy life and my dreams all went up in smoke\nToo damn strong to hang myself by a rope\nOne day in my cell feeling blue\nI got a kite from my main man, Guru\nHe told me what to do\nHe said if you get your shit right, there's a chance for you\nRight then, it hit me like a metal pipe\nI'ma rock mics for the rest of my life\nNo longer will my mind be cluttered\nI was able to make it without my father or my mother\nBut I love them still\nAnd if they stay together, my life might not be ill\nBut you got to do what you got to do\nAnd for the rest of my fam, this one's for you\nYeah\n\n[Hook]"}], "artist": "Big Shug"}