{"songs": [{"lyrics": "[Produced by DJ Quik]\n\n[Intro: JAY-Z]\nUhh, this feel right right here, Quik\nIt's like it's supposed to happen this one right here\nYoung! God damn\nLet me justify my thug on this one right here\n\n[Verse 1: JAY-Z]\nIt goes one o'clock, two o'clock, three o'clock, Roc\nFive six seven o'clock, eight o'clock, Roc\n11 o'clock, 12 o'clock, the party 'bout to pop\nThen, Roc-A-Fella y'all, it's your boy S. Dot\nAnd I ain't never been to jail; I ain't never pay a nigga\nTo do no dirt for me I was scared to do myself\nI will never tell, even if it means sittin' in a cell\nI ain't never ran, never will\nI ain't never been smacked; a nigga better keep his hands\nTo himself or get clapped for what's under that man's belt\nI never asked for nothin' I don't demand of myself\nHonesty, loyalty, friends and then wealth\nDeath before dishonor and I tell you what else\nI tighten my belt 'fore I beg for help\nFoolish pride is what held me together through the years\nI wasn't felt which is why I ain't never played myself\nI just play the hand I'm dealt, I can't say I've never knelt\nBefore God and asked for better cards at times to no avail\nBut I never sat back feelin' sorry for myself\nIf you don't give me heaven I'll raise hell\n'Til it's heaven\n\n[Chorus: Sharlotte Gibson]\nJustify my thug for you\nMy thug (hoping)\nMy thug (praying) for you\nTo justify my thug\nMy thug (hoping)\nMy thug (praying) for you\nFor you\n\n[Verse 2: JAY-Z]\nNow if you shoot my dog, I'ma kill yo' cat\nJust the unwritten laws in rap, know that\nFor every action there's a reaction, don't have me relapsin'\nRelaxin's what I'm about, but about mine\nDon't be actin like you can't see street action\nTake me back to Reasonable Doubt time\nYou see my mind's on the finish line, facin' the wreck\nI put my muh'fuckin' faith in the TEC, tell Satan not yet\nYou understand I am chasin' my breath\nI am narrowly escapin' my death, oh yes\nI am the Michael Schumacher of the Roc roster\nTravellin' Mach 5, barrel in my apparel can stop God\nGod forgive me but I can't let them deliver me to you\nUntil, I won this race, then eventually\nMy engine gon' burn out, I get whatever is meant for me\nHowever it turns out fine, red line!\n\n[Chorus: Sharlotte Gibson]\nJustify my thug for you\nMy thug (hoping)\nMy thug (praying) for you\nTo justify my thug\nMy thug (hoping)\nMy thug (praying) for you\nFor you\n\n[Verse 3: JAY-Z]\nThey say an eye for an eye, we both lose our sight\nAnd two wrongs don't make a right\nBut when you been wronged and you know all along that it's just one life\nAt what point does one fight? (Good question, right?)\n'Fore you knock the war, try to put your dogs in his\nTen-and-a-halfs, for a minute-and-a-half\nBet that stops all the grinnin' and the laughs\nWhen you play the game of life and the win ain't in the bag\nWhen your options is none and the pen is all you have\nOr the block, niggas standin' tight as lemons on the ave\nTryin' to cop a shop - call theyself cleansin' in the cash\nBut can't put they name on paper 'cause, then you on blast\nMr. President, there's drugs in our residence\nTell me what you want me to do, come break bread with us\nMr. Governor, I swear there's a cover up\nEvery other corner there's a liquor store, fuck is up?\n\n[Chorus: Sharlotte Gibson]\nJustify my thug for you\nMy thug (hoping)\nMy thug (praying) for you\nTo justify my thug\nMy thug (hoping)\nMy thug (praying) for you\nFor you", "title": "Justify My Thug", "image": "https://images.rapgenius.com/db98dd9c59a51c9b6b76f6d6a32cac9f.991x1000x1.jpg", "year": "2003-11-14", "album": "The Black Album"}], "artist": "JAY-Z"}