{"songs": [{"album": "S.I.D. ”Shining in Darkness", "year": null, "title": "Fuk That", "image": "https://images.genius.com/405a5067b45fd58bd084f3542906675a.1000x1000x1.jpg", "lyrics": "The Mekanix\n\n[Verse 1: J. Stalin]\nNah, I ain't trying to dance nigga fuck that\nI done popped all these pills so where the love at\nWhere the bad bitches and the drugs at\nFuck that, I'm trying to bring high street back\nThis molly got me hard as the concrete\nMy bitch call me Too $hort she know I been a freak\nWhere your friend at I need a two-piece\nPut that pussy on my head like a kufi\nGirl that ass so big and it juicy\nThrow that pussy at me ain't gotta give me a roofie\nI ain't got a lot of manners so excuse me\nFuck my dick, you can have it bitch use me\nI don't give a fuck about no motherfucking floozy\nFuck you, I'm a dog like Snoopy\nBitch, your niggas dumb and they goofy\nAnd I ain't never give a fuck about a groupie\n\n[Hook: J. Stalin]\nI don't care if you owe me a dollar nigga fuck that\nThink I'm playin' bout money I be right back\nThat peace talk, I don't wanna hear none of that\nNiggas think I'm playing, nigga fuck that (fuck that)\nFuck that (fuck that), fuck that (fuck that)\nNiggas think I'm playing nigga fuck that\nThat peace talk I don't wanna hear none of that\nNiggas think I'm playing I be right back\n\n[Verse 2: J. Stalin]\nNigga I be right back like I never left\nSmith & Wess with a teflon on my chest\nAll that arguing about who the best\nHands down niggas know he coming out the West\nBullets tearing through the flesh of you bitch niggas\nI had the undertaker dig a ditch nigga\nLivewire, the game run it with an iron fist nigga\nI ain't worried about nothing but my chips nigga\nBig banger, big bezel on my wrist nigga\nEverytime I speak you with the thoughts of a drug dealer\nReal nigga, horny motherfucker, pussy killer\nStop trying to treat me like I'm Tito when I'm Mike nigga\nBusting down bands, going shopping with my white niggas\nI get real skrilla, your bitch think I'm Godzilla\nSlide through, shoot shit up on the (?)\nTold 'em I be right back, you ain't even know nigga\n\n[Hook]\n\n[Verse 3: Too $hort]\nFuck the economy, fuck hard times\nFuck what your going through, gimme all mine\nEvery dime, you dreaming bout a brand new whip\nWhat you finna flip, we'll take that shit, bitch\nTrying to creep through the town\nSee your picture in the paper when we lay your ass down\nCause you ain't nothing but a clown\nAnother dead body was found\nIs it true?\nWas it you?\nWhat them niggas do?\nFuck with Short Dogg, motherfucker you through\nAll you fake niggas gonna get it one day\nOwing people money you don't ever wanna pay\nNow they wanna kill you, they can't wait\nIt's the money or your life, it's too late\nCan't pay 'em next week, or turn back time\nNed to stop being stupid and learn how to grind, BITCH\n\n[Hook]"}], "artist": "J. Stalin"}