{"artist": "Fat Joe", "songs": [{"year": "2007-11-08", "album": "The Elephant in the Room", "image": "https://images.genius.com/0cefb63621c669cd0b3959fd5e673e2d.220x220x1.jpg", "lyrics": "[Intro: Fat Joe]\nBaby, you can keep a secret {*laughing*} Coca\nKrills mania - ayy, AYY!\nUhh, uhh\n\n[Fat Joe]\nFresh off the runway, pair of white Nikes\nPhantom top-drop on that I-9-5\nPink seersucker suit, who but I\nOn my way to party at Carew N-Y\nNow I ain't gotta tell you that them boys pop bottles\nAnd mami's lookin like America's Top Model\nShe says, \"Your earring - look at that thing~!\nThat's even bigger than the rock on my ring\"\nNow she got a man, plays for the Hawks\nI like c'mon ma; you know me run New York\nJ's in the background, put you to bed\nSays he got brains so I'm lookin a-head\nThen I'm lookin for bread, I gotta eat on these streets\nShit seventeen-five, 'bout to holla at G's\nI'm a real nigga, real niggas do real things\nAnd I can keep a secret is the song that I sing\n\n[Hook: J. Holiday]\nBaby I (I) won't (won't) tell (tell)\nIf you don't want me to\nCause I got a thing for you\nI'll do anything for ya (girl anything for ya)\nBaby I (I) won't (won't) tell (tell)\nI'll never do bad to youuuuu\nCause baby you got it, and you got me\nI got a thing for ya\n\n[Fat Joe]\nA material girl in a material world\nVenus, Serena, my cereal girls\nWhat you know about havin dinner on a jet?\nMake it back before the DJ's finished with his set\nNow they call me the bird man when them doors ajar\nGhostride the whip like I'm from Oakland y'all\nIt's the Crack Man and he ain't got a shot in the dark\nThe wrist is Jacob, earring Chapard\nWent to Chao for chow's out and order the same thing\nBill's so high they throw in the champagne\nI'm a real nigga, real niggas do real things\nAnd I can keep a secret is the song that I sing\n\n[Hook w/ ad libs]\n\n[Fat Joe]\nGrown man B.I., millionaire frames, Perrier rods\nEvery day a different chain nigga get ya gear up\nName another fat guy fly like me\nAnd get you right, lay pipe all night like me\nCall you Fruity Pebbles cause you got so many spa bags\nPurple ones, yellow ones, sky blue, the wine bag\nHermes shiy wherever you lay your eyes at\nRed card, black card, I could buy that\nLouis Vuitton I'm truly the don\nChristian, Lou' Vuitton, the bluish charm\nI'm a real nigga, real niggas do real things\nAnd I can keep a secret is the song that I sing\n\n[Hook - 2X w/ ad libs]\n\n[J. Holiday - over second repeat]\nJoey Crack you killin 'em with this one~!\nJ. Holiday checkin in...\nSaid this is grown folks music\nI got a thing for you, yeah\nSee I won't tell, I won't tell, no no [fades out]", "title": "I Won’t Tell"}]}