{"songs": [{"title": "Opps Want Me Dead", "album": null, "year": "2018-11-26", "image": "https://images.genius.com/51a33ae34262277f8026e86dad8e86ce.500x500x1.jpg", "lyrics": "[Intro]\nCashMoneyAP\nDu-du-dun-dun-dun, ayy\nDu-du-dun-dun-dun, yeah\nAyy\n\n[Chorus]\nYou can miss me with that fake shit\nHow you real but writin' statements?\nI’ma change the world, lil' nigga, I'm not basic\nMoney in my hands, spend it all then I replace it\nShe know I’m the man, why she in here gettin' naked?\nMy gang in the buildin', we came up from dirty basements\nNigga try to beef with us, we left him in the pavement\nTake a puff and all my feelings go away, I'm painless\nOpps want me dead, we gon' hit 'em with the stainless\n\n[Verse 1]\nOff a addy pill, I'ma fuck her 'til she brainless\nHouse up in the hills, all of my neighbors are famous\nForeigns in the front, you would think a nigga racing\nCrack another blunt, now I’m higher than a spaceship\nI ain’t goin' out bad, I’m destined for greatness\nThought you was my mans, now I see you on some lame shit\nNot part of the plan, always knew that you were hatin'\nSmoke a ton of grams, I'm in love with bein' faded\nStand on top of everything I do, yes, I believe\nI set the bar higher, I be workin’ to achieve\nThere's not too many people out here doin' it like me\nMy town behind my back, I got these kids chasin' their dreams\n\n[Chorus]\nYou can miss me with that fake shit\nHow you real but writin' statements?\nI'ma change the world, lil' nigga, I'm not basic\nMoney in my hands, spend it all then I replace it\nShe know I'm the man, why she in here gettin' naked?\nMy gang in the buildin', we came up from dirty basements\nNigga try to beef with us, we left him in the pavement\nTake a puff and all my feelings go away, I'm painless\nOpps want me dead, we gon' hit 'em with the stainless\n\n[Verse 2]\nWhere you at? And where you been?\nThe money changin' all your friends, now you cavin' in\nHard to say, not like it hurts, they can't comprehend\nFeel like I been through the worst and they don't understand\nKnow they want me in the ground with the dirty sand\nBut it's not happenin'\nI know you niggas cappin' when it comes down to this rappin'\nMy whole life been a savage, never been the one for actin'\nOut in Cali, Calabasas, eatin' sushi with a bad bitch\nRun my money up, now I'm livin' way better\nThis exclusive drip, I can wear in any weather\nFly like a bird, why they tryna pluck my feathers?\nA band on my shoes and 3000 on a sweater\n\n[Chorus]\nYou can miss me with that fake shit\nHow you real but writin' statements?\nI'ma change the world, lil' nigga, I'm not basic\nMoney in my hands, spend it all then I replace it\nShe know I'm the man, why she in here gettin' naked?\nMy gang in the buildin', we came up from dirty basements\nNigga try to beef with us, we left him in the pavement\nTake a puff and all my feelings go away, I'm painless\nOpps want me dead, we gon' hit 'em with the stainless\n\n[Outro]\nOpps want me dead, we gon' hit 'em with the stainless\nHi-hit 'em with a stainless"}], "artist": "Lil Skies"}