{"artist": "The Game", "songs": [{"title": "California Vacation", "album": "Doctor’s Advocate", "year": "2006-11-14", "image": "https://images.genius.com/8733b8e495bb8c50e53cd1da0aada2cb.1000x1000x1.jpg", "lyrics": "[Intro: Xzibit & Game]\nWest Coast!\nThe Doctors Advocate\n\n[Verse 1: The Game]\nGet a blunt, roll the weed, light it up nigga\nSippin' on Gin & Juice, fill up your cups nigga\nThe West Coast back crackin' like it's '94\nSo bitch get on your knees and give me head like it's '94\nAnd don't come up for air 'til the beat drop\nI'm the Doctor's Advocate\nCall it a sneak peak at the motherfuckin' \"Detox\"\nTake note, grab a pen\nAnd let the world know the West is ridin' again\nI graduated from Dre school, top of my class\nTreat my switches like my bitches, got 'em droppin' that ass\nStill bangin' The Chronic like Doggystyle came with it\nAnd I roll up sticky on my bitch back while I hit it\nI done been there, done that, had beefs and won that\n5 million records on one plaque, I hung that\nStill got Dr. Dre lowridin' in the '6-4\nWhen you see us throw it up for the fuckin'\n(West Coast)\n\n[Chorus: Snoop Dogg & (Xzibit)]\nMy heart beat for the (West Coast)\nWe grow the best weed on the (West Coast)\nWe lowride on the (West Coast)\nSo I'mma die throwin' up the (West Coast)\nMy heart beat for the (West Coast)\nWe grow the best weed on the (West Coast)\nStill lowridin' on the (West Coast)\nYou should take a trip and visit the (West Coast)\n\n[Verse 2: Snoop Dogg]\nCheck game, I'mma show you how to bang\nUncle Snoopy is it true you from that 20 gang?\nAll the time neph', I gotta let my nuts hang\nA chest full of chains, left hand with a pinky ring\nI'm in a Steeler cap, Swisher Sweet peel 'em back\nMy lil' hoodrat, baby got that mini Mac\nBaby got that twenty sack, baby got plenty that\nWhatever you send us my nucca, we gon' send it back\nI'm in the club with the snub, gettin' loved\nWith 20,000 Crips and 20,000 Bloods and\nWe don't give a fuck about none of y'all\nAnd when you hit the city, you better holla' at the Bigg Dogg\nI done seen niggas hit L.A. and get they chain snatched\nThen they call me up beggin' me to get they chain back\nWhat I look like, the motherfuckin' police?\nThere's certain rules you got to follow when you in these streets\nEspecially when it comes to this Cali shit\nAnd I ain't talkin' bout hangin' in the valley bitch\nGangbang niggas all up in the alley, Crip\nOn some real talk nigga we the real ones\n(West Coast)\n\n[Chorus: Snoop Dogg & (Xzibit)]\nMy heart beat for the (West Coast)\nWe grow the best weed on the (West Coast)\nWe lowride on the (West Coast)\nSo I'mma die throwin' up the (West Coast)\nMy heart beat for the (West Coast)\nWe grow the best weed on the (West Coast)\nStill lowridin' on the (West Coast)\nYou should take a trip and visit the (West Coast)\n\n[Verse 3: Xzibit & Game]\nI heard the blue rag niggas ain't fucking\nWith the red rag niggas on the West Coast (Fuck you mean?)\nShit, from what I seen, red and blue can make green\nBlack Wall Street and X only\nSince jealousy breeds hatred, hatred breeds violence\nViolence breeds enemies, more permanent silence\nCalifornia alliance, it's more important than ever\nSo throw it up, we lowridin' together (yeah!)\nMake the West Coast rise forever\nEses, Bs and Cs represent your letter\nGot Game the go-getter, Xzibit the rhyme spitter\nSnoop Dogg the boss, we gangsta at all costs\nY'all niggas is so soft and pussy so fuck off\n'Fore one of my niggas draw that hammer and dump off\nIt's kush, you gon' cough {*cough-cough*}\nYeah, inhale the smoke\nBandana hang, bang the Coast my nigga\n(West Coast)\n\n[Chorus: Snoop Dogg & (Xzibit)]\nMy heart beat for the (West Coast)\nWe grow the best weed on the (West Coast)\nWe lowride on the (West Coast)\nSo I'mma die throwin' up the (West Coast)\nMy heart beat for the (West Coast)\nWe grow the best weed on the (West Coast)\nStill lowridin' on the (West Coast)\nYou should take a trip and visit the (West Coast)\n(West Coast)\n(West Coast)\n(West Coast)"}]}