{"artist": "Fat Joe", "songs": [{"year": "2001-12-04", "album": "Jealous Ones Still Envy (J.O.S.E.)", "image": "https://images.genius.com/4a7618aab6a23480b8790a58ffad66c8.1000x1000x1.jpg", "lyrics": "Ch-ch-ch-ch... Yeah\n(Terror Squad.. First Family..)\nAHHHHHHHHHHH!!! (Yeah, hahahah!)\nYou see them diamonds gliserin off that three-quarterla (Hahaha)\nDat dem dere polyesther (Uh, nigga!)\nHahaha, ya heard me? (What the fuck, what the fuck, huh?!)\n(Terror Squad... First Family...)\nOH!, OH! (OH!) OH! (OH!) OH! (OH!)\nOH! (OH!) OH! (OH!)\n\n[Fat Joe]\nYeah, yeah uh\nYo it's that motherfuckin Bronx nigga Don shit\nRun up in yo' mom's crib\nShip-stacked biddomb shit - gun up in the palm shit\nNobody moves, nobody get whacked with the contrict\nYo' shot at they concert, it's locked on the concrete\nI'm Stone Cold, I mean I slap... then stomp...\nThen what's to stop my .40 Glock from rumblin your calm streets?\nI'm troubled when I on deep, loco enough for dolo\nBlow holes in ya carseat and roll over ya Rover\nFuck this role model shit I'm finna blow out ya wig\nBitch! Throw bottles to kid and get 'em thrown at ya crib\nIt's the return of the worst shit that ever happened\nReborn like what's crackin, we formed with raw plastic\nBlastin off ya doors with an awful passion\nForcin the walls to crash in\nYou see them kids, I'll make 'em all bastards\nJoey Crack - keep it gully\nKnown to clap - keep a fully\nAutomatic mack whodie on my lap - doin thirty\nDrivin through the Heights tryna find these cats that did me dirty\nShot me on the Ave., now I gotta blast until them pearlies\nWe the realest niggas ever touch the mic (BLAH!)\nAnd we love to fight (BLAH!)\nYou heard my niggas (ANTE UP!) give up the fuckin knife!\n\n[Hook] - 2x\nWe gonna\nBREAK! - (BREAK!)\nMASH! - (MASH!)\nBRAWL! - (BRAWL!\nCLASH! - (CLASH!)\nFight up in them clubs, got no love for yo' ass!!\nGET YO' ASS UP NIGGA!\nSHOW ME WHERE YOU AT!\nGET YO' ASS UP NIGGA!\nOPEN UP HIS BACK!\n\n[Lil' Fame]\nYo who that husky-ass nigga with the flow so dumb\nComin up outta Brooklyn lookin like Mighty Joe Young\n(FACE DOWN!) Know we real - got this motherfucker\nCrackin and buzzin with my Latin cousin Joey Grills\n(WE INTERNATIONAL!) 151 proof\nLetcha cold run loose, I give 'em a sunroof\nFor cotton-ass pretty boy talkin bout drama\nWith that nasty-ass Coogi suit, lookin like pajamas\n(SOMEBODY GON' GET HURT TODAY!) So be it\nWe the First (First!) Fam (Family!) - You see it!\nPut some trouble in ya voice homeboy, fore ya get whacked in\nCALM (CALM!) DOWN (DOWN!) GET - BACK!\n\n[Billy Danze]\nFor you niggas that wanna trap me\nI make families unhappy\nI'm tied into the same shit as Boy George and Papi\n(E'RYBODY KNOW!) Everybody wanna clap me\nTonight I'm with my Spanish homie Joey\nSo get at me with the ghetto issued .45, semi-automatic\nI (SPIT) with intentions (TO RIP)\nPut-put pieces out yo' cabbage bitch\nTrained on the Hill, aim at niggas faces\nPush his hat back seven paces - leave him standin still\nCobra-ass nigga (Huh?!) You beg me to kill (Yeah!)\nWhen I cock Glocks and pop, you beg me to chill (Chill!)\n(Y'ALL REMEMBER BILL!) Y'all remember the motherfuckin deal\nYou will get yo' ass zipped up, how this feel nigga?!!\n\n[Hook - 2x]\n\n[Petey Pablo]\nOh motherfucker uh-uh, y'all ain't seen nuttin yet\nGot a call from the Bronx Best, bitch and I was right there\nDuck tape, grip ply, havogee, turpentine\nTwo nickel nine, MacDonald, cup of richie wine\nWish a motherfucker would, look and he shall find\nTEN MILLION WAYS TO DIE!\nI'm the thickest of the fire\nAin't to many niggas round with the rumble\nWith the rawest in the jungle, blicky BLOAW BLOAW!!\nBitch I break 'em down (DOWN) with Terror Squad now\nYa pretty bad, clumsy mouth, sit down - get up get out\nHottest thang they got in the south (Petey Pablo!)\nIf ya don't know now ya know - HOLLA AT 'EM JOE!\nFight club! - Fight club!\nFight club! - Fight club!\nFight club! - Fight club! HOLLA AT 'EM JOE!\n\n[Hook - 2x]\n\nYeah, huh, yeah, huh?! (Hahaha)\nFirst Family, Terror Squad....", "title": "Fight Club"}]}