{"artist": "Immortal Technique", "songs": [{"title": "Rich Man’s World (1%)", "lyrics": "[Sample]\nYou get up and howl about America and democracy\nThere is no America, there is no democracy\nWe no longer live in a world of nations and ideologies\nThe world is a college of corporations\nInexorably determined by the immutable bylaws of business\nThe world is a business\nAnd I have chosen you to preach this evangel\n\n[Intro]\nFor all my free market, health care-robbing\nStock-stealing, retirement fund fuckin'-with niggas\nFuck you little credit card-scamming, jewelry-stealing\nCrack-selling, liquor store-robbing motherfuckers!\nShout out to the homies Carnegie, OG Willy Randolph Hearst, Farouk, Rockefeller – the real Rockefeller\nMy main bitch Leona, pour out a little Louis the 13th\nScott Rothstein, Jack Abramoff, hold ya head\nMy Rothschild niggas: Let's get this money!\n\n[Verse 1]\nI spend my day pairin' America overseas\nPension for the workers, nigga please\nEmbezzlement etiquette, private settlement\nI'm better with confederate rhetoric\nFrom my mansion in Connecticut\nForeclose, evict hoes out of tenement\nI twist words like a speech impediment\nI hope you got good credit, bitch\nIf not, better get a new job with benefits\nWhile I play golf with niggas I get cheddar with\nNew money buys brand new carats\nMy old money bought your great grandparents\nYou got grills in your mouth, I ain't mad at ya\nI own every goldmine in South Africa\nThanks, baby, you made me a billion\nPlus I own a building\nFor each one of my children's children; that's the shit\nSnort coke in the whip, Miss USA suckin' my dick\nYeah, what! Fuck the law, ‘cause real jail is for suckas\nI go to country club prison, you dumb motherfuckers\n(I am the 1 percent, fuckin' bitch!)\n\n[Hook]\nYou know my CEO, corporate steeze, please\nOverthrow governments overseas in a breeze\nPoliticians in my pockets for a few hundred G's\nSo if I'm ever in court, my assets'll never freeze\n\n[Verse 2]\nI got a job and a house and a bank account\nWhen I'm out, I doubt that's something you can say\nAnd if not then I'll fake death like Kenneth Lay\nMake money everyday the world burns on its axis\nWhile y'all strugglin' to pay taxes\nI'm gettin' my money the fastest\nMemos and faxes, shredded up documents\nSlush funds through the corrupt continents\nBut they don't want me indicted\n‘Cause they don't want my dirty laundry aired when I fight it\nDon't get my lawyers excited\n‘Cause what good is a law if you can't rewrite it?\nI got CIA traitors, dictators\nSo fuck y'all whistleblowers and haters!\n(Sheeeiiitt!) I'll invest money from al-Qaeda\nIn the bank 9/11 widows go to later\nCapitalism's who I pray to, fuck the state of the world\nMoney talks, so what the fuck I need to say to your girl?\n(I don't pay them to fuck, I pay them to leave!)\n\n[Hook 2]\nYou know my CEO, corporate steeze, greed\nI treat countries like the IMF, down on your knees\nReal gangstas run the world, fuck what you believe\nI'll cut down a forest while you niggas burnin' some trees\nI'll get your family murdered for a couple of G's\n‘Cause your working class money ain't fuckin' with me\nYou think rappers are rich ‘cause of songs you heard?\nMy labels make the money and haven't rapped a fuckin' word\n\n[Verse 3]\nYacht in the ocean, coastin' with the sails out\nHey, America, thanks for the bailouts\nI made off with the Banco Ambrosiano\nGot away scott-free like El Vaticano\nActivists act a bitch, get mad at me\n‘Cause of my tax-free charity\n80 percent to the staff and company\nAnd 20 percent to the homeless and hungry\nThe country gotta pay the Fed Reserve\nKick back to the banksters—haven't you learned?\nYou protest cops or patrols on the street\nBut I bought city hall, so I own the police\nEmail, Facebook, and the shit you tweet\nAll the phone companies, so I heard you speak\nAnd my suggestion is your correction\nNo elections, sex with no affection\nNo invention will benefit the world of man\nWill exist 'til I've got the money in my hand\nWorld Bank interest rate damn rape on the spot\nBut I'm a gangsta, you gon' take my money, like it or not, nigga\n(I got your country in my pocket, motherfucker!)\n\n[Hook 3]\nYou know my CEO, masonic steeze, cheese\nOnly little people pay all these taxes and fees\nSince you were born, we've controlled what you watch and you read\nAnd pretty soon we're gonna own the fuckin' air that you breathe\nI take what I want, fucker, I don't have to say please\nI convince you that it's good for you, take it and leave\nYou think presidents are a face of a nation?\nI put 'em all where they are, end of the conversation", "image": "https://images.genius.com/d17ee30cab427a6ea7fa3bfa64561580.400x400x1.jpg", "album": "The Martyr", "year": "2011-05-07"}]}