{"songs": [{"image": "https://images.genius.com/8cf43d6f7aa51e497bff7c1ad2e0abcc.500x500x1.jpg", "year": "2016-05-25", "title": "​a helping hand, not a song.", "album": null, "lyrics": "[Speech]\nOkay, so it's recording, it's recording now.\nIt's 8:31 AM and I am currently talking to my laptop and I don't exactly know how to have a conversation with my laptop while I'm by myself\nSo this is gonna be, um how do you call it, a try?\nUm, so here we go.\nSo I'm pretty sure we have a lot of SoundCloud fans that actually don't have a Twitter, Tumblr, or an Instagram or anything such as that.\nCause I'm sure that a lot of you just discovered my music through SoundCloud and probably don't know how to get in contact with me.\nSo here's how we're gonna, here's how we're gonna keep in contact for those of you that actually, like diehard fans.\nCause I'm pretty sure a lot of our diehard fans don't have the main social networks.\nSo what I want you guys to do is either download Tumblr, Twitter, Instagram, or maybe even Snapchat.\nAnd I'm gonna give you each of my names and I'm gonna put em in the, in the description and I'm gonna put my partners' names and I'm gonna, like different, different people that I'm working with\nor whatever you guys want from me.\nI'm gonna start answering questions through Tumblr so if you wanna get in contact with me to have a conversation, you're gonna contact me through Tumblr.\nIf you want to, I mean just look at what the fuck I'm thinking and have a comment on what I'm thinking, that would usually be on Twitter.\nUm, Instagram obviously is just, just photos\nI mean the extent to it's just a DM, I see pretty much where I check is the DM's is why I go on Instagram. So if you wanna get in contact with me, again, Instagram.\nMy, I'll give you contact to my manager so that way you can contact my managers easier if you have a line of business that you want to contact me for. Please only contact if it is for business.\nWhat, I mean as far as the shows we have, what's the shows we have coming up?\nWe have one in West Palm, West Palm Beach on Friday with Wifisfuneral.\nAnd then I have a, I have a show with my partner the day after and also with my partner Pollari, Kevin Pollari.\nI mean if you wanna come to those shows, those are the dates.\nFriday, West Palm Beach, myself and wifisfuneral.\nAnd Saturday, I'll be attending my partner's show in, what is it, Miami?\nWell, so yeah it's in Wynwood, Miami.\nSo what I need you guys to do is go on our social networks and follow us.\nSo for Twitter, my social network name would be what my artist name is on SoundCloud.\nX-X-X-T-E-N-T-A-C-I-O-N\nFor, I'll give you Instagram, for Instagram: heroinfather, H-E-R-O-I-N-F-A-T-H-E-R\nFor Snapchat, theheroinfather, T-H-E-H-E-R-O-I-N-F-A-T-H-E-R\nTumblr, xxxtentacion.tumblr.com, so X-X-X-T-E-N-T-A-C-I-O-N, dot tumblr, T-U-M-B-L-R, dot com.\nAnd, um, I'm pretty sure that'd be it.\nAlright, well, on a different note, here's what I'll cover. We'll call it \"a helping hand.\"\nDamn, I gotta get in my feelings I guess.\nFor those of you that I guess feel misguided or feel, what would the word be?\nA little bit not in tune with what's going on around you and you feel confused, you feel like you're just following whatever is right in front of you\nHere's what I call a helping hand, here's how I'll help you do it:\nWith whatever you apply your attention to is which direction your life will go in.\nSo say for instance you see money in your life and that's what you want more of.\nThe more you apply your attention towards money is the more it will appear.\nThe more you apply your attention towards bad things in your life, the more it will appear.\nThe more you apply your attention, such as the good things in your life, the more it will appear.\nPeople think that people such as DJ Khaled, or like people that are successful maybe people like Kanye.\nOr these bigger artist, they see them as crazy because of what they display and that they display it so simple, but it's literally what it is.\nSo, the key to success would be more success. The more you apply your attention towards your success.\nThe more you apply your attention to the good things around you, the more you apply your attention to the things that you want in your life is the more it appears.\nAnd that, there's no other way to actually say that, so for those of you that feel like you've been thrown into some sort of disarray.\n[glitch]\nWoah, did it pause? Oh, well no it didn't pause.\nYeah, for those of you that are kind of like lost in space in your mind, just understand that your attention is important.\nWhatever you, whatever you, how do I put it?\nWhat you want will appear if you surround yourself with it.\nSo if you want that brand new car, surround yourself with success, surround yourself with money so this car will eventually pop up.\nThere's no simpler way-holy shit.\nShouts out to Teflon Sean.\nYou need to make a, need to make a SoundCloud, Teflon.\nBut yeah, also, study the Golden Beetle.\nWith that being said, goodbye."}], "artist": "XXXTENTACION"}