{"artist": "Professor Green", "songs": [{"album": "At Your Inconvenience", "title": "At Your Inconvenience", "image": "https://images.rapgenius.com/77fac9cb635136345d2df6c14f88ad3b.1000x1000x1.jpg", "lyrics": "[Intro]\n(Ahh mate)\nI'm back\nLike I never left\nI'm here at your in-convenience\nI'm back\nLike I never left\nI'm here at your in-convenience\n\n(So Steve, Steve. Where did you grow up?\nUpper Clapton, Hackney\n(How old were you when you first started rapping?)\nI was 18\n(Who are your major influences?)\nAre you serious?\nYour mum\nI ain't answering anymore of your questions\nYou know what? I have a question\n\n[Verse 1]\nWhose idea was it to get in the charts\nBy rhyming over Hungarian dance mu-sic?\nAnd why would I make dance mu-sic\nWhen I can't dance to it?\nI'm the anecdote to that shit\nBringing back this rap shit\nSoon as I'm done calling this bulimic a fat bitch\nI'll be saving the day and renegade with a dog playing fetch\nWatching him chase a grenade (pow)\nMaybe I should play the same game with Bruno\nIf I ever again get mistaken for a Cluedo character\nI'm gonna have to unleash some amateur judo\nI just took a shit and now I can't find any loo roll\nTwo flows for everyone that you got, too hot, I do squat\nDiddily and do more than you do when you do lots, do lots\nDo women do for me what they do not do for you?\nMaybe it's got something to do with my new watch\n\n[Hook]\n(I'm back) I'm back\n(Like I never left) like I never left\n(I'm here at your) I'm here at your\n(In-convenience) in-convenience\n(I'm back) I'm back\n(Like I never left) like I never left\n(I'm here at your) I'm here at your\n(In-convenience) in-convenience\n\n[Verse 2]\nI have a question\nWhy would I beat around the bush or take the scenic route?\nWhen I'm a meanie born to instigate fumes\nI'm the morning, midday and evening news\nAnd I started a trend, Mike got his teeth fixed too (Mike Skinner)\nIf you're wondering where I've been at, kicked back with a six-pack\nOf Beck's on a bench, sunbathing in a hijab\nGive me a Tic-Tac, I just had a pack of Nik Naks\nThanks now I'll turn you into a kebab with my pick-axe\nMish, mash, mosh pit, whenever I drop shit it's hot shit\nI just won a race with an ostrich\nObnoxious, preposterous, looney, a damn nutter\nIf I ever see Rooney anywhere near my grandmother (ah!)\nI live life without an ounce of logic\nI like my wrist so much I spent a house deposit on it\nVomit and then I drink more wine\nThen I broke a bowl and hope the hospital gives me morphine\nHow do you spend your time?\n\n[Hook]\n\n[Bridge]\nI don't have a question, nope\nWhen it comes to competition I'm burying them\nBetter to bury them then have them getting lairy again\nThey want it with me like they want it with malaria\nLike Wayne Bridge wants to be John Terry'd again\nI developed an obsession with Caroline Flack\nI wouldn't mind having a go on Caroline's-\nActually I promise to never be so vulgar\nTo never mention putting my cobra\nInside of Anna Kournikova\nI swear\n\n[Hook]\n\n[Outro]\nI think I've got it out of my system now\n(You sure?)\nI am once again ready to answer questions\n(Good, cause there's so much I've been wanting to ask you)\nAbout 8 inches\n(What?)", "year": null}]}