{"artist": "Westside Gunn", "songs": [{"year": "2018-06-22", "lyrics": "[Intro: Westside Gunn]\nBrr\n\n[Verse 1: Westside Gunn]\nAyo, I know some niggas only skate on Supreme shit\nI know some niggas hit the dope with the remix\nI know some niggas got two bodies and still a teenager\nI know fiends that wanna lick the resi off the razor\nI know niggas from uptown and down the way\nI know niggas got 8 balls of pure yay\nI know niggas that'll rob your ass bare faced\nI know niggas that's coming home, they wanna play\nI know niggas that'll sniff a line and shoot up shit (brr)\nI know some niggas went upstate and got cut quick\nI know niggas that'll put money on your head\nI know niggas that when they hit the powder then they dead (boom boom boom boom boom boom)\nI know niggas showing fake love (ah)\nI know some niggas going 'round claiming fake Blood (ah)\nI know some niggas going 'round claiming fake Cuz\n\n[Chorus: Westside Gunn]\nCan't nobody fuck with me\nI'm that one\nKeep the MAC 10 for that fuckery (brr)\nGet you some\nWish Chine Gun could see me now (ah)\nWish Bacon could see me now (ah)\nCan't nobody fuck with me\nI'm that one\nKeep the MAC-10 for that fuckery (brr)\nGet you some\nWish Chine Gun could see me now\nWish Sly Green could see me now\n\n[Verse 2: Westside Gunn]\nAyo, every color Lambo truck we parading\nOG just came home from being caged in\nDon't know what to do, been locked up since Reagan\nThe Lord got a better plan for you, be patient\nMa Dukes struggling, know I can't have that\nBalenciaga, triple sole sitting on the dad hat\nCatch me in the bushes, cone head, ski mask black (ah)\nPootie need a new pair of Guccis, where the stash at?\nDay dreaming in my cell\nFredo had a body, did that nigga go to hell?\nKilled another 30 with the sand on the scale (ah)\nLoading up the .30, shoot the niggas over there (boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom)\nFree my nigga DC, free my niggas\nThey gave his ass 33\n\n[Chorus: Westside Gunn]\nCan't nobody fuck with me\nI'm that one\nKeep the MAC 10 for that fuckery (brr)\nGet you some\nWish Chine Gun could see me now (ah)\nWish Bacon could see me now (ah)\nCan't nobody fuck with me\nI'm that one\nKeep the MAC 10 for that fuckery (brr)\nGet you some\nWish Chine Gun could see me now\nWish Sly Green could see me now\n\n[Outro: Mick Foley]\nSmile, and I look at you, Benoit, as I stand here face to face\nAnd you know what I see?\nI see one of the damn best wrestlers I've ever seen in my entire life\nBut there's some things, Chris Benoit, that I do not see when I look in those dead eyes\nI do not see an ounce of remorse\nI do not see compassion\nAnd I sure as hell don't see a sense of humour\nSo, Chris Benoit, I think I speak for everybody when I ask this one simple question\nWhy? Why, Chris? Why?", "image": "https://images.genius.com/a8a5e42d4ec977626772d2df25f034c5.638x638x1.jpg", "album": "Supreme Blientele", "title": "Elizabeth"}]}