{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/6988db34176c7b94ceb840e8cf16ec4e.500x500x1.jpg", "year": "2012-07-04", "album": "Heart of Dixie", "lyrics": "If DJ Frank White isn't on your mixtape, kill yo'self...\n\n[Intro: Yelawolf]\nYeah!\nOn behalf of Alabama, I just wanna say\nThe Heart of Dixie is in this bitch\nM16, DJ Frank White, my name is Yelawolf\nHello world, hello world, hello world!\n\n[Verse 1: Yelawolf]\nThis morning I woke up feelin like, that I never had a fuckin’ dime\nLike I didn’t wake up in the back of the bus that’s finally mine\nWhy, do I feel like I never had Marshall Mathers’ co-sign sometimes?\nLike Radioactive failed, well maybe this time\nI’m even not eased to believe that I could be one of the top 5\nMaybe when I tell myself I’m one of the best, I’m just lyin’\nWhen my Uncle Buddy calls and ask, I say\n\"I’m just fine, but I feel like I haven’t made it, Uncle, but I’m just tryin.\"\nOr maybe, I’m just not used to having shit I never had\nNever stood in the Winner's Ave\nNever said, “I got dinner, dad.”\nShit, never even had the cash to pay my dad for gettin' her back\nAnd Jim I love you, thank you, always remember that\nAnd it feels like yesterday, literally like yesterday\nWhen I couldn’t get one motherfucking fan to come and see me play\nWhen I drove that minivan for the ends, without a license plate\nTo ATL, so I could play Will Power my demo-tape\nYeah, that’s writing on the wall that I can't erase\nHe’s a friend of mine that are in the line, and that I can’t replace\nIf I’m in the line, he’s in the line and we both get a play (church)\nThis ain’t no crew, it’s a family, so get it straight (church)\nSo Father you can tell God to part the clouds\nAnd let your sun shine thru the minds of my target crowd\n‘Cuz I know some of these people think I’m a certified artist now\nBut the butterfly’s still a bug, and I’m above where I started, now\nPassionate like a political poet in an artist lounge\nHungry like a poor daddy with a gun and a starving child\nIf you thought it was a flake, then you just a departed clown\nAnd if you thought I was coming hard, well you better think harder now!\n\n[Verse 2: Yelawolf]\nAnd it’s been a long motherfucking time\nSince I felt this homesick as I do now\nYeah it’s been a long fucking time\nAnd I just wanna say\nHey! How ya been? Roll Tide! Amen!\nThe Heart of Dixie’s in this bitch, yeah I’m Dixie rich\nBut if I don’t have y’all, I ain’t got shit\nGadsden, B-Ham, to the Gump\nAnd all the small towns\nThrow it up, it’s that Alabama sound\nMuch love and I never let you down\n\n‘Cause I might as well be dropped\nBack in Gadsden and cuttin’ grass\nOr handcuffed on the side of the road, on my fuckin’ ass\nBefore I become complacent on any level that I’m at\nMomma will quit drinking and Obama will smoke some crack\nLost, yeah I may have, my mind\nBut it takes a lunatic to pursue this shit\nAy that’s fine, because I paid the cost\nReally more like a fine, but instead of paying for tickets now\nThey pay for tickets in line, to see me drain exhaust\nThe pain from the mic, from the strain it cost\nTwo-step in my shoes with a shameless walk\n300 soldiers I brought, Wolf-Pack follow my lane and put chalk\nAround suckers dying for change and talk\nThe New South’s got a new house\nWith a frame and a stump\nRoots and limbs, the truth’s in him\nYeah I’m a grain of salt\nPreachers yelling out, prophets around Wayne\nI refrain, I’m a couch, I’m a chair, I’m a seat\nA relief pitcher, or beer in the mouth\nI’m a sofa to hold ya, just ride the beat homey, it’s over\nWhatever rapper would ever say he’s a sober?\nI must be smoking bath salt, ‘cuz I’m out of my mind!\nI should have built roads for a livin', cuz I never run out of lines\nThe Heart of Dixie", "title": "Howdy"}]}