{"songs": [{"album": "The Warm Up", "year": "2009-06-15", "title": "Dreams", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg", "lyrics": "[Intro: J. Cole]\nYeah, uh, yo\nYou gotta li—, you gotta follow me\nWith what I'm doin' right here, mane\nLike, when I say this shit is crazy\nI don't mean it's crazy like crazy\nI just mean crazy like it's fuckin'—\nLike it's actually crazy\nKnow what I mean? Yeah\n\n[Verse 1: J. Cole]\nSeems like I always had crushes on chicks I couldn't have\nAnd then I end up fuckin' with someone I shouldn't have\nSee, in my mind, it's like I'm perfect for her, I gotta show her\nBut sadly, in reality, dog, I don't even know her\nBut still somehow she got my mind infatuated\nAbsolutely fascinated\nWith the thoughts of what she might be like\nTime after time after time I had to wait and\nIs fate procrastinatin'?\nI can take it 'cause I might be right, 'cause it's…\n\n[Hook: J. Cole and Brandon Hines]\nThis is the girl of my dreams\nYeah, and is she good as what she seems?\nOr am I lyin' to myself?\nAye, should I try and get some help?\nThis is the girl of my dreams\nIs she as good as what she seems?\nOr am I lyin' to myself?\nAye, should I try and get some help?\n\n[Verse 2: J. Cole]\nOh shit, she passed me on the boulevard\nAye, tell me, is it stalkin' if I follow her\nLike, all the way home without her knowin'?\nNah, nigga, I'm just curious where she stay at\nBesides, when I'm with her, this gon' be the spot we lay at\nAnd maybe I'll just drive by occassionally\nAnd if one day I happen to see her outside, she'll wave at me\nImagine what she'll say to me\nThis ain't no time to be afraid no more, it's time for bravery\nNo matter if my homies think I'm crazy\n\n[Hook: J. Cole and Brandon Hines]\nThis is the girl of my dreams\nAye, and is she good as what she seems?\nOr am I lyin' to myself?\nAye, should I try and get some help?\nThis is the girl of my dreams\nIs she as good as what she seems?\nOr am I lyin' to myself?\nAye, should I try and get some help?\n\n[Verse 3: J. Cole]\nLook, I spot her walkin' in the mall\nOkay, it's time to grow some balls if she really gon' be yours\nOh my God, I'm walkin' towards her\nMy mind's screamin' stop\nBut my legs keep walkin' forward\nStraighten up your face, nigga, she see you comin' for her!\nMy heartbeat racin', and my hands keep shakin'\nSay somethin', you shy motherfucker, she's waitin'!\n\"What's up, girl? Don't mean to interrupt\nBut in the city I done met a lot of women, but\nYou from my dreams\nAnd will you come true?\nI know about a show that we can catch\nSome R&B and rap, and you should come through.\"\nShe said, \"Uh, I'd love too\nExcept I don't like rap\nBesides, if I went with you, then I don't really think my man would like that.\" (Damn, Damn)\nOkay, you say you got a man\nI mean, I definitely understand\nI'm happy for you, really am\nI couldn't have been the only fan\nIn the world of a girl like you\nI mean, you're beautiful, and I'm sure he's a very nice dude\nIt ain't no biggie\nWell, I'm sure that I'm gon' see you 'round the city\nOnly thing I ask, if shit don't work out for y'all\nThen don't forget me\nAnd don't act like a stranger when you see me on the scene\nI came up with a world-class scheme, to get…\n\n[Hook: J. Cole and Brandon Hines]\nThe girl of my dreams\nAnd is she good as what she seems?\nOr am I lyin' to myself?\nOr should I try and get some help?\nThis is the girl of my dreams\nIs she as good as what she seems?\nOr am I lyin' to myself?\nAye, should I try and get some help?\n\n[Verse 4: J. Cole]\nSo I find out the nigga name\nKnow exactly where he stayin'\nFind out when he leave for work\n\"Hold up, nigga, is you sane?\"\nI'ma follow in my car; I'ma cut in front of his\nRun him right into the wall\nMaybe even off the bridge\nI give her a little time\nThen console her while she cryin'\nShe gon' take that as a sign\nFinally she will be mine\nI'll be king, and she'll be queen\nWhen I hit her with the ring\nAt the wedding, who gon' sing?\n\n[Hook: J. Cole and Brandon Hines]\nThis is the girl of my dreams\nAnd is she good as what she seems?\nOr am I lyin' to myself?\nAye, should I try and get some help?\nThis is the girl of my dreams\nIs she as good as what she seems?\nOr am I lyin' to myself?\nThink I should try and get some help"}], "artist": "J. Cole"}