{"songs": [{"year": "2014-05-05", "album": null, "image": "https://images.genius.com/214f4cc51eadce650131efd872a18cae.1000x1000x1.jpg", "title": "Vato Freestyle", "lyrics": "[HOOK]\nYoung Kap G Dinero\nYea I'm just coolin' with my vatos (vato, vato, vato)\nAnd I just left trabajo (work, work)\nFinna cash this checke, Wells Fargo (finna cash this checke)\nNo cash no convo.  Everybody around me, mi hermanos (my brothers)\nIt ain't gotta be Cinco de Mayo, I still be coolin' with my vatos\nIt's just me and my vatos x4\nI'm just coolin with my vatos\n\n[VERSE 1]\nShe want it pronto, I know\nWhite tee, Blanco\nMomma in the kitchen whippin' arroz with the caldos\nShe say, \"what you call those?”\nTrue Religion cargos\nI might crash into your girl\nDon't worry I got Geico\nGoodnight tho (skrrt), I'm iight tho\nI wake up to a lot of Gin and (?)\nI'm just tryna be a legend like El Santo (the wrestler)\nI was stackin' green, and now they call me Rajon Rondo\nWe just a bunch of head honchos\nAnd we don't mess with them Narcos\nThey so strapped like Pancho (Pancho Villa)\nTengo diez y nueve años\n\n[HOOK]\n\n[VERSE 2]\nOk [?] on my side uh\nYou know how we ride uh\nAnd my blunts be louder, and we got that pride uh\nTell your girl to wash my clothes with Tide uh\nI'm tired, on the jet to D.C\nJust like I’m Deshon uh, Jackson\nVatos got them packs and, you can't even blame em’\n[?] brought the crack, and we got a lot of papers they say beat it, Michael Jackson\nAll-Star in pro sports, ballin' Bo Jackson\nVato, Vato, Vaatoo\nStackin' pesos like the Eiffel (Tower)\nYea Ray-bans on my face, I know they look like blindfolds\nI'm in the Cleveland Cavalier tho, like I’m from Ohio\n\n[HOOK]\n\n[OUTRO]\nVato, vato, vato, vato, vato\nI do me like Rocko\nI’m just stackin up nachos\nNo, no, no these nachos\nKap G man, what you see man\nShe just want the D man\nOk, cool. Cause I’m just free-styling off the dome\nAnd say baby ima go and take you home\nGirl you don’t want to leave me alone. (Haa)\nVato, vato, vato I’m outchea, you know that\nGanja, we blow that\nOk, no way, José, we out of here"}], "artist": "Kap G"}