{"artist": "Pusha T", "songs": [{"album": "DAYTONA", "title": "What Would Meek Do?", "image": "https://images.genius.com/99199dd6e0f60ef05789ba2cbe2a5d9b.1000x1000x1.jpg", "lyrics": "[Chorus: Kanye West]\nNiggas talkin' shit, Push—how do you respond?\n\n[Verse 1: Pusha-T]\nI'm top five and all of them Dylan\nI am the hope, the dope dealers won\nPrice and the quote, the dope dealers want\nFeds takin' pictures like it's GQ (GQ)\nThis Avianne collarbone is see-through\nAngel on my shoulder, \"What should we do?\" (we do)\nDevil on the other, \"What would Meek do?\"\nPop a wheelie, tell the judge to Akinyele\nMiddle fingers out the Ghost, screamin' \"Makaveli\" (come with me)\nHail Mary, the scale fairy\nTwo sides to every coin so we bail ready (bail ready)\nHow do you respond?\nI let the monies and the fools talk\nI let the jewels and the hues talk\nWatch face came with a fuse box (fuse box)\nChanel's on ya bitch\nThe coupe is 320, the roof's hit or miss\nMurder on the highway, the news is at six\nSee, I did it my way, the proof's in the bricks\nEghck! Smell it through the Tupperware (Tupperware)\nTwo can get you four like a double dare (woo!)\nI'm the king of the oven-ware (oven-ware)\nYou can piece the whole puzzle here\n\n[Chorus: Pusha-T]\nNiggas talkin' shit, 'Ye—how do you respond?\n\n[Verse 2: Kanye West]\nPoop, scoop!\nWhoop! Whoopty-whoop!\nAm I too complex for ComplexCon?\nEverything Ye say cause a new debate\n\"You see, he been out of touch, he cannot relate\nHis hallway too long, bitch too bad\nGot a surrogate, his kid get two dads\"\nI be thinkin', \"What would 2Pac do?\"\nYou be thinkin' what New Kids on the Block do\nIf you ain't drivin' while Black, do they stop you?\nWill MAGA hats let me slide like a drive-thru?\nThat phone call from Ricky still hazy\nWhen heaven got an angel named Avery\nYou gotta watch who you callin' crazy\nYeezy, the newest billion-dollar baby\nIt won't feel right 'til I feel like Phil Knight\nGoin' for six rings like what Phil told Mike\nSeven pill nights, who know what that feel like?\nNo more hidin' the scars, I show 'em like Seal, right?\nHow do you respond?", "year": "2018-05-25"}]}