{"songs": [{"year": null, "title": "Come Alive", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Hook – Corbett and (Saigon)]\nWill you raise me from the daze? (Saigon)\nMake me come to life again? (I need all my people)\nI won't be afraid (Never afraid)\nWith your breath of life inside my heart, today (You don’t have to die to be dead)\n(There’s a lot of braindead.  But you know what?  You gotta)\nCome alive (We gotta open our eyes)\nCome alive (Watch me reincarnate)\nCome alive\n\n\n[Verse 1 – Saigon]\nI heard we 'bout to send the Navy out to Syria\nAnd niggas yappin' 'bout some Maybach interior\nThis the way of thinking that made blacks inferior\nAt least wonder, wonder why is that the criteria?\nIf I wanted to get censorship, now look at how big this is\nYou Illuminati in a new Bugatti—guess membership got some privileges\nNone of y'all could be the new 2Pac\nWe ain't hearin' 'bout 2Pac's watch\nWe ain't care 'bout 2Pac's chain\nNerve of y'all to say 2Pac name\nI don't think that y'all got that right\nAin't neither one of y'all 'bout that life\nIf I could turn back time, turn back crime\nYou know we'd all be better off without that night\nMight be better off without that fight\nThe world'll be better of without that sight\nPac in the car with Suge Knight\nNah, he would've been in the house that night\nNow it's getting harder each day\nI don't know what y'all do, but we pray\nLittle riding officer on the BK\nWe start by the park, poverty play\nNot just the artist, it's the DJ\nThe rider soundtrack to where we stay\nYou ask Jesus what would he do\nWhat do you think he'd say?\n\n[Hook – Corbett and (Saigon)]\nWill you raise me from the daze? (Think it’s time for us to resurrect)\nMake me come to life again? (We can’t be afraid to live, can’t be afraid to die.  For real)\nI won't be afraid (We can’t be afraid)\nWith your breath of life inside my heart, today (We gotta live.  Fight to survive)\n(We gotta fight to survive.  I need everybody to) Come alive\n(I need all my people to) Come alive\n(I need everybody right now)\n\n[Verse 2 – Saigon]\nI done climbed a mountain, I done swam an ocean\nYou should move before I snap—that's that man in motion\nPeople say when they hear me rap that they can hear devotion\nI swear that this year that I'm back and I'm gon’ clear that notion\nThat I fell off, not gon' work\nThat's like saying that getting shot don't hurt\nI give God the praise Monday to Sunday and I ain't gotta be inside some church\nRaise my daughter right—she not gon' twerk\nShe marry a gentleman and not some jerk\nIf, by chance, a jerk guy come first\nHe gon' see how my shotgun work\nYou could put me up [?] the culprit\nWe won regardless and we won't forfeit\nWe borderline, never gonna cross it\nIf he on that BS, he best to come off it\nBut you smoke—medicinal purpose\nY'all must've forgot what a lyrical verse is\nSai coming alive like I did on my first shit\nY’all… nah, y’all just worthless\n[?] perfect\nI scribe all my life, I survive the worse shit\nI ride on y'all before I ride them hearses\nSwear ‘fore God, done found my purpose\nNow I lay me down to sleep\nPray my Lord, my soul to keep\nBy some chance I don't survive\nI need all of y'all to\n\n[Outro – Corbett and (Saigon)]\nCome alive\n(I need everybody to) Come alive\n(I need all my people to) Come alive\n(I need everybody) Come alive\n(Gotta resurrect.  Let’s wake up) Come alive\nCome alive", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}