{"songs": [{"image": "https://images.genius.com/c152fe66db78409c9b0afec9d741497d.500x500x1.jpg", "album": "Generation Gaming XV", "title": "Commander Zavala vs. Cayde-6", "lyrics": "[Zavala]\nLook around you\nThe Galaxy's greatest Guardians gathered\nThough times are dark\nIt is the light inside your heart that matters\nYou are the final line, mankind relies on for redemption\n\n[Cayde-6]\nAttention!\nWoah, tough crowd\nOkay, let me break the tension\nYou're a rebel of reprobate\nBut there's no one else left that's capable of taking on\nThe great threat we face, and then staying to mop up\nThe mess they've made\n\n[Zavala]\nYes, they layed siege to our motherland\nOur precious home, I saw it all\nAnd fought amongst the falling rubble\nDeflecting endless blows\n\n[Cayde-6]\nThey kept on coming, so my gun kept humming\nYou should've come and seen it, it was really quite something\nI looked so great, so good\nIn a tide, in a cape, in a hood, it was rather inspiring\nI side eyed a few girls admiring\nWhy you suprised? I'm so fine, it's tiring\nAnyways, I'm getting sidetracked\nLet me go and get a pint\nPinky promise I'll be right back\n\n[Zavala]\nDespite the sacrifice of our finest Guardians\nWe could not stop the scarlet army rising\nFrom the ashes of the Darkness\nThe tower fell, the city rushed, our homes are crushed to dust\n\n[Cayde-6]\nPlus, my stuff, now I was salty before\nBut now I've had just enough\nI mean, who does this stuff?\nIt's unproductive, plus, my stuff!\nSo we're gonna look for the chump responsible and fffluff him up!\n\n[Zavala]\nAnd so today we know the name of the heinous foe we face\nThey call him\n\n[Cayde-6]\nGavin?\nNo, Gary\nIt's Gary, isn't it?\n\n[Zavala]\nThey call him Ghaul\nHis only goal to cause a fall of all we've fought for\nAnd war 'till there's nothing at all\nWhen the Cabal is at the door, you look for my support\nBut this time I call on yours\n\n[Cayde-6]\nYou're probably gonna end up pretty sore\nThese armor plates, they kinda chafe\n'Till your thighs are aching, rubbed really raw\nSh! All this tech and we still haven't developed\nAny military drawers that'll win us any wars\nI've been wearing these ones for months!\n\n[Zavala]\nThe time is now at hand\nTo avenge the injustice thrust upon us\nIn our final stand\n\n[Cayde-6]\nI'm a nice guy, so I shan't tell a white lie\nLook, you might die\nBut then again, you might survive\nSo like every guide of advice, see the brighter side of life\n\n[Zavala]\nI ask you: who'll rise and keep aside my side and fight?\n\n[Cayde-6]\nNo hide and seek, dab on the haters\nEveryday bro, ride or die!\n\n[Hook]\nThis is the law of the jungle\nAs old and as true as the sky\nThe wolf that shall keep it may prosper\nBut the wolf that shall break it must die\nAs the creeper that girdles the tree trunk\nThe law runneth forward and back\nFor the strength of the pack is the wolf\nAnd the strength of the wolf is the-\nWooooaah!!!\n\n[Outro]\nHold on\nSorry, sorry, sorry\nTripped over the... speaker jack\n(Cough, Cough)", "year": "2017-10-31"}], "artist": "Dan Bull"}