{"songs": [{"lyrics": "[Intro: Frank Ocean]\nReady for it\nI'm ready for it\nYeah, ahh\n\n[Bridge: JAY-Z]\nEastside nigga with the feets high\nNigga with that Lisa, uh\nTalkin' about that Lisa, nigga, with that Westside, nigga\nWith that Eastside, that dance, uh\n\n[Verse 1: JAY-Z]\nYour eyes speak the truth when everything else lies\nMay pretend that we kin but the vibes don't fly\nBruh, I survived readin' guys like you\nI'm surprised y'all think you can disguise y'all truths\nI seen eyes wide as they're about to shoot\nYou can be a hairpin off and you can trigger your roots\nI wave to these haters, don't give me dap\nYou know the world can see just how phony you act, bruh\nY'all body language is all remedial\nHow could you see the difference between you and I?\nMy crash course was much tougher\n'Round friends who kill they friends\nThen hug their friends' mothers\nAnd show up at the funeral, complete with blank stares\nInvisible ink, I had to read things that wasn't there\nMemories may sneak down my cheek\nBut I could see a side-eye in my sleep\n\n[Chorus: Frank Ocean]\nReady for it, deep breath, fill up the void\nEyes open them up, check off the coins\nStill stingin' from tears, they try to see you\nI'm ready for earth, ready for real\nSolipsistic, admit it, I see you there\nSo it seems, so you seem\nI can't tell if you're image or are just the flare\nIn my dreams, in my dreams\n\n[Verse 2: JAY-Z]\nI sat down with Prince, eye to eye\nHe told me his wishes before he died\nNow, Londell McMillan, he must be color blind\nThey only see green from them purple eyes\nThey eyes hide, they eyes high\nMy eyes wide shut to all the lies\nThese industry niggas, they always been fishy\nBut ain't no Biggie, no lazy eye, huh\nThis guy had 'Slave' on his face\nYou think he wanted the masters with his masters?\nYou greedy bastards sold tickets to walk through his house\nI'm surprised you ain't auction off the casket\nDon't big bro me, don't \"Big Homie\"\nI've seen pure admiration become rivals\nI've been to Paris at least two times\nI've seen the Eiffel, I've seen a eyeful\n\n[Chorus: Frank Ocean]\nReady for it, deep breath, fill up the void\nEyes open them up, check off the coins\nStill stingin' from tears, they try to see you\nI'm ready for earth, ready for real\nSolipsistic, admit it, I see you there\nSo it seems, so you seem\nI can't tell if you're image or are just the flare\nIn my dreams, in my dreams\n\n[Post-Chorus: Frank Ocean]\nI've been out of touch for a couple years\nI've been ready for this for real\nHopin' I can touch what I see\n'Cause I've been ready for you, for real\n\n[Outro: JAY-Z]\nLook, you've done enough\nHave you no sense of decency, sir?\nAt long last, have you left no sense of decency?\nEastside nigga with the feets high\nNigga with that Lisa, uh\nTalkin' about that Lisa, nigga, with that Westside, nigga\nWith that Eastside, uh", "title": "Caught Their Eyes", "image": "https://images.genius.com/4cf5f4f88ace021acdc18cc3cefcf2f4.1000x1000x1.jpg", "year": "2017-06-30", "album": "4:44"}], "artist": "JAY-Z"}