{"artist": "Valete", "songs": [{"title": "A Vida Dos Outros", "year": "2012-06-12", "lyrics": "[Intro]\n\"...Tive de sair da cama ir pr'o drama que me agrega\n'Tou sem chama nesta merda desta trama que me enforca\nJá tou atrasado, visto rápido, como rápido\nAtrapalhado já é hábito, é o prefácio do meu dia...\"\n\n-Keidje? Acorda Keidje, vais chegar atrasado ao trabalho\n-Foda-se\n\n[Verse 1]\nAcordo mais uma vez cansado\nCom o corpo todo amassado, dorido e triturado\nFoda-se, esta vida acaba comigo\nNão consigo aguentar isto, cada dia é um castigo\nOlho p'ra ela do meu lado, já não me sinto encantado\nO nosso amor está caducado\nÉ óbvio, rotina quebra o encanto\nNo inicio somos um só, depois é cada um para seu canto\nJá não sinto aquela chama quando olho nos olhos dela\nJá não sinto aquela gana de fazer amor com ela\nAgora cada mínima coisa acaba em discussão\nTodos os dias confusão, dramas e novas crelas\nTomo um banho visto-me a mil à hora\nDigo ao puto para se levantar e ele como sempre demora\nEle grita, rebola, esperneia não se controla\nDiz que não quer ir pa escola, que só sai da cama as 11 horas\nNão há nada neste mundo que eu ame mais o meu filho\nMas a vezes só o consigo ver como um empecilho\nNão aguento o trabalho que me dá, deixa-me estourado\nRouba-me imenso tempo fico desolado\nBato-lhe para ele sair da cama e ele lá se despacha\nPronto todo acelerado, sai mais uma vez atrasado\nDeixo-o na escola vou a correr po autocarro\nEntro no bus e reparo num ambiente consternado, insano\nVejo toda a gente deprimida desmotivada\nPara uma jornada laboral homicida\nOlhares distantes, sem planos pesarosos\nEspíritos silenciosos, repelosos e cavernosos\nGente como eu que hipotecou os sonhos\nE que se entregou à fatalidade desse destino medonho\nDestino, dos homens escravos de um salário\nPresidiários de sobrevivência do trabalho precário\nVou do autocarro po metro, do metro p'a outro autocarro\nChego ao trabalho e encaro com o meu karmo sanguinário\nEste trabalho repetitivo, exaustivo, psicologicamente corrosivo\nTer que dividir o espaço com colegas insuportáveis\nQue mandam piadas miseráveis e bocas dispensáveis\nFico sempre ultra sensível nestas horas\nE a contar os segundos até a hora de ir embora, foda-se\nSaio às 6 vou outra vez para o autocarro\nVejo outra vez toda a gente perdida no desamparo\nGente vazia, sem utopias, que representam a maioria da realidade que eu encaro\n\n[Bridge]\n— Keidje, não foste ao banco?\n— Nelson, Nelson, vai pr'o teu quarto, vai pr'o teu quarto\n— Eu avisei-te ontem 3 vezes para ires ao banco e tu não foste\n— Eu não tive tempo, eu não tive tempo\n— Ah Não tiveste tempo... Então não tens hora de almoço...\n— Se eu tivesse tempo eu ia, eu não tive tempo\n— Não podias ir ao banco? tu nao sabes viver em família Keidje! Estás sempre a falhar, combinamos para fazer as coisas e falhas sempre, falhas sempre Keidje!\n— Ouve, ouve... Tu tens razão, tu tens razão mas não 'tou a aguentar mais, eu não 'tou a aguentar mais a sério\n— O que é que foi?\n— Tu tas a sentir man, percebes? tu tas a sentir, eu já não estou cá, eu quero ir viver sozinho, fazer coisas que me dão prazer, eu quero, percebes? eu quero largar o trabalho, não tem so haver contigo 'tas a ver? mas eu não 'tou fixe, não 'tou feliz\n— Keidje olha p'ra mim\n— A sério, eu vou, vou, a sério, vou voltar a fazer musica, largar o trabalho, eu quero mesmo viver sozinho, eu quero fazer coisas que curto fazer\n— Keidje olha p'ra mim, fala comigo, para com isso, por favor!\n— Olha tu p'ra mim, olha tu pra mim, eu estou decidido eu estou mesmo decidido!\n\n[Hook 2x]\nEu 'tou livre como um condor\nA sentir a vida onde não há stress não há dor\nA sentir aquela paz que rejubila a alma\nA viver o sonho num pleno com todo o fulgor\n\n[Verse 2]\nVoltei a fazer musica, voltei à rotina de beats, flows e rimas\nDinheiro é pouco às vezes vivo num sufoco\nAmigos dizem que eu sou louco mas é esta vida que me anima bro\nFaço uns concertos pequenos, dinheiro é o menos porque 'tou a viver em pleno\nA guita chega p'ro t0 e pr'o sustento do miúdo\nQuase não sobra pa mais nada, mas felicidade é tudo\nAgora só tenho relações sem compromisso\nAmor livre desde o inicio sem pressão nem sacrifícios\nVivo sem horários, sem stress emancipado\nApenas governado pelo instinto desregrado, claro\nEspírito leva a viver esta vida breve\nCada dia será vivido desfrutado eternizado\nAtrás da paz liberdade e conforto\nEu não serei outro semi-morto a viver a vida dos outros\n\n[Hook 2x]\nEu tou livre como um condor\nA sentir a vida onde não há stress não há dor\nA sentir aquela paz que rejubila a alma\nA viver o sonho num pleno com todo o fulgor\nEu 'tou\n\n[Bridge]\n-Keidje? Acorda Keidje, vais chegar atrasado ao trabalho\n-Foda-se\n\nAcordo mais uma vez cansado\nCom o corpo todo amassado, dorido e triturado\nFoda-se", "album": "Hip-Hop Series Vol.4 ", "image": "https://images.genius.com/8fa65344536360b216f4fff5a3180144.305x305x1.jpg"}]}