{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Manny Pacquiao", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Verso 1]\n'Tou tipo o c-brown, look at me now\nPussy goin' down, dick diz «wow!»\nNome é xau! escolha inteligente\nNo final digo tchau! por mim volte sempre...\nManny pacquiao, vai aponta o teu peso\nSlit é tao tight, acho que 'tou preso\nE ela so sai quando 'tou nesse\nMambo de foder putas sem ligar ao preço\nTrue! Nem preciso de pagar\nNo final da foda ela pede pa' lhe ligar\nSei que já é cota portanto é só perar\nEu mother-fucker, ela com filhos pa' criar\nJoga-me a catota que o joker vai brincar\nRock'em sock'em robot, só me falta trincar\nChoca-me como a moca começa-me a fritar\nComo chocos em azeite, droga faz-me tripar\nE me'mo a tripar, ela quer viajar\nTripin' in the trip? Ainda vai tropeçar\nTripception flick, o filme vai começar\nC'a tribo na trip, índio vai cachimbar\nFlip é o meu trick, sou o case a flipar\nBitch I'm the shit, Tyga vai te explicar\nQueres que eu te apite? Então vai te aprontar\nQueres que eu te a pite? Então vai te lavar\nSou palhaço, faço a flor deitar liquido\nDá-me espaço, já perdi o meu lítio\nRed eyes, já não saio mais do sítio\nOnde é que vais? Isto aqui é pa' ti puto\n\n[Bridge]\nFodass man, coldest man - I'm the man!\nThrow this man, oldest man - I'm the man!\nFodass man, coldest man - I'm the man!\nThrow this man, oldest man - I'm the man!\n\n[Verso 2]\nChavaaal, nada aqui me pára, já que a cara que eu tenho é pa' enfeitar o craneo\nA minha massa não é verde nem dourada, é cinzenta porque esse é o exemplo que eu tenho\nQueres um desenho? Então pega na pen\nUSB nigga, conecta Profjam\nSe foda a cheta, I say it again:\nSe és escravo da guita, então sai me da frente\n\"my way or the high way\"? Nah Fred, eu quero o paaaaar..\nTou rolling tipo JK, j.k. 'tou a brincaaaaar\nTua mente muda, mayday! 'Tou aqui p'ajudaaaaar\nA própria morte eu ceifei quando me veio buscaaaar\n\n[Outro]\nPor isso agora visto preto\nHoodie sempre tipo oldschool shit\nMic é uma foice, bitch\nPor isso é que um nigga é fudiiiiido\nE as meninas sabem como é que eu paro brother\nStreet é minha casa, a Joana é inquilina\nPor mais pr'o que seja, eu não pago nada\nPorque a vida é sagrada quando é vista lá de cima, topas?", "year": "2014-01-17"}]}