{"artist": "YNW Melly", "songs": [{"image": "https://images.genius.com/8f60e277f118e6db76045f68c7e848fc.500x500x1.jpg", "year": "2017-06-11", "album": null, "lyrics": "[Intro]\nYoung Nigga World\nBitch\nMhm\n\n[Verse 1]\nFresh outta jail (huh), Louis V shirt\nOffset 4G's and them bitches got worked\nRun up on lil' Melly (huh), you gon get murked (you gon get)\nI don't give a fuck, bury me in a hearse\nLui V. Chinchilla (huh)\nWho the fuck Rilla?\nI ain't Kodak Black but I am all about my Skilla\nOops pardon me I meant my Skrilla\nBitch I grew up in the jungle with Killers and them  Gorillas\nI wanna bean, he want a perk\nI ain't fucking with these Jits and I heard he from the murk\nThese niggas snitching, my nigga silent\nWe really robbers, killers and got bodies\nReal drug dealers (Gang), Candy Paints Seats (fuck it)\nAlligator feet in that Forgiato\nAnd Lil Jit was strapped up walkin' round with the Choppa\nBad Yellow Bitch and she from Opa-Locka\nWe were trapping out the bando tryna flip a Quarter Key\nBad Yellow Bitch Florida Water it splash (water it splash)\nShe don't wanna move cuz she got too much ass\nI was the one with the Pistol in Class (Ooh)\nI don't give a shit (fuck it)\nYou ain't 'bout that action nigga you can't hit no lick (No lick)\nI don't give a damn (Damn), you don't give a fuck (give a fuck)\n(Like I'm from the fucking murk)\nWe had to run through the forest with Jungles and Lions and Cheetahs\nGiuseppe, Margiela, We started from Payless Sneakers and Adidas\nBig AK-47, Knock you out your feet and kill your people\nI am a blood bitch, I boss in the slime, me and you not equal\nHow the fuck you say a nigga robbed you, you ain't even go and get your money back (Get it back, Get it back)\nI don't give a fuck, I'm a goblin smokin' on that Mother Fuckin' Funny Pipe (Funny, Funny, Funny)\nShe don't give a fuck about her man, she keep tryna' get on me  (Tryna' get on me)\nI'ma up the thang let it bang, let it thang like rich homie (rick homie)\nFuck nigga shit (shit), swear to got I never been a fuck nigga jit\nAll you pussy niggas talking like you on it, we pull up with this [stick]\nShow me my opponent\nShow me my opponent, who the fuck wanna be\nThese niggas talkin' like they on it until we pull up with three big guns\nThey ain't nun, we shootin' for fun\nI swear to god, I'm smokin' loud, it's fucking up a Young Nigga Lung\nBitch I went to school with a Glock (For Real)\nYou went to school to do your Homework (Homework)\nI don't give a fuck 'bout Vagina Lil' Baby, I wanna see how your dome work\nNappy headed bitch, Goddamn did your mama ever show how a comb work?\nI don't give a fuck 'bout shit and I know you heard about me\nWe gon' shoot a movie, call it Spike Lee (Fresh outta' Jail)\nWith the Uhh in the Uhh Uhh Eee\nFresh outta jail with a Louis White Tee\nShe wanna fuck Melly, wanna be like me\nWanna talk like me, walk like me, drip sauce like me, go floss like me (Woahooh)\nStraight up out the G and she from Vero Beach but her ass so fat, you though she was a Georgia Peach\nI'm a Street Nigga, I ain't worried 'bout a deal\nFuck Niggas stop it before I have to take your meal (meal)\nWe robbin' in Juggin' Car jackin' tryna' make it happen\nShe fuck wit' Lil' Melly, she know that boy never be lackin'\nI'm up in the Pistol shootin' in public all in Traffic\nFree my nigga Savage, he's a money fanatic\nThis my first day out, This my first day in Bitch\nHaha", "title": "First Day Out. First Day In."}]}