{"songs": [{"album": "LA Leakers Freestyles", "image": "https://images.genius.com/6f329ec4a2750d93b8aa60439c9ba414.500x500x1.jpg", "title": "2 Chainz Freestyle | LA Leakers Freestyle #017", "year": "2017-06-13", "lyrics": "[Chorus]\nPretty Girls Like Trap Music, that's me\nPretty Girls Like Trap Music, that's me\n\n[Verse 1]\nMAC-11 and the crack I'm sellin' in my DNA\nFrito-Lay, Aston Martin there's no need to kid and play\nPick a day, bet I'll pull up on your ass with dealer plates\nPaper plates was my dinner plate, you prolly can't relate\nThis that Dre mixed with 3K, Wayne and Kanye\nAndale, want no bullshit, no need to perpetrate\nPurple drank in that dirty cup, down south MC Eiht\nDown south MC Eiht, LA call me down south MC Eiht\nHalf a million for the restaurant I have to renovate\nMan, I got so many demons, please don't make me demonstrate\nI know trappers, rappers, actors, got the Phantom 'fore the mansion\nMan that's backwards, ass-backwards, I'm a bachelor and I'm handsome\nAnd I'm straight up off the porch, and I landed in a Porsche\nAnd I ended on The Source, man I'm on the right course\nTurn your body to a corpse, turn this beat into a corpse\nTurn this beat into a body then shake and bake like Ricky Bobby, woo!\nCrib so big the livin' room like a lobby, woo!\nI can damn near fit a pool in the lobby, woo!\nGot your girl in here 'bout to drool in my lobby\nCuz is a Blood, he like to bool in my lobby, yeah\n\n[Chorus]\nPretty Girls Like that Trap Music, that's me\n'Bout to drop that shit around June 16th\nPretty Girls Like that Trap Music, that's me\n'Bout to drop it on your ass June 16th\n\n[Verse 2]\nFirst I met the plug, then I met his sister\nBought 20 packs, then I turned around and kissed her\nThen you know I left, I been left, Derek Fisher\nHad a lot of prize, but I'm tryna get richer\n\n[Chorus]\nPretty Girls Like That Trap Music, that's me\n'Bout to drop it on your ass June 16th\nPretty Girls Like That Trap Music, that's me\n'Bout to drop it on your ass June 16th\n\n[Verse 3]\nMan I got a dog, I paid 10 G's for it\nFucked up her hair and bought a quick weave for it\nSomebody please come and get these boys\nL.A. Leakers, come and get these boys\nSmokin' on the loud, man I'm known to bring the noise\nThis ain't Santa Claus when I'm comin' with the toys\nGot a duffle bag, man I got a duffle bag\nGot them suckas mad, man I got them, woo!"}], "artist": "2 Chainz"}