{"artist": "Wale", "songs": [{"title": "Clappers (Remix)", "year": "2014-02-03", "lyrics": "[Intro: Hit-Boy]\nHit-Boy on the beat, HS87 the plug\nYou know MMG in the street so them real niggas showin love\nWe ain’t throwin' up no ones like we movin' in, we came with bags\nFolarin said no hands, let me see you clap!\n\n[Hook: Wale]\nClappers to the front, front, front, front\nClappers to the front, front, front, front\nShawty got a big ol’ butt\nOh yeah!!!\n\n[Verse 1: Rick Ross]\nReal niggas gon' clap, I’m still holdin' on my strap\nReal hoes act right and all these fake hoes get left\nAll I want is that check, smell this Bel Air on my breath\nRich Forever my set, that mean I can’t sleep with no debt\nWale my nigga, workin' tight on all that we rep\nWalkin' round my new estate like I’m the king of Zaire\nMastermind right here, I got 30 rounds right here\nKnow I burn it down right here, nigga we certified 'round here\nKilo 35 'round here, we gon' tear him down right here\nHalf a mil' in one night, I’m the king of the diamonds right here\n\n[Hook]\n\n[Verse 2: Wale]\nI said clap, clap, clap it to the front, girl is yo back stolen?\nClap, clap, I think I’m 'bout to front you on a bag or somethin'\nClap, clap, clap, matter fact, most times I be the cause of that\nShow me where yo baddest bitch, I’ll show where you lost her at\n2 Rolex like 40 stacks, may just go and floss it back\nI just left some rendezvous, my broad said she could take off a month\nI be with CB, Virginia, that's Tappahannock\nI be with CB's, shout out to Chase and Zackie\nThere go jazzy spinners, supper clubbin' 87\nAnimals be cross-breedin', don't you see my mink is draggin'?\nI got it bros and I think y'all need some grownup values\nI’m thinkin' my jewel investors, you thinkin' them Jordan Gammas\n\n[Hook]\n\n[Verse 3: Fat Trel]\nLook, I like a real fat bubble back\nGucci bag, Louis trap\nKing of diamonds, DOA\nAn Onyx thot, I'm throwin' knots\nShow me tits, I’ll show you stacks\nThrow it back, I’ll throw you racks\nGeechi, bring Corona back\nGold Rolex, that 40 stacks\nBring one back to DC ’03\nEast street where the border at\nMy new bitch had to bring a new bitch\nCause fuck a one bitch, I’m bored of that\nBel Air Rose, Ciroc no chase\nLittle bit of OJ order that\nClappers where my tour was at\nI think we need some more of that\nMade her twerk or place a work\nCouldn’t you wait? Yall here to fuck\nTIV, I did it first\nDick 'em D, make em hurt\nShawty got a big ol butt, that’s what’s up\nI wanna touch but for how much? I got enough\nLet's get it!\n\n[Hook]\n\n[Verse 4: Young Thug]\nBig butt bitch\nYou wanna drop it, shake yo big butt bitch\nBack it up, back it up, back it up, hold up, is that for me?\nBooty big, I tell Stevie Wonder, \"Would you like to see?\"\nDo what y'all doin for me, do it\nDo what y'all doin for me, do it\nDo what y'all doin for me, do it\nThis hard earned cash gon be yours only if you do it\nNow clap it clap it clap it clap it let’s grab it\nWale want you to do it\nThugger want you to do it\nHit Boy want you to do it\nFat Trel want you to do it\nRicky want you to do it\nI see you want to do it\nMeechy want you to do it\nAll the skrippas please do it\n\n[Hook]", "album": null, "image": "https://images.genius.com/e0cde0eabe61c1ddca97cce2386792d2.421x421x1.jpg"}]}