{"artist": "Fashawn", "songs": [{"year": null, "album": "Higher Learning 2", "image": "https://images.genius.com/e483145f15089213e79bccc6be96eef8.500x500x1.jpg", "lyrics": "[Intro: Fashawn]\nReporting live from the 4LF\nIts your boy F, man\nWhat up Ush\nYou ain't the only one who can blow, yall\nI'm a teach you how to roll\nGee´s up you know, OCB´s (worldwide) Zig Zag (in the sky)\nOr even some Raw papers but not without them tips though, you know what I'm saying\nSee you got to do it right\nSmoke some, punk\n\n[Verse 1: Fashawn]\nShe smoke OCBs likes me I'm a take her\nTeach her how to properly roll a paper\nStraight lace we don't fuck with the flavors fuck with the G and get GCK'd up\nYou should see how much we blow in a day\nJust how it be when you roll with a gang\nRoll me a J ain't smokin with me I don't know why you came\nShoot this game watch me load it and aim\nKush and dro let me show you a thing\nTake my advice before you roll one again\nLet your nigga F take control of your brain\nDon't you complain\nHad you ever a nigga stroke you insane\nAnd nigga left you alone what a shame\nI'm a teach you how to smoke while you playing\nI don't do dope just promote Mary-Jane\n\n[Hook:]\nI smoke so much chronic\nYou can even ask my mama\nI've been everywhere and rolled all kinds of weed (All types of weed)\nI gotta cope with all this drama\nGot me smoking at all my concerts\nTo the point by the end of the show i can hardly breathe (I can hardly breath)\nSo who's gonna roll some papers\nPapers\nPapers\n(Don´t smoke that sess, GC Kush the only option girl)\nSo who's gonna roll my papers\nPapers\nPapers\n(Don´t somke that ses, GC Kush the only option girl)\n\n[Verse 2: Fashawn]\nGR-IZ-ZL-YG-ANG\nSo be prepared to roll some weed\nI'm rolling OCB's I brought from overseas\nHow bout we post up and blow these trees\nBrought some Zig Zags she's so FC\nI'm just wondering if you can roll one for me\nShe said oh indeed well OMG\nI'm about to break down a whole OZ of some potent weed\nBlow like a muther-fucking ocean breeze\nG's up, like I'm supposed to be\nUFO I'm higher than any jet and flyer than any plane\nA guy who entertain\nThis is heavy why you riding with them lames?\nCome and kick it in the sky for a change\n\n[Hook]\n\n[Outro: Fashawn]\nAy yo man I just wanna dedicate this song right here, to all the smokers worldwide, man, you know what I'm saying. Niggas who smoke that real shit that good shit, man. To all that other Niggas with strains an shit man, I don't fuck with this Grizzly City kush man, I swear to god I got iron lungs, man I can blow all the day man straight up. It's good indigo though, some sativa some shit you know how we smoke California man. Fuck around pop a lung or something, nigga. East Side, West side, North side, Mid West. For the smoking mill, for the smoking mill yeah come on. I've been everywhere, man, I smoked all kinds of weed man Snow Cap, you know what I mean Grand Daddy Purp, Blue Dream, Kim D, Hell Ban you know what I'm saying G 14, Sour Deez. Damn man, we CA man, we do this all day man we'll be higher that a motherfucker, man. Ay it's just a lifestyle out here, man. Ayo that's the kind of shit ,you know what I'm saying, yall niggas only read about in magazines, man. We do this shit every day, man out in CA., you feel me?", "title": "Papers (Remix)"}]}