{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legendary Classics Volume 1", "year": null, "lyrics": "[Verse 1: R.A. the Rugged Man]\n(Rugged Man have it, Mobb we infamous)\nYo, the Jess Franco of hip hop, leave you faceless\nTorture chambers, sadist in the basement\nRugged Man, who's the foulest? Who's the rudest?\nI grip my dick while I do this, HG Lewis\nThe two thousand maniacs, who this?\nBlood feast, old school splatter, occupation\nFamous rappers, straight razors, we dead broke, we playa haters\nViolaters, up your bitch pussy with vibrators\nThat's why they hate us, scum dripping\nUnder age, coogi sticking, pussy licking, put the clip in\nI take a shit on your album when it drops\nPlus your whole crew is pussies, like Suffolk County cops\nSuffolk County, meets Queensbridge, don't be foolish\nRugged Man, Jack Johnson, Joe Louis\nR to the A, no life, lowlife\nThe pretty bitch offender, the fat bitch complementer\nTop five lyrical contender, the lyricist's career ender\nWhite trash trailer park representer\nWho can stop this? Who rock this? Who lock this?\nWho got the Glock? Who cock this? Lucio Fulci\nR.A. the Rugged Man (on the reals)\nRugged Man, Havoc (no doubt)\n\n[Hook: Havoc x2]\n(Who's that guy?)\nA nigga you don't wanna fuck with\n(Who's that guy?)\nFour pounds will make 'em duck quick\n(Who's that guy?)\nGetting lifted at the bar, no doubt\nRugged Man, Havoc, Mobb we infamous\n\n[Verse 2: Havoc]\nGot my drink on, reminiscing drama on God\nStepped out my crib, politic with the gods\nOver gats, even though the hood is hot\nJakes on bikes, gotta hold down the block\n'Cause my life this automatic instant, ice grills, without a blink\nPermanently stained, they surface like Big\nThey shitting on my name, some ask why\n'Cause the sign just a regular gangsta, fuck DKNY\nScuffed Timbs laid up in Holiday Inn's\nAnd shortie wanna fret, I'm running up in her friend\nOfficial roaches, Scarface, shitting on mister Sosa, stay bent\nHold my liquor, like a cup coaster, handle mines\nSever great lines, cut throats while you drop dimes\nSnitch niggas on my shit list, quietly cock the biscuit\nThe Rugged Man, Havoc, Mobb we infamous\n\n[Hook x3]", "title": "Who’s That Guy", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}