{"songs": [{"title": "Criminal Background (feat. Peedi Crakk)", "lyrics": "[Young Chris]\nCriminal background, State Prop's back now\nLookin' for a squad like ours, picture that clown\nDifference in them verses what we talk we live it too\nThey just beats and hooks far from lyrical\nJust a lil' piece of mind I thought I'd share with you\nThey don't really care for you\nBe a lil' careful, you\nMight think you sharin' ya shit\nAnd the weirdest shit\nThen next time you hear his shit\nYou hearin' you\nThat just let's me know I'm gift with the lyrics too\nWhile I don't take it personal\nReverse em' when they share with you\nKeep her near you, unless you sharin'\nCuz I party mines\nSippin' on my name while you lames drinks Bacardi lime\nI'm takin' brains for the game when it's party time\nThinkin' you here to hang with the gang?\nWell I'm sorry ma\nGo ahead ma, keep ya ol' man Chris\nNot Ronnie, ain't no old man shit\nPlus you know this\n\n[Peedi Crakk]\nCriminals grindin', you hear us rhymin'\nBut at the same time nines is in alignment\nState Prop, a problem try to hide ya diamonds\nAs if Peedi and them Youngins won't find em\nAs if B. Sig and Freeweez ain't behind em\nOmilio Sparks and Oschin, perfect timin'\nWe criminal background, we back now\nSo lemme see ya motherfuckin' diamonds, diamonds..\n\n[Peedi Crakk]\nNow...\nKnow Crakk pick up on em bitches like Chevys\nGot my Avalanche tinted, know who in it P and Lezzy (P and Lezzy)\nBlowin',???? then he passed it to Haniffy\nTell me Crakk is off his grindin'\nI'm in the heaviest weight class ho\nC.R.E.A.M's say blast\nGot a camera in my bathroom lookin' at ya ass\nKnow my whirl-a-frame playin' too bout to break fast\nGet a half, while my nigga Tommy Buttas do the math (do the math)\nIt's like a capsule, you can see it from the past\nFrom the way they call me Crakk, from upstate I'm countin' cash\nFrom Montgomery's ass\nI might blast you, look at my lap, I'm in the cash rule\nThe girls feel so good, but the brain is not ready, I don't know\nI'd rather talk to a woman, cuz their mind is so steady, now here we go\n\n[Peedi Crakk]\nCriminals grindin', you hear us rhymin'\nBut at the same time nines is in alignment\nState Prop, a problem try to hide ya diamonds\nAs if Peedi and them Youngins won't find em\nAs if B. Sig and Freeweez ain't behind em\nOmilio Sparks and Oschin, perfect timin'\nWe criminal background, we back now\nSo lemme see ya motherfuckin' diamonds, diamonds..\n\n[Young Chris]\nI undastand that the ROC a crowded family\nBut I gotta lotta family\nAnd I'm one of the hottest\nI know the fans runnin' to cop us\nWill need that jam that have Def Jam want em to drop us\nCan't none of them stop us, one in the top plus\nYa don't really live it ya'll runnin' the blockbust\nThey get it from the flicks (watchin' too many movies)\nNow watch them cameras\nIf they don't get it from a snitch, they get it from the flicks\nI limit on these chicks, and kinda when I get head\nEver since they told me you could get it from the lips\nI never hadda pops, I can get it from some shit\nUsed to get it on the strip, or they get it from the clips\n\n[Peedi Crakk]\nCriminals grindin', you hear us rhymin'\nBut at the same time nines is in alignment\nState Prop, a problem try to hide ya diamonds\nAs if Peedi and them Youngins won't find em\nAs if B. Sig and Freeweez ain't behind em\nOmilio Sparks and Oschin, perfect timin'\nWe criminal background, we back now\nSo lemme see ya motherfuckin' diamonds, diamonds..\n\n[Young Chris]\nYoung C!.....P.C.!\nChad West, yous a problem!\nBrian Crest, holla at ya boy!!\nMy nigga P!\nNeef Buck, Face Dolla\nSigel, Free, O and Sparks\nIt's our summer\nBrice holla at the doe!!!!", "album": null, "year": null, "image": "https://images.genius.com/4b6d7fe9bbb80c2e12add9c4118de77a.395x395x1.jpg"}], "artist": "Young Chris"}