{"artist": "Pink Guy", "songs": [{"album": null, "title": "Pink Guy Raps Tweets and Comments", "image": "https://images.genius.com/2e0ea0eff080494fcfbee80f9df5aed9.999x999x1.jpg", "lyrics": "I like my women like I like my coffee, ground up and put in the freezer\nI am from Kenya, please send help\nI miss my dad\nIf I was anymore inbred I'd be a sandwich\nI am the supreme gentlemen\nFuck her right in the pussy\nMy dad left me\nThis beat is going down like a South Korean ferry\nWhat's better than swinging a dead baby in circles around your head on a 5 foot rope? Stopping it with a shovel\nThere are orphans shitting in my mouth\nI cry a lot when i touch myself\nD-D-D-D-Dad w-w-w-what's of breakfast?\nThe Jews did 911\nFilthy Frank fans will never get girlfriends and will die alone\nWhats better than a pile of dead babies? One in the middle is alive and has to eat it's way out\nWhat the fuck did you just say about me, you little bitch? I'll have you know I graduated top of my class in the Navy Seals, and I've been involved in numerous secret raids on Al-Qaeda, and I have over 300 confirmed kills...\nKekekekekekekek jajajajajajajajja kekekekekekekekek\nCory in the house\nDead girls can't say no\nSometimes I sit in a deep dark corner regretting the day I didn't use a condom on Rosie O'Donnell\nIn the 8th grade a guy almost put an egg up his ass because of me\nHow do you make a baby cry? Drop it. How do you make it stop crying? Drop it again\nFalcon punching pregnant women is my favorite past time\nIt hurts but i do it for Shrek\nYour mom should have swallowed you\nHey mom I'm in a Filthy Frank video\nPink Guy sucks he is a gay piece of shit and needs to die\nThis one time i pissed blood and drank it. Recycling is good\nI want to caress Matty B Raps and make him squeal like the lil' boy he is\nConsensual sex in the missionary position with the lights off\nWhat's red, 6 inches long, and makes my girlfriend cry when I feed it to her? her miscarriage\nIf she's old enough to pee then she's old enough for me\nAs long as I have a face your mother has somewhere to sit\nB0ss pls gibe da pusi b0ss xOver9000\n\n[Frank]\nWow these people are awful\n\n[Pink Guy]\n*Crys*\n\n[Frank]\nI believe I can fly\nI believe I can touch the sky", "year": "2014-06-22"}]}