{"artist": "Ice Cube", "songs": [{"title": "Gangster Rapper", "lyrics": "[Female Insert]\nMaestro!!!\n\n[Ice Cube]\nBlame me\n\n[Intro: Ice Cube]\nYou niggas know my pyroclastic flow\nYou niggas know my pyroclastic flow flow\nYou niggas know my pyroclastic flow it's R-A-W, R-A-W\n\n[Ice Cube]\nYou looking at the grand wizard, war lord vocal chord so vicious\nAnd I don't have to show riches to pull up pull off with some bad bitches\nAnd it ain't about chivalry\nIt's about dope lyrics and delivery\nIt's about my persona ain't nothing like a man that can do what he wanna\nAin't nothing like man on that you knew on the corner\nSee 'em come up and fuck up the owner\nSee 'em throw up Westside California\nNigga I'm hot as Phoenix Arizona\nI'm Utah I got multiple bitches\nIt's a new law keep a hold of yo riches\nDumb nigga don't spend it as soon as you get it\nAnd recognize I'm a captain and you a lieutenant\n\n[Hook 1]\nI can say what I want to say ain't nothing to it gangsta rap made me do it\nIf I call you a nigga ain't nothing to it gangsta rap made me do it\nI can act like an animal ain't nothing to it gangsta rap made me do it\n(Ghetto niggas struttin' with nothin' )\nIf I eat you like a cannibal ain't nothing to it gangsta rap made me do it\n(Ghetto niggas struttin' with nothin' )\n\n[Nas]\nGhetto niggas struttin' with nothin' but dreams and Queens broke\nMack-10's, you can smell the PCP smoke\nMele Mel told it real in the music he wrote\nThose were the days I remember\nWe used to be close, then I was nine, coldest winter I remember\nWas slippin' in December, two feet of snow\nYeah, that's the East Coast, that black ice\nSymbolized the rap life\nIt was slick and smooth\nI understood I had to come from the hood\nDoin' the Pee Wee Herman, the Smurf\nBefore them phones chirped\nThe block's drugs flowin', didn't have your own work\nYou had to have somebody else's, a small chrome on your pelvis\nStarter Jacket, Blue Georgetown or Green Celtic\nYour girl's too expensive, she wants shellfish\nRed Lobster was poppin', standin' on that line forever\nI wish somebody would step on my Bally leather's\nNow it's whatever... hip-hop's forever (hip hop's forever)\n\n[2Pac]\n\n(Fade In) HEYYYY! Got some static for some niggas on the other side of town\nLet my little cousin K roll, he's a rider now\nWhat they want from us motherfuckin thug niggas?\nUsed to love niggas now I plug niggas, and slug niggas\nAm I wrong? Niggas makin songs, tryin to get with us\nMust be gone on stress weed, in the West we trust\nTo the chest I BUST! Then we ride 'til the sun come\nShinin back to brighten up the sky, many die\nHeard the Fugees was tryin to do me - look bitch!\nI cut yo' face, this ain't no motherfuckin movie\nTHEN! We watch the other two die slow\nCastrated entertainin at my motherfuckin sideshow\nBAM! Set my plan in mo', time to exterminate my foes\nI can't stand you hoes, uhh\nNow label this my fuckin trick shot\nMy lyrics runnin all you cowards out of hip-hop\nWhen we RIDE - on our enemies\n\n[Ice Cube Hook]\n\nSo if I act like a pimp ain't nothing to it gangsta rap made me do it\nIf I call you a nappy headed ho ain't nothing to it gangsta rap made me do it\nIf I shoot up your college ain't nothing to it gangsta rap made me do it\nIf I rob you of knowledge ain't nothing to it gangsta rap made me do it\n\n[The Notorious B.I.G]\n\nHangin' with the goodie-goodies loungin' in paradise\nFuck that shit, I wanna tote guns and shoot dice\nAll my life I been considered as the worst\nLyin' to my mother, even stealin' out her purse\nCrime after crime, from drugs to extortion\nI know my mother wished she got a fuckin' abortion\nShe don't even love me like she did when I was younger\nSuckin' on her chest just to stop my fuckin' hunger\nI wonder if I died, would tears come to her eyes?\nForgive me for my disrespect, forgive me for my lies\nMy babies' mothers 8 months, her little sister's 2\nWho's to blame for both of them (naw nigga, not you)\nI swear to God I just want to slit my wrists and end this bullshit\nThrow the Magnum to my head, threaten to pull shit\nAnd squeeze, until the bed's, completely red\nI'm glad I'm dead, a worthless fuckin' buddah head\nThe stress is buildin' up, I can't\nI can't believe suicide's on my fuckin' mind\n\n[Ice Cube]\n\nSo if I act like a pimp ain't nothing to it gangsta rap made me do it\nIf I call you a nappy headed ho ain't nothing to it gangsta rap made me do it\nIf I shoot up your college ain't nothing to it gangsta rap made me do it\nIf I rob you of knowledge ain't nothing to it gangsta rap made me do it\n\nOh yeah and another thing\nFor all ya niggas that don't do gangsta rap\nDon't get on TV talking about gangsta rap\nCause 9 times at a 10 you don't know the fuck you talk about\nTalk about that bullshit rap you do\nStay the fuck out of mine", "image": "https://images.genius.com/c457bbdb72f694aa2707c388b36e7230.960x764x1.jpg", "album": null, "year": null}]}