{"songs": [{"image": "https://images.genius.com/361fbb0a68e9287bdc9eb1ad1f8099a7.640x640x1.jpg", "title": "Dirty Money (first and second part)", "album": null, "year": "2007-07-05", "lyrics": "Intro:\nI don't wanna sound mad, though! I don't wanna sound mad!\nI feel marvelous right now!\nDirty money!\n\nVerse:\nTell that bitch with the crown to run it like Chris Brown\nShe won 3 rounds, I'mma need a hundred thou\nLike china town, bitches better bow down\nOh, you ain't know? bet ya'll bitches know now\nFuck I gotta do to let 'em know that I'm the one?\nWay I ride the drum they salute me in the slum\nIn the 6 hun the color of bubble gum\nI'm with my nigga spits and my nigga, bun crum (waddup!)\nYes, I'm the one, I'm the motherfuckin' one (chyeah!)\nHold more weight than the late big pun (oh!)\nBitches talk slick, but they ain't say nun (no!)\nMad cause I'm bad, 2 sticks in my bun (chyeah!)\nYes, sir, look what i've done\nThey r-run, run when I come\nBum-stickity-bum, let me tell 'em where I'm from\nQueens, little mama, gabbana, some nice pumps (chyeah!)\n\nFreestyle:\nYo, what up? It's Nicki Minaj\nDirty Money, holla at ya girl\nUm, shout out to everybody that hit me up for the last come up\nThanks for the love I really do appreciate it, you know what I'm sayin'?\nUm, but like, since the last come up niggas was like, coming up to me they was like, \"Yo, Nicki you spit crazy\"\nGet it poppin' like M80 with twin trey 80s\nThe hood's first lady, you know?\nBaby girl of the group, I'm also known as baby girl in the coupe\nNever get me confused with baby girl in the hoop\nCuz' Nicki stay fly like that Cash Money do\nI'm stuntin' on these hoes like Marilyn Monroe\nI gotta esk-curl flow spit slick ya know?\nNow I don't just spit raps and chit chat\nNicki could get it in, Nicki could spit gats\nYour girl got hustle, Nicki could pitch crack\nBut Nicki rather chill and stack a mil'\nWhile these hoes stay in hoods like rats for real\nMy voice stay on the track like a Mac for real\nRiding the baseline like Quille O' Neal\nGassed ya baby father for the keys to the Esclalade\nNot a baby momma put I'm Drama like K Slay\nWhat could I say? It's how ya girl do\nYa girl stay fresh down to her cuticles\nMy people smoke dutches we don't fluck wit bamboo\nI'm a winner mami, your careers' a gamble\nOld ass broad off track like bow weez\nNicki stay on the toes on point like ballerines\nLemme remind you I'm getting a tan too\nYa caramel dream, ya girl from queens\nThey say I'm too pretty to be spitting sixteen\nI should be on the screen, posing for Maybelline\nOr be a baby phat girl getting on my jean\nHood star broad, black barbie doll\nPardon me if the cockiness bothering y'all\nI'm just being Nicki Minaj, ya know?\nGirl from around way without the L Cool J\nWhile you spit kool-aid, I spit acid out\nDoing this since you was Reebok Classic out\nAnd this hoe wanna get at Nick? Why?\nCuz' I bagged her baby daddy, she ain't seen him since\nNick so caught up, lil tank top, Ed Hardy zone\nSome Dolce Gaban pretty panties on\nLike wait til' the summer, catch me up in the hummer\nOn my way to 55 front, row with the Rucker\nEvery baller wanna, never give out my number\nOnly the email, cherrythong.com, holla\nName a girl as real as her, nope not dem\nWho's ya best MC's? Nick Fox and KIm\nNick up in the Porsche, box or the Benz nigga\n\nOutro:\nDirty Money, you heard? I do it, I do it for fun like\nI mean I just do it cuz' I can like\nI only rap because I'm good at it like, really\nYou know what I'm sayin'? It really was a hobby for a minute\nBut then you know what I'm sayin'? I was like, \"Damn look at the state of hip-hop, like what's goin' on?\"\nNah but thanks for the love, to everybody you know what I'm sayin'?\nShout out to New York, shout out to everybody who seeing this right now like I'm just on my grind, don't get it twisted\nLike it's not a, not even about being cocky, it's just about being real\nLike I'm, like I'm good at what I do, so you know what I'm sayin'?\nThat's why I act the way I act like don't get it twisted like if you see me, holla at me\nI'm never too ill to stay, \"What up?\"\nLike it's not that serious trust me I know that\nBut anyway, holla at ya girl, hit me up on MySpace or something\nNicki Minaj, N-I-C-K-I M-I-N-A-J\nYa heard me?"}], "artist": "Nicki Minaj"}