{"songs": [{"title": "Can’t Let You Go", "album": null, "year": null, "image": "https://images.genius.com/37d697fdf2a877e070869cbcf7cc9322.151x151x1.png", "lyrics": "[Lil' Flip - talking]\nWheew\nReality check\nI ain't hear to, sing to ya\nRing a ring to ya\nBitch please (bitch please)\nBitch please, lick these!\nYou tease\nSucka free\n\n[Lil' Flip]\nBitch please, you don't need to miss me\nCuz when I come around you don't even kiss me\nBut it's coo (it's coo), I ain't a foo (ain't a foo)\nIt's twelve thirty, how the fuck you at schoo\nBitch please, I'm about to leave\nCuz I, got another trick up my sleeve\nBe gone I don't need you no mo\nCuz you ain't shit but a dirty ass hoe\nBitch please, you wearin' ya friends clothes\nBroke, smokin' my indo\nTryin', to stay in my fuckin' house (get the fuck out)\nBitch, quit, runnin ya mouth\nBitch please, I don't like ya ass\nIf ya go to jail, hoe I won't write ya ass\nI won't lick ya ass, I'll jus stick ya ass\nTreat ya like a bug n i'll pick ya ass\nBitch please, then I'm jumpin' in my lambo (lambo)\nGot a gun niggas call me rambo\nDon't give a damn I got more ammo\nLil Ron, that's my fammo\n\n[Pimpin' Ken]\nBitch Please, you can't understand\nI'm the thug type dude, I don't hold no hands\nWhat you talkin' bout you wanna be my wife\nBitch, you gave the nigga head on the first night\nThat ain't right, Bitch please\nYa listnin to ya friends\nTryna go through the mall and hit me from my ends\nTryna roll my benz, I can't let that happen\nThat's why a nigga, keep on rappin'\nBitch Please, I don't fuck wit u\nYou a busta type bitch, runnin wit ya crew\nEverythang ain't all good, when ya in the place\nYa make a nigga wanna put a punch to ya face\n\n[Lil' Flip]\nBitch please, I don't play that shit\nWhen you talkin' wit ya girls, don't say that shit\nThat I be doin, or who I be fuckin'\nCuz I'm gonna come, and give yo ass a concussion\nWhat the fuck was you thinkin?\nJus because I got a benz, that I don't have a lincoln?\nWhat the fuck was you doin?\nWhy the fuck, why you playin wit me, what you persuin?\nI know you wanna come to a nigga house (house)\nYou on ya period, then put it in ya mouth\nLike jigga said, fuck what a nigga said\nDon't fuck wit him, Lil' Flip got bigga bread\nI got money, and I got that shit for safe\nGot a mutha fuckin ring and a nice face\nWon't catch a case, I gotta good lawyer\nCuz when you knock a nigga out, errybody saw ya\nFuck that, I got a gun nigga bitch please\nGot more jewlery than Mista T\nI'm like Mister freeze, lookin' at my watch (why)\nShit tac toe, I got the clover on the top (nigga)\nI'm in the block (block), I'm in the drop (drop)\nNiggas know the cops, runnin' in the spot (spot)\nIf ya, too hot (hot) tryna be too fast\nYea I don't sell drugs so don't ever ask me\nDon't put shit past me, Imma have to get niggas who blast me\nI ain't trippin' on these niggas, I ain't slippin' on these niggas\nImma pull off my belt, and give a whippin' to these niggas\n\n[Lil' Flip - talking]\nHaha, Lil' Flip\nBitch please\nThis how we do it (this how we do it)\nBitch please, bitch please, bitch please"}], "artist": "Lil Flip"}