{"artist": "Wax", "songs": [{"year": "2019-09-16", "lyrics": "[Intro: Wax]\nAw yeah (Aw yeah)\nWe about to hear some chill ass motherfuckin' shit\nYo\nUh\n\n[Verse 1: Wax]\nAyo, your writing is a pitiful shame, it's quite hazardous\nMichael is a biblical name, it's like Lazarus (New Testament)\nAin't nobody rappin' quite as laid back as this (Nah)\nMe and Herbs casually sittin' 'round, passin' spliffs\nWe reminisce like \"remember this?\"\nI like life best when it's truly effortless\nMore paper than the way they package Pepperidge Farm\nRappers talk a lot but then they fall off like a leper's arm\nThem I lambaste\nThey say I got game\nLike the way that lamb tastes (Gamy)\nI make sure all my beats are tamb-laced\nHey\nThere you have it\nLegendary tactics (Ayy)\nI'll be very active even when I'm geriatric\nBig Wax, I'm comin' at ya with that laid back maneuverin'\nIf you'd like to know about this pocket that we're groovin' in\n\n[Chorus: Wax]\nI'm lovin' it, lovin' it, lovin' it\nLovin' it, lovin' it, lovin' it\nI'm lovin' it, lovin' it, lovin' it\nLovin' it, lovin' it, lovin' it\n\n[Verse 2: Wax]\nCheck it out, ayo\nI'm very beautiful, painters love painting me\nI hold my cup of English breakfast tee quite daintily\nAsk the maître d' who his favorite patron be\nHe gon' say it's me and you won't have to wait patiently\nHe sees me and he says \"I'm a gigantic fan of you\nHere's a table for two with a panoramic view of the city\nBy the way, your lady friend is very pretty\"\nI'm the smoothest motherfucker this side of the Mississippi\nAin't it trippy how the sunset colors the sky?\nA palette so vast, in front of which the seagulls fly\nI agree, there must be a G-O-D\nTo provide such beauty\nIt reminds me of me\n'Cause I shine and I'm fresh\nAnd my breath control is mean\nI'm like Mr. Clean used Listerine and antihistamine\nPristine, the bars that I'm droppin'\nWax, Herbal T, we are never stoppin'\n\n[Chorus: Wax]\nI'm lovin' it, lovin' it, lovin' it (Say what?)\nLovin' it, lovin' it, lovin' it (Alright)\nI'm lovin' it, lovin' it, lovin' it (Word)\nLovin' it, lovin' it, lovin' it (Okay)\n\n[Verse 3: Herbal T]\nI wake up early in the morning, walk my dog 'round the block\nSee people rushin' everywhere, it seems they're racing the clock\nThey hurry and wait, face full of worry and hate\nThey wanna talk, I'm content to let the jury debate\nI figure why worry? A watched kettle, it never boils\nI'll reap the benefits and I'll get away with the spoils of chillin'\n'Cause chillin' is a feeling more thrillin'\nLord willing, I could float from the floor to the ceilin'\nI'm a old schooler, flow ruler\nTo get this hot, you should probably cop bottles of Chalula\nCompared to snow, cooler, I'm a go-getter\nThe flow meta, you should probably know better\nThan to ever try to test\nMe or my brother's crew\nThere could be no other two that could do it like we do\nThat's a guaranteed, certified, bulletproof covenant\nWe lovin' it, yes, yes, we lovin' it\n\n[Chorus: Wax]\nI'm lovin' it, lovin' it, lovin' it (Word?)\nLovin' it, lovin' it, lovin' it (Okay)\nI'm lovin' it, lovin' it, lovin' it (Uh-huh, uh-huh)\nLovin' it, lovin' it, lovin' it (Okay)", "image": "https://images.genius.com/e015818e43a752157eb3e43900823a29.999x999x1.jpg", "album": "B.A.A.A", "title": "Loving It"}]}