{"songs": [{"year": "2019-06-14", "image": "https://images.genius.com/632cbe474a2ab6a525c2a0da36a43d67.1000x1000x1.jpg", "title": "Solo Crippin", "album": "I Am Me", "lyrics": "[Intro]\nOh my fucking God\nKushy got a retainer, haha\n(Damn Chop, this shit slappin')\nHah, ayy (Word)\n\n[Verse]\nI get more ass than a lawn chair\nI like a bitch with some long hair (Hair)\nShe shakin’ that ass and throwin' it fast (Throw it)\nThat makin' me wanna go bone her (I wanna fuck)\nSneak dissin’, lil' boy, watch your tone there (Huh?)\nI'm not givin' you shit, I'm no loaner (That's on mama)\nIf you do what I do, you a clone there (Word)\nSat down with a nine, young nigga did some long prayer\nRide around your block with a corner\nI might just serve me a corner (Yeah, yeah, yeah, yeah)\nHe a barber, that boy used to comb hair (Huh?)\nI might walk through your hood just to roam there (Huh? Huh?)\nIf you reach in that glove department, trap phone there\nGive it to 'em like a donor (Donor)\nWhy beef 'bout a bitch if I really don’t want her?\nI check them hoes off the list like Nike Air (Woah)\nFuck her in your house and spend the night there\nYou caught me, I know you don’t like that shit right there\nYou fought me, that's how you got that lil’ black eye there (Huh?)\nYou diss them Crips or the Nation, you die there (Yeah)\nSend your location, I fly there (Fly there)\nEight-legged freak, send her back in my Spyder (Spyder)\nFour hoes on me, I'm the shit like a diaper (Diaper)\nI'm comin' off the dome like a cypher (Yeah, yeah, yeah, yeah)\nTwo-tone (Two-tone)\nAudemar my wrist, I got designer on my ’fit ('Fit)\nNo collision, but nigga, we be callin' hits (Rrah)\nIn the Expedition, we got 'bout 37 sticks (Doon, doon, doon)\nHeard your ex went missin', I got her fuckin' on the clique\nNo supervision, radar in this bitch (Bitch)\nNo record label, got my A&R in this bitch (Rrah, rrah, rrah)\nShoot a nigga in December, that's a cold hit (Cold hit)\nAll that sneak dissin' got your folks hit (Folks hit)\nCaught a body, same gun, hit the show with it (Yeah)\nDo whatever for the money, baby, go get it (Woo)\nThousand dollars for a front row ticket (Yes)\nIt's all fun until your dough come missing\nCall my niggas, do a door-door kickin' (Kickin')\nSay you a killer, get your mojo missin' (Missin')\nSay you a P, better slow your pimpin' (Pimpin')\nBitch, I be solo Crippin' (Crip, crip)\n\n[Outro]\nNigga, better slow your pimpin'\n'Fore your fuckin' folks come missin'\nSay you killer but your mojo missin'\nNigga, you ain't gettin' no money\nTake a notepad, nigga, you came with that nigga (Oh)\nI'll tell you 'bout these slow ass niggas\nSay they a shooter but they gun ain't never on safety\nNah, we ain't even gon' play\nNah, we just fuck 'em on the pavement\nNah, fuckin' your bitch on the pavement\nNah, man\nShit is litty in the city, bitch\nNigga, weed comin' out in this\nBoy, why you put that shit in here, boy?\nChoppamatics made another one\nWhy did you do that? Stupid"}], "artist": "BlocBoy JB"}