{"songs": [{"year": null, "lyrics": "* known as 'I Am the Champion' on the NBA Live 2010 Soundtrack\n\n[Intro] [Sportscaster talking]\nIncredible! Incredible! Oh my God. Ladies and gentlemen\nYou have just witnessed world history being made\nBobby Simmons, takes it to the hole, dunks it\nOvertime three seconds left, oh my God! Yeah!\n\n[Hook]\nI am the champion (champion, champion) (okay)\nI am the champion (champion, champion) (did he just get serious in here?)\nLights, cameras, action (action, action) (I think it did)\nWhenever I play\nNow say. I am the champion (I am the champion)\nI am the champion (I am the champion)\nI say I am the champion (I am the champion)\nI am the champion (I am the champion)\n\n[Verse 1]\nOkay Bob hit the stage now\nLights and cameras on\nYes I'm givin them want they want\nBut no, I will not ever conform\nCause I'm outside of the norm still\nWhat a spectacular form\nFrom the blood sweat and the tears shed\nEvery time I perform\nAnd whenever your doin' your thang\nYep, people gonna hate on it usually (that's right)\nBut I'm just as human as you\nI just look good while doin' it\nAnd they telling me I have so much dope I won't know what to do with it\nWell until then\nI'm gonna continuin' maneuverin'\nBecause\n\n[Hook]\nI am the champion (champion, champion) (What a spectacular athlete)\nI am the champion (champion, champion) (If I do say so myself)\nLights, cameras, action (action, action) (hahaha, seriously)\nWhenever I play\nI say. I am the champion (I am the champion)\nI am the champion (I am the champion)\nI say I am the champion (I am the champion)\nI am the champion (I am the champion)\n\n[Verse Two]\nI look in the mirror and laugh\nLike look at what I've become\nEveryone calls me Bob but I'm still my mother's son\nAnd I'm low key when I'm out now, hell no, fame ain't fun\nBut I stay Live like NBA on yo' Playstation\nAnd I entertain' cause I'm in the game\nIt's easy to see I ain't into fame\nCause I ain't\nAnd critics say that I imitate, but I really can't\nPlease allow me to demonstrate\nBut no matter what they say\nI stay charged up like a triple A\nReally maine?\nReally maine\n\n[Hook]\nI am the champion (champion, champion) (I wake up and piss excellence)\nI am the champion (champion, champion) (All day)\nLights, cameras, action (action, action) (Please hold your applause)\nWhenever I play (I'm kind of a big deal)\nI say. I am the champion (I am the champion)\nI am the champion (I am the champion)\nI say I am the champion (I am the champion)\nI am the champion (I am the champion)\n\n[Sportscaster talking]\nWow, it seems like the crowd is pandemonium!\nThis is pandemonium!\nThe crowd is rushing the court\nAnd it seems like they're chanting for...\nWhat?! What?!\nCan we get audio?\n\n[Bridge]\nHoo hoo you be too scared you need to go home\nHoo hoo you be too scared you need to go home\nHoo hoo you be too scared you need to go home\nJeah you need to go home\nJeah you need to go home\n\n[Hook]\nI am the champion (champion, champion) (Hey what can I say?)\nI am the champion (champion, champion) (hahaha)\nLights, cameras, action (action, action) (Please, no interviews)\nWhenever I play (hahaha)\nI say. I am the champion (I am the champion)\nI am the champion (I am the champion)\nI say I am the champion (I am the champion)\nI am the champion (I am the champion)\n\nWhenever I\nWhenever I play\nPlay\nWhenever I\nWhenever I play\nPlay", "title": "Champion", "album": "May 25th", "image": "https://images.genius.com/51bfc55fdc338bff1c957159669698ce.320x320x1.jpg"}], "artist": "B.o.B"}