{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/c347081c7afabbcba96aea0847886344.758x738x1.jpg", "title": "Mafioso", "year": "1998-10-20", "album": "Roots of Evil", "lyrics": "Verse 1:\nWho macks the most shit? smoke ya whole clique like roach spliffs\nWho's ro's drip enough to hold drifts and float ships?\nNo mo' shifts, I hold enough chips to toast Criss\nIt's G. Rap, the cat thats on your wanted most list\nI wrote this so you could sweat this and soak this\nGet the focus, the main family kid not the bogus\nWe're crime culprits, put hot shit up in you like posters\nLeft for the vultures, we DT's pickin' up cultures\nThree-thousand volt ya just like the third rail\nAnd if you heard shells a herb fell\nSwift with the words well\nAll of my dirt trail\nKicked up enough dust to hurt cells\nSwerve the SL's, Get G merks well or shirt brail\nCurve the jail cell for jakes that wanna H-block those\nNiggas in Paco's keep the blocks froze and the shops closed\nWhere the pot grows, young cats coppin' the drop Roves\nGet the Nacho's, and no cops show when the shots blow\nShit's red hot though, the streets remain flooded with D's\nBundles of Ki's to maintain a hundred degrees\nMain crime wave\nWe handle the beef in .9 ways\nGet your mind grazed\nMy teck-nine sprays your spine blades\nWhen it gets too hot on the block better believe the rhyme pays\nPut all you cats in cradles if you crave divine ways\nDiamond ??? rays blindin' you with my shine glaze\nUnlike them other rappers that get stuck in a time phase\n\nChorus - Wanted for rude intrusions, major operations, distribution (G. Rap is down\nWith a mafioso posse) Wanted for rude intrusions, major operations distribution\nRackateerin', prostitution, and paid execution\n\nVerse 2:\nMy corporation's body casin', watch where you pacin'\nThug orchestration, this is live niggas you facin'\nWe paper chasin', for that million baby we lacin'\nFifty Caliber gat embracin'\nLeavin' you wit' legs without sensation\nWho's full of malice? Who thug the wildest?\nAct childish get your body sent to a stylist\nWho live the foulest? be grippin' cannons 'till my hands is callused\nPile this paper longer than malice from Ney York to Dallas\nPurchase a palace, sip Collatas with the whole brigata\nBodies get dropped while I attend the opera\nLand on Casino roofs in Helicopters in Las Vegas Nevada\nCan't stop until I got a Casa up in Trump plaza\n929 Mazda, foreign chicks talkin' with accents like they Sza Sza\nCream like Iri Amin Dada\nThug saga, slugs burn you like they lava\nYou and ya bimbo get hit up through ya car window\nSee you an drift slow and let ten blow\nFrom out the darkest shadow\nMy aim's straight as an archers arrow\nI'll spark this barrel\nHit my target even if the mark is narrow\nLay you like a pharoah\nWith fragments inside your bone marrow\nGet your wig flown just like a sparrow\n\nChorus"}]}