{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/223eae699f7fa6a530d91ded286f794f.600x600x1.jpg", "title": "Soundtrack to the Streets", "year": "1998-11-17", "album": "Soundtrack to the Streets", "lyrics": "[Kid] Yeahhhhh!\n[Nas] Uhh, QB\n[Kid] All the people in the place!\nIt's the one and only Kid Capri\n[Nas] Uhh, TM nigga\n[Kid] Along with my man Nas Escobar\n[Nas] Ill Will\n[Kid] We about to take this one all around the world\nSo y'all feel this one, come on!\n\nVerse One: Nas\n\nMy antidote to the dope add drugs in the party\nPistol-whippin' your body lyrical odyssey\nY'all ain't smoke real shit less y'all smokin' with me\nAnd y'all ain't heard real shit, til you heard it from me\nEscobar, I toasted with Frank White, to this new era\nOf gangster life, slangin words in the mic\nThanks to the life, I urge y'all to write pain\nYou a whore to the war, I remain a virgin that's tight\nThis game I'mma run til it's done, stack my funds\nPackin' guns, clean each gat, once a month\nHope ya toast carry heavy as the vest on your chest\nHope you squeeze it cause you're only safe from stomach to chest\nEverything else left open, I'm smokin'\nNext to your balls, police won't even question at all\nIt's the Esc- to the -bar, connects in P.R\nOverlord of rap, U.S., France to Ecuador\n\nChorus: Nas\n\nHave you ever met a QB gangsta, who would\nShake your hand and turn ya back he would shank ya?\nNiggas want the street you lookin' for me\nYou want the hot shit you must cop the Kid Capri\nLadies dance to it, niggas pound that in your Jeep\nEsco' and Kid Capri, with the motherfuckin' Soundtrack\nTo the Street, thugs pop to it, sell rocks to it\nPuffin L's poppin' Glocks to it\n\nVerse Two: Nas\n\nMe and the streets share the same vein, same pain\nThe whole game changed, niggas with no brain could make dough\nOff of cocaine, Colombian neckties\nDemocrats to Bill Clinton gotta respect Nas\nCustomized flow, words stitched into the seams\nTailor made lyrics words fit ya, spit scripture worship\nFar from Ali, niggas can't spar with the kid\nRegardless of your bid or who you partners with\nSpit, cartridges at so-called hard ni-ggaz\nYou get, sparked and hit, held as hostages\nYou know how the mobsters is from the heart of the Bridge\nWe just started gettin' dough, yo pardon the kid\nI ain't used to havin' shit, my youth as bad as it get\nGhetto bound first lesson was to let off rounds\nShots, echo the town, New York, home of\nThe Harlem mix tape, master as we all know him now\n\nChorus\n\nVerse Three: Nas\n\nUhh, what? Kid Capri\n\nSoundtrack to the Street a theme for every hood\nEvery lockdown facility, get oxed down for grillin' me\nRight down hostility, iced down with friends of ours\nRespect money and power and them honeys that swallow\nBut what's becoming of Pablo, nothing but bigger bank\nFuck you niggas think I ride for?\nSame thing niggas die for, so we draw guns\nThe same time in this war, leave your mind on the floor\nNiggas doing thirty to life to survive in this world\nTransporting keys that's inside of a door\nOpening spots from Little Rock to Baltimore\nSmoked out, chillin' on the Kid Capri world tour\n\nChorus\n\n[Kid Capri]\nYeah\nWord up, come on\nWe make it bump one time word up\nMy man Nas make it bump one time come on\nCome on, we make it bump one time word up\nThe Kid Capri make it bump one time come on\n\nChorus\n\n[Kid Capri]\nAnd I say party people, it's the Kid Capri\nNas Escobar, Soundtrack to the Streets\nJumpin off, youknowhatI'msayin?\nYou a part of history, stay tuned, uh!"}]}