{"artist": "Boogie", "songs": [{"album": "Everything’s for Sale", "title": "Whose Fault", "year": "2019-01-25", "lyrics": "[Skit]\nI will tear this whole fucking house down\nI'm bettin' you won't do shit\nOh, really? Try me. Try me!\nYeah\nCome on, try me!\nFuck out my face!\nTry me, bitch!\nThen come on and try me!\nGet out my fuckin' face, move!\nWhat you gonna do?\nCome on, don't stop here\nNo, I'm tired of you\nGo head, go\nGo head, stop\nYeah, whatever\nI have had enough!\nShut the fuck up!\n\n[Verse 1: Boogie]\nYo, yo\nUh\nDon't put your hands on me, uh\nFuck out my phone, I already told you she my damn homie, uh\nYou know the buttons still hurtin', and then you gon' stand on em', uh\nAnd have the nerve to say you'll call another man on me, whoa\nI was aware of your hurt, but I didn't know what your vengeance like\nHow the role of the killer switch to the role of the victim?\nLike why the fuck you keep yellin', \"We can't afford no eviction\"? Uh\nOn my momma, you trippin' bitch, don't be bringin' my kid in this\nShe say, \"Nigga you ain't shit, shoulda left you where you stand\nShoulda never let you hit, I shoulda chose up on your friend\nWish your daddy was around and taught you how to be a man\n'Cause you a, motherfuckin' coward, nigga, let go of my hand\nI swear I hate you, I hate how you think you dumb poppin'\nNigga, fuck Compton, act like you don't see your son watchin', uh\nI'm done watchin' you fuck him up, keep it pushin', go do you\nLike he don't copy your movements and he ain't lookin' up to you that shit is boo-boo, I hate it\nKnow it's actually kinda crazy how you fucked your homegirl and then actually tried to blame me, like\nNo, I'm laughin' because I'm angry, you salty 'cause I been dating don't ask me to see your baby, fuckin' pussy\"\n\n[Interlude]\nAt the tone please record your message, when you finish recording you may hang up or press one for more options\nLook bro, I don't know what you been on\nBut this is the example you want to set for your son?\nLike dude, get it together\nI need some me time\nYour son got practice on Friday and a game on Saturday\nI need you to pick him up after school\nGet out your feelings\n\n[Verse 2: Boogie]\nWe in darkness, but we addicted to it\nYou say my son got a game and I need to get him to it, uh\nThough I miss him, I say, \"Shit, no I ain't finna do it\"\n'Cause I'm too pissed, I say, \"No, bitch, go tell your nigga do it\", uh\nAnother stereotype that I couldn't prove wrong\nCool with doin' me, but just not tryna let you move on, uh\nThe rude tone was too strong, shit, you know I just can't back down\nKnow you got me fucked- nah, who that nigga in your background?\nI told you, bitch, don't ever have no nigga 'round my baby\nI'm forever gon' be with it, bitch, don't ever try and play me\nShe like, \"Boy you fake crazy, I bet you wish you cared then, huh?\"\nThen, \"I bet you wish that you was there then, huh?\"\nI seen the truth when I was buried in my shame\nWe already share the pain, how 'bout we finally share the blame?\nYou was bitter out my bones and take the hatred out my veins, uh\nDon't look for change, be the change, that's it", "image": "https://images.genius.com/3e057bea64f27f9ecfbe001b0cf96345.1000x1000x1.jpg"}]}