{"artist": "ILL BILL", "songs": [{"title": "Stick N Move (Remix)", "lyrics": "Brr! stick ‘em hi-hi-high stick ‘em\nBrr! stick ‘em hi-hi-high stick ‘em\nBrr! stick ‘em hi-hi-high stick ‘em\nTreat it like boxing, stick and move, stick and move\nBrr! stick ‘em hi-hi-high stick ‘em\nBrr! stick ‘em hi-hi-high stick ‘em\nBrr! stick ‘em hi-hi-high stick ‘em\nYou ain’t got to explain shit\n\nBorn Unique:\nStick and move the switchblades, down to four-fifths\nDo it gladiator style, hit you with the raw fist\nSniffing the raw fish makes your jaw twitch\nFirst joint was hot, remix more sick\nStick and move, try it with me, the wrong shit\nYou picked the wrong vic\nCatch you at church wearing the wrong kicks\nYou can’t run now sonny, ain’t nothing funny\nI want the money, body filled with dummies\nSo here we go, be like “Not him!”\nCats hate me in the (…)\nBut never shot him, never got him\nDo me a favor, I’m ready to die\nI’ll be waiting heavy in the cut cleaning my nines\nWith a dime between my thighs cleaning my nine\nGreasy grimy guy been seen with demon eyes\nBrrr! stick em, hi-hi-high stick ‘em\nYo!, Sha pull the whip over, I see another victim\n\nChorus\n\nKilla Sha:\nYo, yo, straight to the point like twenty minutes to one\nStill in 06, a nigga’ll get hung\nSpit out venomous shit from the lungs\nLames be tucking in their links when I come\nPull up to the club, nothing less than ten guns\nThe god came to party then snatching funds\nNiggas don’t say a word until I’m done\nI really think you wanna get home to your son and to ya wife\nSo look into my eyes\nCome on daddy you know what this is already, nigga\nYo, I ain’t really playing around with this\nAnd I’m right up on you, son\nI don’t plan to miss\nI’m high off that dust and lion piss\nGive niggas the business and I’ll smash their bitch\nThere it is, Unique and the QB kid\nStick-n-move, nigga straight from the bridge\n\nChorus\n\nILL BILL:\nNever hit a man with glasses, hit him with a brick\nIf he doesn’t give up his shit, hit him with a clip\nI don’t suffer from insanity, enjoy every minute of it\nMy hobby’s armed robbery, it’s really fun\nWhen a motherfucker run and try to jog from bullets\nI blow wigs off leaving flat tops and mullets\nWhen you die go to Heaven, till then welcome to Hell\nGive me something to bring to the porn shop and sell\nI snatch diamonds and rubies, Pradas and Guccis\nMy getaway driver push Hondas and (…)\nRun up in your fucking house with Llamas and Uzis\nAnd a roll of duct tape for your momma and your two seeds\nHomie, even Snoop loves La Coka\n(…) half bandana on a skull with toasters\nLie the fuck down homie, put your hands on your head\nWhile I’m walking out the door with my hands on your bread\nStupid!\n\nChorus", "image": "https://images.genius.com/99ff63951f21bd5532d81bd64d3cbd69.800x800x1.jpg", "album": "ILL Bill Is The Future Vol. II", "year": "2006-10-13"}]}