{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Verse 1: Young Thug]\nI'ma ball like Spalding, nigga\nI'm a Blood, I'm a baller, you can call a nigga\nAnd I'm smokin' angel dust, yeah, spa nigga\nAnd I'm attracted to green like gua', niggas\nI'ma pull up late, regulate\nMy jewels are no joke, shit's frosted like flakes\nI swear to God I'm baked, like Easy Bake\nI show the very same energy, sound like a taser\nYeah shot like a shawty with a taser\nFly the bitch to LA, she ballin' like a Laker\nI know not to tell and never speak to the neighbor\nIn fact I can't see ‘em, I'm on so many acres\nEver since I met shawty I feel like Hercules\nAnd I'm smokin' bales of weed cause it grow on trees\nSix girls in my mouth like a set of Ds\nWith my West Boast Bloods bangin' burgundy\nRich bags under my eye, nigga Birkin Ds\nShe say, \"I want Victoria Secret\"\nAnd I fuck her long, watch her decrease\nEven though I'm a Blood, she like CC\nShe get mad whenever I bring her BB\nShoot, no 2-2-3, DVD\nWatch me shoot them folk way up the street\nLost a whole hundred bands, bands with the heat\nI'ma die for my clan, [?] me\nDiamonds red like a mothafucka cut me\nAnd I smoke rusty and dusty\n\n[Hook: Young Thug]\nWhat are you doin' in this game?\nI wanna know what are you doin' in this game?\nHey, baby girl what you doin' out here?\nWhat the fuck are you doin' out here?\nI know what you're doin' out here\nI know what you're doin' out here\nYou killin' these bitches, killin' these niggas\nCook a lot of white like Tommy Hilfiger\nBaby girl, I'll give you this [?] [?] nigga\n\n[Verse 2: Rich Homie Quan]\nRidin', nigga with [?] I ain't lookin' for the swoop, I need a bitch do that to me\nI want a bitch with some loot who gon' take care her kids\nI mean make sure her kids straight forever, you dig?\nI won't stop gettin' money forever, you dig?\nAnd I ain't talkin' 'bout a shovel, you dig?\nI just bought a new dog that'll eat up you pig\nI just bought a new car, a hunna, you dig?\nShhh, stop, a hundred ain't shit\nTwo boys wasn't much, a hundred on them\nCan't go broke, it may not come again\nBut a lot of money comin' in, you don't belong here so..\n\n[Hook: Young Thug]\nWhat are you doin' in this game?\nI wanna know what are you doin' in this game?\nHey, baby girl what you doin' out here?\nWhat the fuck are you doin' out here?\nI know what you're doin' out here\nI know what you're doin' out here\nYou killin' these bitches, killin' these niggas\nCook a lot of white like Tommy Hilfiger\nBaby girl, I'll give you this [?] [?] nigga\n\n[Verse 3: Young Thug]\nBaby watch out for the sharks, watch out for the cops\nWatch out for the thots\nThey just want a piece of you, like me\nBeat ‘em like Bruce Lee\nFacin' life and you're broke, here go my shoulder\nBoy you can cry on me\nNo, no tellin' but I told you\nYou can't ‘trol, control these streets\nIf a pussy nigga play\nI'm gonna gun him down like a G\nB you can't see me\nI'm ballin', you can't even D me", "title": "Brain Nichols", "year": null, "image": "https://images.genius.com/334dc3565e640f1df6f809a163903cad.1000x1000x1.jpg", "album": null}]}