{"songs": [{"image": "https://images.genius.com/e4f501fdfa584d29ce2e2706f76e3bf6.500x500x1.jpg", "title": "I Don’t Give a Fuck", "album": "For All Seasons", "year": "2000-09-19", "lyrics": "Chorus (Nature and Woman)\n\nW: I don't give a fuck about your Girlfriends\nN: I don't give a fuck about your Man boo\nW: I don't give a fuck about your friends\nN: and your friends ain't shit, and sometimes I can't understand you\nN: I don't even know why you page me\nW: I don't even know if I can trust you\nN: Yo, is you jumpin' it off?\nW: is you jumpin' it off?\nN: If not then keepin' movin' bitch, fuck you\n\nVerse 1:\nI got a whole 'lotta problems that I gotta resolve\nLike 4 in the mornin' I get anonymous calls\nThey let it ring once, they let it ring twice\nDamm, it rang twelve times, chickens ain't right\nCussin' like a sailor, fuckin' in trailors\nPhotoshoots, niggas did it and told me the head was much realer\nShouldn't have did it boo, you shouldn't have did it boo\nNow you forgettin' exactly how many niggas you did it too\nCut you off, shit's critical, gimme my space\nI admit, I was the one that made the silly mistakes\nThe Fifty state roamer\nHad to throw the fake on her\nHeavyweight, ringside seats in Nate's corner\nWait for her, it might take days\nBut back home's where the fight takes place\nPunches and scratches\nHeadlocks and hatchets\nScreamin' at the top of her lungs, this bitch is spazzin'\nComin' at ya, whats up with that shit?\n\nChorus\n\nVerse 2:\nHugs turn to kisses, kisses turn to intercourse\nEngagement, marriage, then divorce\nDevellish acts, sinnin' thoughts\nSecrets bein' spilled out, soon as it happens the pigeons talk\nI try to keep her close by, don't mind lettin' go\nLet her know who the fuck she wit'\nLike any Man unless he's whipped\nA messy script leads to domestic disputes\nAll your friends gettin' caught in our beef cause they thought it was\nCute\nDressin' in suits, I used to get you from work\nChecked your feelings, even flipped on you first\nStripped down your purse\nOne night I found your phonebook\nHidin' spots, look in all the places you thought I won't look\nNever said shit, but dead shit immediate\nRipped out the numbers that I needed to rip\nHeated quick, did what I had to do\nSat her down, she flipped it around, looked in my eyes and quickly\nCaught this attitude\n\nChorus\n\nVerse 3:\nSome nights you might talk in your sleep, pig Latin\nDrunk, the next mornin' actin' like I didn't happen\nShould I cheat? give me reasonable doubt\nIs the next Man trickin' on you? huh? is he eatin' you out?\nYou're poppin' up with mysterious gifts\nWhen I ask you just laugh, brushin' off the seriousness\nThere's nothin' worse than a curious bitch\nWith some nosey friends\nSix deep in a old BM\nPushin' it to the limit\nRipped up seats with cushion in it\nChange on the rug\nShe give brains to all the thugs\nWhile she drives, somethin' called dangerous love\nGot a airbag on both sides, no lie\nDoin' shit the average hoes don't try\nWanna know why I'll never leave you?\nYou're intelligent, young, and evil\nThe definition of a real bitch, some'll G you\nCome and see you like \"Next!\"\nRight after their ex\n\nChorus 'till fade"}], "artist": "Nature"}