{"artist": "Wiz Khalifa", "songs": [{"year": null, "lyrics": "Wiz Khalifa:\nA nice round of applause\nLadies and gentleman, I'd like to shout out Taylor Gang\nAnd shout out my car keys, haha it's big business bitch\nChevy Woods:\nI'm just chilling, loking, sipping, smoking\nLike a G Should\nOn my fly oldschool shit.. Clint Eastwood\nTell a friend, bring a friend.. its a Cookout\nWe gon' drink, we gon' smoke we gon' turn this bitch out\nChevy Woods:\nRoll another doubie\nOnly papers baby fill it with that oh-wee\nLet a G roll the OG then roll one for OG\nYeah that's the homie\nZig zags baby no leaf\nActing like you know the Wizzle man, that's my homie\nIf thats gin nigga, pour me\nSippin' slow she go down slow like a slow leak\nCop the car from the dealer\nPulled off thumbs up to the homie mac miller\nKing kong young gorillia, my cup overfloweth, i'm a rhyme spiller\nAll day Mr. Count It Up, I lost count I don't ever think its enough\nI get it 100 after 100 so everything you did with that money I done done it. Gone\nChevy Woods:\nI'm just chilling, loking, sipping, smoking\nLike a G Should\nOn my fly oldschool shit.. Clint Eastwood\nTell a friend, bring a friend.. its a Cookout\nWe gon' drink, we gon' smoke we gon' turn this bitch out\nChevy Woods:\nDrop top.. leather seats\nTape deck playing, she a freak\nIt ain't about money, it ain't my language\nDon't know my name in memory of Rick James Bitch\nYou know that I'm a Taylor Dog\nSo to the cops Cartoon George \"which way'd he go?\"\nShit, nigga I done blew 80 O's, then 80s O's, then 80 Mo\nIn my lifetime, No Jay Z\nJust Oz's, roll something.. smoke weed\nDrink liquor, double cups\nNo lean in it.. fuck is up?\nI tell her \"bitch I be airborne\"\nThen in a minute in my lap where her hair goin'\nShe Keep it G, she love a nigga\nI tell her chill, I'm fucking witcha\nChevy Woods:\nI'm just chilling, loking, sipping, smoking\nLike a G Should\nOn my fly oldschool shit.. Clint Eastwood\nTell a friend, bring a friend.. its a Cookout\nWe gon' drink, we gon' smoke.. we gon turn this bitch out\nI'mma roll one up, and you should\nWe gon' smoke old school joints, clint eastwood\nI'mma roll one up, and you should\nWe gon' smoke old school joints, clint eastwood\nWiz Khalifa:\nJust parked the time machine bitch\nYou can write a movie off the shit I done seen\nRolling them Khalifa papers up with all kinds of green\nSmoking when I'm rapping niggas don't get no time between\nYeah I came up in the game, it took time you see\nI'll show you how to get your money up and get high as me\nTalked to my Dad the other day said he proud of me\nMy girl says she found 30 racks when she found my jeans\nI told her blow it, like her nose was running\nWhat you hating me for fam get some hoes or something\nNiggas know me for twisting a whole key\nFuck around I might charge you a O or something\nI'm a let you hold it and you owe us nothing\nIts the shit I be smoking so be carefull how you roll it when you cuffin\nGot a projecter in the crib like nino\nNiggas ain't gotta talk about it, we know\nTaylor Gang we are heros. Motherf**ker\nChevy Woods:\nI'm just chilling, loking, sipping, smoking\nLike a G Should\nOn my fly oldschool shit.. Clint Eastwood\nTell a friend, bring a friend.. its a Cookout\nWe gon' drink, we gon' smoke.. we gon turn this bitch out\nI'm gon roll one up, and you should\nWe gon' smoke old school joints, clint eastwood\nI'm gon roll one up, and you should\nWe gon' smoke old school joints, clint eastwood", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg", "album": null, "title": "Cookout"}]}