{"songs": [{"album": null, "year": null, "title": "Autism Speaks Apology Letter", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "Recently there’s been a trend that includes rappers saying something offensive, only to be attacked for it in the media and pressured to apologize. I have to be completely honest and say there’s a part of me that resents that. I view rap similar to how I view comedy. It’s going to ruffle feathers at times. It’s going to go “too far”. I do not believe that an apology is needed every time someone is offended, especially when that apology is really only for the sake of saving an endorsement or cleaning up bad press.\n\nWith that said, this is not the case today. This letter is sincere.\nThis apology IS necessary.\n\nIn a recent verse on the song “Jodeci Freestyle”, I said something\nhighly offensive to people with Autism. Last week, when I first saw a comment from someone outraged about the lyric, I realized right away that what I said was wrong. I was instantly embarrassed that I would be ignorant enough say something so hurtful. What makes the crime worse is that I should have known better.\n\nTo the entire Autism community who expressed outrage, I’m moved and inspired by your passion, and I’m amazed at how strong you are as a unit. I have now read stories online from parents about their struggles and triumphs with raising an Autistic child and I admire how incredibly strong you have to be to do so. It’s touching. It also makes what I said even more embarrassing for me. I feel real shame. You have every right to be angry.\n\nTo anyone suffering from Autism, either mildly or severely, I am sorry. I’m bound to make mistakes in my life, but in my heart I just want to spread Love.\n\nI want to educate myself more on Autism, and I’ll gladly own my mistake and serve as an example to today’s generation that there’s nothing cool about mean-spirited comments about someone with Autism. People with this disorder and their loved ones have to go through so much already, the last thing they need is to hear something as ignorant as what I said. I understand.\n\nTo the parents who are fighting through the frustrations that must\ncome with raising a child with severe autism, finding strength and\npatience that they never knew they had; to the college student with Asperger’s Syndrome; to all those overcoming Autism. You deserve medals, not disrespect. I hope you accept my sincere apology.\n\nMuch Love\n\n-Cole"}], "artist": "J. Cole"}