{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/2decfd21500fdb5a5da95f4bba1d1e86.300x300x1.jpg", "title": "Gun Ho City", "year": "2008-01-29", "album": "The Veteran", "lyrics": "[First Verse: Kool G. Rap]\nI'm biggest lifetime  combat\nWhen there's beef with a dog cat\nYou rhyme with your peoples\nYou get put up in they contract\nTwo steps back rat a tat from the arm strat\nWhether it be [?] face severs like a wombat\nNYPD\nBe careful where you place your palm at\nWho's to follow up a tongue like Dialo\nBody donated to science, lungs in a bottle\nPlayin', you lay flat as bums on a model\nNo drive by connect your ear drum to the nozzle\nIt's gunplay all day, I fiddle with clips\nSpray shot in the middle with clicks\nGet your brains popped to Kibbles and Bits\nHalfway shots are riddle the risk\nAin't no way pop griddle with this\nDon't call it New York this is Gun Ho City!\nLeave your fuckin' head puffed up like Done Ho Diddy\nShit back on your stomach like a fat Ho's titties\nEverything around me ugly, it ain't no pretty!\nDon't cause the green if the slain thrown is iffy\nCock back the thing drop the frame in a jiffy\nNigga titsy hoes in your bladder screen\nUp the risky\nFuck a fort, nigga turn up the flames til it's crispy\nThe flames on the side of your rings\nLike rips in a [?]\nSeparate a nigga head from the frame like a mystic\n\n[Hook: Kool G. Rap]\nDon't call it New York, this is Gun Ho City!\n(Laugh that sounds like Vincent Price)\nDon't call it New York, this is Gun Ho City!\nDon't call it New York, this is Gun Ho City!\n\n[Second Verse: Canibus]\nI walk in the room in the Dr. Doom costume\nI consume, the plot resumes\nTrust me you're the abductee\nMy trigger finger touchy\nTry me, see if you lucky\nBlam slam desplam motherfuckin' mayhem\nStupid you can't contain him cause you trained him\nLove the bad weather, freckle faced lepers\nCan't go outside, gotta stay together\nLive's members don't attempt to announce my name\nThe brown sage one year away from my crown age\nCount the ways my sound waves been downplayed\nUSA underground made, I live without fame\nHard labor for the data reincarnator\nRip your carborator out your car and chase ya, I hate cha\nI'm the Gun Ho city mayor\nWho's in charge out here? Who's the fuckface, huh?\nBang on you, done slang on you, Cani get on you\nWatch who you talk to, my manager warned you\nViolatin,' the rhyme weak you libate\nPut you behind the gate with the five-eight primate\nI improvise, explode, synthesize flows\nLike your favorite MC with the wide nose\nGrehan shell is a PSB hand held\nIn real time speed I could read fan mail\nRip the pound, blitz the town with a two or three round\nYou'll never want that to go down\nSpin around and shoot at you\n180 degree cupola , attacks to my van on Utica\nNext stop Gun Ho city, nigga shoot em up\nSee rapper Canibus PLOO 'em up"}]}