{"artist": "G Herbo", "songs": [{"title": "Koolin", "album": "Welcome To FazoLand", "year": "2014-02-11", "image": "https://images.genius.com/4af4495189941f1b86086adb14c093ca.300x300x1.jpg", "lyrics": "[Intro]\nI'm just koolin til my tape drop\nWelcome to Fazoland the mixtape\nLet's get it\nGANGGGG!!\n\n[Verse 1]\n10 birds in the Louie bag\nWrapped up in the glad top\nHop straight in the Audi, 9 tucked in the stash box\nGot thousands everywhere\nThere's money piling everywhere\nWhy the cops hot on our block?\nMan, there's violence everywhere\nBoy don't try us, why you think you hear them sirens in the air?\nHollows flying, mommas cryin\nThere's homies sighin' over there\nWe start rollin thru them blocks\nWhips stolen, shooting Glocks\nMan down, blew his top, then walk around like \"who was shot?\"\nAnd we not talkin to the cops, so we don't know what's true or not\nAnd bitch I cop so many fits to rock, don't know whats new or not\nIt's Lil Herbie I got lots of swag\nTrue religion all that\nWent to town workin lots of jabs\nTrue religion skull cap\nTalkin shit then get ya skull cracked\nBeat that nigga wit a ball bat\nPussy niggas I ain't dealin wit em'\nLet the 50 hit em' to resolve that\nWater whip so hard\nI spend 10 grand tomorrow\nI promise ima make it all back\nIma ball so hard, don't got no competition\nCity know that ima dog now\nAnd my money long, just imagine all the niggas tryna call my phone now\nWhen I was on the block, you ain't really think that I could do it on my own NAH\nNow im on the road, smokin doin shows, you think you could come along? NAH\nBut nah you ain't real\nNigga you ain't really real\nAnd if you was in a jam and you had to give up info, you'll tell\nDon't walk up on me, what's the deal?\nMally paranoid let the semi spill\n\nCRAHHHH!!!\n\n[Hook]\nIm koolin(2x)\nKoolin(2x)\nIn this hellhole\nIm koolin(2x)\nKoolin(2x)\nIn this hellhole\n\n[Verse 2]\nYou niggas foolish, im just coolin and yall still losin\nI see you tryna steal my shit, but yall can still use it\nAnd I ain't trippin bout that bitch, man she's still useless\nNah, I ain't tryna save that ho, but you can still do it\nIm bout my paper, im just chasin\nRemy keep the chaser\nHe said im broke, yeah he's a hater, he must be mistaken\nPull up in all types of whips\nThey all excite ya bitch\nOn Instagram yall like to kick\nShe always bite the dick\nGot no time for relationships\nCatch me on flights n' shit\nOr im in the 9 in the nicest whips\nRunnin thru lights n' shit\nTold myself if this shit take off then I just might get rich\nCan't forget bout that hellhole, I spent my life in it\n\n[Hook]"}]}