{"artist": "Zebra Katz", "songs": [{"year": null, "album": "Tear the House Up", "title": "Tear The House Up", "image": "https://images.genius.com/350973a760d40c0fdbdc1e9424f09480.500x500x1.jpg", "lyrics": "I'm gonna tear this house up (4x)\n\n(Chorus)\nI'mma tear the house up and get down on this beat\nTear the house and get down on this beat\nI'mma tear the house up and get down on this beat down on this beat, down on this beat\nI'mma tear the house up and get down on this beat\nTear the house and get down on this beat\nI'mma tear the house up and get down on this beat down on this beat, down on this beat\n\n(Verse 1)\nYo let's go way way back to the basics\nDamn motherfuckers really just can't take it\nSippin all around they wanna bite wanna taste it\nI'm that cat yeah I'm the black cat\nI'm that bitch that does it like that\nYou don't got to say it cuz the cat got ya tongue\nI ain't gotta say it cuz bitch i get it done\n\nTell me what you did what what chu done done\nWhat you ain't know it? Muthafucka i'm the one\nWhat you ain't know it? Muthafucka i'm the one\nNaw none these bitches in the back want some\nI'm the new young darkling with a dirty city kitty\nBad to the bone school fish looking pretty with it\nNope nope, the girl can't cope\nYes bitch i know you dope\nBrr like a polar bear pussy ice cold\n\n(Chorus)\nI'mma tear the house up and get down on this beat\nTear the house and get down on this beat\nI'mma tear the house up and get down on this beat down on this beat, down on this beat\n\n(Verse 2)\nTear the house and get down in this bitch\nWhen i'm up in your city burn a pound of good shit\nPop champagne cuz i'm getting hella pissed\nMy big black so please sit back i'm gonna eat\nPut it on your plate, hungry bitch? eat\nDon't feed these pigeons cuz they shit where they eat\nI'm the underling king of the dark world thing\nI'm the darkling thing of the dance floor thing\n\nCome wanna play with the kitten from the street\nBang bang with the kitten put the stripper on the beat\nKnown to rock the mic you know I could never not leave it red hot\nOh no now they're begging me to tear it up\nOh no now they're begging me to tear it up\nOh no now they're begging me to tear it up\nOh no now they're begging me to tear it up\nNow they're begging me to tear it up\n\n(Chorus)\nI'mma tear the house up and get down on this beat\nTear the house and get down on this beat\nI'mma tear the house up and get down on this beat down on this beat, down on this beat\n\nLet's go way way back to the basics\nDamn motherfuckers really just can't take it\nSippin all around they wanna bite wanna taste it\nI'm that cat yeah I'm the black cat\nYeah I'm that bitch that does it like that\nYou don't have to say it cuz the cat got ya tongue\nI ain't gotta say it cuz bitch i get it done\n\nTell me what you did what what chu done done\nWhat you ain’t know it? Muthafucka i’m the one\nWhat you ain’t know it? Muthafucka i’m the one\nNow known to rock the mic you know I could never leave it red n' hot\nOh no now they’re begging me to tear it up\nOh no now they’re begging me to tear it up\nOh no now they’re begging me to tear it up (up, up, oh)\nNow they’re begging me to tear it up"}]}