{"artist": "Andy Mineo", "songs": [{"title": "Reflections rough w_horns & break.mp3", "album": "Work in Progress", "year": "2016-09-18", "image": "https://images.genius.com/4fa9eaa4fd9645485a3d2928421edda8.1000x1000x1.jpg", "lyrics": "[Verse]\nI'm probably the king of overthinkin'\nAvoidin' pitfalls, but it's always opportunities I'm missin'\nMan, I'm scared to make a bad decision\n'Cause you live with 'em\nThey eat your food, then leave you with the dishes\nMan, we quick to talk, we ain't fast to listen\nJesus walked, but He sat with sinners\nSo if you lost, ask for a visit\nWe bring our need and then He bring forgiveness\nTo give yourself away, that's the highest form of livin'\nListen, the other day, I ran into a fan\nGettin' a sonogram at the hospital, I visit\nThem tears were running down her face, she said, \"I made a difference\"\nFound my music when she was battlin' with addiction\nWell, she ain't even religious, but what I said in some interviews had really got her thinkin'\nThat's when she introduced me to her husband\nNow they first child comin', 'bout to start a family\nMan, that's iller than a Grammy\nThose are my trophies, when people in pain quote me\nI live my life on purpose, you wouldn't believe the old me\nI made a lil' money, now it's like they all know me\nThey got they hands out, they doin' the hokey pokey\nI got a few fans who no longer support me\n'Cause a quiet un-woke white folk is what I won't be\nPeople killed like animals on video, they stay quiet\nAnimals killed on video, they start a riot\nMust I remind you? Jesus was a dark-skinned man publicly murdered\nHe ain't never deserve it\nThe Pharisees sat by and watched while He hurtin'\nThat's why I see the Savior when I look at Mr. Sterling\nMake America Great Again, I'm like, \"Which version?\"\nWe talkin' pre-slavery or post?\nWe talkin' 'bout before or after women could vote?\nWe talkin' about this land, before or after we stole it?\nThis isn't anti-patriotic\nI'm just tellin' the truth\nY'all wanna change the topic\nMan, stop it\nIt's clear that we still got a problem\nBut until we admit our past, there's no way the future could have progress\nUh, and I'm just cleanin' out my closet\nGettin' rid of everything that's toxic\nMy train of thought; thanks for takin' a ride\nWhere do we go next? Well, let's keep it a surprise\nLike, uh\n\n[Outro]\nAndy Mineo, where are you?"}]}