{"artist": "50 Cent", "songs": [{"album": "After Curtis", "image": "https://images.genius.com/0c708b9a3a4a8fcdb64a78bed91678b8.500x486x1.jpg", "title": "I Get Money (Forbes 1, 2, 3 Remix)", "lyrics": "[Intro]\nThe Giants play in New York, Forbes, 1, 2, 3\n\n[Chorus]\nI get money, money I got (I get it)\nMoney-money I got, money-money I got (I run New York)\n\n[Interlude: Diddy]\nYou know what it is, aww man\nIt's the billion dollar remix, baby, for reala\n\n[Verse 1: 50 Cent]\nCome on man, I'm hot now, drop now, top down I got style\nBeen around the block pal imagine what I got now\nThe Bentley the Ferrari, maybe the Bugatti\nRange and Maserati, I got 'em all, goddamn\nMy money, my-my-my money, long\nI blackout and break a bat on your ass like Barry Bonds\nI get it, I'm down for the jooks now what's up\nI'm with it, I told you I was gon' cake up\nI did it, niggas tryna show me how to ball\nMan, they tryna buy some Gucci, I'm tryna buy the mall\nI ain't came to get a little bit I'm tryna get it all\nMy new bitch a cool bitch I'm fitting to make her spoiled\nIf my watch is right, my stocks is right\nBut don't be shocked tonight, if you get shot tonight\nStill gutter like a mothafucka, chipped up\nDon't be surprised when I grip up, you slip up you could get it\n\n[Chorus]\nI get money, money I got (I get it)\nMoney-money I got, money-money I got (I run New York)\n\n[Interlude: Diddy]\nA lotta money on this record man, I like being around money man\nIt's three the hard way baby, you know my mothafuckin' name\n\n[Verse 2: Diddy]\nBo knows but Diddy did it\nCars, jewelry and big homes, yeah, Diddy did it\nShootouts, coastal beefs, yeah, Diddy did it\nBut my lawyer's so good that Diddy got aquitted\nI met J. Lopez out in St. Tropez\nWhile you was riding around in Miami on mopeds\nOh, you just got here\nI been doin this shit for over ten years\nI am chilling, in Sean John denim\nNigga I don't walk nowhere I'm four wheeling\nChampagne spilling, chilling, no ceiling\nStealing a quarter million, feeling, ice grilling\nHit the avenue, earthquake up the morgue\nGive Jacob a call then make a withdrawal\nFace on the Forbes in '94 I did it\nDon't like it I'm a Bad Boy now let's get it come on!\n\n[Chorus]\nI get money, money I got (I get it)\nMoney-money I got, money-money I got (I run New York)\n\n[Bridge: 50 Cent]\nI get the pounds, the pesos, the yen\nI celebrate and I'm fresh out the pen\nI'm a hustler, I'm back at it again\nI'm bad and I don't play pretend, fuck with 'em, Jay\n\n[Verse 3: Jay-Z]\nI'm a hustler baby, can't escape my past\nWhen I flipped Rocawear, I told 'em: 'Give me mine in cash'\nYeah, checks might bounce\nAlphabet boys might check my accounts\nStill hustling baby, hurry up, kill me\nI'm already the GOAT, next stop is the billi\nYoung turbo, six speed 9/11\nI'm revving I'm trying not to spill my merlot\nWhen my girl go on world tour\nLadies I'm back on the street like I'm out on a furlough\nI'm back clubbing, Ace of Spades bubblin'\nDrink it from the bottle, who the fuck need a bucket?\nI'm killing the block, multiple whips\nSo I'm killing the roof, like Michael Vick\nYeah! Just call me Forbes.com\nIn case y'all forget New York is still mine, I get it\n\n[Chorus]\nI get money, money I got (I get it)\nMoney-money I got, money-money I got (I run New York)\n\n[Outro: Jay-Z]\nYou talking my language now baby\nI wouldn't wanna be outside the borough on this one", "year": "2007-10-04"}]}