{"songs": [{"year": "2019-07-02", "album": null, "image": "https://images.genius.com/e219b806297124424afdd5e22bb9c77b.500x500x1.jpg", "title": "LOVE SONG", "lyrics": "[Intro: Keith Ape]\nYeah, yeah\nYeah, ayy\nYeah, okay, yeah\nYeah, yeah, yeah\n\n[Chorus: Keith Ape]\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don’t wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\n\n[Bridge: Keith Ape]\nI just gotta ball, ayy, I just gotta ball, ayy (Ball, ball)\nI just gotta ball, ayy, I just gotta ball, ayy\nI just gotta ball, ayy, I just gotta ball, ayy (Yeah, yeah)\nI just gotta ball, ayy, I just gotta ball, ayy (Yeah, yuh)\n\n[Verse 1: Keith Ape]\nGo like [?] stackin’ through the ceiling and I sip lean, lean, lean\nGot me tweakin', 마셨어 so dirty, [?]\n도려내 내머리 그래도 난 벌어 i milli i milli\n[?]\n[?]\n난 너가 갖지 못하는 것만 전부 다 골랐지\nYou want an ice cream? 신발 위 녹아내려, dripping on my feet\n내겐 소스가 넘쳐흘러\n[?]\n내 보석은 너무 깨끗하지 가그린 ayy (Yuh)\nYuh, yuh, ayy, yuh ([?])\nSwitchblade [?]\n[?] (Ayy, yuh, yuh, yuh)\n\n[Chorus: Keith Ape]\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\n\n[Bridge: Keith Ape & Afourteen]\nI just gotta ball, ayy, I just gotta ball, ayy (Ball, ball)\nI just gotta ball, ayy, I just gotta ball, ayy (Yuh, yuh)\nI just gotta ball, ayy, I just gotta ball, ayy (Bitch)\nI just gotta ball, ayy, I just gotta ball, ayy\n\n[Verse 2: Afourteen]\nI just wanna ball, got my Spiders on the wall, like, fuck 'em all\nStart a brawl, swing my wrists, blow up a mall\nLike, let me crawl\nWhere he go? Run down on 'em, break his nose\nI whip a ho, crack his back, Wendi’ said the head is whack\nWhen she wet the bed I yack\nWhy in the fuck is your entire vagina out?\nRun down get slumped\nAnd put you back ’cause you dirty mouthed\nRun around the town, put a bomb on every car down\nSittin' like a lard, why you actin’ like a tard now?\nThrow it back up, we actin' up in the yard, how?\nHangin' on the wall like a spider, boy\nBRUHMANE killed God with his nasty boy\nTalkin' to the wall, hearin’ acid noise\nI rap like a runt and your bitch, she get punched in the cunt\nAnd I'm playin' some golf wit' yo' head like its put, one-two\nI pass Darkie the blunt and he screams at you, yeah! (Yeah!)\n\n[Verse 3: Lil Darkie]\nMarijuana make me wanna run up on a nigga like, \"Take this hit\"\nNo gun up on a nigga, just Backwood stick\nI fuck a nun, and bust a nut up on her lip\nI tuck a gun inside the furniture, no clip\nPut that under my pillow case a nigga wan slip\nThat lady, she wanna marry\nI cannot give that lil shawty a baby\nNone of these pussy ass niggas will fade me\nGripping an AK, hitting yo' vehicle, make 'em say, \"Mayday\"\nGive a fuck about you, they all wanna doubt you\nNiggas will do anything bringing in that clout, dude\nNiggas wanna know, I do it like a \"How to?\"\nBigger man I bit off a bullet and spit\nRounds to a nigga and I pick his fate\nNo clowns in my circle you a square, that's fake\nWhole pounds of the purple in my lair, no shake\nRide down where they rolling up and wear that Bape\nI lurk in the shadow and I wait, I wait\nMy body it carrying my weight, my weight\nMight bathe in the pussy like I'm ape, real ape\nIf shawty ask for it, it not rape, not rape\nShe be seated on my cedar, like she Peter Pumpkin eater\nI can meet her, I don't need her to love me for me to feed her\nI lead her into my lair and spray her inside the hair\nWith something to make a infant\nShe lick it off of her lips with no spittin'\n\n[Chorus: Keith Ape & Lil Darkie]\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\nI just wanna fuck, bust my nuts, I don't wanna love\n\n[Outro: Lil Darkie & Keith Ape]\nI just wanna ball\nI just gotta ball, okay\nI just wanna ball\nI just wanna ball, aye\nI just wanna ball\nI just wanna ball, okay\nI just wanna ball\nI just wanna ball, aye\nHAHAHAHAHA\nSpider Gang shit!\nSpider Gang!\nUnderwater, underwater"}], "artist": "Keith Ape"}