{"artist": "Andre Nickatina", "songs": [{"title": "Killa Whale", "album": "I Hate You With a Passion", "year": "1995-04-19", "image": "https://images.genius.com/caf6d8331e5ef8bd79cb75fa64fb6144.1000x1000x1.jpg", "lyrics": "(Whale calls)\n\n(Dre Dog talking)\n\nHehehehe...\nOooh...\nThis shit is on beat....\nHehehehe...\nMan...\nDrop that shit boy...\nHehehehehe...\nFillmoe....\nHehehehe...\nDid somebody say umm...Fillmoe?\nMista Jim Jones could ya...please drop a verse?\n\n(Dre Dog)\nNigga it's the J to the I to the M to the J-O-N-E-S\nNigga in the flesh\nChewy boy, doobie with the buddha cess\nI'm like the Lion King cause everything I see is mine\nAnd Tommy Tuckers man I'm stoppin' fuckas like a sign\nSo read my mind, the situation's critical\nAnd off that chewy man shit can get like winter cold\nYou think you know me? Well test your luck and try me out\nAnd watch me treat you like a cow in a slaughterhouse\nThat cutty chrome, that microphone\nThat new Jim Jones, that indo zone\nThat watch that value on your dome\nI'm putting beary fairy niggas in a state of shock (shock!)\nAnd I'm a killa whale but nigga check my pimp walk\nSo bust that, crush that, crush that\n\nCuh-crack crack!\nThat's how that nigga's neck snap\nI'm heartless like that wolverine\nDeadly like that Octagon\nFillmoe to the fuckin heart\nCrooked like the Pentagon\nRecka! Niggas get jumped like checkers\nSo what's the use if fuckin Salt if I can't fuck with Pepper\nSo check my rep, survival tech, and hit man killa tactics\nNiggas get buried faced down in silver plastic\nMothafucka, niggas get split like a wishbone\nDank or dope, bank or cope, Nigga Mista Jim Jones\nThe fat rat dominator, microphone terminator\nQuick to break the neck of an E-40 imitator\nNigga don't front, you know I got you open\nWith more Raider in me than they ever had in Oakland\nTo all you mothafuckas that juss can't tell\nI'm a Pisces but I'd rather be a killa whale\nPLOT!\n\nTo all you mothafuckas that juss can't tell\nI'm a Pisces but I'd rather be a killa whale\n\nTo all you mothafuckas that juss can't tell\nI'm a Pisces but I'd rather be a killa whale\n\nTo all you mothafuckas that juss can't tell\nI'm a Pisces but I'd rather be a killa whale\n\nTo all you mothafuckas that juss can't tell\nAnd I'm a Pisces but I'd rather be a killa whale\n\n(Dre Dog)\nNigga check my Ike Turner way of doin things\nNot out for peace, Dre Dog is out to ruin things\nThe most hated mothafuck in the Frisco park\nAnd Tommy Tuckers that talk foo I watch like a hawk\nSo strike a pose like a deer when you see me bitch\nAnd like a hound on a fox fool I'm on your scent\nYou fuckin skunk\nSome sugar and some chocolate thai skunk (what?)\nThese niggas step up and get hung like a duck\nCause I'm the dirty worm hunter\nThe caterpillar killer\nAttitude juss like a ruthless Cuban coke dealer\nIn Miami, nothin but the money and the power\nA deadly mix at 6 foot 6 I'm sorta like a tower\nOr a tanker, a mothafuckin Iraq tanker\nNigga raise up and get (dropped!) dropped (dropped!) like an anchor\nThe Guardian Angels lookin straight to rip right on the spot\nCause all you are are voluntary unpaid rent a cops\nAnd I'm a factor, better yet a motherfuckin force\nNow I gotta shoot you like a broke legged horse\nIn pain, nigga break me off beneficial\nMothafuckas praise Nino Brown and Felix Mitchell\nBig bread, too mothafuckin smart for the feds\nThese niggas try to raise up (what you say?) but I heard (what I said)\nWhat\nYou said\nI'm like woof, I know foo but you don't have a clue\n(Fuck you!) Nigga fuck me? NO NIGGA FUCK YOU!\nFuck them mothafuckas I don't duck them mothafuckas\nI say fuck them mothafuckas I don't trust them mothafuckas\nSo without a doubt I'll turn it out I ain't got no time to clown\nMy first words are to the point-nigga lay it down\nSo rock me up cause I'm dope and triple beam to scale\n3/11 is my birth but nigga I'm a killa whale\nCAUGHT!\n\nTo all you mothafuckas that juss can't tell\nI'm a Pisces but I'd rather be a killa whale\n\nTo all you mothafuckas that juss can't tell\nI'm a Pisces but I'd rather be a killa whale\n\nTo all you mothafuckas that juss can't tell\nI'm a Pisces but I'd rather be a killa whale\n\nTo all you mothafuckas that juss can't tell\nI'm a Pisces mothafucka"}]}