{"artist": "Inspectah Deck", "songs": [{"title": "Game Don’t Change", "lyrics": "[Verse 1]\nThe nigga that all of the talk 'bout\nPlates on the table, got knives and forks out\nNines and four-pounds clappin' like proud parents\nS.I., red-eyes off the loud package\nCorner G, born a G, talk so raw\nYou couldn't nod harder off a D-Boy\nMagneto pull\nBrother stay, custom made\nTwelve hundred spokes on a vehicle\nCity slick, sip liquor with a 50's kick\nI keep a grip, pretty bitch, and a sticky spliff\nFrom a place called try and test\nWe're them shooters, they let it fly quicker than step\nIt's the come-up, \"Yo, whaddup boss, where the work at?\"\nTen G's a day on a pole, shorty, twerk that\nYeah, that's get it how you live it\nWhile niggas get mad tryna figure how you did it\nTwenty-four seven, three-sixty-five, mind on the money\nFriday night, eyes on the honey\nRebel lean on 'em, no prometh\nSaturday, fuck around, blow the whole check\n\n[Chorus]\nChase paper, see what the streets make of you\nThe victor or the vic just to name a few\nIf these walls could talk, they'd tell you what the neighbors knew\nThe game don't change, the players do\n\n[Verse 2]\nI spent countless hours countin' thousands a hour\nAt the stove with the Pyrex, mountains of powder\nHow I hooked 'em with the blue chops\nWildlife, rumble with a few cops\nCheckin' out the view from the rooftops\nStarin' at the Verrazano, thinkin' that there's gotta be more\n'Cause these four corners is all that I know\nI'm a monster, feed my hunger\nNeo with the red pill, all I see is numbers\nIt's like a jungle sometimes make me wonder how a nigga ain't catch a body or go six feet under\nGovernment informant, secret indictments\nSeen a nigga leave with the judge when he was sentenced\nResident patient, basic, it's that gritty\nGot a one-way ticket down to Rack City\nCareful though, they layin' cats flat, back to back\nThe Feds snap your chat, no app, fact\nV.V.S. chrome spin, your domes spill\nNew enemies, used to be old friends\nYeah, that's how it go when your power grow\nThey wanna put out your fuse when you 'bout to blow\n\n[Chorus]\nChase paper, see what the streets make of you\nThe victor or the vic just to name a few\nIf these walls could talk, they'd tell you what the neighbors knew\nThe game don't change, the players do", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-10"}]}