{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind (The Prequel)", "title": "High Rollers", "image": "https://images.genius.com/15c3a4148e8368b49f9e0527134125d7.500x500x1.jpg", "lyrics": "[Intro: DJ Drama & Pharrell]\nOkay this today's lecture\nOn how it should be done\nYessir\nWhy I keep having to school y'all niggas?\n\n[Verse 1]\nYo\nBehind the door there was gat-man\nWho was also known for robbin'\nAquaman cooked the coke and kept the Superman saucy\nA dirty nigga that wasn't known for washin'\n[?] didn't care what it cost him\nEventually the nigga started cookin'\nCreation nothing but the reverse of 12-B\nThe tumultuous life of Skateboard P\nI hang with white people but you don't know me\nI seen, niggas run down stood over and gunned down\nOne shot up in his arm, then he spun 'round\nNow how does in front of his son sound?\nAnd get his dog it was just one round\nFor the ready rock they smoke that shit on cans\nI was rockin' flattops and rockin' slip-on Vans\nScreamin' \"Killa dude!\", and rolling my pants up\nAs the ghetto bitches mixed the neighbourhood dances up\nBut this wasn't a soft place\nFriendship villages threw the smile off ya face\nTrainin' em young, they were schoolin' 'em mane\nFifteen killer niggas face cool as a fan\nTold them \"The right bullet hole will free one's soul\nLet you control the block and get a ve-hicle\"\nSo I, started pacin' the X of my situation\nThen I became the bases of, see style's translation\nSure I'm on that brothership but I started thinking color-less\nLike my favorite watch but I had to get the other wrist\nReporters like \"Yo, so what you done good?\"\nFall back bitch, I brought computers to the hood\n\n[Hook]\nWhether you ride or you above the law\nMake money money make money money money\nDon't even try if you afraid to fall\nNigga make money money make money money money\nKeep your mommies that'll ride with the dice taped with the raw\nMake money money make money money money\nAsk police state-fly keep your gangstas on call\nSo we make money money make money money money\n\n[Verse 2]\nI got\nModel bitches to drive me on sixes\nCondos in Paris with million-dollar pictures\nSmoke like a sailor, drink tushy two-up\nSuckin' my dick because she love the way I grew up\nHuh? You talkin' to me?\nYou gon' do what? Yes he's got the gat and he can pull two-up\nThem shits is mind-blowing\nWhere he grew up they wear rags with they eyes showin'\nFour in the morning you hear the nines blowin'\nArmour all on they cars to keep the shine goin'\nWe order cars with special features\nThe two-tone rose the bitch got alopecia\nWho got vitiligo, intended color cycle\nWhite and tan and brown, call it Michael\nI just might go down to the beach\nAbsorb the heat pick up a couple freaks\nEyes lead them between my sheets\nThen eyes lead them right beneath\nDownstairs right in the lobby\nI'm not being cocky\nBut snugglin' is  not me\n\n[Hook]\n\n[Verse 3]\nKilos, C-notes, speedboats pe coastal\nSee low we smoke chocha tre ochos\nThat's what eighty-five percent of niggas envision\nWhile the real ten percent get caught and go to prison\nThe other five percent them niggas end up missing\nProbably on the coastal bellies deep sea fishing\nBlowin' perfect rings out the Cuban cigar\nTheir daughters turn 16 get 'em Italian cars\nThe world is yours fuck it how 'bout Mars?\nI know your mother told ya' \"Aim for the stars\"\nLet's get right nigga cut short the laugh and\nGet in touch with high B with the half hand\nThe dope is opium comes from Afghan\nSo let's make millions and blow up like a gas can\nYou wanna shine don't you? Like the rocks glisten\nBut you ain't tryna listen, you on a fuckin' mission\n\n[Hook]", "year": "2006-04-04"}]}