{"artist": "Fashawn", "songs": [{"year": null, "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Verse 1: Fashawn]\nEmerged from the bottom, made my way through the gravel\nTurn me 'to a survivor, I ain’t want to, I had to\nNow I’m shining my nigga, in the mist of the scramble\nShooting cee-lo and craps, every day is a gamble\nGood lord never gave me nothing I couldn’t handle\nI hustle without a menu til they blow out my candle\nDiamond in the rough, y'all niggas gem stones\nI pen poems to the point I had to switch homes\nNew location, no vacations\nSitting comfy on the money, down with paper chasing\nSecond to none, and nothing’s adjacent\nCould probably see it from space we did it up in Vegas\nPicture me rolling, in a pair of penny loafers\nEuropean chauffeur, I’m 'laxed like shit is kosher\nUh, that’s how it ought to be, no! That’s how it gotta be\nVVS quality living with no apology, nigga!\n\n[Hook: K-Young]\nDiamonds and girls, I hustle hard\nFor these diamonds and girls!\nAnd now I’m in the spotlight\nI live for diamonds and girls\nTrunk full of hundreds, speakers on blast\n[?]\nYou don’t want no problems, problems\nI’m trying to get more diamonds and girls\n\n[Verse 2: Fashawn]\nI’m like an invisible set, in other words, what I mean\nI just can’t be seen, I just gleamed\nPeople stare at me, as if is rare to see a jewel with such clarity\nApparently I revel in the\nFact that y'all can't get on my level\nI belong in the bezel, I’m specialist at 38\nWords to that grizzly city murder rate\nAnd all the real niggas serve away\nPrincess cuts for the king of the city, totin' a semi\nPull strings like Jimmy, accumulated plenty of glow\nPlenty of dough, more champagne and Henny to pour\nRemember when he was poor\nNow it ain’t hard to spot him up on Fairfax shopping\nBut not for boxes of shoes, bought a few watches\nThat’s how it ought to be no, that’s how it gotta be\nVVS quality living with no apologies\n\n[Hook: K-Young]\nDiamonds and girls, I hustle hard\nFor these diamonds and girls!\nAnd now I’m in the spotlight\nI live for diamonds and girls\nTrunk full of hundreds, speakers on blast\n[?]\nYou don’t want no problems, problems\nI’m trying to get more diamonds and girls", "title": "Diamonds and Girls"}]}