{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/1820d89200ceee4f0b20325385670042.804x804x1.jpg", "year": "2019-03-29", "album": "Trunk Muzik 3", "lyrics": "[Intro]\n(Drugs)\n(Drugs)\n(Drugs)\n\n[Verse 1]\nI never was the one in the classroom sitting with my hand up\nWhen the teacher told us that we needed to report\nAnything that was happening at home\nLike if I saw pipes or things of that sort\nCocaine dime bags laying on my front porch\nNever made me feel sick 'til I found out what it was\nNo telling how many adults went in through my home\nHad a convo with me, unavailable\nAnd maybe I've caught the vibe and maybe they're right\nAnd maybe I'll follow them footsteps of my folks\nBut that's only a theory 'cause of the people near me\nLove me enough to never let me do that dope\nBut the crew I roll with knew that road\nWe took a left turn and pursued that dough\nI remember being scared of the goons in the room\nPassing needles around, spooning, smoke\nAt the time my young mind was curious\nGullible and naive still\nI run around the apartments, hidden in darkness\nAnd sparked it with Chris, Robby, and Will\nAnd I didn't like the feeling at first\nThe taste in my mouth or the smell on my clothes\nBut I kept showing up after school to be cool\nI would do anything with the bros\nAnd I told my mama lies over and over\nWhat I was doing and where did I go?\nDidn't hurt my feelings anymore\nI didn't care about being an asshole\nUnless my girlfriend found out\nThat my backpack had a fat packed out roll\nBut out the blue, she pulled a joint out her purse\nThat she stole from her folks, and that's all that she wrote\nI quote\n\n[Chorus]\nI got a question for you, please don't tell nobody\n\"Boy, do you get high?\" I said, \"All the time\"\nWe got a secret, baby, I won't tell nobody\n\"When do you get high?\" She said, \"All the time\"\nGive me a lesson, baby, teach me something new\nI said, \"I'll be your guy,\" She said, \"Give me a try\"\nWe got a secret, baby, we won't tell nobody\nYou and me get high, all the time\n\n[Verse 2]\nYou and me? Best friends 'til the end, amen\nRide around in the box, \"Guilty Conscience,\" Eminem\nGrowing up too fast, no bars over no hoes\nNo high is too high, no bottle is too low\nPack it up, let it burn, pass it, my turn\nLet me hit one more time\nLet me live, let me learn\nWho am I for you to judge?\nWho are you? It's just drugs\nIt's only weed, it's only pills\nIt's my dope, it's my buzz\nOne time, one try, then I say bye\nI'm lying, I can't stop now, and why?\nI tried this, I tried that, I came clean, my act\nTook five yellow pills, passed out, came back\nD.U.I. sometimes, too lit, can't drive\nI made it home, I survived, I shouldn't be alive\nMy bad, my fault, I'm just an alco'\nShoot 'em up, bang-bang, no chase, no salt\n\n[Chorus]\nI got a question for you, please don't tell nobody\n\"Boy, do you get high?\" I said, \"All the time\"\nWe got a secret, baby, I won't tell nobody\n\"When do you get high?\" She said, \"All the time\"\nGive me a lesson, baby, teach me something new\nI said, \"I'll be your guy,\" She said, \"Give me a try\"\nWe got a secret, baby, we won't tell nobody\nYou and me get high, all the time\n\n[Outro]\n(Drugs)\n(Drugs)", "title": "Drugs"}]}