{"artist": "The Game", "songs": [{"title": "Black Democrat (Accapella Freestyle)", "album": "You Know What It Is Vol 4 - Murda Game Chronicles", "year": "2007-04-08", "image": "https://images.genius.com/fd823b680b687dac4f58ed6122bbab9b.500x500x1.jpg", "lyrics": "[Verse 1: The Game]\nI’m feeling like a, black democrat\nBarack Obama, the only nigga that can catch Osama\nSpray lamas, get good head and fuck fly bitches with no covenant\nOnly the kitchen oven in and rules to the government\nAsk the republicans how crack cocaine get smuggled in\nWatch them throw they hands up and say it wasn’t them\nAs for rap, this is my lyrical asthma attack\nIt’s all I know, the guns, the cash, the dro\nFidel Castro in my own right, Capone like\nMafioso, Ben Franky on the low pro\nDrop top Bentley, chromed out semis\nTwo grand in popular demand like the first pennies\nMy Audemars Piguet wrist say it's time\nTo dethrone Jay quick, tell 'em other niggas to take six\nCoupe a buck fifty, what’s coming out the speakers\nGot every video bitch scared to fuck with me\nGive 'em hard dick and tampons, a shot of Patron and Don\nThe ones trained get ran on, my crew hard\nLouis V sweaters on the boulevard\nPull niggas cars throw up signs and bang Nas\nThem hoodfellas, fuck niggas, let them get jealous\nWhile we fuck their hoes and stay out the windows of propellors\nGotta be the new school king, if not who is?\nI get the most pussy and cash and move units\nYou bum niggas can't take my seed, i'm real\nTalk to Kool G Rap three times a week\nStill holla at Nas on the daily, only thing missin'\nIs the crown and a phone call from Jay Z\nSnoop got my back, nigga go ask him\nMy flow is lambo, bitch, try to pass him\nHit hard like maternal contractions, me and rap got\nA fatal attraction, what the fuck happened?\nTo the new KRS-ONE, the Kool Hercs?\nThese new school niggas got the old school merked\nWhere are the new KRS-ONE, the Kool Hercs?\nThese new school niggas got the old school merked\nNiggas ain't gon' never be on my level, get a shovel\nDig a hole bitch, and polly' with the devil\nYou're a Ipod hustler, i'm a 80's baby for real\nBorn in '79 and bred to kill\nYou fascinated with your watch, the chain, that wack ass bling\nAsk them how to spell Big Daddy Kane\nYou'll never blow, mattafact, you'll never know\nWhy Dame and Jay just let Roc-A-Fella go\nYou'll never blow, and you'll never know\nWhy Dame and Jay just let Roc-A-Fella go\nThat was The Dynasty - minus me\nI was just five years short of my rhyming spree\nMotherfuckers"}]}