{"songs": [{"image": "https://images.genius.com/655b854c09fd20fcd932070d6fa0e912.640x640x1.jpg", "title": "Find My Way", "album": "Price City", "year": null, "lyrics": "[Intro]\nYou can only be big compared to something smaller than you man\nIt's not the same with greatness\nYou know what I mean?\nI can find my way\nI can find my-, ay\nI was fine the day before\nAnd I'm fine today\nI'll be fine tomorrow\nGet the fuck up outta my system\nI'm sure that I'll find my way\n\n[Bridge]\nCan you guide me?\nI'm not used to this\nI tell em\nWe in the city where everything got a price\nSurvival of the best, you don't cut it if you just kinda nice man\nI tell em\nYou already know\n\n[Verse 1]\nI made a lot of niggas bow like wow\nNigga, yippee yo, yippee yay\nWhere my dogs at?\nBark with me\nYeah the kind of dog really come and fuck the law with me\nIf they talk about that line pause with me\nCause niggas went 8 ball when they heard 'Hallelujah'\nAnd that ain't even the trigger I had up under my sleeve\nCause really Hallelujah's something I would call a microphone test when these rapping niggas call it defeat\nI do it in my momma name tho\nFour!\nGod bless mom's dear soul\nI live through these bars like a convict so\nI give your ass hits like Solange did ho\nWelcome to the playground of the great hounds mo'fucker\nNow stay down mo'fucker\nNiggas round here play foul and they bust like pornstars\nEight rounds mo'fucker\n\n[Pre-hook]\nDon't you talk 'bout what you packing in store\n'Cause who you tell might come attacking you for it\nI'm hungry for Dibas, I'm hunting for Dibas\nThem faces man, you keep the rest of the corpse\nPops saying he don't wanna hear me rapping\nWell I'm saying I don't wanna hear him yapping\nThe only rule I'm following is if he acting\nSo he might as well cuss me out and send me packing\n\n[Hook]\nI can find my way\nEven if I gotta leave home and do it all alone\nYeah, I'll find my way\nGotta kill one of these niggas just so I can get off?\nWell, fine by me\n'Cause daddy was a hustler\nNow I'm really talking but he wouldn't get in clutter boxes\nJust a nine-to-five\nAnd times were rough as fuck\nBut that taught me to toughen up\n\n[Bridge]\nUh huh\nThat taught me to toughen up\nYes sir\nCould you guide me\nUh huh\nThat taught me to, that taught me to toughen up\nYes sir\nI'm not used to this\nUh huh\nYes sir\nCould you guide me\nI'm just warming up man\nY'all ain't ready for the flow\nCheck it, uh\n\n[Verse 2]\nAs I bless these bitches with godliness\nI told my brother how to body this\nHe saw me typing, told me he treated it like he was a columnist\nBack when I was only nine and they treated me like I was anonymous\nBut, I got somewhat fans\nSome of these niggas are drawing the butt not plans\nCreeping in the hope they gon' use me to come up fast\nThey know I run my class\nI'm working for hours on end for somewhat cash\nI put in my heart and effort and bust my ass\nBut y'all don't get it, what this means to me\nThis is crack, cocaine, nicotine and weed to me\nIf niggas on the street like hookers this shit is weave to me\nThe only reason I ever needed Pops to believe in me but\nHe never dared to listen\nCouldn't bother my feelings, I put them in a pen\nI'm in a position of jurisdiction\nLook at my haters dissing\nI couldn't give a fuck not a handjob neither\nI can't stand y'all breathing\n\n[Pre-hook]\nI still party like rockstars and them rich bikers\nI never marry girls all broads, every chick side\nI gotta beat this shit at all hours like disc dicing\nAnd I'm getting thumbs up from y'all stars like hitch-hikers\n\n[Hook]\nEven if I gotta leave home and do it all alone\nYeah, I'll find my way\nGotta kill one of these niggas just so I can get off?\nWell, fine by me\n'Cause daddy was a hustler\nNow I'm really talking but he wouldn't get in clutter boxes\nJust a nine-to-five\nAnd times were rough as fuck\nBut that taught me to toughen up"}], "artist": "Nasty C"}