{"artist": "ZICO", "songs": [{"year": null, "album": "Mixtape Vol. 1: ZICO On The Block", "title": "Dead President (English Version)", "image": "https://images.genius.com/27cee963d76d36ff721229258c74bc13.500x500x1.jpg", "lyrics": "[?]\n\nMoney disgusts me, I fear it  (I fucking hate money money money)\nWhat is this green piece of paper?  [?]\nWe're all scared of the greater men now  (I try to avoid it, it isn't happiness)\nIn fear, I don't know no more (what should I do, man? I don't know)\n\nPolitics, the economy, the education system, and the media\nOur souls are twisted and dirtied in the midst of it all\nAll of the problems eventually end up at money\nIt's always money that's the problem (money money money)\nThe majority of the people of Korea sign a slave contract before they're born\nThere are only words in picture books for babies\nEven before they learn how to walk, they're forced to speak English fluently\nWhy? It's so obvious why\n100 reasons out of a 100, it's because their parents want a comfortable retirement\nSend their sons and daughters off to high-profile colleges to get top tier jobs\nThey want to work them to death, are your kids your avatars?\nEvery time November rolls around, I get goose bumps\nHow many students will leave for the arms of God this year?\nOnly on the outside does it look like an exam hall, the inside's a slaughterhouse\nI'll find out the cause of this fucking problem\n\nMoney disgusts me, I fear it\nWhat is this green piece of paper?\nWe're all scared of the greater men now\nIn fear, I don't know no more\n\nYou can't catch up once generations change and pass\nThe fate of your life is determined by a green piece of paper\nYou can't bring light to such dark change, yeah that's the truth\nEvery day, I collapse under reality\nWant to hear a fucked up example?\nIt costs $1,950 per quarter at my music school\nOne of my friends didn't have enough to even pay the application fee\nHe gave up the transfer, he's banned from asking for an allowance anyway\nQualifications are the fundamental causes of support (fucked up)\nThe town one over is boisterous again over money lost\nThis is the result of human greed\nWe continue to shrug off this vicious cycle like it's nothing\nWhat exactly are we supposed to be teaching our kids?\nWe were better off during the times of the IMF\nOnce a life of mutual aid, it's now a life of individual division\nI so fucking hate the dead president\n\nMoney disgusts me, I fear it\nWhat is this green piece of paper?\nWe're all scared of the greater men now\nIn fear, I don't know no more"}]}