{"artist": "Phora", "songs": [{"album": "One Life To Live ", "title": "Hope", "image": "https://images.genius.com/d1e75acbdeb01e13d54d7b06f6752078.1000x1000x1.jpg", "lyrics": "[Intro]\nI'm surprised I'm still standin' right here\nI was livin' in a nightmare\nNever be able to breathe again\n\n[Verse 1]\nFirst off\nI ain't in this for the Dead Presidents\nThe nice whips fly chicks or gold necklaces\nI do this in hopes that my Auntie gets off of the pipe\nN the small chance of possibly changing a persons life\nI wanna make things right\nThese kids need some guidance\nThis generations lullaby is gunshots n sirens\nI'm here to make a difference fuck the code of the streets\nI refuse to be a victim to my own self-defeat\nDon't let em' get you trapped\nCuz there's only 2 places that you'll end up\nN I'm pretty sure you know just where that's at\nFuck the fame, fuck the money, fuck gettin' put on the map\nI'm just trynna come together\nBrown, White, Yellow, Black\nIt don't matter what color\nN before you put that bullet in his head\nJust make sure you think of his mother\nAnd his little sister cryin' when they see him at his funeral\nBut in the streets, I guess that's business as usual\n\n[Hook]\nAnd I took so many chances in my life\nI'm surprised I'm still standing right here\nI never thought I'll make it yo\nJust a couple of years ago, I was living in a nightmare\nKnife in my chest, Knife in my back\nNever thought I'll be able to breathe again\nBut now I know I'm here for a reason but\nI just don't think this muthaf's see it yet\nI just don't think these muthaf's see it yet\n\n[Verse 2]\nI don't write music to convince you to believe in me\nI write music to convince you to believe in you\nStay positive, keep smiling, and one day you’ll see\nAnything is possible & you could make your dreams come true\nThis is for the Kids that past before they had a chance to live\nTheir memories live on throughout my words\nAnd If I had to give my life so you could hold the ones you lost\nAnd hear them laugh again, I would do it in a second\nAll I ask is this when I'm gone remember\nAll I ever wanted was to make a difference\nPray my sister graduates, I hate to miss it\nBut if my time comes you won't hear me complain\nBut since we still here let me speak to you\nSo just press play n listen\nIf I ever made a million dollars\nI'll create a program to help these kids get into college\nEven tho my ass didn't pass the 11th grade\nMomma is still proud and that's all that matters for heaven's sake\nI let the haters hate, cuz my family will always love me\nNothing left to say didn't make it here by getting lucky\nI'm playing by the rule but yo I gotta confess\nLast night I felt like quitting cuz all of the stress\nGot the world on my shoulder n pain all over my chest\nPlus my girl is tripping, she keeps thinking I'm callin' my ex\nBut somehow, someway, I kept on pushin'\nNever show my pain cuz you never know who's lookin'\nWhen you show weakness they try to bring you down\nN talk behind your back & diss you when you're not around\nBut they will never stop me\nI'mma change the world\nDon't believe me\nJust Watch me\nHeyyy...\n\n[Spoken: 2pac]\n(2pac - White Christmas Interview)\n...\n...\nIt’s been times I gave to these little kids — they was at the gas station. It impressed me that them little kids was like 14 and they’re pumping people’s gas instead of taking the money like I would think — that’s the easy way — they’re pumping people’s gas. And you know people was cruel. They’ll give you a quarter after watching you inhale vapors and everything. They’ll give you a quarter for pumping gas. And I gave them little kids like fifty bucks. They was like, “Thank you!” But that teaches them that when you work hard and be responsible, there’s a reward for that. And I think that just like I did that, corporations can do that, and on a bigger level. Imagine if a corporation just sent a representative and said, “Just go hang out in that playground, and … whatever kid is the coolest and shares the ball or lets the most people play basketball, we’re gonna give them a scholarship.” That would bring hope. There’s no hope, and there’s not going to be too many more Christmases without hope. … There’s not going to be too many more days without hope\n\n[Hook]\nAnd I took so many chances in my life\nI'm surprised I'm still standing right here\nI never thought I'll make it yo\nJust a couple of years ago, I was living in a nightmare\nKnife in my chest, Knife in my back\nNever thought I'll be able to breathe again\nBut now I know I'm here for a reason but\nI just don't think this muthaf's see it yet\nI just don't think these muthaf's see it yet", "year": "2013-04-06"}]}