{"songs": [{"image": "https://images.genius.com/0e1f124f48c2edf75255aa6292bdf2b5.600x600x1.jpg", "title": "DIE!", "album": "Die!", "year": "2010-05-18", "lyrics": "[Intro: Uncle Howie]\nIn my lifetime I’ve died a few times. A couple of months ago I went out; they had to bring me back twice from death. Let me tell you something: when you die you ain’t taking your wallet with you up there! You ain’t even taking your underwear!\n\n[Verse 1: Necro]\nYou never went to jail, you’re shook from the look of it\nI invented Hell when I took a shit\nMy religion is music and abusing bitches\nSnitch I’ll make you a eunuch, a loser dickless\nSaget of the human trafficking racket\nBeat the shit out of Jesus for being a faggot\nSkeez into techno, douchebag die\nBelieve in Necro, you’ll be crucified\nSpeak the gospel of an asshole like Simmons\nSelling Kiss caskets harassing women\nDon’t test me, finish your breath G\nMy ministry is from a sinister ancestry\nCrass gynaecologist, fuck a female activist\nYou took it in your ass by your misogynist\nPlump like a putrid eighty-year-old bitch\nI’ll worship you like Buddha’s fat gold tits\n\n[Hook]\nDie, die, die\nWhen I hurt you - you die\nDie, die, die\nWhen I hurt you - you d-\n\n[Verse 2: Necro]\nA disgrace since birth, you’ll soon be dead\nThe holiest place on earth an exit wound through your head\nDon’t try to enter my plain of existence\nI’ll blast the center of your brain with a biscuit\nNo matter what remain sadistic, maintain persistence\nBreak every chain of resistance\nAny lame gets in my way in this game\nI’ll make sure every vein in your frame is spritzing\nFuck peace, you want it with me? Please\nYour seeds are now abductees from Chuck Cheese\nHit like Michael Spinks with a bike link\nAttack your think hole like an Inca with a spiked drink\nHad a tough career, kid I don’t care\nI’ve been suffering for years, Hell is right here\nShut your trap, that’s enough shit out of you\nTrap you to clap you, I’ll make a snuff flick out of you\n\n[Hook]\n\n[Outro: Bob Dylan]\nAnd I hope that you die\nAnd your death’ll come soon\nI will follow your casket\nIn the pale afternoon\nAnd I’ll watch while you’re lowered\nDown to your deathbed\nAnd I’ll stand over your grave\n‘Til I’m sure that you’re dead"}], "artist": "Necro"}