{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/6988db34176c7b94ceb840e8cf16ec4e.500x500x1.jpg", "year": "2012-07-04", "album": "Heart of Dixie", "lyrics": "[Verse 1: Yelawolf]\nI got nuts on the mic, you can hear it in Stereo\nSeem em' in Bama' from motherfuckin' Ontario\nBeast to en cherry oh, balancin from the swinging roll\nThere it goes Catfish Billy make 'em go hysterical\nGot em dizzy and really get it like Merry go\nRounds with pound of that babbage packing in every show\nSound,yeah I sound like a savage heavens can let 'em go\nYou ain’t a big foot you just in yeti clothes Bet your mama' smokin' newports with her hair in rolls\nSpaghetti’s ready rockin jellies with the (heritos)?\nAin’t you a gumma star, bet you got a pair of those\nBut these nutz are big oh man and there’s no comparin’ those\n\n(Hook)\n\nGotta lotta juice, big cups\nRunnin over muther fuckas in a big truck\nLookin dead in the face, bitch what?\nBig nuts Yeah\nBig nuts Yeah\nBig nuts yeah\nBig nuts yeah\nBig nuts\nSlap the shit out the biggest muther fucker in the room\nDisrespectin my family I got big nutz\nGotta lotta juice, big cups\nBitch what?\nBig nuts\n\n(Verse 2: Yelawolf)\n\nSome people wanna rise when people talk shit I get so frustrated\nEverybody things that I got rich and I walk around like I’m fuckin made\nPull out the alcohol lookin for it in a few makin feel subjugated\nAskin me about a rap beat? who? what? when? where? why? was my lady?\nWant me to snap out snap quick bitch go grab Jack, I’m fuckin crazy\nIf I gotta get go man I'mma make a grown feel like such a baby\nIf you get too close then I'mma have to back you up cuz I’m suffocating\nFeel safe runnin that mouth cuz I got crowd when I’m out in public place\nSay Yelawolf, what’s the lates? Ain’t shit up in the gas pipe\nBut I’m still livin the fast life in my own name and I’m doin aight\nFuckin A!\nIf it’s a game, then I’m in the game and I'mma and I’m in the front pine\nCuz I love to play!\nDudes I’m fuckin' paid and I know you love to hate me biiiiitch\n\n(Hook)\n\nGotta lotta juice, big cups\nRunnin over muther fuckas in a big truck\nLookin dead in the face, bitch what?\nBig nuts Yeah\nBig nuts Yeah\nBig nuts yeah\nBig nuts yeah\nBig nuts\nSlap the shit out the biggest muther fucker in the room\nDisrespectin my family\nI got big nutz\nGotta lotta juice, big cups\nBitch what?\nBig nuts", "title": "Big Nutz"}]}