{"songs": [{"image": "https://images.rapgenius.com/c5ee5a135a602846f22a19c87cc81dba.594x461x1.jpg", "title": "More Money Than Jay Z", "album": null, "year": "2014-08-18", "lyrics": "[Intro]\nYou don't wanna talk that money shit\nWe gon' upset some people with this one\n\n[Verse 1]\nMore money than Jay Z\nNo disrespect, but I ain't \"Roc-ing\" shit\nAnd OAG wonder managed me\nTell 'em cut the check\nMatter fact, nigga, cut the debt\nThat's like if your ace of spades tried to buy Moet\nYour taste ain't expensive and you know it\nIt ain't taste that different and you know that\nIt's vintage, old school with the pimpin'\nWomen, only thing that's rented\nThem young boys couldn't move in my linen\nThem wrinkled old heads, they get the picture\nPop by, you better get your spinach\nBlew though, getting knocked for your bitches\nCV watch, got your moves from soul train\nWhat I do? Went and bought the soul train\nAin't no thang from here to Spokane\nI'm Nicky Barnes before there was cocaine\nPee Wee Kirkland, shooting in two games\nI'm [God Fischer?], telling the truth mane\nI'm about to buy the Apollo and give it a new name\nDo it for Harlem\nShaking all these niggas like [Macy's] hoop game\nNo subliminals, I said your crew name\nBroke niggas, I'm talking to you mane\nNo killer, but the cannon is Hussain\nI rack, I ran, I run it\nIf you want a nigga put up a hunnit\nNot a grand, I brought some dough with me\nGee, you in it, no 50\nI get money, money I got\nAsk Wayne, a milli a pop\nAsk Puff, I'm finally making 'em stop\nDiddy money, my pockets making 'em woop\nA king stunna, Jamaican that guap\nCayman Islands, we making it stop\nStash the cash, K's in the block\nYall mad, cause Drake is on top\nWhen I created Wild N' Out\nHe was on my network making wheelchair stops\nHa, I do this shit for fun\nAnd yall better update your website\nI was worth 20 mil when I was only 21\n\n[Hook (x3)]\nMore money than Jay Z\n\n[Verse 2]\nGot real money, Double XL money\nFuck a Forbes nigga, black dollars, ill money\nYou ain't gotta count it mommy, it's all [air] money\nYou babysitting paper, call it day care money\nFunny? They ain't even near money\nYeah, you dress like Jay but where your Rocawear money?\nDiamonds in your chain, I don't care money\nCause I bought the jewelry store, you can get it here money\nFashion rocky socks, A$AP red money\nMy diamond shoes dancing, Fred Astaire money\nNiggas can't say nothing, mean mug stare money\nGet the fuck outta here, you can't compare money\nYou got that \"I get paid next week when my peeps get their money\nOn a [?], I swear\" money\nYou reality broke, TV repair money\nGo on VH1 and end your career money\nI'm not joking, I'm bouta sell Nickelodeon\nYeah, that's that double dare money\nYou a Spongebob nigga, square money\nWanna be like Jordan, I'm Nike Air money\nFirst round draft pick, player money\nA bitch never told me no, [?] money\nYeah money\n\n[Hook]\n\n[Outro]\nI see all yall rap niggas out there\nAnd your little videos\nYour rented Bugattis\nThrowing stacks of money at women\nWhere's your intellectual properties?\nWhat's your R.O.I?\nThat's return on investment, dumb nigga\nWhat you gon' do after rap?\nWhat you say Jay?\n(You gotta respect that)"}], "artist": "Nick Cannon"}