{"songs": [{"image": "https://images.genius.com/aa170d87db45499351a4d9c5cd06c777.500x500x1.jpg", "album": "Generation Gaming XIV", "title": "Crash Bandicoot vs. Neo Cortex", "lyrics": "[Intro: Dan Bull]\nIt's the Bull- Dan Bull\nWith my mate age, SAV-age\nWe're gonna go back in time now\nWay back, to when it was still socially acceptable\nFor an anthropomorphic marsupial to wear high-tops!\n\n[Chorus: SAV]\n'Cause I'm Crash\nB-B-Bandicoot\nBig red haired animal with pants and shoes\nYou don't really know me for my dancing moves\nNow everywhere I go, they shout: Bandicoot!\nI'm Crash\nB-B-Bandicoot\nI said Crash\nB-B-Bandicoot\nI'm Crash\nB-B-Bandicoot\nNow everywhere I go, they shout: Bandicoot!\n\n[Verse 1: SAV]\nThey call me Crash B-B-Bandicoot\nBig red haired animal with pants and shoes\nMy genetics were enhanced in a lab\nBy two N. Sane scientists, I knew what I had to do\n(Break free)\nI've got to think quick and run\nFrom the doctors and wow, I can spin, kick and jump\nRunning through the lab like a young George Best\nI can reach a vortex, just three or four steps\nStanding in my way I can see a forehead\nMy creator, my nemesis, Neo Cortex\nHe's a nearly bald man with a goatee\nWith a big 'N' on his head\nAnd 'O' 'B' are the two letters that are kept in his coat, see\n'N.O.B.' would look better for the slow readers\nRunning through the levels where rocks are rolling there\nI'm dodging fire, riding on hogs and polar bears\nAnd I haven't got a care when I grab an Aku Aku\n'Cause you ain't gonna hurt me when\n(Ooga booga!)\nThank you!\nThere's lots to fear, see\nI'm dodging TNT and boxes that are green\nBut wait, I've got to pause for a slo-mo\nEyebrows up and down always, I'm loco\nMan, I should be armed with a GoPro\nYou can watch me while I'm searching for Tawna and Coco\nI should be at a disco with friends\nInstead I'm collecting these crystals and gems\nNo pistols or anything vicious\n'Cause this is for kids, but us kids are now men\nEquip me with anything, watch me come for you\nMy bazooka is shooting you with a Wumpa fruit\nForget your five a day, I got a hundred too\nThat'll puncture through you, you'll need a number two\n\n[Chorus: SAV]\n'Cause I'm Crash\nB-B-Bandicoot\nBig red haired animal with pants and shoes\nYou don't really know me for my dancing moves\nNow everywhere I go, they shout: Bandicoot!\nI'm Crash\nB-B-Bandicoot\nI said Crash\nB-B-Bandicoot\nI'm Crash\nB-B-Bandicoot\nNow everywhere I go, they shout: Bandicoot!\n\n[Verse 2: Dan Bull]\nMy birth certificate says Neo Periwinkle Cortex\nThe best nemesis that ever did draw breath\nPerfectionist, vivisectionist with a special gift\nFor resurrecting minions from any critters, pets and shit\nBut I bet I never win a nobel prize\nI presume they've got a policy: No bad guys\nIf you don't know me, I'm the mojo thief\nGiving loads of grief to boatloads of peeps\nBecause they're so beneath me, nobody sees\nAs deeply the scope of my rogueish schemes\nIn preschool I was the recipient of ridicule\nPretty please do tell me now: Who's the silly fool?\nWhen I minimize the planet 'til it's miniscule\nMaking the Pacific Ocean fit into the kiddy pool\nYou're a little waste of energy, so I kilojoule\nYou must admit it, isn't being an evil villain cool?\nIf I look like a stereotypical bad guy\nThe reason is because I am one, that's why\nBut far more than a mere mad scientist\nRewiring household appliances\nI am the vilest nihilist, tirelessly riotous\nFracturing alliances, confirming biases\nCultivating viruses, causing mild psoriasis\nYes I'm getting under your skin, like an itch\nI am an antagonist, like Dan is to Savage\nThat's just how I cope with my emotional baggage\nDo you know how it feels to have a head so massive\nYou can walk down the pavement and still stop traffic?\nRemastered with Nil block graphics\nTwenty years on and we still drop classics\nThe mic's real hot but I will not pass it\nSo go and shout it from the hilltops, SAV, it's\n\n[Chorus: SAV]\n'Cause I'm Crash\nB-B-Bandicoot\nBig red haired animal with pants and shoes\nYou don't really know me for my dancing moves\nNow everywhere I go, they shout: Bandicoot!\nI'm Crash\nB-B-Bandicoot\nI said Crash\nB-B-Bandicoot\nI'm Crash\nB-B-Bandicoot\nNow everywhere I go, they shout: Bandicoot!\n\n[Outro: Dan Bull]\nI rather enjoyed that\nDo you know I never actually played Crash Bandicoot?\nI pretty much just... reworded the Wikipedia article on Neo Cortex\nSo it rhymed a bit better\nThat's essentially my job", "year": "2017-09-13"}], "artist": "Dan Bull"}