{"songs": [{"title": "The Edge", "lyrics": "[Verse 1: Akala]\nDo you never feel like there's something missing?\nStuck in a role, just playin' your postion\nEven when you scream, it seems no one listens\nFree as a bird, but it feels like prison\nNever break tradition, suttin' like it's superstition\nAnd your marrige is about as boring as a politician\nNow listen, what you need to do is change the way you livin'\nIt's your life, don't explain your every decision\nWhatever your vision, believe and make it happen\nLook at me, I'm a English rapper\nIt's only one life here\nGotta do you bruv\nI feel marvelous, how about you luv?\n\n[Bridge: Niara]\nYeah, I feel good (Do you feel good?\nYeah, I feel good (Do you feel good?\nYeah, I feel good (Do you feel good?\nYeah, I feel good (Tell the people...)\n\n[Hook:]\nEverybody jump over the edge\nEverybody let go and just feel the music\nJump over edge\nEverybody jump over the edge\nEverybody jump over the edge\nEverybody jump!\n\nDon't know where the edge is, I'll explain to you it's fine\nIt's that line or that time when your mind just [?]\nLike your boss has been rude to you just one too many times\nOut at night, might just have one too many pints\nLike when you got ambition and they tell you you can't do it\nYour body feel the music, but your scared to move to it\nThe edge is where you lose it, jump with me\nDon't quit your job, take the low road, spit in his tea\nDrink til' your pathetic, til you act like an idiot\nIn the morning you'll regret it, right now it's brilliant\nAs far as your dreams go you just gotta get em\nAnd as long as the beat plays just move to the riddim, like\n\n[Bridge]\n\n[Hook]\n\nCome over the edge to infinite possibilities\nSorta like a parallel universe your visiting\nBut it's here on earth from the prison to the villages\nOpen up your mind and you feel limitless\nDon't let them tell you what is real\nThey don't know, realistically\nThey said Einstein was dumb\nHow come he thought of relativity?\nThey're just despicable, miserable individuals\nAnd every single syllable they uttering is cynical\nIt's typical, don't sit down waitin' on a miracle\nJump like Jordan, like your tryna' reach the pinnacle\nIt's only one life here\nGotta do you bruv\nI feel marvelous, how about you luv?\n\n[Hook]", "year": null, "album": "It’s Not A Rumor", "image": "https://images.genius.com/715fae4666a7a92dab37c4e67a75dbb4.500x500x1.jpg"}], "artist": "Akala"}