{"artist": "Problem", "songs": [{"album": "S2", "title": "I’m Cool", "image": "https://images.genius.com/7fb9d8c4ebfefcd0475c83bda4bfb488.1000x1000x1.jpg", "lyrics": "[Intro]\nMo' life, mo’ weed\nI see you lookin' at me but I'm out’cho league\nI could tell how you move but you not my speed\nNot sayin' less about you, it's more about me\nSo-\n\n[Break]\nLittle nigga bang back\nFuck, where that ass at\nBitch, where that cash at?\nBitch, where that cash at?\n\n[Verse 1]\n'Cause if you ain't on that, you really gettin' laughed at\nI'm on a fast track, and I'm not tryna flash back\nTo my crazy days, yeah, I had some crazy ways\nIt was a crazy phase, but, nigga, I got crazy pay\nWoo, caught a few crazy fades\nThough I’m still with the shit, each day it fades\nSo much shit done changed, shit, mostly me\nDrugs had me makin’ decisions emotionally\nAllowin' motherfuckers to get too close to me\nBut now, a nigga like-\n\n[Break]\nLittle nigga bang back\nFuck, where that ass at\nBitch, where that cash at?\nBitch, where that cash at?\n\n[Bridge]\nForever on that and I ain’t buyin' how y'all look\nPaper and ink don't make you a book, nigga\nBro, little nigga bang back\n\n[Verse 2]\nMy mind different\nI’m listenin' more, talkin' less\nAin't focused on L's, I'm talkin' best\nI'm talkin' wins, I'm speakin' wins into existence\nThank God for his persistence\nHuh\nBut I was lettin' him down, now-\nFuck where that ass at?\n'Cause, baby girl, we past that\nYou ain't mine, so why would I even ask that?\nI'm on a fast track, you still tryna flash back\nYou reminiscin' about ass smacks in public\nTellin' me to stop, knowin' that you love it\nI liked it too\nBut a nigga like to hustle more than I'm likin' you\n\n[Break]\nLittle nigga bang back\nFuck, where that ass at\nBitch, where that cash at?\n\n[Bridge]\nForever on that and I ain't buyin' how y'all look\nPaper and ink don't make you a book, nigga\n\n[Verse 3]\nAnd I might go over your head\nYou need money stacked to sit tall as my leg\nChanged my hidin' spot, it was under my bed\nNow right there is that thang that'll blow off your head\nAnd I pray to God I never have to use it, on moms\nMe or you, and I get to choose, Allfather\nAnd I ain't say that shit to be tough or rah-rah\nI'm just tryna make sure my kids have a father\nSo respect my G\nAnd if you buyin' goods from me, please respect my fee\nI done earned every motherfuckin' right\n\n[Interlude]\nHold on\nUh\nSo to whoever wanna clash nigga-\n\n[Break]\nLittle nigga bang back\nFuck, where that ass at\nFor real\nBitch, where that cash at?\nBitch, where that cash at?\nWhat", "year": "2018-11-30"}]}