{"artist": "C-Rayz Walz", "songs": [{"title": "A Bonus", "album": "Classic / Rhyme Doublin’ & A Bonus", "year": "2002-06-14", "image": "https://images.genius.com/31f0f9722ac8884f9a381226a030b02c.529x529x1.jpg", "lyrics": "[Intro (Overlapped with Hook Adlibs): C-Rayz Walz]\nSpin around.  The reverse project theory.  Oxymoron.  [?].  [?].  Nagasaki Blaze.  C-Rayz Walz.  Plain Pat.  Double 9.  The same thing to splash you all with.  New soup, cooking it up\n\n[Verse 1: C-Rayz Walz]\nMy style’s [?] like, “Who’s Jerry love and [?]?”\nGuns?  I carry some.  Hoes?  You married ‘em\nCops’ Glocks is hot.  My whole block got dumdums\nWith a 41-shot mentality.  Fucking with me\nYou’d rather go to court and get blunted\nJoin a covenant, do ten hits for five-hundred\nYou thought life is so sweet and simple\nNow you in jail with holes in your cheeks like dimples\nYou know the real.  I’m nice enough to get ten deals\nTrife enough to write, cook glass, and smash your windshield\nOn some Bronx shit, a “Hok” spit like [?]\nJedi-mind-trick your clique like [?]\nRap cats get smacked with gats—I instill fear\nY’all make no moves like ski teams in wheelchairs\nPut you in cornfields with crows to scare some\nI stab tracks—Plain Pat swear I got a spear tongue\n\n[Hook: C-Rayz Walz] (x2)\nVerbal spit gigantically stomp your gerbil myth\nMurderous be the mode of the herbalist\nC-Rayz Walz hip hop, lyrical material\nA bonus to your mental\n\n[Verse 2: C-Rayz Walz]\nI fight the beast.  Earth cheers and eggs me on\nMy feet tired and I’m headstrong—the perfect balance\nMaintain, making movements against the malice\nAttracting a-alikes using my power as a magnet\nSave Wonderland for Alice—hands on the chalice\nCaressing my palm, calloused from smacking white mountains\nTo make the rocks come tumbling down with a thunderous sound, you need practice\nI drink chamomile and rose hips\nMake imbeciles walk tightropes with they toes clipped\nCut your hands off, make you juggle balloons\nRebuttal buffoons, use civilization for heirlooms\nC-Rayz hit you in your mouth.  Your tongue blisters\nTurn your bigger brother to your young sister (What?)\nI’ve been underground so long, my favorite food is rubble\nDrown myself just to see if I could bubble\nDrink a drop of water and spit out a puddle\nBrave enough to look hate in the face and say, “I love you”\nWild like a caveman—don’t make me club you\nLike S.O.B., [?] speed or the tunnel\n\n[Hook: C-Rayz Walz] (x2)\nVerbal spit gigantically stomp your gerbil myth\nMurderous be the mode of the herbalist\nC-Rayz Walz hip hop, lyrical material\nA bonus to your mental"}]}