{"artist": "Iamsu!", "songs": [{"title": "Ascension", "lyrics": "[Verse]\nLyrically I could be Talib Kweli\nSaid fuck following whoever decided to leave\nGod’s speed, Rocky at the top of the steps\nGive everything I have in me, 'till it’s nothing left\nA man’s defined by his words, quiet as its kept\nKeep your third eye open, no paying intercept\nSon, what’s the meaning of life?\nTrying to stick to the code, I’m not reading it right\nUh, so one can be a sign\nFeels like everybody around me is living a lie\nEnough water that I could drown all the tears of my eyes\nWanna make the world a little better, before my demise\nFeel like the gap is getting longer, the higher I climb\nHaving to put myself right again time after time\nLine after line I’m elevating the collective conscious\nSkipped over college, took my tuition, I made a direct deposit\nInto the school of hard knocks, I'm majoring in my dreams\nAnd now my wallet is so big that it can't fit in my jeans\nGod, family and music, won’t let the shit intervene\nI had a dream when I was younger, I was winning that ring\nI had to switch up my roster, switch up my mantra\nHard to stay humble when they’re praising you at concerts\nStupid, occupied so I divide up my attention\nThought she wanted me to blow, how you can’t do with my ascension\n\n[Hook]\nI thought you loved me\n(I do love you!)\nI thought... I thought you were the one for me\n(Baby, I’m the one for you I know it!)\nLike, forever?\n(I want this shit forever)\nWhat happened?\n(I don’t know, I was tripping)\n(I was on the, I was on the bullshit like)\n(The insecurities in my mind just kept working in)\n(It’s was just the bitches and the I don’t even know)\n(I was tripping please)\n(It doesn’t even matter like)\nYou’re all I want, I’m sorry no\n(Wait no, come back)\n(Don’t, don’t walk away from me)\n(Cause I need you, I love you)\n(I'm sorry, please, I'm not good without you)\n(Don't leave me)\n\n[Chorus]\nI thought you loved me\nI thought you love me\nYou said\nI thought you loved me\nI thought you loved me\nNo, no, no, it’s not love, no", "image": "https://images.genius.com/66cb89c1f7d6b685d2378a90b777119d.500x500x1.jpg", "album": "Sincerely Yours", "year": "2014-05-14"}]}