{"songs": [{"image": "https://images.genius.com/d0073b86981d7d028459e551fe038140.500x500x1.jpg", "album": "Generation Gaming II", "title": "Arkham Asylum", "lyrics": "[Verse 1]\nHa! So the Joker's locked away in the asylum\nMe thinks things are gonna become quite violent\nI believe, he slipped a trick inside his sleeve\nAnd his desire to leave is nonexistant 'til he's played a game malicious hide and seek\nWith sticks and dynamite and tnt\nBut what's that silhouette that you can see?\nIn the half-light to the dark night you might just find the dark knight\nSavage as a shark bite, to the other rappers who can't just quite do this\nYou see the truth is I leap from roof with a really ruthless steez\nI leave you toothless please you silly doofus\nI'll give you a Chinese burn, and I don't mean confusius dead inside a little urn\nI'll twist your arm until the skin is rather irritated\nMy methods of torture are really unsophisticated, to the most complicated machinations\nTo mash your face in, with patterned lacerations that are fascinating\nAnd as my grapple hangs my batarang'll batter gangs\nI brang the thang to make you say this can't be happenstance\nThe blackest avalanche, and as Dan's an anagram of \"and\"\nI'll crick your spine and leave twisted like an ampersand\nFeeling squiffy like you're getting high in Amsterdam, the neon city light'll emphasise the fact your damned\n\n[Hook]\nNANANANANANANANA\nBATMAN BATMAN!\n\n[Verse 2]\nIf commissioner Gordon didn't ignore the dissonant warnings\nThan it'd have surely been a different story all together for the better\nThe prisoners all lead a sinister life a criminal orgy\nLiving inside a wicked and vile despicable isle, sicker than bile\nBut it's evident I'm a vigilant militant\nWilling to kill them with brilliant diligent skill and the guile of a killer with infinite style\nJack White is quite insane, and while I'm fighting Bane, I find a titan-like strain flowing rife inside his veins\nIt's the same the Joker's trying to synthesise in doses high as planes\nI'm tired of games, It's time for change, to time to take is smile away, Hey\nHow long has Killer Croc been a cock?\nMy trap'll leave him reeling like a spinning top and I willn't stop until his locked up in a box\nSit and watch me fighting pound for pound with Poison Ivy, a vigilante plant antidote without my boys behind me\nHorticulture's not the sort of culture to be taken lightly\nI take an eighth of titan now I'm feeling slightly hyphy\nI might be quite that as high that I can see inside me psyche\nMe, I'm so fly that I can fly, crikey\n\n[Hook]\nNANANANANANANANA\nBATMAN BATMAN!", "year": "2012-07-20"}], "artist": "Dan Bull"}