{"songs": [{"album": "Paper Trail", "image": "https://images.genius.com/cfd0caa9a36fd23db9dec05ae1a43aed.953x953x1.jpg", "year": "2008-09-29", "title": "Every Chance I Get", "lyrics": "[Intro: T.I.]\nReal talk, true story (uh-huh)\nNo nuts, no glory (uh-uh)\nY'knowmsayin? (Real talk)\nAy dawg (yeah yeah)\nI'mma tell you like this\n\n[Hook: T.I.]\nHey I'm so raw, and I'm so rich\nAnd you so flawed niggas ain't 'bout shit\nI'll take yo' broad, I can fuck yo' bitch\nKnow that I'm gon' ball every chance I get\nEvery chance I get, real talk, no shit\nEvery chance I get, make money on this\nI'll take yo' broad, I can fuck yo' bitch\nKnow that I'm gon' ball every chance I get, every chance I get\n\n[T.I.]\nThey say it's lonely at the top, but I don't feel lonely\nGot my homies out in Hollywood so I don't feel phony\nAin't another nigga colder, cribs all over\nFlash-in-pan, these other rappers catch a number, Coca-Cola\nI'm exceedin expectations, you barely meetin quota\nI give it to 'em straight, you cut it with baking soda\nYou said I ain't Zone One, nigga ha, that's a funny one\nI'm King like my 3 year-old, Major like my youngest son\nGot one named Domani, so you know what I'm gettin (guap)\nDeyjah and Neek-Neek and Messiah like \"Daddy, get 'em\"\nGot an angel named Leah here to keep me outta prison\nAnd my partner Jason Geter to help me see about a billion\nListen; Grand Hustle, best respect this vision\nMy records sell about a million, but shit that just the beginnin\nWhat with Club Crucial and Grand Hustle film division\nMultiplication to get the paper, I let the clique do the division\nBreak bread, StreetCred.com makin a killin\nPlus \"A King of Oneself,\" high fashion, I'm flashin\nI'm, ready for whatever though, trained to go you better know\nPut dick up in whoever ho, let 'em know\n\n[Hook]\n\n[T.I.]\nI gotta thank my lucky stars cause it came so far\nDope game, rap game, 'bout the same so far\nBrag about your lil' Benz, nigga that ain't no car\nI got some shit in my garage that requires a chauffeur\nHigh as gas is, the country at war and people are starvin\nAnd I pay a million dollars for Ferraris, retarded, huh?\nSorry bruh, been addicted to ballin since I started up\nSee ten hoes, get 'em all to fuck cause they know this dough stack tall as fuck\nNah, it ain't that I'm rich that they hate so much\nLeast I could do it, not rub it in niggas face so much\nSo I'm tryin now while I'm rhymin not to brag about the island\nOr the crib in Hawaii where all the walls slide in\nHouse is wide open, we could bring the outside in\nI think you should hear about it, but fuck it I'll be quiet\nI just spit it how I live it homie I don't be lyin\nWould it make you feel better if I put my pockets on a diet?\nIf I made less money, started to dress bummy\nWould the haters and the critics have more respect for me?\nShould I downgrade the crib and the way I live?\nNow how about I don't and we just say I did, nigga\n\n[Hook]\n\n[Outro: T.I.]\nAy say homeboy\nIt's real talk comin at you live and direct homeboy, you dig that?\nHeh, you could hate all you want partna\nI'mma give you somethin to hate on, bitch nigga\nHa ha! Grand Hustle, you understand?\nDJ Toomp you did yo' muh'fuckin thang as usual\nAy-hey look, P$C partna, Pimp Squad Click\nAy, Big Kuntry you up next homie\nIt's the king, BITCH!\nYeahhhhhh, they say I ain't Zone One, bitch nigga\nMy grandmama been livin on Center Hill 43 years, ho-ass nigga\nYou understand that? Nigga come meet me nigga\nSee me nigga! You know?\nWhy niggas gotta wait 'til a nigga got the police watchin you\nAnd start kickin that fuck shit, you know?\nYou know how I get down, you know what it was nigga\nYou know you don't wanna see me, bitch nigga!\nYeahhhhhh, AY!\n\n[Hook]"}], "artist": "T.I."}