{"songs": [{"image": "https://images.genius.com/3455d80c0949060bbaa5eccb85982765.900x900x1.jpg", "title": "Go", "album": "5.0", "year": "2010-11-12", "lyrics": "[Intro: Nelly]\nLife... what is it for real?\n\n[Verse 1: Ali Jones]\nI don't know... yo\nIt's like hate taking over but hold up, what is it over?\nSuicide, man that's the devil trying to control us\nThey told us but we ain't notice the pain was sitting on they shoulders\nThe world is just too polar, they'd rather live in the solar\nSystem got us hopeless, they focus on foreclosures\nWake up and smell the Folgers\nObama bring home the soldiers\nOsama, you owe us, the 9/11 was bogus\nNow we right back at him, save the world is our motive\nC'mon...\n\n[Verse 2: Nelly]\nYeah, wake up early in the streets of the block (streets of the block)\nHe posted up on the corner like a soldier in a drill but it won't stop\nYeah, living life in the battlefield (battlefield)\nHmm, trying to survive every day and every night is the same deal\n'Cause, life's strange (life's strange) time changes (time changes)\nBut karma always finds a way\nStay strong (stay strong), hold on (hold on)\nAnd don't let all your dreams fade away\n\n[Pre-Chorus: Nelly]\nYeah, life can beat you down\nWhat goes, it comes around\nIt's not how you hit the ground\nIt's how fast you get back up, and\n\n[Chorus: Nelly]\nGo! Keep going, sometimes it feel like I'm giving my life away\nAnd it gets hard, and harder, the happiness is worth the wait\n'Cause all I want is a better day\n'Cause all I want is a better way, hey\n\n[Verse 3: Nelly]\nA lot of mothers they just don't understand (they just don't understand)\nYeah, they think we hard on our sons but we gotta teach our boys how to be a man\nYeah, they on they own when they walk out the door (when they walk out the door)\nMm, see we can show 'em how to fire but they gotta teach theyself how to reload\n'Cause, unemployment's higher than it's ever been\nSometimes it feels like I can't win\nAnd even though all the rules keep changing\nI'm stronger now than I was when I came in\n\n[Pre-Chorus: Nelly]\nYeah, life can beat you down\nWhat goes, it comes around\nIt's not how you hit the ground\nIt's how fast you get back up, and\n\n[Chorus: Nelly]\nGo! Keep going, sometimes it feel like I'm giving my life away\nAnd it gets hard, and harder, the happiness is worth the wait\n'Cause all I want is a better day\n'Cause all I want is a better way, hey\n\n[Verse 4: Talib Kweli]\nHey, hey\nRolling through the back streets like we got beef\nA carnival for carnivores with the sharp teeth\nThey animalistic, that's why we call the cops beast\nThey on the hunt cause they hungry for the dark meat\nI'm rapping to my heartbeat, the brain is the bass\nThe heart is the drum; give the drummer some\nPromise of a better life is all I got to give\nI ain't just trying to survive, I'm trying to live\n\n[Bridge: Nelly]\n'Cause all I want is a better way, hey\nIf you're not prepared the world can be so cold\nAll that you can do is your best and just hope (yeah)\nIn time the truth will show, just stick to what you know\nGet a grip on something real, and never let it GOOOOOOOOOOOOOO!\n\n[Chorus: Nelly]\nGo! Keep going, sometimes it feel like I'm giving my life away\nAnd it gets hard, and harder, the happiness is worth the wait\n'Cause all I want is a better day\n'Cause all I want is a better way, hey\nGo! Keep going, sometimes it feel like I'm giving my life away\nAnd it gets hard, and harder, the happiness is worth the wait\n'Cause all I want is a better day\n'Cause all I want is a better way, hey"}], "artist": "Nelly"}