{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro]\nPhiladelphia\nI dedicate to you this song\n(Olympick)\nFuck it I'm coming\nUh, uh-huh, uh-huh, uh-huh, uhm-hmm\n\n[Verse 1]\nSomebody got to die\nEither this guy or this guy\nEither way somebody mama throwing a fish fry\nBigger the beef, bigger the clip size\nHome Depot trips, duct tapes, zip ties\nWas gonna leave it dead, let shit slide\nBut niggas pushing my fuck-it button\nI gotta fuck up something\nI'm thinking churches and hearses\nER trips, IV drips, and nurses, uh\nHomicides for purchase but I think I might work this\nCash that check myself though\nVest with the velcro\nClip from the wrist to the elbow\nDraco small but the drum can't fit in the belt though\nTrench coat still can't tell though\nIt is what it is but we ain't gon' dwell though\nIf shit hit the fan cuz, just don't tell though\n\n[Interlude]\nI respect what he's done. New overthrows the old, it's natural\n\n[Verse 2]\nAmbulance screaming up the block\nShots so loud can barely hear 'em screaming \"stop\"\nVaguely hear somebody screaming \"cops\"\nSpray the family while they grieving at his plot\nOn target till I off it\nYou want me off your head? Where that bread, nigga cough it\nIssue me a ticket or I'll park it\nOr I get you fitted for that coffin\n\n[Interlude 2]\nJust when I thought I was out they pull me back in\n\n[Verse 3]\nBack on course with no remorse\nLike the fat guy from Bed-Stuy kick in doors\nEverybody getting on the floor\nEverybody in this bitch get it but the whore\nBitch where that bag at?\nYeah, yeah I love them too but where that tab at\nSomebody cashing out or I'm blasting out\nTalking bout what? Ain't shit to ration out\nYou drew that line so I'ma cross it\nNow lay in-between them lines when they chalk it\nCatch you at the Clearport, extra cartridge\nAin't no jets departing only death departing\nTeterboro with the barrel exercise the plan\nUnderstand you ain't never too fly to land\nHow you goin' through your face and your feet?\nHogtied, broom in your ass, you in too deep\nFucking with the crypt keeper, grim reaper\nYou just a tweeter, I'm the knock in the Devil's speaker\nStop, this bigger than Omeeka\nI wanted you and ITY, Latifah\nSwitch this horror flick, double feature\nGee, what niggas do for money, my brother's keeper\nA sucker way out is to steal him\nFace said look him in his eyes 'fore you kill him\nNigga you weak for real\nYou did that for Meek? You shoulda did it for Mills\nBitch you should of did it for real\nGot niggas checking under cars 'fore they get in their wheels\nBefore I check you up to God, better get in your will\nYou niggas better pick a side 'fore I get in the field\nAin't gon' have no pics when I'm blicking the steel\nEverybody getting fired when I'm clicking the drill\nUh-huh, Poppa gave out warnings, not me\nJust another body for mama to ID\nYou could play a game but not me\nAll shells, no stripes, Y3\nHeart cross your windpipe, cannot breathe\nOne cannot fight what one cannot see\nYeah and I be there when the smoke clear\nDrown in your own blood, nigga soak there\nI pluck you then rock him, I ain't no joke yeah\nCheck out my felonies, check-check out my felonies\nSell your soul you say your ass what you telling me\nFuckin' faggots, pussies\nBeen doing this, fuckin' rookies\nCrush your whole empire, Cookies\nWhy the fuck would you push me?\nAnd no more Ruckus, I'm reckless\nWhat you expected? I'm coming\n\n[Outro]\nUh, uh-huh, uh-huh, uh-huh, uhm-hmm\nI'm coming, uhm", "image": "https://images.genius.com/ba0469b4b6450e72a4c873b3fc14e109.1000x1000x1.jpg", "year": "2016-10-06", "title": "I’m Coming", "album": null}]}