{"songs": [{"year": null, "image": "https://images.genius.com/da38feb1c7ca636243c52d23e325bbd4.500x500x1.jpg", "title": "Don’t Be Fake", "album": "Thugs Revenge", "lyrics": "[Intro]\nYeah, yeah we gon' beat these demons down within the mind\nWith the sound within the mind, beat on this shit\nC'mon now let's get this shit together\nC'mon, beat this shit down baby\nWell let me show you how the Midwest rocks, west rocks\nWell let me show you how this Midwest rocks, west rocks\nLet me show you how this Midwest rocks\nWe gon' get this motherfuckin money young'n, what nigga! Hahaha\n\n[Bizzy Bone]\nI was rollin the I-80, holdin the vibe baby\nPolice up in this bitch, you know they hate me\nWith a motherfucker to search me, and a motherfucker to curse me\nAnd it all end up to them walkin it like you not dirty birdy\nBringin it most certainly, you don't want me, quit frontin\nOl' hater hater hater hater, quit stuntin\nPlain and simply bluntin, nothin for nothin that equals nothin\nAnd I'm still walkin and needin that somethin\nVision a perfect woman, a vision of perfect women\nCh-ch-check out my melody, check-check out my rhythm\nInspiration is God, spiritually we can see\nIn the name of our Lord and savior Jesus Christ, it's whatever you need\nBreak bread so the demons can eat\nHandle my money like Yvonna, it's just me the G\nCall it what'chu wanna call it, feel me I'm in a venna{?}\nShut up so you can get some real manner\nMy momma my Rosanna-anna, just me and my Joanna\nHey, pick up yo' stamina, hit 'em like wow\nYou know I love my style, I'm not a faker I'm the real\nI'm walkin in my sins in this precious metal and steel\n\n[Chorus 2X: Bizzy Bone]\nNow do you want me? Don't be fake\nAnd don't have the nerve to try to play me like you're real\nI'm tryin to eat off the plate, baby please peace be still\nThou shall not kill, we in the belly of the beast\n\n[Bizzy Bone]\nIt was a setup, motherfucker don't ever think I let up\nI peeped out of every movement when you get up\nFor the woman that never loved me, only just to wipe away my smile\nWas it jealousy? Mad cause my hair was wild?\nAin't no vanity, never was surrounded by no enemies\nOne glass of Hennessy, mind on the trinity\nHeavenly, somebody got pissed, at the caucus\nGive me a leaf and let me break down college studies and collars\nBallers, shot callers, I'm comin up\nDug up, up out the grave, now pay attention to the thug\nCan you try that? Fellamina, Robert and Masadonia\nBryon never forget bitch, can you buy that?\nPlus the one that I gave you, a real diamond, no cubic zirconia\nHeaded for Mariah like it's right around the corner soldier\nShanaya said it best, I guess it's war\nSo what the fuck you think I landed on this fuckin planet for?\nNow keep the lust, eat the coochie cause I know that steez\nI heard you say that you was lovin but you said it while they dissin me\nDissin me, dissin me.. why they dissin me? Fuckin crazy\n\n[Chorus]\n\n[Bizzy Bone]\nWhen it's, said and done, one we still standin\nHaters'll never find me, no matter how they demand it\nPay dues, pay price, pay more than thrice\nDon't get mad when I pop up with ice - little haters\nAlligator snake skin, serpent with yo' fake skin\nWanna be a man, be a man than me\nI'm a child of God, and you can call it if you wanna\nHomeboy grab girly if you wanna\nBut he won't even claim her, fuckin same dude tryna frame us\nBitch please, I'm already famous it's stuck in the danger\nNever cry, I know the Lord is the greatest\nHe in secret, you don't need to be searchin\nNo hatred, cause I'm a soldier for the Lord\nWise, and I'm humble with that double edge sword\n\n(Hahaha, it's that \"Thugs Revenge\" mo' murda)\n\n[Chorus]\n\n[ad libs to the end]"}], "artist": "Bizzy Bone"}