{"artist": "Pimp C", "songs": [{"album": "Still Pimping", "title": "Watch The Reaction", "image": "https://images.genius.com/3d5d412ed24c8c0c0e6090d935ec7bc3.500x500x1.jpg", "lyrics": "[Intro]\nCheck 1-2 1-2 bitachhh, smoke something bitch trademark naw tawlkin bout?\n\nGet ya finga out ya booty bitch, get on yo money motherfucker\n\nIts really going down in the southhh, grinding, money over bitchess\n\n[Pimp C]\nJohn Ross, Tony Snow, Sweet Jones I got that work for the low\nIt’s 17.5 nigga fuck that shit, they 12 right nah got ‘em hot off the pit\nI’m fucking with that border nah fuck tha boat\nGeorge Clampton let’em come thru so he getting my vote\nIf the rap game died could you sell cocaine? would you still have a Benz? would you still have a chain?\nIf I wasn’t a rapper I’d still be a hi capper, black toy in my lapper laying dead for the jackers (unh)\nI know DJ Screw (unh) the real DJ Screw (unh) if you was down why the fuck I never seen you? (biyatch)\nI seen Fat Pat, I seen 3-2, I seen KeKe at the house but nigga where was you (where was you?)\nMissing in action, when I ride by nigga watch ya bitch reaction (I got it)\n\n[Hook]\nTop start falling (biyatch) and the bitches start calling (watching girls get buck)\nMy trunk start banging (biyatch) and my 4’s start crawling (watching girls get buck)\nThe drank mixed up (biyatch) in the cream soda bottle (watching girls get buck)\nWhen I ride by nigga watch a bitch(biyatch) reaction (watching girls get buck)\nTop start falling (biyatch) and the bitches start calling (watching girls get buck)\nMy trunk start banging (biyatch) and my 4’s start crawling (watching girls get buck)\nThe drank mixed up (biyatch) in the cream soda bottle (watching girls get buck)\nWhen I ride by nigga watch a bitch(biyatch) reaction (I Got It)\n\n[Lil KeKe]\nSlide by slow and get a better reaction cream soda relaxing something like thug passion\nThey asking, yeah they wanna hear this kinda talk, as soon as the top fall the 4’s begin to walk\nHey, im on that other shit, perforated butter shit\nDippin by bad hoes, but flippin with another bitch\nBoppin, 6 – 15’s I got em knockin\nFreaks be tryna call, them haters be baller blockin\nBrand new pretty jag, 80 was on the tag\nLeaving them niggas mad and banging that Pimp Chad\nDon Ke, 7-13, the rag matchin, raspberry paint can get a bitch reaction (I got it)\n\n[Hook]\n\n[Killa Kyleon]\n(???) frame like I’m from another planet\nBlack guts red paint got the drop looking satanic\nNow I’m sinking in that butter feel like I’m on the titanic\nIceberg’s on my body feel like I’m on the titanic\n3 bad bitches so all of my wishes granted\nLisa, Keisha, and Tammy, the black, Caucasian and Spanish\nMy mission is money getting an getting ‘em out they panties\nCream soda purple drank got it Texas cotton candy\nCandy cover my doors, 4’s cover my 4’s\nWeed rolled in my swisher, don’t like it cover your nose\nG’s cover my clothes, face waist wrist and toes\nNot to mention that they the reason that my pockets on swole\nFold money on the regular, kush no regular\nOG Bubble, Rolls Royce or that medical\nCup fulla medicine, running threw bottles\nLike I’m Flipping king pages, I’m running thru models (I got it)\n\n[Hook]", "year": "2011-07-12"}]}