{"songs": [{"title": "DeepRest", "image": "https://images.genius.com/02d3ad2b829899023edb27dd83a02009.1000x1000x1.jpg", "lyrics": "[Intro: Odd Thomas pretending to be a reporter]\nWe're on location from planet Earth. Things are crazy down here! It's painfully obvious that all of creation has been affected by the curse\n\n[Verse 1: Braille]\nReported live from the darkness where hope is absent\nSport a broken heart like the latest fashion\nDesperation is a dangerous attraction\nIsolation is an empty habit\nAnd none of my senses can make sense of it\nI'm numb, but once I come to sensualism\nEnter with a sensitive mind, till the temperature rise\nWhen I'm assembling rhymes, I start to tremble inside\nAnd start to recognize these words are not mine\nI wouldn't be breathing if he didn't put the breath inside\nBut I still wrestle with pride\nTry to steal the glory when the pressure is high\nMy body is a temple so access denied\nThis is a place where the Holy Spirit resides\nThe risen king died, made me alive\nAnd one day I'll see Him with my eyes\n\n[Chorus]\nAnd that's how I sleep at night\nDeepRest!\nAt peace when I close my eyes\nBeat on my chest\nFaith to believe, when it seems impossible, impossible\n\nAnd that's how I sleep at night\nDeepRest!\nAt peace when I close my eyes\nBeat on my chest\nRedeemed from the curse\nSo I stand firm\nWaiting for the King to return\n\n[Verse 2: Braille]\nDon't get me wrong, I'm just the messenger\nI make songs, but I didn't make the message up\nI've done wrong. So many times I've messed up!\nConfessed my sin, that's when God cleaned my mess up\nAcquitted what I committed, forgiving all of my sinning\nWritten in the beginning, on the cross it was finished\nBelieving means more than just saying a prayer\nIt means my life is not my own. Yeah, I'm taking it there. Uh!\nYou know what time is it? The Lord is coming sooner\nLike the sound of (?) or the counterfeit\nWhen the King returns, the whole world stops\nThere's nothing left to say. Stand back and watch\nI know He's on His way. For some that means\nJudgement and tomb if your soul's not clean\nSo I'm following Christ through the danger zone\nSaved by grace through faith alone\n\n[Chorus]\n\n[Instrumental]\n\n[Chorus]", "year": "2011-08-30", "album": "Native Lungs"}], "artist": "Braille"}