{"songs": [{"album": "Vintage Curses", "image": "https://images.genius.com/578d3254e53548c2137f0fe0adf43217.1000x1000x1.jpg", "year": "2015-08-01", "title": "Ad Nauseam", "lyrics": "[Verse 1]\nI can hear your heartbeat through your sweat\nSo don’t put dirt on my grave just yet\nSpittin’ bars to new levels for irrelevant fellas\nDemystifying the Devil cause I’m the real rebel\nRaisin’ stakes in my rhyme the first line with my fist\nPunks step back; don’t know how to react to this\nFeminist, activist, no need to practice this\nAin’t showin’ my ass every goddamn chance I get\nTracking this seamless so you fuckers will feel this\nFor lyrical content and not with your penis\nNo booty shakin’ half naked ad nauseam\nI’m making moves by the moon with insomnia\nFluidly with ingenuity I rock shit\nYou wanna dismiss it but can’t so you talk shit\nFed up with the ageism, sexism, racism\nIn an industry fueled by fakeism\nCommercialized over hyped cheap antics\nI’m sick to death of seeing everyone’s panties\nNot here for the sell, just kickin’ semantics\nWith style and perspective that’s real, so respect it!\n\n[Chorus]\n(Anyone can be likeable but it really takes guts to be hated)\n(And she knew she was hated but she didn’t care)\n(You know her name?)\n(She repped hip-hop on the West Coast)\n(You’re taking about Tairrie B. Yeah Tairrie B!)\n\n[Verse 2]\nNow let’s hear it for my sisters who had something to say\nThe ladies who spit legit from back in the day\nSmashing stereotypes and breaking down doors\nPushing boundaries and waxing poetic on the dance floors\nNot dropping drawers like whores on all fours\nSetting women back for years after all that we’ve fought for\nWhatever happened to the bad ass chicks?\nNow everybody’s videos are porn flicks!\nDon’t get me wrong, there’s nothing wrong with a nice ass\nBut put some clothes on and leave some mystery for fans\nDamn, that shit’s weak and reeks of weak minds\nWho got nothing to say so they just show their behinds\nI grind rhymes and flow my linguistics\nMyself not a mimic, so no need for those gimmicks\nAnd that might come as a disturbance to cynics\nBut my resurgence is urgent so middle finger to critics\nI never quit it, just took a sabbatical for my soul\nTurned my words into sigils so magical to behold\nBringin’ the cold to the mic like an ice queen\nBut I can make it melt motherfucker, if I scream\n\n[Chorus]\n(She was gonna be a real fiesty dynamo)\n(And create electricity wherever she went)\n(Tairrie B!)\n(Bitch virtuosity!)\n(Putting more fuel on the fire)\n(I would love to hear more female opinions with regards to this topic)\n\n[Verse 3]\nStrike a pose and the Hollywood sign lights up\nSo leave your Gods and your politics home cause I don’t give a fuck\nI rep the city that I love the most\nAnd when the sun sets low on the West Coast\nI shine cause I’m nobody’s protégé\nWrite my own rhymes, won’t apologize for what I say\nIn a business that thrives on lies\nNobody gave me a free ride but I still survived\nAnd there was hell to pay so I paid dues\nI took my lumps and I gave a few too\nSo don’t believe everything you read\nThe internet's full of bullshit and those who feed\nOff the negativity like a vulture\nAnd they’ll bleed you dry in this comment culture\nThe need to be famous gave us pop\nAnd watered down Hip-Hop with a booty on top\nPlease stop tryna get that attention\nBecause it’s a movement, don’t mean it's progression\nMy self-expression is progressing with age\nBut I can still remember when women had rage\nOriginality that wasn’t easy to bluff\nAnd now all I see is just image and fluff\nBut “If It Ain’t Ruff” then I’mma say “damn bitch”\nSo listen up! Do I speak a dead language?\nCause I’m a bad witch like Jessica Lange is\nAnd I ain’t here to be cute, I do damage!"}], "artist": "Tairrie B"}