{"songs": [{"image": "https://images.genius.com/def92196a0e23158a8cd127e3dde6217.470x470x1.jpg", "album": "The Hybrid ", "title": "Drinks on Me", "lyrics": "[Verse 1]\nYou got your niece to babysit ya baby\nToes looking right cause early you got a pedi\nYou ain't got a man but you got a baby daddy\nGo out ya way to get drunk at a party every Saturday\nBut who am I to judge, baby? Want another drink?\nTonight give me your brain, you ain't gotta think\nJust let yourself go, tomorrow blame the alcohol\nYou ain't got a job, it ain't like you got a class tomorrow\nFind you a purse to borrow, beats is like your friends\nStart being in thoughts cause the party never ends\nI.D. say 22, shop at Forever 21\nBest friend 30, she's forever 21\nGoing down the same path, take another sip\nPour another glass, take another hit\nI tell you that you're beautiful, your pops never did\nProbably why it ain't a pop around for none of your kids\nSorry for putting out ya biz\nBut right now I can't stop looking at them tits\nAnd grabbing on that ass, filling up the glass\nGet you drunk and fuck you, that's a part of my task\nAnd she really helping, being a real sport about it\nFull cup of Goose, pinch of cran and she allowed it\n20 minutes later, man, she really all about it\n20 minutes later, man, she took a nigga out, kid, drinks on me\n\n[Hook]\nPass the designated driver the keys\nAnd don't worry y'all, drinks on me, so have a toast with me\nBring your I.D. hanging with me\nIt's on my tab y'all, drinks on me, so have a toast with me\nHennessey and Grand Cru for me\nI take a sip and say free Max B, so have a drink with me\nSo don't worry y'all, 'bout no fees\nI said I got it y'all, drinks on me, so have a drink with me\n\n[Verse 2]\nSay my auntie sort of like an alcoholic\nBeen drinking since the teens, shitting blood in the toilet\nStarted real young, nigga pushed the bottle on her\nDrunk, fully clothed in tubs, I cut showers on her\nBut I still love her and I live life for her\nShe ask me for a dollar, I'm gon' give it to her\nStay drinking on the brew, keep a can in her hand\nTied grocery bag full of keystone cans\nAlcoholism has poisoned our city\nLiquor store on every corner ain't like that in other cities\nSo you have a drink, take a hit and pass that\nGive a buck to a wino help him buy crack\nDwell on the past, looking towards tomorrow\nWish I could lend my pain, let you borrow my sorrow\nLive where lil' niggas wanna be Chris Partlow\nSay fuck the lotto, buck's on a bottle, drinks on me\n\n[Hook]", "year": "2010-03-16"}], "artist": "Danny Brown"}