{"songs": [{"lyrics": "[Verse]\nKill JAY-Z, they'll never love you\nYou'll never be enough, let's just keep it real, JAY-Z\nFuck JAY-Z, I mean, you shot your own brother\nHow can we know if we can trust JAY-Z?\nAnd you know better, nigga, I know you do\nBut you gotta do better, boy, you owe it to Blue\nYou had no father, you had the armor\nBut you got a daughter, gotta get softer\nDie JAY-Z, this ain't back in the days\nYou don't need an alibi, JAY-Z\nCry JAY-Z, we know the pain is real\nBut you can't heal what you never reveal\nWhat's up, JAY-Z? You know you owe the truth\nTo all the youth that fell in love with JAY-Z\nYou got people you love you sold drugs to\nYou got high on the life, that shit drugged you\nYou walkin' around like you invincible\nYou dropped outta school, you lost your principles\nI know people backstab you, I felt bad too\nBut this 'fuck everybody' attitude ain't natural\nBut you ain't a saint, this ain't kumbaye\nBut you got hurt because you did cool by 'Ye\nYou gave him 20 million without blinkin'\nHe gave you 20 minutes on stage, fuck was he thinkin'?\n\"Fuck wrong with everybody?\" is what you sayin'\nBut if everybody's crazy, you're the one that's insane\nCrazy how life works\nYou got a knot in your chest, imagine how a knife hurts\nYou stabbed Un over some records\nYour excuse was \"He was talkin' too reckless!\"\nLet go your ego over your right shoulder\nYour left is sayin', \"Finish your breakfast!\"\nYou egged Solange on\nKnowin' all along, all you had to say you was wrong\nYou almost went Eric Benét\nLet the baddest girl in the world get away\nI don't even know what else to say\nNigga, never go Eric Benét!\nI don't even know what you woulda done\nIn the future other niggas playin' football with your son\nYou woulda lost it\n13 bottles of Ace of Spade, what it did to Boston\nNah, JAY-Z\nBye, JAY-Z", "title": "Kill Jay Z", "image": "https://images.genius.com/4cf5f4f88ace021acdc18cc3cefcf2f4.1000x1000x1.jpg", "year": "2017-06-30", "album": "4:44"}], "artist": "JAY-Z"}