{"songs": [{"year": null, "image": "https://s3.amazonaws.com/rapgenius/1365104129_220px-Big_Lurch.jpg", "title": "America", "album": null, "lyrics": "[Verse 1]\n\nI'm loving the plans to conquer the black man until infinity\nBut, still, I can't find a way to reverse the motions or a remedy\nNow, I wish I could find a way to interrupt The White House in assembly\nTo convince the panels that laws are  biased and bogus, and that's my penalty\nWhen I was penalized from the birth, in the ghetto I'm restricted\nWhen all I see is police patrolling my hood and people that's drug convicted\n[?Will I be?] a statistic for the pain the po po, on us, inflicted?\nBy a government flooding the ghetto with crack and putting us in business\nUs [?within?] the minority--overusing seniority\n[?] withing America. They brought majority\nPaying taxes while the ESE's and blacks are slanging crumbs\nMaking 100 billion a year while we look like dum-dums\nIncarcerated, 30,000 a year for prisoners\nOnly giving us 15,000 a year for welfare, can you envision them?\nHypocrisy going on within a society\nI got kids and been in jail for theft, so I can't watch it quietly\nViolently, I'm caught up in this here mass hysteria\nEnemies, I'ma bury ya' starting with the government--America\n\n[Hook]\n\nAmerica, America\nI'm getting sick and tired of this mass hysteria\nWhile we living in this communist society\nAmerica, America\nX4\n\n[Verse 2]\n\nAmerica is the topic\nNo logic is what they using, abusing they power\nAre we free from slavery? It's confusing\nI don't think so\nWe losing our youth while they keep on inducing and enhancing mo' laws--\nWhile they should be trying to figure out a damn solution\nComing in the form of illusion, stripping us of our native tongue\nTaking us from our tribal land, breaking us down and getting us sprung--\nOn material things like $money$\nTaking all the jewelry from the original land of Africa\nEven robbing the tombs of fucking mummies\nThroughout history, his-story, talking about his-glory\nBlack people built the foundations of this land\nWhat you done did for me? Besides po-ver-ty?\nRacism is evident because they covered it up so sloppily\nI'm a king that deserve a throne, and when I get it, they'll be no stopping me\nBut instead I'm locked up for cases like armed robbery\nWe used to be innocent souls, but now we killers like John Gotti\nWe crack babies, but maybe one day we'll overcome poverty\nBut until then, I'm [?] my enemies who got a Glock for me and a plot for me\nPo po's gotta [?load they Glocks fo' me] --Uhhh\n'Cause in the 60's Black Panthers was buried for using they tools\nSo tell me why the fuck we killing up each-other, foo--l\n\n[Hook]"}], "artist": "Big Lurch"}