{"songs": [{"image": "https://images.genius.com/6695d2bb24f7779de6a82b14bfd69716.350x350x1.jpg", "album": "You Can Be a Daddy, But Never Daddy-O", "title": "Nobody Move (Nobody Get Hurt)", "lyrics": "[Daddy-O]\nAh ah I've been waitin and playin the backseat\nWatchin MC's buy rhymes from the swap meet\nNow should another year go by of the worst\nOr do you wanna dibble what the Daddy does first?\nNow if I was blue I'd be the size of an ocean\nKeepin it calm, with minimal commotion\nKinda sorta like the way my rhymes gotta flow\nCause without that flow I wouldn't be Daddy-O\nSo go tell a friend, just who's on your dial\nAnd if takes a minute, then I'll stay a while\nInstead of shootin the gift, I'm bombin with my presents\nWith the knack to make a torture pleasant\nBack to the bass root corn foundation\nAs the funky beat comin 'cross yo' station\nNeed to be alarmed?  Then call the Red Alert\nBut if nobody moves, nobody gets hurt\n\nChorus: Daddy-O\n\nNow nobody move (nobody get hurt)\nNobody move (nobody get hurt)\nC'mon, nobody move (nobody get hurt)\nTell me what you came to see? (Daddy-O doin work!)\n\n[Daddy-O]\nCheck it, folks are consumed by the error\nWho's got the best video, props on stage?  Whatever\nI choose the Fellowship Shop\nCause when I go to rhyme for mine I get props\nAnd most can't cut it cause they think like a dog\nSomebody says, \"Fetch!\" and you're jumpin like a frog\nYou should stop runnin, you're forfeitin the race\nAnd even if you ran you would be in last place\nYou gotta be tasty, just enough season\nWanna be a rapper?  You gotta have a reason\nWanna know mine?  I make a punk wanna shiver\nAnd my flow is like the Euphrates river\nHello hello, wake-up wake-up\nTime to put the rhyme caffeine in yo' cup\nIs it true that poppa got a brand new bag?\nI'm comin with my troops, so raise the flag\nAllies are welcome, foes get crushed\nMainly cause they talk too god damn much\nAbout gettin the skins, and raisin the skirts\nBut if nobody moves, nobody gets hurt\n\nChorus + minor variations (repeat 2X)\n\n[Daddy-O]\nI'm +Flowin in File+ with a bag full of goodies\nTwenty-five deep out in Brooklyn with the hoodies\nSolo creep?  Not unless I have to\nSo until that time, I guess my crew's gonna mop you\nYou see the Ed man made up the track\nMike Ajou, Peace and A.C.'s got my back\nDaoud and Richard take care of engineerin\n'Fore I forget, Richy Hustle does the steerin\nMy brother Kedar, keeps the crew in line so\nThat we can have a good strong and healthy cashflow\nSome say whatever's clever, I say whatever works\nAnd if nobody moevs, nobody gets hurt\n\nChorus + minor variations (repeat 2X)\n\n[Daddy-O] Yeah!\n\n{Yo that kid tryin to run?  WET HIM!  *BLAM*}", "year": null}], "artist": "Daddy-O"}