{"songs": [{"title": "Foreva", "lyrics": "[Intro: Young Dolph]\nHonorable Court\nHey, who is that?\nWho is that right there?\nHey, what's up lil mama?\n\n[Verse 1: Young Dolph]\nShe a good girl but she bad so I'm confused (Damn)\nFuck it, I'ma shoot my shot, got nothin' to lose (Fuck it)\nI said, \"What's up? My name is D\" (What up?)\nShe said, \"Nigga, you lyin', yo' name Dolph\" (Damn)\nOkay, you know me? Then let's go pull off (Let's go)\nJump in this coupe and let's go and get lost (Skrrt)\nTook you to my hood (Yeah)\nBut you was scared (Yeah)\nI started laughin' (Yeah)\nThen you got mad (Hahaha)\nBet you never been with a nigga like me\nDon't give a fuck about bitches, count skrilla like me\nWe started off havin' fun though (For real)\nYou asked me where I keep my gun though (On me)\nUh, I don't wanna talk about that\nWhy that ass so fat ,and why you walk like that? (Ayy)\nI'm just a lil nigga out here havin' it\nAll of my niggas, they savages (Yeah)\nGuess what I did last weekend?\nBitch, I made your boyfriend's salary\n\n[Chorus: Young Dolph]\nShe kept it so real, I fuck with her forever\nShe kept it so real, I fuck with her forever\nShe kept it so real, I fuck with her forever\nFuck with her forever, fuck with her forever\nShe kept it so real that I love her forever\nShe kept it so real, I fuck with her forever\nShe kept it so real that I love her forever\nFuck with her forever, fuck with her forever\n\n[Verse 2: Young Dolph]\nShe kept it so real, I can't say no (Nah)\nBitch real thick like clay though (Shit, bruh)\nI got Hi-Tec in my faygo (Raw)\nHeard you got strippers on payroll (What?)\nNigga I got killers on payroll\nMy lil mama mad at me\nSaid that she don't like the way that I'm livin' (Damn, man)\nShe hate to see cough medicine\nSay she don't like the way that I'm sippin' (Shit, man)\nI was drinkin' this shit 10 years before I met you\nLil mama, you trippin' (Po' up)\nWait a minute, hold up, it's me (Hold up)\nWait a minute, roll up the weed (Hold up)\nWait a minute, roll up my sleeves, uh\nGot a pocket full of blue cheese, ayy\nKickin' shit in the trap like Bruce Lee (Woo)\nWhen I walk in they be like, \"Who's he?\" (Stylin')\nWhen I walk out they be like, \"What the fuck?\" (The fuck?)\nWhat the fuck is that lil nigga drivin'? (Haha)\nAll my niggas, they ridin' (They ridin')\nAll of these bitches be lyin' (They lyin')\nLil fly nigga plus my bitch fly so together we flying\n\n[Chorus: Young Dolph]\nShe kept it so real, I fuck with her forever\nShe kept it so real, I fuck with her forever\nShe kept it so real, I fuck with her forever\nFuck with her forever, fuck with her forever\nShe kept it so real that I love her forever\nShe kept it so real, I fuck with her forever\nShe kept it so real that I love her forever\nFuck with her forever, fuck with her forever\n\n[Verse 3: T.I.]\nLil mama in a Bentley back (Yup)\nPussy nigga hatin', pulled up beside me (Ayy)\nShe pulled out a purse, rolled the window down\nTold the pussy nigga bust a move, ain't shit to try\nStayed down for a nigga on a gun charge (Yup)\nWent to jail with a nigga on a dope case (Damn)\nI told the girl how much I love ya, I'd die for ya\nWouldn't think twice, told me, \"Boy, go pull weight\"\nAnd when I told her ballin' on these hoes, ain't shit to do\n10 million dollars on the crib, all that for you\nWhen you ain't even got to ask me where I'm puttin' my dick\n'Cause odds are you gon' be with me when I'm getting seduced\nYou know, penthouses full of your WCW's\nAnd St. Regis, Four Seasons, Londons, and W's\nAnd Rolls-Royces, Benzes, i.e. BMWs\nSpend that cake if I'm in love with you, hey\nHey you gon' find it hard to get\nSomeone goin' hard at TIP\nBut look where we started at\nCloser where we are, and you a part of that\nAnd apologies if you gave me your heart\nAnd I turned around, gave you a heart attack\nGod damn, I'm a dog for that\nBreakin' up? Came too far for that\nI keep it real though\n\n[Chorus: Young Dolph]\nShe kept it so real, I fuck with her forever\nShe kept it so real, I fuck with her forever\nShe kept it so real, I fuck with her forever\nFuck with her forever, fuck with her forever\nShe kept it so real that I love her forever\nShe kept it so real, I fuck with her forever\nShe kept it so real that I love her forever\nFuck with her forever, fuck with her forever", "album": "Rich Crack Baby", "year": "2016-08-25", "image": "https://images.genius.com/4da68d9619cde669496e970d7f868c65.630x630x1.jpg"}], "artist": "Young Dolph"}