{"songs": [{"title": "Under My Thumb", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Chorus 1: Sample]\nUnder my thumb\nThe girl who once had me down\n\n[Verse 1: brandUn DeShay]\nSo, this is where the story all begins\nJust like most, they started out as friends\nThen things changed\nIt's like the more they talked, the more that he was on her brain\nAs the conversations got deeper\nAnd the meetings more and more frequent\nThen she seen that this could be more\nWhen he caught her alone\nShe wondered where he'd been\nNot your average boy meets girl\nThese two were too perfect to be strangers\nMore like it's Boy Meets World\nAnd they were the real Cory and Topanga\nIt used to be down to him\nThe difference in the clothes he wears\nDown to her, the changes come\nNow she's got him under her thumb\nHe told himself that he would be more of a gentleman than usually\nCause he used to be more of an ass and get more ass but he'd end up losin', see?\nAnd with her, there was no way she'd let that fly\nEven though he was black and attacks would do it\nThere was no way he would let her pass by\nAll because of love, no need to ask why\nI could sympathize for this guy\nCause it's like he only needed one big mistake\nAnd the one that he chose to make:\nMoving too slow when time's at stake\nDidn't let her know how he felt for her\nDidn't let him know how she felt for him\nAnd the way he acted, none of her friends could understand how she felt for him, but\nIt was only a matter of time, she started to see things differently\nThe dumb things he did, the dumb things he said, and consciously killed what was meant to be\nIt was down to me - I mean him - but now she only says \"Hi\" whenever he does first\nNow it's goin' in reverse, the changes come\nBut she still has him under her thumb\nIt's down to her, but that just means that\nIt's up to him to get things on track\nNo longer under her thumb\nShe belongs under my arm\n\n[Chorus 2: Sample]\nUnder my thumb\nWell I, I can still look at someone else\n\n[Verse 2: Marty Herson]\nI'm on the\nCool team, tool means\nThat you do me instead of doin' you\nAnd it's seldom seen creativity\nComin' straight from you, no, please don't fool me\nAnd if he wasn't so busy checkin' me\nHe would've known what was under my thumb\nThe detonation button to her soul and being\nJust by switching my style up\nI used to say \"I thought...\"\nShe would say \"Aha, yeah, you thought like Nelly\"\nNelly thought she was makin' them\nBut a-ha-haha, she was really makin' illy\nNow I don't need to think cause I know I'm makin'\n(?)\nHold up, let me count my ones\nMy fives, my tens, my hundreds\nNiggas see why I plummet\nAnd I land after flyin' coach\nI know I steal my tow\nGucci bags, but this\nMight get you arrested, cause I\nGet it from A-rabs, from Abdul\nAnd Aladdin, I'm baggin' myself up and\nI'm laggin' in that steez department\nThey say, \"Look how the teacher talkin', he gay!\"\nSo go ahead and plug me, okay\nOr you could just bump me a few grades\nUp and I'll get up out of this place\nAnd a few years later\nHollywood would state:\n\"Do you know your way to San Jose?\"\nNo, damnit, still tryin' to find my way\nHome, where I'm from, where I long to be\nHopefully the ears of the red carpet streets won't get a hold of me\nHopefully the ears of the red carpet streets won't get a hold of me", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}