{"songs": [{"year": "2017-05-12", "lyrics": "[Verse 1]\nWhat's up with this faggot?\nFuck is with this nigga?\nWhy is he still rapping?\nHe even wears the fashion\nShould've stuck to makin' pop commercial smashes\nSeriously\nThat's why people don't take you seriously\nThat's why we don't wanna hear nothin' you say\n'Cause you ain't the man that you appear to be\nNo, nigga, seriously\nWe don't wanna hear your conspiracies\nAnd we don't wanna hear your political views 'bout extraterrestrial activity\nLook, nigga, make up your mind\nHow much longer you gon' wait to decide?\nYou was kickin' some dangerous lines\nNow buyin' your shit a waste of my time\nNigga, what's up with you?\nThat's why all my niggas don't fuck with you\nAnd that's why we don't come to your after parties\n'Cause we don't wanna hang in the club with you\nIt's only two type of niggas\nA street nigga and a you type of nigga\nA coon type of nigga\nProlly born with a new silver spoon type of nigga\nA new type of nigga\nA sell out surrounded by wealth\nYou should've been one of the greats\nNow you just sound like everyone else\n\n[Verse 2]\nHello?\nBob, what are you doin'? What are you doin'?\nYou losin' your core, fan base and your viewers\nLet me show you how to flow, show you how to make music\nObviously you clueless, how I know? 'Cause I'm Jewish\nOh, is that unruly? For me to say so rudely?\nWhat if I stand on trial? What if I stand on jury?\nWhat are we on TV? Who's the judge? Judge Judy?\nWhat am I supposed to return all these cars and jewelry?\nLike I don't even know how the flow supposed to go\nLike I don't even know how the show supposed to flow\nLike I don't even know how the beat supposed to sound\nLike I don't even know where the notes supposed to go\nLike I don't even know how my soul's supposed to feel\nLike I ain't supposed to win, like I ain't supposed to glow\nBut you'll never understand the way that I think\nIf you ain't grow up where they sold dope before\nOh, number one draft pick, number one draft pick\nOh, he's nice for a black guy, oh, he's smart for a rapper\nOh, that's who he's with? Oh, she's cute for a black chick\nOh, he's actually cool, I went to school with him actually\nActually, he could've had a masterpiece\nNow it's just a fuckin' catastrophe\nAnyway, get Fitz on the phone\nTell him send it over to mastering", "title": "Fan Mail", "album": "Ether", "image": "https://images.genius.com/6781733c678d3aa14dd4fd2442879421.1000x1000x1.jpg"}], "artist": "B.o.B"}