{"artist": "Pitbull", "songs": [{"album": "M.I.A.M.I.", "title": "Culo (Miami mix)", "image": "https://images.genius.com/90d83bbccc997ee025b43ba0adb70c52.500x500x1.jpg", "lyrics": "(Intro - Lil' Jon (Pitbull))\nYeah, Yeah, Yeah, Yeah, Yeah, Lets go (Let's go)\nRight about now, we need all the ladies to hit the danceflo'\n(Dominicana) If you got a big ol' booty (Cubana, Mexicana)\nAnd you like to set that motherfucker, let's go! (Colombiana) (Boricua)\nPitbull, Lil' Jon, Heey, Heey!\n\n(Hook - Mr. Vegas)\nThe vibe is right and the ladies gettin wild o the dance floor\nAll the girls having fun tonight so move your body from the left to the right\nCause you know you looking good tonight for sure\n\n(Verse One - Pitbull (Lil' Jon))\nPull up to the club, walk in then I\nPull up to the bar, get drinks then I\nPull up to a broad let her know what it is\nHow it is, why it is, what it is, (Hey hey hey hey)\nI ain't got time for no games, I'm hopin' mami that you feel the same\nI got what you need to feel the pain\nHere's my number call me when you're up for an even exchange\nFEEL ME, let me see you do that dirty dance, dirty dance\nMami, feel me let me see you touch your toes\nOr shake that thing and talk wit' your ass\nFEEL ME! all my chicos, all my Jamaicans\n(Put your hands up) all my haitians\nCause they know I'mma rep' 'til the day that they kill me PULL UP!\n\n(Hook - Pitbull)\nEsa hevita esta enterita tiene tremendo CULO!\nEsta tan linda, esta tan rica, tiene tremendo CULO!\nQue rica chiquita, pero que importa si tiene tremendo CULO!\nHas me el favor y meneate chica tienes tremendo CULO!\n\n(Hook - Mr. Vegas)\nThe vibe is right and the ladies gettin wild o the dance floor\nAll the girls having fun tonight so move your body from the left to the right\nCause you know you looking good tonight for sure\n\n(Verse Mr. Vegas)\nWave yuh hands cause yuh dont give a damn\nGirls make noise cause yuh konw yuh got yuh man\nClap yuh hands stomp yuh feet\nAnd a make mi see yuh body rock to di beat\nYuh look neat yuh look sweet\nMi just love off yuh sexy physique\nGet crazy get wild get drunk get high\nTouch the sky touch the sky\nGet nasty we goona party\nWatch di gal dem a shake dem body\nDi whole place under frenzy AAH!\n\n(Hook - Pitbull)\nEsa hevita esta enterita tiene tremendo CULO!\nEsta tan linda, esta tan rica, tiene tremendo CULO!\nQue rica chiquita, pero que importa si tiene tremendo CULO!\nHas me el favor y meneate chica tienes tremendo CULO!\n\n(Vesre Two - Pitbull (Lil' Jon))\nMami got the ass and thighs like Trina and J. Lo\nMultiply it she's off the chain\nOff the glass, off the flip andd\nWith a couple more drinks I'll be off the hip maaayn...\nI'll be wearin' her out and when I'm finished\nParamedics gon' be carryin' her out maaayn... (That's right)\nThe night is young, and if you shave (Hey hey hey hey hey)\nI'll give you some of this mighty toungue heey..\nBe easy, go ahead please me, talk to me sleezy baby (Yeah)\nI wanna freak, a monster in bed, last thing I need is a lady\n\nThe vibe is right and the ladies gettin wild o the dance floor\nAll the girls having fun tonight so move your body from the left to the right\nCause you know you looking good tonight for sure\n\n(Hook - Pitbull)\nEsa hevita esta enterita tiene tremendo CULO!\nEsta tan linda, esta tan rica, tiene tremendo CULO!\nQue rica chiquita, pero que importa si tiene tremendo CULO!\nHas me el favor y meneate chica tienes tremendo CULO!\n\n(Outro - Lil' Jon)\nCulo, hey, hey, hey, hey shake that shit hey\nHey, hey, hey, hey shake that shit hey\nHey, hey, hey, hey shake that shit hey\nHey, hey, hey, hey shake that shit hey", "year": "2004-08-03"}]}