{"artist": "Azealia Banks", "songs": [{"title": "Fuck up the Fun", "image": "https://images.genius.com/3728c37e67817b2557a4c55f90393b99.500x500x1.jpg", "album": "Fantasea", "lyrics": "[Intro: Talking]\nTell him to keep that\nYeah just play the track stop cuttin it off\nAnd lemme-lemme pop my shit\nIt is what it is hehe\nFuck is ya'll niggas doing?\nYou ready bitch?\nWhat up what up whatup?\nYo Yo Yo Yo!\n\n[Verse 1]\nWho want it? Who-who want it?\nWhich nigga little goon gettin' stewed with a onion?\nNiggas all cute 'til the roogs in abundance\nAnd ya dude get to running with the womb in his stomach\nBitch nigga, bitch get ya nigga\nAll these niggas just raw food for the dinner\nAnd these niggas better tuck in their little jewels when I enter\n'Cause your bitch hot nigga finna fuck up the fun\nDon't fuck with your bitch when the rum in her punch\nI might dance on these niggas, but the gun in the butt\nThe gold Jimmy's little mirror little stun in the clutch\nAnd don't slip up little nigga, I'll put the stun in your nuts\nWhat? yo dude 'bout to fuck up your trust\nHe gon' run when I hit ya, put you under the pump\nYou gon' run with your nigga, now you close enough\nTo shoot once in the throat leave ya both in a slump, huh\nGo 'head, go 'head, nigga, pop off\nYou can get your fam and your man's and them shot off\nI'ma get the AMS for ya and blow your top off\nShit funny 'til the gun in your face\nYou better run with your nigga, better open the safe\nYou better come up with the money better show up the weight\nI'm gon' come with gorillas cause I run with the apes\nAnd put shots in your butt like you wanted the cake\n\n[Interlude]\nWord\nMost of ya'll niggas is fucking pussy out here\nLike I’ll smack all y'all niggas in the face\nAll in the mouth and all in the shit\nLike where ya'll nigga's come from?\nY'all niggas is not from New York\nY'all niggas is not dirty\n*Laughing* Where y'all niggas come from?\n\n[Verse 2]\nOk, ok, ok, ok\nBitches better quit that chat\nThese bitches better hold up with the yizzap-yap\nI grips the fifth then click-clizzack clack\nI hate to have to blow your little wig all back\nI mean I hate to have to see you with your wig off, bitch\nI see you tryna come and get on, bitch\nYou gon' trip, slip, fall, land and lick on dick\nIt be the same nigga 'bout to come and lick on this, hold up\nScram, hit the breeze, you a fan, bitch, please\nDon’t slip up in the presence of ya little bambin'\nDon't get it at ya residence and get it so clean\n'Cause I’m sick up with the evidence and bitches won't speak\nAnd we can freak with your man this week\nBad bitches, you a nickel and your pussy game weak, huh\nI'm fickle and my pussy named peach\nI can disappear and let the pussy game speak, huh\nLet the pussy game speak\nNiggas know the center of the pussy stay peach\nAnd these bitches better keep it, keep it going like fif'\n'Fore I reach and that thing go BRRRRRRRRRAAAAAHHHHH!\n\n[Interlude/Outro]\nWhat-what, what-what, what-what\nBRAAHAAHAA, BRAAHAAHAA\nWord, fuck outta here, y'all lil internet ass bitches\nLike, I really do this, niggas is in Tokyo right now\nLike, c'mon, y'all bitches still on the Myspace, on YouTube, tryna get y'all little video views up to a million\nLike, c'mon, y'all bitches not fucking with me\nLike what kind of money is y'all bitches really even getting for shows?\nLike, is y'all bitches even doing shows? Like c'mon\nLike b-, c'mon, y'all bitches is out here tryna like fuck these little rap niggas and fuck these little basketball niggas and shit\nLike, I'm getting this money for real, for real, for real, for real, for real, c'mon now, shit\n\n[Alternative Outro]\nKeep it, keep it goin'\nWho want it? Who-who want it?\nWhich nigga little goon, which nigga little goon-goon\nWho want it? Who-who want it?\nWhich nigga little goon, which nigga little goon-goon", "year": "2012-07-11"}]}