{"songs": [{"title": "Interlude 5", "album": "MTV Unplugged 2.0", "year": "2001-07-21", "image": "https://images.genius.com/223n7ezbshqosz0dhiz8hrmkd.500x500x1.jpg", "lyrics": "You all doin’ alright?...You ok?\n*claps*\nI’m not screamin at ya, I’m just askin you a question. Y’all givin’ me a clap.\nA yes is fine (laughing) ok?\n(voice from audience “I love that song”)\nThank you. Praise God.\n\nI tell you, I know everybody’s in the same mess. I’m telling you.\nWe all are.\nI, I, I know that, you know...\nand I’m just, you know, I’ll be the first to tell you, you know,\nI’m a mess and God is dealing with me everyday. And everyday I’m trying, you know, how I can be less of a mess. Cuz you know, he showed me, Look Lauryn, you know, You’re the problem, ok, I’m going to show you how you’re causing the problem, and now I want you to be the solution. And that’s what all of these songs are about, just, problem, cause and solution. Free your mind.\n\nIt’s like, we all think that the gospel is join and church building, and that’s deception, you know.\nThe real gospel is Repent, which means ‘let go of all that crap,’ that’s killin’ you.\nLife was supposed to be a pleasurable experience, not this torment, you know.\nAnd when I realized that I was tormenting myself, it was about my lust.\nIt wasn’t about things that I needed it was just, you know, all these security blankets. I mean, the more I acquired I became more of a prisoner. I mean, you know, forty people on staff, and you can’t do nothing, and now creativity is impossible because all you can think about is all these folks that you know, you’re supporting and carryin’ and you know, it’s not good. You know, everybody…\na friend of mine says that every tub has to stand on it’s own bottom, you know. And in that respect, we all get to do what our passion is.\nSee , that’s what praisin God is all about, is doing your passion.\n\nYou know, it’s not useless, worthless ritual, you know, monotonous ritual, where we just show up and can’t wait to see the game, you know. It’s doing your passion and fulfilling your passion. You know.\nThat’s how we’re thankful. That’s how we say we appreciate the opportunity to be alive.\n\nAnd I’m just glad that I, you know, I don’t have to slave anymore. You know, cuz I, music was my love, and because of everything I thought had to accompany my music it became my burden. It just got stolen from me. I said, What is this? How did this thing that I love so much so easily and so quickly turn to something I loath and hate?\nAnd so now, you know, I understand that it was because I was measuring myself or trying to compare myself to a standard that wasn’t reality. It wasn’t the standard at all, you know. T\nhere’s a scripture in the Bible that we, what does it say, it says ‘We compare ourselves amongst ourselves’ you know. That’s not the standard. You already are the standard. What are you trying to fit into a standard for? We were each created to be individual standards, you know. And we’re trying to fit into a standard? It doesn’t make any sense, you know.\n\nSo now I’m just, you know, after all that, I’m just ready to be me. And it’s a lot to work through, you know, because all of us have hidden in these little boxes purposely, because of parts of ourselves that we were unhappy about. And it’s because we didn’t understand, you know, because there’s all this social doctrine that says, you know, that\nThe infinite God, with all this expression,\nwho created every single one of us,\nabsolutely different,\nOn purpose,\nwants everybody to fit into the same suit.\nBut like, you know, that’s deception.\nThat’s deception.\n\n(Talking to someone offstage) Ok, let me just, I think this is the wrong one (laughing) I don’t think this is the right one.\n\nWe took…we were in, um, Florida this weekend and we took the kids to Disney world, and um, you know we were going, they gave us a tour. They escorted us through the back. And when they escorted us through the back, we got to see how, you know, there all these people workin all hard, and it was like, real dirty back there, and of course, in the front it was all immaculately clean.\nAnd I said, I said, you know, People need to see the reality, they need to see, you know, how these people slave to maintain this illusion.\nAnd it felt like my life. I said, If people only knew what it was.\n\nIt’s like, you know, a bunch of musicians, listen, bustin’ their ‘mm’ workin all hard to make it look easy. What’s the point? You know, Oh, uh, I just threw this together, uh…(audience laughs).\nYou know, it’s like, you know what I’m sayin?\nI mean, you know.\nSlaving.\nSlaving to act like, you know, I wake up like this. And none of us do, you know, none of us do.\nNone of us do.\nAnd reality is good cuz that means everybody could just exhale, let your belly out, you know, and chill. You know. But people get mad at me when I say, Look, let’s stop frontin’. And I’m saying, you know, that’s the blessing.\nNow we can go around and look at each other and say, Oh, you got one too?!\n\nAnd be free.\n\nAnd we want to defend the curse. I’ll tell ya, that was not fun. Did it for a long time...\n\nToo long.\n(offstage) You didn’t find it? It’s another white one. But you see…in my purse. Or the, the other bag? Or the green one? Ghetto. You know, it’s reality, ok (laughing)?\n\nOne time, it came to me, you know, I was just told very concretely.\nYou know, it was like that voice, the right one, said to me,\nhe said, Lauryn, You know the real you is more interesting than the fake somebody else.\nI just want you to know that.\n\nBecause we always thought we could get, you know, we could get reality by just putting on the clothes and wearin’ the face and you know, lookin hard in the video. But, you know. Reality is..it’s like I’ve always told to my husband, it’s like, look, you know, we look at Bob Marley, you know, and we say Ok, let’s just grow locks and wear the clothes and have the band and we have no many idea how many years of struggle and pain and suffering that made that content. You see what I’m saying?\n\nYou can’t get it from the outside in. Truth is from the inside out.\n\nYou know, and the way we’ve been trying to heal and be healed is with these topical, surface, superficial, temporary solution. And I’m telling you, true healing is from the inside out. You know, we’ve been told to protect our outer man while our inner man is dying. (offstage) Oh, this is the one.\n\nBoy I’ll tell ya, God made him for me. I’m something to put up with. And to endure that is amazing. I’ll be the first to tell you, trust me. Y’all could clap cuz that’s some real work (more clapping). I was in there in the room, you know, before we came out here, and he said to me, I said, Ro should I change? And he said, Yeah. So I looked at him, I said, Why did you tell me to change I was comfortable, man. But I asked him the question. So I went in the room and I tried on all these clothes and I was like, I feel like an idiot. So I pulled out all these clothes and I’m sayin, ok Ro, you know, Pack the bag neatly, you know, Could you put the clothes back in? And he’s like, Alright. So he’s trying to do this but then I’m like, No! Now take this out! Now put that back and take that out! Put that back, hold that, take, that, put, The orange shoe! The orange shoe! So I’m like. And then after awhile I just said, Ro baby, could you leave? Please get out the room. And I just put back on the clothes I came in. Ok, I was like…I’m just not there anymore. Nah, I’m telling you. It’s like, uh (laughing). Hey you know he’s learned. Because before we used to just beef and now he’s like, Okay…I’m out. It’s real. God gave us a brand new relationship, man, I mean, one in truth, you know.\n\nIt’s like, we date people, like let’s say, you know, we’re interested in somebody and we put on the perfume and dress up and then we do things that we will never ever ever do again! You understand what I’m sayin? It’s like…And that’s why so many marriages end up in divorce. It’s because people wake up next to a stranger.\nThey say, Who the hell are you? What are you doing in this bed?\nWhere’s that man that used to do ‘du, dua, and du.’\nAnd I’m sayin let’s give them reality from the door because: you’re going to attract love,\nand the one that really loves you. And then you don’t have to pretend and falsify, and you know, keep that posture.\n\nYou know, you know, I can’t, I’m just like...I’ll never forget when I first met him I said to him, it was like, he saw me eating in front of him, and he told me, he was like, You eat like a man, you must not like me. You know, because, women, usually they keep that posture. And I said, Nah. I said it’s not even that, you know. It’s but, this is reality. This is, you know, and that’s it, man, I mean, I’m just telling you, it’s so wonderful to finally find…\n\nAnd trust me, it’s a work in progress, it’s not something that happens overnight.\nWe all have to be introduced to each other.\n\nI’m telling you, I know that I’m up here and you see, Lauryn Hill, you came to see Lauryn Hill.\nBut this is the first time y’all meet me. You see what I’m saying? Don’t think you met me before, ok. And as I grow, you’re going to meet me a little bit more. You’re gonna be exposed to the real me a little bit more. I can tell you I had to reintroduce myself to everybody I know. My mother my father. Listen, y’all never knew me. I want to introduce you to me. I’m just getting to know me. And you know what, anything that’s not growin' is dead, so we better be changing.\n\nYou know, people would say to me, they would hold me hostage. And they, seriously, emotionally hostage, and they’d say, Uh, she’s changing. The money’s changing her. And I’d say Listen, the money’s not changing me, God’s changing me. I’m changing, because that’s a natural part of life. We’re all supposed to change. Who wakes up and is the same way tomorrow and the day after that? Nobody is. Let the experience teach you and be real, man.\n\nAnd, um..there’s gonna be warfare involved. Because there’s some people who prefer deceptions, see. They say, uh, I don’t like this new expression, and I say, what, you want two-thirds of me to stay outside? I’m a whole person. You can’t say, you know, two-thirds of Lauryn, come in here. Only two-thirds is acceptable. I’m a whole person. You know. And that’s everybody.\n\nYou always talk about spiritual warfare and we didn’t realize that it was in relationships. It’s emotional warfare. Being able to tell the people we love the most the truth about ourselves. And when they say, Hey that doesn’t fit into our box for you, we say, well, I ain’t in no box. Don’t try to put me in one.\n\nI’m going to play a little bit of guitar with this one, but I might stop it’s cuz I really want you to listen to the words, so if I stop, you understand why. I want you to really hear the words…"}], "artist": "Lauryn Hill"}