{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Lullaby", "image": "https://images.rapgenius.com/5298ec56701f146bbcdea1f9633a0021.500x500x1.jpg", "lyrics": "[Chorus: Tori Kelly]\nAll the times I have laid in your light\nWhen your love kept me safe through the night\nAll the time, I was sure you were mine\nAnd before time demands our goodbye\nCan you sing me a last lullaby?\n\n[Verse 1: Professor Green]\nIt's been a while since I last dreamt\nBarely remember what it's like to dream\nFinding it hard to get to sleep, too stressed\nAnd there ain't anyone to sing a lullaby to me\nPretend shit doesn't get to me\nAnd I suffer in silence when I'm hurting\nA man's problems are his own\nAnd it's my burden\nTossing and turning, trying to get to sleep\nBut I find it hard to switch off when my mind's working\nI ponder on things I shouldn't bother with\nOff the rails, my train of thought's wandering\nSick of pretending to be so happy\nAll the while my anxiety eats away at me\nMy skin crawls, I look up to the sky\nAnd it falls, the walls close in and it's\nAs if all the good in my life disappears\nIn an instant, happiness is so distant\nSo seeing the ones who I love, the ones who love me\nBut I don't wanna tell em how I feel in case they judge me\nIt's just me, wish I could let somebody in\nBut I ain't ever been too trusting\n\n[Chorus: Tori Kelly]\nAll the times I have laid in your light\nWhen your love kept me safe through the night\nAll the time, I was sure you were mine\nAnd before time demands our goodbye\nCan you sing me a last lullaby?\n\n[Verse 2: Professor Green]\nI've barely had any sleep when I get up\nSick of all these nightmares and these night terrors\nLike it's only when I'm leathered that I sleep better\nMight sleep better when I get up, I'm weak\nIt just makes my day harder, I wonder if\nIt would've been any different if I had a father that I knew\nCould it have helped shape the way that I grew?\nBut the point of things I never have went from\nBeing a reason for the things that I do\nTo just being an excuse that I'd use\nI've gotta take responsibility for the things I do\nFind something other than negativity for my fuel\nBut I feed off it, even when I don't seem bothered\nI hide everything that's going on inside\nGuess it's been a while since I've been honest, I need help\nBut I deny it and even lie to myself like I'm fine\n\n[Chorus: Tori Kelly]\nAll the times I have laid in your light\nWhen your love kept me safe through the night\nAll the time, I was sure you were mine\nAnd before time demands our goodbye\nCan you sing me a last lullaby?\n\n[Bridge: Professor Green]\nI just wish someone would tell me it would be OK\nBut pessimism leads me to believe that it won't\nTo see even a glimmer of hope in the darkness\nIs hard and depression is a slippery slope\nI don't wanna do what my dad did with a rope, though\nSo I carry on even though it's hard to\nThe only thing that's definite is death and things always change\nAs long as you give em a chance to\n\n[Chorus: Tori Kelly]\nAll the times I have laid in your light\nWhen your love kept me safe through the night\nAll the time, I was sure you were mine\nAnd before time demands our goodbye\nCan you sing me a last lullaby?\n\n(Can you sing me a last lullaby?)\n\n[Chorus: Tori Kelly]\nAll the times I have laid in your light\nWhen your love kept me safe through the night\nAll the time, I was sure you were mine\nAnd before time demands our goodbye\nCan you sing me a last lullaby?", "year": "2014-09-14"}]}