{"artist": "Westside Gunn", "songs": [{"year": "2017-10-31", "lyrics": "[Intro]\nBoom boom boom boom boom boom boom boom boom boom\n\n[Verse]\nAyo, Just Don Wolverines like I play with Webber\nCrossover Fieg Pippens with the leopard\nNext at the microwave floor, we 'bout to chef up\nGet the sales off, call me [?] and some ketchup\nScarface Supremes, [?], niggas lickin'\nI flew off the pitch to hit a fiend, [?]\nCactus triple beam on it, I mean\nFour-door Ferrari, money green\nGot my courts, beat the feds while I'm still on tour\nBaggin' up dimes, had the MAC on the floor\nChine Gun is my shepherd, loaded Desert\nAnd for the record, I be the flyest nigga of all time\nMore grime smothered my walls, more violence\nCookin yay on the gas stove, lit pilots\nRaf parkas, Balenciagas makin' me look taller, ah\n\n[Hook]\nI'm off the top rope, like Finn Balor\n(Y'all niggas fucking know better)\nI'm off the top rope, like Finn Balor\n(Ain't nobody fucking with me, Lord, you niggas know that)\nCame off the top rope, like Finn Balor\n(Fuck you niggas, the fucking king of this shit, niggas)\nI'm off the top rope, like Finn Balor\n(I make more money off one fucking shirt than you niggas ever have in your fucking life)\n\n[Outro]\nYou niggas is bums, you hear me\nLet y'all niggas live, man\nI doubt any of you niggas gon' live long though\nYou know what happen when niggas disrespect me, right?\nHuh?\nLook in the fucking mirror\nJust look at your fucking self, you a fucking bum\nFuck you got on, nigga?\nOld ass Giuseppes and shit\nThese niggas don’t fucking rock Giuseppes, nigga\nI don’t even wanna f-\nListen man, listen man\nJust do, just, just chill out, b\nI got love for niggas, man\nI want the best for niggas, man\nBut see who hiring out here, man\nGet y’all some n-\nGet y’all some fucking jobs or something\nRapping ain’t it, man\nNiggas made a thousand fucking songs, man\nStill fucking broke\nI’m on tour, nigga, I’m making it-\nListen man\nI gotta show tomorrow, a show the day after that\nA show a day after that, a show the day after that\nAnd a show the day after that, motherfucker\nHitler 5, nigga", "image": "https://images.genius.com/338424eb8e4925ae359b7f4cfadc9dbb.500x500x1.jpg", "album": "Hitler Wears Hermes 5", "title": "FINN BALOR"}]}