{"artist": "Angie Martinez", "songs": [{"title": "Take You Home (Just Blaze remix a cappella)", "image": "https://images.genius.com/439f66679a994188cae23c6858565d8a.438x438x1.jpg", "album": null, "lyrics": "I got a call from my girls around eight about that Friday spot\nRound 12 hit the highway stop, I need gas\nCar behind me on my ass, speed pass\nTurn the radio on that's my joint got me and I need to dance\nPull up in the truck and it ain't my man's\nYou screaming \"hey yo\", you don't got a chance\nSon, you are speaking a language I don't understand\nKnow the dude I hang with, I don't hold his hand\nCause, me, I'm free to choose\nIt's possible to leave with you\nWhen we get through, I drive passenger seat for you\nLet's ride\nAt one I arrive\nWalked past the line\nDamn his ass is fine\nSome guy now we up in the spot\nWatch\nPlace hot\nCouple of bottles champagne popped\nAnd that's how we doing it now\nI'm scheming while the DJ's moving the crowd\n\nChorus x2\nI was wondering if I could take you home\nWould ya still love me baby, if I could take you home\n\nIt's around 2 A.M\nThe mood is trend\nThe club is snug\nI see him watching, love is love\nCaught him when I looked up, gave him a glance\nPromotion chick walked over while I'm shaking her hand\nI'm looking over her\nSorry but I'm waiting for this man\nIs what I told her, so she could leave\nNo breaking up my plans\nNo time for talking about shows\nOr dates that I could host\nDamn, he walking over to me, they breaking out the jokes\nMy girls laughing\nThey see me already imagining\nHe whispered in my ear, would I dance with him\nI answered him\nHe took my hand with him\nDancing close\nI turned around and gave him my back, he passed a smoke\nHe put his hand on my hip, then my stomach\nHe must want it\nAnd I was really just 'bout to leave, his clique fronted\nLike they don't see\nThat they man 'bout to tell 'em peace\nAnd to think, I wasn't even gonna go out..see?\n\nChorus\n\nAll I need is my lip gloss, I.D., gum, and I'm straight\nEspecially if it's Envy in bungalow eight\nWe making it hot on the dance floor today\nBut my girls wanna leave cause there's nothing to take\nNothing to meet\nSpot dead, nothing to see\nThen we all agree that we won't leave\nCause some spots the papi's still come at three\nThat's when I tell the DJ to run that please\nHe dancing behind me\nI feel what's under his jeans\nAnd I had one too many so I'm under his scheme\nI mean I'm cool and the gang\nThe music is playing\nThink I found what I'm looking for, no purpose in waiting\nAlmost time for breakfast\nStanding by the coat checkers\nLooking for my parking lot ticket...that's it\nAnd this night just ended\nCan't say with who, what, or where but it'll definitely be remembered\n\nChorus\n\nWould you be my boyfriend?\nFor tonight only\nWould you be my boyfriend?\nFor tonight only", "year": null}]}