{"songs": [{"image": "https://images.genius.com/8ab5eeecff25b17cb0aada47b6f1cc02.600x600x1.jpg", "lyrics": "[Verse 1]\nIt's friday night and all I wan't to do is relax\nThe week was so hard it almost made my knees crack\nI'm trying to read on the couch in my sweats\nTill my cellphone vibrates and I get a text it says\n\"What's up dude this is Chris come and meet us\"\nI said na man I'm just realizing with my feet up\nHe said \"dude, it's Joe's birthday party, there's girl's here wetter than the mermaid Barbie\"\nI thought to myself \"geez, hum, think, I guess it's not a crime to only have one drink\"\nEven though it's kinda risky I got dressed quickly, drove to the bar and ordered up a shot of whiskey\nThen I got another shot of whiskey\nThen I accidentally got like ten more shots of whiskey\nTwo martinis and a couple cold lagers, and finally a shot of goldschlager\nHow disgusting\nWoke up the next morning on my carpet with a turkey sandwich smashed in my armpit\nI swear to god I was this close to crying it hurt, I needed water I was dying of thirst\nI fucking screamed\n\n[Chorus]\nI'm hungover, and I ain't gonna drink again\nUntil the night when I see my friends, until the night where we do it again\n\n[Verse 2]\nPopped two Advil, my head hurt like I got punched by the greatest boxing champion from [?]\nI turned off my cellphone, turned on the TV like \"ahhh i'm gonna take it easy\"\nFor real though I'm staying in tonight, my brain is really sore, but all of the sudden I heard a banging on the door\nIt was my friend Matt, and he was with a couple cute bitches, and I was like \"yes! I love cute bitches\"\nCome to the kitchen, lets have a couple light Buds next thing you know my freaking living room's a night club\nBoulevard beers with some Xanax bars, we even shoveled snow with my Amex card\nWoke up the next morning on my couch with the taste of Makers Mark in my mouth\nI swear to god I was this close to crying it hurt, I needed water I was dying of thirst I fucking screamed\n\n[Chorus]\nI'm hungover, and I ain't gonna drink again\nUntil the night when I see my friends, until the night where we do it again\nI'm hungover, and I ain't gonna drink again\nUntil the night when I see my friends, until the night where we do it again\n\n[Verse 3]\nYo, I can't drink like I used to, either that or I don't choose too\nBut when I do dude I get so drunk that it looks like I'm talking to myself like a person with a Bluetooth\nAnd I be slurping on that Deuce-Deuce, never Vodka and fruit juice, man none of that stuff\nJust give me a tall boy of PBR I gave a whole can CPR like \"breathe goddamnit!\"\nCheck this, last week we partied so late that we went and got breakfast\nThen I sent a text message to my ex-bitch telling her she looked like precious\nThen I broke into her Netflix!\n\n[Chorus]\nI'm hungover, and I ain't gonna drink again\nUntil the night when I see my friends, until the night where we do it again\nI'm hungover, and I ain't gonna drink again\nUntil the night when I see my friends, until the night where we do it again\n\n[Outro]\nWhy does every sing weekend gotta end up like this? goddamnit!\nI'm always like \"I'm not gonna drink tonight, I'm gonna take it easy\"\nNext thing you know I'm at Denny's eating something greasy\nMac Lethal, Seven, we out", "year": null, "album": "Postcards From Kansas City", "title": "Hungover"}], "artist": "Mac Lethal"}