{"songs": [{"lyrics": "[Acyelaone-Talking]\nFuck is up? What's happening?\nYo, tell you a fucking story\nTell you a fucking story\n\n[EL-P]\nHere we go, huh!\n\n[Aceyalone-Hook]\nOnce upon a time in a city called Shit\nLived a man named \"What The Fuck?\"\n\n[EL-P]\nHe used to clown around with his dick in the ground\nAnd one day his dick got stuck\n\n[Aceyalone]\nHe was kicking and screaming and yelling\nAnd cussing and asking everybody for help\n\n[EL-P]\nThen he ran into a man named \"Fuck You Too\"\nAnd he told 'em he should help himself\n\n[Aceyalone]\nHe was so frustrated with his dick getting grated\nAnd he had no one to call\n\n[EL-P]\nThen he gained control and climbed out the hole\nMotherfuck, he barely save his balls\n\n[Aceyalone]\nNow every time I think about \"What The Fuck?\"\nI think about you\n\n[EL-P]\nAnd how he changed and took the pain\nWhen he ran into \"Fuck You Too\"\n\n[EL-P]\nHey yo peel the fuck out\nPop the clutch, weave through the traffic, backwards once\nStraight from the wastelands, modern luck\nTainted, baked in hate and hot sun\nIt ain't the same when I murk the certain\nBump the whip trunk, alert: trucks swervin'\nWe play the game like bitch curtains\nAnd Ace in a hole like..\n\n[Aceyalone]\nYou talk nervous!\nMy mind is filled with a thousand kills\nWhen no-good MC's come face these skills\nPop the peel, bug the fuck out, brake the fuck out\nWhen I grab that steel\nThe neutralizer, the equalizer, meet the heat miser\nBurn your high riser\nRoof's on fire and so is the first floor\nKeep sticking you, till it don't hurt no more\n\n[EL-P]\nI've seen modern thugs with a virtual headset\nProgram martyrdom for those who ain't dead yet\nAnd yet dead vets turn and earn bed rest\nSick of how murdering men became trend set\n\n[Aceyalone]\nNuts and bolts, programs and gears\nAnd shots and targets when hands get clear\nTry to play brave from a bottle of beer\nBut you can't play hero if your cape says \"Fear\"\n\n[Aceyalone and EL-P]\n[EL-P:Man]Fuck you too!\n[EL-P:Fuck]Man, fuck you too!\n[EL-P:Come on!] Fuck you too! [EL-P:Come on!]\n[El-P:Matter fact] Fuck your whole crew!\n\n[EL-P]\nWelcome to the circus of stars\nSit down! My reach collapse rats, fractured clown!\nI was wild with a style before your recording\nAnd smiling to hell with born from pure mourning\nIn the morning, it's napalm glory\nThe city's on fire but I can't stop warming\nSick with the vision of bliss and wild burners\nStick with admission I'll split you lips\nWarning!\n\n[Aceyalone]\nThey wanna jump into the battle and earn their respect\nWell get the fuck up! Let me cash this check\nI'm still on deck with a mouth full of poison\nSpitting at you and your crew and your boys and\nRain on parades, leave stains on the blade\nI came with the raid and I'm leaving with your head\nI walk home alone from the terror dome\nFULL! Because hungry wolves need to be fed\n\n[EL-P]\nYo, I punch throats and punch the clock\n(There's) sharks in the moat and landsharks with Glocks\n(Where) cops and kids bust shots not to live\nBitch shut your barf box and talk to the fist\n\n[Aceyalone]\nMarksmanship and the parts don't slip\nYou marks get lit up and hit up so quick\nIt's dark in the pit you betta watch what you do\nFuck you motherfucker!\n\n[EL-P and Aceyalone]\nFuck you too!\n\n[Aceyalone-Hook]\nOnce upon a time in a city called Shit\nLived a man named \"What The Fuck?\"\n\n[EL-P]\nHe used to clown around with his dick in the ground\nAnd one day his dick got stuck\n\n[Aceyalone]\nHe was kicking and screaming and yelling\nAnd cussing and asking everybody for help\n\n[EL-P]\nThen he ran into a man named \"Fuck You Too\"\nAnd he told 'em he should help himself\n\n[Aceyalone]\nHe was so frustrated with his dick getting grated\nAnd he had no one to call\n\n[EL-P]\nThen he gained control and climbed out the hole\nMotherfuck, he barely save his balls\n\n[Aceyalone]\nNow every time I think about \"What The Fuck?\"\nI think about you\n\n[EL-P]\nAnd how he changed and took the pain\nWhen he ran into \"Fuck You Too\"", "title": "City of Shit", "album": "Love and Hate", "image": "https://images.genius.com/8aabb2266f1dc21cbed33421bd2b76e2.220x220x1.jpg", "year": null}], "artist": "Aceyalone"}