{"songs": [{"image": "https://images.genius.com/db53bad96e691f9ab9aec5c0405e2fc5.375x375x1.jpg", "lyrics": "[Intro: Mac Miller & Tay Walker]\nAlright, you ready?\nBouta, yo Tay, I'm bouta mothafuckin' rap\nCheck these raps out baby\nYou wanna see some raps\nDo that shit\nOkay, (laughs hysterically)\nOh my goodness\nAlright let's go\n\n[Verse 1: Mac Miller]\nOkay, chilling for an hour, smoking weed, watching Worldstar\nBenz in the garage, probably gotta drive your girl car\nYou ain't a rapper if my homies never heard y'all\nI just spit a punchline, smile then they bird call\nHit your sister in the face with a Nerf Ball\nI'm dealing with some shit that really don't concern y'all\nPunch a fan if you get a fucking word wrong\nI'm wavy, giving you some shit that you can surf on\nFinding me a bitch I can swerve on\nFrank Thomas homie, 'bout to put the hurt on\nYour bitch a night light in bed, she turned on\nRoll some weed, tell her burn one\n\n[Hook: Mac Miller]\nBurn one, burn one, burn one, burn one\nBurn one, burn one, burn one, burn one\n\n[Verse 2: Mac Miller]\nOkay, I used to give a fuck about success\nNow I just want to see Mila Kunis undress\nHope she down for buttsex, it will be a cum fest\nFUCK! Sorry that's some shit I had to confess\nCrazy-ass bitch doing 911 threats\nCame in the game smoking Newport Hundreds\nNow I'm at the top and the crown fit, gold on my outfit\nSurrounded by this pussy, I'mma drown in it\nGot that wet pack, bitch come and give me that\nYou know we want to know where them titties at\nGot 'em gassed, they be asking what I'm cooking with\nHave your little brother ask your moms what a pussy is?\nCorruption, stunting at the function\nYour girl pussy smell like Sour Cream & Onion, woo\nPay attention, you'll learn something\nRoll that weed up, burn one\n\n[Hook: Mac Miller]\nBurn one, burn one, burn one, burn one\nBurn one, burn one, burn one, burn one\n\n[Outro: Mac Miller & Crowd]\nPut your motherfuckin hands up!\nEverybody put your hands up!\nEverybody put your hands up!\nPut your motherfuckin hands up!\nOkay okay, when I say Saint you say Louis!\nSaint!\nLouis!\nSaint!\nLouis!\nWhen I say Mac y'all say Miller!\nMac!\nMiller!\nMac!\nMiller!\nSay hell yeah!\nHell yeah!\nSay hell yeah!\nHell yeah!\nSay do that shit do that shit do it!\nDo that shit do that shit do it!\nWhen I say thank you, y'all say Based God!\nThank you!\nBased God!\nThank you!\nBased God!\nWhen I say thank you, y'all say Based God!\nThank you!\nBased God!\nThank you!\nBased God!", "year": "2013-12-17", "album": "Live From Space", "title": "Bird Call (Live)"}], "artist": "Mac Miller"}