{"songs": [{"album": "Below Paradise ", "image": "https://images.genius.com/21eb413b37360c4ff2074e95f89b8fa4.1000x1000x1.jpg", "year": "2014-05-27", "title": "Paradise", "lyrics": "[Verse 1: Tedashii]\nThe day that we met I tell you no lie\nI'll never forget, it's stuck in my mind\nYea, a love so real it brought tears to my eyes\nDidn't care who was around, couldn't keep it inside\nAll my feelings on the real, man I’m lettin' ‘em show\nSharing this straight from the heart and I’m lettin’ it flow\nAnd anybody askin' questions I’m lettin' ‘em know\nAnd if they hate it, can’t embrace it then I’m lettin’ ‘em go\nMy heart was broken till you rode in and made it alright\nEvery word lifts me higher, it's like I can fly\nBut your words keep me grounded, I'm down for life\nAnd if you say we need to get it I ride tonight\nAnd yea you never hear me say that I’m leavin'\nAnd there is no one else I want so please believe me\nAnd don’t you ever leave me, I know you never will\nLife wouldn’t be the same, or remain, be sustained, it would change\n\n[Hook: Tauren Wells]\nWhat's paradise, if you're not there?\nWhat's paradise, with nobody to share?\nCause I could have it all, but I don't care\nIf I don't have you\nThen what's the point of paradise?\nParadise (x3)\nNo (x6)\n\n[Verse 2: Tedashii]\nWhat this is doesn’t work without you\nIf you’re not there then I don’t wanna be too\nI need you, more than I want you\nI want what you have\nThis thing is forever, I’m down to make it last\nBut forever’s no endeavor\nIf you’re not there with me to share it worth havin'\nIt’s drab, lacks compassion, couldn’t bear it\nI want you all the time and I\nCouldn’t handle it if you are not around\nSo I'm spendin' all my time to get to know you\nReadin' all your love letters to feel closer to you\nWhen I’m distant, you persistent, you pullin' me through\nI wouldn’t make it, like creation, not talking to you\nMe with you, now that’s an upgrade\nEvery time you step on the scene, I get upstaged\nBut you deserve that, right on the front page\nI tell 'em all, don't sleep so I be up late\n\n[Hook]\n\n[Verse 3: Tedashii]\nI could never be without you\nLead without you\nI come alive but you couldn’t breathe without you\nWhatever you need, best believe I got you\nI’ll see you in paradise\n\n[Hook]"}], "artist": "Tedashii"}