{"artist": "50 Cent", "songs": [{"album": "Animal Ambition: An Untamed Desire To Win", "image": "https://images.genius.com/dd7d8d12ad309874d7cb65201c53e320.640x640x1.jpg", "title": "Irregular Heartbeat", "lyrics": "[Produced by Medi and G Rocka]\n\n[Chorus: 50 Cent]\nNigga, you pussy, you scared\nI can hear your heartbeat\nWhy the fuck would you come around here?\nI can hear your heartbeat\nYeah, you know a dog sense fear\nI can hear your heartbeat\nYou bark while we bite around here\nI can hear your heartbeat\n\n[Verse 1: 50 Cent]\nWe ain't cut from the same cloth, we into different shit\nI want the bread, you want the bitch\nCome out your mouth slick I'll get you hit\nMy niggas hungry, they hit a lick\nFuck who you're with, niggas'll dump a clip\nWe by the school yard waiting for you to get your kid\nI caught a A1 felony on my last bid\nKept calm, made bond, I'm on that shit\nYou think my rap shit a gimmick, I ain't seen parole in a minute\nTruth be told these niggas is hoes\nOnce the shit set off, man, anything goes\nThrough the windows of your soul, the eyes never lie\nIf you ain't scared to die, nigga, why would you cry?\n\n[Chorus: 50 Cent]\nNigga, you pussy, you scared\nI can hear your heartbeat\nWhy the fuck would you come around here?\nI can hear your heartbeat\nYeah, you know a dog sense fear\nI can hear your heartbeat\nYou bark while we bite around here\nI can hear your heartbeat\n\n[Verse 2: Jadakiss]\n30 something and you ain't never open your mouth yet\nSocial media is giving cowards an outlet\nSee him in person, say something, I doubt that\nRather get caught with it than get caught without that\nTrying to back peddle and stumble on the curve\nYou stayin' at the ground, you mumblin' your words\nLiterally I can see your heart pumpin' through your shirt\nPussy your whole life, you always been a bird\nScared for so long it's all up in your nerves\nScrew 9-1-1, you probably call up the reserves\nAnd I'm killin' you first, if we ever do a purge\nAnd you know what it is, kid, whenever we emerge\nAnd I'm tragical, traumatical, no match, incompatible\nNigga, you vaginal\n\n[Chorus: 50 Cent]\nNigga, you pussy, you scared\nI can hear your heartbeat\nWhy the fuck would you come around here?\nI can hear your heartbeat\nYeah, you know a dog sense fear\nI can hear your heartbeat\nYou bark while we bite around here\nI can hear your heartbeat\n\n[Verse 3: Kidd Kidd]\nMoney for bail, money to bail\nDead or in jail, Heaven or Hell\nFEDs on my coat tail, snitches given court tales\nKept fate when all hope fail\nNiggas rattin', all they missin' is the tail like Mickey Mouse\nCall me Mickey Mantle when I bat you in the mouth\nI bring them hammers out, we ain't trying to build a house\nNiggas on them songs rappin' shit they ain't about\nI'm from the N-O, we don't scrap, we bang it out\nBang, I'm the one that came in your house for the chickens\nLeft a nigga brains hangin' out like we chillin'\nStankin' like shipments, over my shillings\nUp your security, Rida gang in the building\n\n[Chorus: 50 Cent]\nNigga, you pussy, you scared\nI can hear your heartbeat\nWhy the fuck would you come around here?\nI can hear your heartbeat\nYeah, you know a dog sense fear\nI can hear your heartbeat\nYou bark while we bite around here\nI can hear your heartbeat", "year": "2014-05-06"}]}