{"songs": [{"image": "https://images.genius.com/bb87853b3afb97785056d36345957531.640x640x1.jpg", "title": "Black Cloud", "album": "Decided", "year": "2018-09-07", "lyrics": "[Intro]\nPlayBoy on this bitch, but he ain't playing, though\nI'm that\n\n[Pre-Chorus]\nSmoke a blunt of strong, tell me, is you with that?\nI'm just tryna get to know you, baby, tell me where you getting at (I been that)\nAnd I can take your pain to the Neverland\nToo busy being who I am\n\n[Chorus]\nRoll out, roll out, roll out\nPull up then we show out\nGo up, rock out\nThey pretend for the clout\nI am way too cool for y'all\nI only care 'bout myself\nI think I've seen a black cloud\n\n[Verse 1]\nOkay, I walk in\nLooking around like where am I at?\nI just seen a girl who's stuck in my head\nTried to stay away but she reelin' me in\nWe could have fun for the whole weekend\nGotta thank God for the big backend\nWe just had a whole new pack came in\nI just went and bought new Chanel lense\nWent on tour and I got new fans\nReal deal slime, got diamonds on my hands\nReal shooter time, I just made a hundred bands\nLost one friend and I gotta advance\nYoung rich nigga need to buy me some land\nReal go-getter, she don't need no man\nShe so thick and the tone of her skin\nMake a nigga wanna try dating again\nOh, Holly, I'm so sorry\nYou my only friend\nI feel you right onside me\nI never want this for the end\nYour energy keep on calling\nI pick up\nIt seems like I can't keep 'em off me\n\n[Chorus]\nRoll out, roll out, roll out\nPull up then we show out\nGo up, rock out\nThey pretend for the clout\nI am way too cool for y'all\nI only care 'bout myself\nI think I've seen a black cloud\nRoll out, roll out, roll out\nPull up then we show out\nGo up, rock out\nThey pretend for the clout\nI am way too cool for y'all\nI only care 'bout myself\nI think I've seen a black cloud\n\n[Verse 2]\nReal street nigga, why they hatin' on me?\nTell me why I got this pain inside of me\nI tried to leave the beef alone, yeah honestly\nBut I've been leaving niggas dead inside the streets\nOhh\nGot no friends, tryna bait us I say \"hell nah\"\nI'm like Holly\nAll these fuckin drugs that I'm on\nI got blood running down my arms\nI don't wanna be alone\nThey fucking fake the shit they say, it only make me stronger\nCut out the tops now your dawgs done went missin'\nWe clear out the block with a stick and a Glizzy\nWe cut off her hair when she join the committee\nInterviewed by reporters while sittin' in the Bentley\nThey know I did it while I'm rapping 'bout killing\nTruth for my city, I'ma say how I feel\nThey say that nigga got several convictions\nYou know how I'm coming, you know how we living\n\n[Pre-Chorus]\nSmoke a blunt, a strong, tell me, is you with that?\nI'm just tryna get to know you, baby, tell me where you getting at\nI been that and I can take your pain to the Neverland\nToo busy being who I am\n\n[Chorus]\nRoll out, roll out, roll out\nPull up then we show out\nGo up, rock out\nThey pretend for the clout\nI am way too cool for y'all\nI only care 'bout myself\nI think I've seen a black cloud\nOkay"}], "artist": "YoungBoy Never Broke Again"}