{"songs": [{"lyrics": "[Hook]\nMy president is black, my Maybach too\nAnd I'll be goddamned if my diamonds ain't blue\nMy money's dark green and my Porsche is light grey\nAnd I'm headed for D.C., anybody feel me?\nMy president is black, my Maybach too\nAnd I'll be goddamned if my diamonds ain't blue\nMy money's dark green and my Porsche is light grey\nAnd I'm headed for D.C., anybody feel me?\n\n[Verse 1: Jay-Z]\nMy president is black, in fact he's half-white\nSo even in a racist mind he's half right\nIf you have racist mind you'll be a'ight\nMy President is black, but his house is all white\nRosa Parks sat so Martin Luther could walk\nMartin Luther walked so Barack Obama could run\nBarack Obama ran so all the children could fly\nSo I'ma spread my wings, you can meet me in the sky\nI already got my own clothes, already got my own shoes\nI was hot before Barack, imagine what I'm gonna do\nHello Miss America, hey pretty lady\nRed, white, and blue flag, wave for me, baby\nNever thought I'd say this shit, baby, I'm good\nYou can keep your puss, I don't want no more Bush\nNo more war, no more Iraq\nNo more white lies, the president is black\n\n[Hook]\nMy president is black, my Maybach too\nAnd I'll be goddamned if my diamonds ain't blue\nMy money's dark green and my Porsche is light grey\nAnd I'm headed for D.C., anybody feel me?\nMy president is black, my Maybach too\nAnd I'll be goddamned if my diamonds ain't blue\nMy money's dark green and my Porsche is light grey\nAnd I'm headed for D.C., anybody feel me?\n\n[Verse 2: Young Jeezy]\nGood morning, America, sorry I woke ya\nI just had to say what's on my mind, like Oprah\nGot the whole world like wide open, his mouth\nSame reason during Katrina that he opened his house\nHelped raise food, helped raise water so\nGod knows who can feed their son or their daughter\nSay what I wanna say cause I'ma say, say it\nSay what I'm gonna say cause I'm a taxpayer\nBill O'Reilly, eat a dick, nice try\nYou're really being a racist asshole in a nice tie\nAnd tell Dennis Miller his show suck anyway\nAnd I rather watch Jimmy Kimmel any day\nI got some white friends and a white Benz\nParked out front and, yeah, also white rims\n'Cept my president is black and I'ma be heard\nDon't ever try to tell me now I can't say the b word\nMy president is black, my Lambo's blue\nAnd I'll be goddamn if my rims ain't too\nMy money's light green and my jewels light gray\nI'm in a lux t-white, nah I much too paid\nMy president is black, my Lambo's blue\nAnd I'll be goddamn if my rims ain't too\nMy money's light green and my jewels light gray\nI'm in a lux t-white, nah I much too paid\n(How much did you pay?)\nMy president is black\nMy Blackberry is too though by the way\n[Spoken outro]", "title": "My President (Remix)", "image": "https://images.genius.com/11e8f2e0d2c5e3d46b6c1a558d7e1f59.1000x1000x1.jpg", "year": "2009-01-19", "album": "The Hits Collection, Vol. One"}], "artist": "JAY-Z"}