{"songs": [{"title": "Break a Bitch", "lyrics": "[Intro]\nA: Akinyele, you know I break a bitch neck!\nK: Kool G. Rap, you know I break a bitch neck!\nA: Yeah break a bitch neck!\nK: Break a bitch neck!\nA: Break her neck, aiyo G catch the fucking wreck, set it!\n\n[Verse 1: Kool G. Rap]\nI can't stand a bitch so I don't treat and I don't date 'em\nThey want a niggas cunt, so I just fuck 'em like I hate 'em\nHoes wanna oppose, like they know me or they knew me\nBut bitch you never blew me, so don't say a fuckin' thing to me\nCause I'm too fly to say hello HA HA\nSee you later, long good-BYE\nBitch yo, what you want pa\nA: But you bitches look so good\nBut it don't mean no give a fuck\nIf there's one less bitches out the neighbourhood\nBecause I never did respect 'em\nYou know you could never give a\nKool G. Rap a swift kick in the rectum\nCheck 'em, develop a chick is a pig\nBecause mad niggas bitches\nThey put they lips around a nigga dick (Come on niggas)\nDid they tell me how my dick is so much bigger (Yeah)\nSwallow my nut if they forgot to call me Mister Nigga (Ah)\nSit back slap a bitch, Kool G. Rap\nBitch runnin' off for the track\nThen a bitch got it slapped\nSo don't be a nigga sex-slave bitch\nDon't try to be brave bitch\nYou be a dead bitch in the grave bitch\nBitch you think a nigga and come beef out\nCome bitch this is G's house\nBitch I slap your motherfucking teeth out (Aight, my man)\nBreak it off bitch you want the drama bitch\nYou'll have to homa, bitch you broke a seven bomber\nBitch I slap your mama bitch (Whoo-hie)\nPull out my dick and start suckin' bitch\nOr keep on puckin' bitch, you stupid motherfuckin' bitch!\nHog bitch you come and stalk bitch\nYou got a lot of heart bitch\nFor you to me you ain't too smart bitch\nSlap a bitch, I got a bag full of bitches\nTry to steal a bitch, you get a head full of stitches\nI'm hittin' bitches with a tec\n\n[Hook]\nK: Aiiyo break a bitch neck, break a bitch neck\nA: Come on!\nK: Break a bitch neck!\nA: Break a bitch neck!\nK: Break a bitch neck!\nA: Come here bitch, let me break your neck!\nK: Yeah break a bitch neck!\nA: Break a bitch neck!\nK: Break a bitch neck, aiiyo Ak catch some motherfucking wreck\n\n[Verse 2: Akinyele]\nYo, beatin' bitches up ain't nothing new to me\nWhether you're down with social security\nOr you're just here in puberty\nA ain't nothing but an agenda\nYou young bat, that comes and after all\nYou better hold on to your changes\nDon't come talkin that slappin' shit\nCause that you're a woman, Miss\nDon't think that it can't happen bitch\nI make, bitches panick and sweat for their life\nIt's bad that bitches mostly get\nStabbed to death with they own knife\nDark skin bitches turn black and blue\nI cruise around town, cruise their ass with a .22 (Bitch)\nCali bitches get the gat that I'm blastin'\nI think straight slang\nSprinklers I'mma (?) when they askin'\nGet the man and his wolfpack\nI play em like Pity Pat\nEach and everyone of them bitch niggas get smacked\nMartial arts bitches get me fed\nWho sees rollin' Bun\nWe say; Return of the living dead (Huhh)\nNobody's shit goes live\nMiss Hong-Kong bitch\nI break my foot up off in your ass (Yeah)\nAnd drunk bitch that keep 'em full of it\nAnd the nigga alcoholic\nMake them think St. Ides is a Church\nAnd jewish bitches they know the settings\nCause I be stompin' they ass\nJust like the class at a Wedding\nAnd dancin' girls get me pissed\nI'm the first straight hater to yell out:\nGo stupid bitch! Go stupid bitch!\nAin't nothing good about me, girlfriend\nYou want a good boyfriend, check the Marines\nI heard they got a few good men (Yeahh)\nDon't hear me I ain't get no love (Fuck that)\nI'm member of the bitch haters club\nI don't kiss and don't pucker up bitch\nYou stuck up bitch\n\"Don't call me a bitch\"\nOh shut the fuck up bitch!\nYou don't get no respect, hell no!\n\n[Outro]\nA: Break a bitch neck!\nA: Break a bitch neck!\nK&A:Yeah ahahaha, word up!\nA:See that fuckin' bitch\nK:Bitches must be fuckin' crazy (Bitch, bitch)\nYou must be out your fuckin' minds (Bitch, bitch)\nSuck my motherfuckin' dick!(Bitches ahaha)\nA:You look like thaaaat\nK:Bitch haters come, come and act up baby (Stop me)", "year": null, "album": null, "image": "https://images.genius.com/9930b12b428e16aeaa47d79eb5259bb4.300x250x1.jpg"}], "artist": "Akinyele"}