{"artist": "A$AP Ferg", "songs": [{"title": "Diamond Dust", "image": "https://images.genius.com/c9440ee0b76ac4cc57b13638e1b04b1b.500x500x1.jpg", "album": null, "lyrics": "[Hook: A$AP Ferg]\nDiamond Dust oooo it's so cold\nShe don't feel her face, and he don't feel his nose\nD-D-D-Diamond Dust It'll leave you cold\nWhere yo body heat? Ooo now his feet is swoll\nD-D-D-Diamond Dust, Living in this cold world\nFuckin with that China White, Ooo that's his old girl\nLookin for that new bitch, to make his toes curl\nDope bitch, fucking up his whole world!\n\n[Verse 1: A$AP Ferg]\nI'm so high as fucking hell, That I can kiss the sky\nThe Devil tryna grip me, I can hear the angels cry\nThat's my momma and my auntie screaming \"You just a bunch of lies\"\nAnd my girl just caught me stealing, I just bought her the new iPhone\nDrugs are my new friends and they just getting tall\nMy boss just caught me beaming, so you know that I got fired\nAnd my clothes is getting old and my hair used to be wavy\nShit, this the life of crack, when you growing up in the 80’s\n\nAnd I’ve been smoking, Lord please help\nCause I’m going out of my mind\nI can hear my heart beat, think I’m running out some time\nWhere do I go from here, do I lay here and just die?\nI can see pearly gates, matter fact I’ve just changed my mind\nI don’t wanna go, go, think I’m going out of my mind\nI can hear my heart beat, think I’m running out some time\nWhere do I go from here, do I lay here and just die?\nI can see pearly gates, matter fact I’ve just changed my mind\n\n[Hook]\n\nHi my name is Becky, and I used to wanna be famous\nI sniffed away my brains, and the itches make me insane, oh\nAnd I used to hang with Dana, used to party with the Lakers\nUsed to travel with the Indiana Pacers\nI used to wanna cheer but they didn't wanna take us\nCause now I'm faded, now my whole world is jaded\nDamn I thought I made it, living out my dreams\nBut this whole time I was faking\nI was faking\nAnd this is what that diamond does\nAnd this is from that diamond dust\nAnd this is from that diamond dust\nAnd this is what that diamond does\n\n[Hook]", "year": null}]}