{"artist": "50 Cent", "songs": [{"album": "God’s Plan", "image": "https://images.genius.com/7488990258b7e75bb8e35de7a131ec87.697x694x1.jpg", "title": "Niggas", "lyrics": "[Intro: Puff Daddy]\nShadyville Entertainment\nBad Boy collaboration\n\n[Uncredited vocals]\nI love niggas, I love niggas\nBecause niggas are me\nAnd I should only love that which is me\nI love to see niggas go through changes\nI love to see niggas shoot the shit\nBut there's one thing about niggas I do not love\n\n[Notorious B.I.G.]\nTo all my Brooklyn\nTo all my Uptown\nTo all my Bronx\nTo all my Queensbridge\n\n[Verse 1: Notorious B.I.G.]\nBack up chump, you know Biggie Smalls rip it quick\nAnd kicks it quick - you know how black niggas get\nWith them hoods, fatigues; with the boots with trees\nSmoking weed, flipping keys, making crazy G's\nHitting buckshots at niggas that open spots\nOn the avenue, take my loot, and I'm bagging you, huh\nPimping hoes that drive Volvos and Rodeos\nFlash the roll, make them wet in their pantyhose\nDamn, a nigga style is unorthodox\nGrip the Glock, when I walk down the crowded blocks\nJust in case a nigga wanna act out\nI just black out, and blow they motherfucking back out\nThat's a real nigga\n\n[Hook: 50 Cent] (x2)\nWe the realest nigga\n50 Cent and B.I.G. my nigga\nDon't try to act like you don't feel us nigga\nBiggie yo' nigga, 50 yo' nigga\nSqueeze the trigger, leave a nigga fo' sho'!\n\n[Verse 2: Notorious B.I.G.]\nYo, we smoke spliffs, we pack four-fifths\nJust in case Dread wanna riff\nHe get a free lift to the cemetery, rough very\nNot your ordinary, we watch you get buried\nThat's a real nigga for ya'\nGet mad do a quarter, flip the script, and rip your lawyer\nSpit at the D.A., because fuck what she say\nShe don't give a fuck about your ass anyway\nUp North bound first stop, Watertown or Fishscale\nWhere the hand skills are real ill\nYou'll be a super Hoover doo-doo stain remover\nHa-ha, yo chief, pass the buddha\n\n[Hook]\n\n[Verse 3: 50 Cent]\nWhen I was young my M.O. was to go hand in hand\nEven my P.O., she called me \"the Ginger Bread Man\"\nI catch a new case, and tell her ass: \"Catch me if you can\"\nDon't let your people fill you up with octane, I'm not playing\nGet gassed up, to get blast up\nReal B.I.G. style watch the kid break it down\nCheck it: thou shalt not fuck with, nor see Poppa\n50 Cent, I'll break yo' punk ass off proper\nThere's no place like home, New York! New York!\nI run this city, and I don't dance around like Diddy\nNiggas is giddy, till they're smacked silly\nOr sprayed with the MAC milli, they don't want drama really\nPussy niggas get hard, lip syncing my lyrics, like Milli Vanilli\nIn the hood they feel me {*Gun cock*} ha! I'm on fire!\nNiggas out in Philly they feel me, they bump my shit {*Gunshot*}\nEvery bootlegger you know, pump my shit - bitch!\n\n[Hook]", "year": "2002-11-01"}]}