{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "50 Pounds of Weed In The Trunk", "year": null, "album": null, "lyrics": "100 dollar freestyle, baby baby\nYou already know what's good\nAy, lemme holla at you one more time\nLet me tell you the deal, man\nWait for the beat to drop in, feel me?\n\nOn yea, I like this one. Ha. Heh heh\n\nOh, wow, man, it’s a groovy little number\nWhat? What? Damn. Heh\n\nYes, yes, ya'll, and it don't stop\nTo the mother fuckin’ beat, ya'll\nAnd it don't stop\nTo the mother fuckin' beat, ya'll\nHeh, ay\nYes, yes, ya'll, feel the funk, ya'll\nFifty pounds of weed in the trunk, ya'll\nYes, yes, ya’ll, feel the funk, ya’ll\nFifty pounds of weed in the trunk, ya'll\nYes, yes, ya’ll, feel the funk, ya'll\nFifty pounds of weed in the trunk, ya'll\nYes, yes, ya'll, feel the funk, ya’ll\nFifty pounds of weed in the trunk, ya'll\n\nYes, yes, ya'll, feel the funk, ya'll\nIn the trunk, ya'll\nYes, yes, ya'll, feel the funk, ya'll\nGot 100 pounds of weed in the trunk, ya'll\n\nYes, yes, ya'll. It's bigger than rap, man\nIt's deeper than you thunk, ya'll\nI gotta a hundred fucking pounds of weed up in the trunk, ya'll\nYo, hella punk ya'll\nBut I still ain't know punk ya'll\nLanguage is a contradiction, listen to my diction\nThat's some cold nonfiction\nListen to the beat, plus the pressure, plus the friction\nTreasure my convictions, hold 'em dear to your heart\nSee me, I'm 100% pure art\nIt's so real, wow, don't give a fuck how you feel now\nAnd forever. Fuck, fuck, fuck, fuck, fuck everybody\nYa, funky fresh, cheddar getter, every track be better than the last one. Money, money, fashion\nBout that action, beast mode\nGang on a leash, beat the beat like they gave me the cheat code\nHeh, always take the conscience to [?] to the skreet code\nYo, yeesh, I go super freaky-deaky on\nNever could you say I didn't do what I wanted to do to\nDog, I don't play, I give you ever last bar that I thought I would and\nYou thought I wouldn't, maybe you thought I couldn't, but I did it, though\nYou was [?] mistaken\nYo, I'm bumpin' 40 in the station wagon\nMaking magic\nYo, uh, place me like Echo 8 on the chess board, the black king kickin' you fresh words\nMackin', slappin' any ass that we need in that seedy rap\nKool A.D., who he? Oh he be that dude who be slingin' that aphrodisiac rap slow medium fast whatever the fuckin' tempo is\n[?] I'm a mother fuckin' god, mayne\nI'm a god in the temple, kid\nListen to the sentences arranged by the mental\nIt's essential, isn't it? Vision it\nYa, um, never was a kid so persistent with it\nShimmy, shimmy, ya, I'm an idiot\nNa, fuck it, I'm a genius, probably\n[?] probably with the gods off of molly\n[?] chumps, oo-chie wally, allie-oop, sorry dude\nYour boy godly woo, choppin' away, [?] off of a haze\nCigarette, cops are all way fuckin' stupid idiots\nThey should kill theyself, see me I'm [?], try to [?] the game with a pay well\nCall me RL Burnside with the Maybelle\nMaytag repair man style cold wash you\nOh my fuckin' god I'll fuckin' bop a fool\nStyles you cannot do\nHeh, who woulda dot cool could ever fuckin' bring the heat, [?] true, never, damn, what, never, nothin', else, but the holy, un-heard-of-truth\nEverybody probably know, wow, who the fuck care?\nSuck it, go fuck yourself\nEverybody do a little dance\nGod damn, I'm the man, I'm the man\nKool A.D., best rapper in the lands"}]}