{"songs": [{"lyrics": "[Verse 1]\nI came from the hood, brother selling all the bricks\nWe was livin' good, till they caught him on a lick\nMe and the gang stick together, like December weather, I'm a pretty bitch I'm living better, had to stack my cheddar\n\n[Chorus]\nEvery day we lit, all about my bands, ridin' in a foreign, I can't shake a hand\nYeah they think they stoppin' me, do the money dance, macaroni in his bowl, I put some thousands in my pants\nThousands on my self, used to stay on wel-fare\nGettin' it was my health, and I took it, got the belt\nKeep yo head high, he wanna be my rockstar\nWe don't fuss and fight, just eat my pussy, pop tart\nIf they hating now, they mad cause I'm chasing bands, and I say I'm from Japan, I don't wear no regular pants\nAsian Doll, I'm self made, I'm too real I get paid\nI be shinning, you pretend. I be takin' bitches men\n\n[Verse 2]\nEvery day we lit, I done caught another flight. They ride my dick like motor bikes. I be so high, I need a kite\nSince I remember, you been done to fight. For your love, I will not fight\nI just need yo hugs, and my drugs. Imma be aiight\nI'm too lit I ain't got no brakes, I be geekin' out of space\nI been moon-walkin' on yo grave, it's a closed case\nI can't entertain that, I just pull the roof back, you can't get yo boo back, she a doll I taught her all my swag\n\n[Chorus]\nEvery day we lit, all about my bands, ridin' in a foreign, I can't shake a hand\nYeah they think they stoppin' me, do the money dance, macaroni in his bowl, I put some thousands in my pants\nThousands on my self, used to stay on wel-fare\nGettin' it was my health, and I took it, got the belt\nKeep yo head high, he wanna be my rockstar\nWe don't fuss and fight, just eat my pussy, pop tart\nIf they hating now, they mad cause I'm chasing bands, and I say I'm from Japan, I don't wear no regular pants\nAsian Doll, I'm self made, I'm too real I get paid\nI be shinning, you pretend. I be takin' bitches men\n\n[Outro]\nOn my gang, every day I'm lit, on my gang, you can't tell me shit, on my gang, and I'm flyer than yo bitch, on my gang\nYeah!", "album": null, "year": "2017-01-23", "title": "Every Day We Lit Freestyle", "image": "https://images.genius.com/31829467c825030f8f1bc9ba5eb791d8.500x500x1.jpg"}], "artist": "Asian Da Brat"}