{"artist": "C-Bo", "songs": [{"title": "Survival 1st", "album": "West Coast Bad Boyz II", "year": null, "image": "https://images.genius.com/8942a3f6f7068261648702d1bb9246ca.500x493x1.jpg", "lyrics": "(chorus)\nCalifornia's the state, where punk niggas die\nFirst thought be survival every mornin' when I rise\nSo many murders and homicides in front of my eyes\nIt's just some ballin'-ass niggas down to die for the West Side\nCalifornia's the state, where all bustas die\nFirst thought be survival every mornin' when I rise\nSo many murders and homicides in front of my eyes\nIt's just some ballin'-ass niggas down to die for the West Side\n\nVerse 1:\n(C-Bo)\nIt could be the napalm, droppin' non stop bombs\nArmed like vietnam, dominatin' like King Kong\nLyrical madness, step up, take up, and start blastin'\nWicked as Stephen King when my mental and vocal clashes\nSyrran wrap, like a boa constrictor, wrappin' ya\nUp from your feet to your neck, nigga, attackin' ya\nThese 4-5 hollow tips will have you backin' up\nI only do my dirt at night like dracula\n\nVerse 2:\n(Lunasice)\nI'm wanted by the feds, these niggas, they want me dead\nCuz I done spread through their territory like the HIV\nSun down spots, suckas swallow Glocks\nIf they know by these rocks I'm pushin' for the blocks\nEvery corner you past, that show will run him up in his ass\nGettin' the cash, while Mr. Bad puts down the smash\nI dumps quick, my clique be so thick\nWith hi-tech mob shit, crooked as Soviet\n\n(chorus)\n\nVerse 3:\n(C-Bo)\nThe house on the water, independent shippin' quarters\nMovin' tapes like K across every border\nTakin' over your brain, causin' addiction like 'caine\nMore deadly than a grand shot of Heroine in the vein\nInflict pain, on any nigga that step in my range\nRetalliate with hollow tips, blast, and splatter your brain\nSo remain calm, this shit is C-4 bomb\nSet trip off your motherfuckin' city like 'Nam\nBest recognize, step up and check eyes\nAin't to many busta-ass niggas from the West Side\nI do or die for mine, livin' life like I'm blind\nSolo on a flame line, dumpin' hollow tip 9's\n\nVerse 4:\n(Marvaless)\nSurvival first, ask questions later\nMovin' patterns on your bitch-ass cuz I heard that you was a hater. Oh who\nCan save ya?\nDefeated your purpose, now you caught up in some deep shit\nWho got the deepest murder clique, that's some would sick\nThis game is way past wicked. Still I commence to kick it\nWest side niggas stackin' meal tickets\nSurpassin' weak bitches, evadin' snitches, and sayin' bomb\nKillafornia style when we ride droppin' bombs\n\nVerse 5:\n(C-Bo)\nPalay Palay, Tommy Hilfiger cold, can I?\nPolo, Jabo, Guess, Khakis and Levis\nBallers is what they call us, too much for the ATL\nLexus, Benz, Beemer, Vet, VIP, 112\nMight catch me at the Platinum, sippin' on some Hen, rolex down\nRide ST 400 Lex through the town\nClown, and you'll catch a hot metal tab up to the chest\nDon't make me kill a nigga out east and head West Side\nTill I die, reason why, I stay high\nTo maintain my composure and attitude when I ride\nDon' push me, I'm too close to the edge\nMight take one to the head\n\n(chorus X2)\n\nVerse 6:\n(C-Bo)\nIt's the season of the sickness, marks on my shitlist\nComin' up out the psychadelic bui'ness, don't sit in it\nWhen I gets to bustin', I let loose like a Mac-10\nI'm born and raised a hustler, got love for my family, fuck friends\nNever been disgusted, but I just like love it\nWit my streetsweeper, put hoes in your bucket\nMan, I just say fuck it, I can't live with society\nNow, how many niggas in yo clique wanna ride on me?\n\n(chorus to end)"}]}