{"songs": [{"image": "https://images.genius.com/72218595c0bb6861d2cc11041abd4c7d.1000x1000x1.jpg", "title": "I LIKE BLOOD", "album": "GOODNIGHT LOVELL", "year": "2019-02-22", "lyrics": "[Intro: Night Lovell]\nWhere are you, Ginseng?\nYeah, umm\nAyy\n\n[Verse 1: Night Lovell]\nI like bands, I like cars, I like broad shit\nGot my mans all around me on my boss shit\nI got pain in my body, I like star shit\nYou can't find me, I’m inside, I'm on Mars shit\nI like, I like bitches on my dick\nI like niggas that don't wanna take no pic\nShawty treat me like a baby, like I’m 6\nGoofy niggas really think I'm from the 6\nI like red like it's blood, I don't move in the sun\nAll these niggas think they tough, you a fan, I ain't dumb\nI'm that nigga, can't you see? I got Gucci on my feet\nFuck your bitch inside your sheet, I got diamonds on my teeth\nAll these meds ain't doing shit, I just wish you end my shit\nFind your grave and then I shit, nigga, I don’t give a shit\nAll these niggas are my kids, I make magic, I’m a wiz\nYou be talking like a bitch, put your body in the fridge, yeah\n\n[Chorus: Night Lovell]\nYoung boy gon' get to ’em (Oh, he did that)\nYoung boy gon' get to 'em (Oh, he did that)\nYoung boy gon' get to ’em (Oh, he did that)\nYoung boy gon' get to 'em (Oh, he did that)\nYoung boy gon' get to 'em (Oh, he did that)\nYoung boy gon', ayy\n\n[Verse 2: wifisfuneral]\nAyy, I like Percs, I like Xans, I throw bands up on that ass\nOh, that's your bitch? Shit, my bad\nThumb through the guap, we move too fast\nAnd she gon' suck like a leech, creepin' right through the sheets\nAnd these diamonds in my gums when I smile like bling\nBeen up finessing, no stressing\nMoving that work out of Texas\nUsing that Uzi, that's my lethal weapon\nTell the world get out my mentions\nI got the check, ain't no need for no pension\nShe suck that dick, but she grip it real reckless\nCame out the mud and I'm dirty, no question\nTell me, lil' nigga, like what you 'bout?\nShe came through and she fucking for the clout\nWhen we fuck, man, pull that G-string down south\nGet smoked like Juul, boy, you know what we 'bout\nPull out them thirties, we pop at his tooth\nSouth Florida boy so you know that I'm a gook\nFlorida water, baby, yeah, you know I'm a goon\nRemix a brick and a bale, that's two\nMain bitch blowing on my dick like a flute\nInstrument, getting hit, Glock, that's my tool\nPatch on my head, that boy ride out the roof\nPatch on my head, hit that boy through the..."}], "artist": "Night Lovell"}