{"songs": [{"year": "2009-06-16", "title": "I Trusted You", "image": "https://images.genius.com/c7ebb60abfe8b9b584644158594daf66.427x433x1.jpg", "lyrics": "[Intro]\nHere is a really brilliant new talent, a singer of such rare distinction, that we simply had to share him with you, it's an honor to welcome to the stage, the gifted...\n“Mr Sage... Mr Sage... Shoot, I'm looking for a man named Sage”\n\n[Verse 1]\nYou know, it's been like 20 years I've been doing this, shit. Came up with a lot of people, a few of which fell the fuck off. So I'mma dedicate this to y'all\n\nPieces of shit who disappear when the campaign fades\nGot a nice little record but you can't play on stage\nI anti-promote you so I can't say your names\nYou're crying about money with your brand name shades\nYou tint out the window to your bland brain waves\nYou couldn't see us move past the champagne phase\nI done changed the game while your fans stayed the same\nAnd say, \"Shoot. I'm looking for a man named Sage.\"\n\n[Hook]\nI trusted you (x 16)\n\n[Verse 2]\nListen, don't sweat the petty things and don't pet the sweaty things\nAnd don't forget to hit the deck when ma' machete swings\nIt's a rage that engages when the celly rings\nYou don't gotta interrupt my life just to tell me things\nI don't get along with self-help book worms\nHad a ring of 'em around me and they all took turns\nWith looks of concern while taking what they could get\nSome parasitic, bloated tick, opportunistic bullshit\nMy little one-trick pony\nYou had a good run while I was patting your ass but after that\nAll anyone could say is how you're so down to earth\nSo is dog shit. Both are getting left in the dirt\n\n[Hook]\nI trusted you (x 8)\n\nNo, it ain't about the lie, it's how you tell me it\nI'll slap this hatchet in your back before we bury it\nThen spit out your cherry pit\nYour petty shit goes tits up. I'm like, \"Man, whateva.\"\nYou're all like, \"What is your damage, Honey?\"\nFuck me gently with a chainsaw. Just make sure\nYou lube up with salt solution, stupid, I'm a take it raw\nThere's canker sores on the lip service you give me\nYour facial flaws are gettin' all nervous and shifty\nSissy. That's an easy tell\nConsider the elbow grease that I put in when you get jealous of what you see me sell\nHow'd you fit those big dollar signs in your little beady eyes\nWithout the use of photoshop or CGI?\n\nI've got a special effect, it's called hard work\nI write my own checks, that's just one of my job's perks\nYou got burnt but you keep playing with matchsticks\nKeep falling off like weak refrigerator magnets\nLock and load. Cock and aim\nI've got a razor tongue but it's like a taser gun when I make shocking claims\nAnd I don't just talk some game\nCause I'm a commentator and a player and a coach who can fan the flame\nFuck a stand off, I'll chop your hand off\nAnd I'll shove it down your throat until you choke and you can't cough\nDis me in your city if you need to, but when I come through...\n\n[Outro]\n\"Am I glad to see you Sage!\"\n\"Wow Mr. Sage. You made me wish I could have been there too!\"\n\n[Outro: Andy Kaufman]\n“I trusted you, I trusted you, I trusted you...” (loop with crazy screams)", "album": "Sick Of Wasting"}], "artist": "Sage Francis"}