{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "Three", "image": "https://images.genius.com/6a5406166b09f9389383b8e5cab645ef.599x599x1.jpg", "lyrics": "For my G-pack niggas\nRight, right\nShooting at cops nigga what\nFor my G-pack niggas\nFuck the police\nN.Y.P.D. - New York Pricks and Dicks\nThey can't stop our floss\nStraight up (for you crackheaded bitches)\nFor my A.M. niggas (for you crackheaded bitches)\nMy Ante Meridian niggas; what up dunn?\nLiqour store closed\nHit the bootlegger, let's hit the bootlegger\nStraight up, yo\n\n[Prodigy]\nYo dunn, we got guns in the grass, it's three at night\nI'm about to take the last swallow of the Eases Jesus\nWho got fifty on the next tree, we gotta stop at the store\nWe need D batteries for the theme music\nSnatch the biscuits from out the lawn\nFuck a cab, lets take cracked-out Yolanda's Saab\nWe gave that bitch two wibbles\nAnd skated off with her vehicle for that pillow\nAll outside the borough, dunn what happened to Queens\nLike Sutphin and 1-2-1, Farmers and 116th\nThe got us on the B-Q-E, just to get a taste of that greenery\nWe took our smoke out to Coney Island, posted up by the Himalaya\nPina Colada champales mixed with Dainy\nThat's St. Ide's in dunn lingo\nSpillin it on the floor for our dead people\nWhile I spark the sequel shit; my niggas got lungs\nWhen we smoke, that shit only go around once\nDogs, we just killin time\nSomebody just got they shit twisted on the block fuckin up the grind\nSo, 'til it pipe down\nWe just going at these sluts - bitch, we wanna fuck right now\n{*overlapped my Cormega's first line*}\n\n[Cormega]\nSon I'm on a bench high eatin chicken wings and french fries\nA crackhead fuck spent his last bucks on six dimes\nI'm one gram from big time, a spliff away from overdosin\nMy heart is broken, my man started smokin again\nP, I heard the tunnel open again\nI spoke to Flex he said he's gonna let both of us in\nIts time to load up the autos and semis\nI wish my nigga Spank was in a physical form of life\nI got my uptown nikes thugged out and icy\nMad deep, jumpin out the Cocaine white Jeep\nThrough was strugglin, so I resume hustlin\nRap game or crack game my crew is still bubblin\nYo, three in the morning and the D's on the corna still\nSeems we were born to kill, yo P meet me on the hill\nSo we can jet through Queens in SUV's\nShow these motherfuckers how we rep this thang, ya know?", "year": "2000-11-14"}]}