{"artist": "King T", "songs": [{"image": "https://images.genius.com/dc61ccdd1dd20750a95785c799561625.820x820x1.jpg", "title": "Guitar Playin’", "year": null, "album": "Act a Fool", "lyrics": "[Pooh]\nHey King Tee since this beat is kinda rockin\nI'mma let you rap and get the suckers cold clockin\nSo yo loc', hear the beat I'm displayin\n(Yep) But now - \"listen to the gui-tar playin\" {*E. Sermon*}\n\n\"listen to the guitar playin\" {*E. Sermon*}\n\"One, two, three..\"\n\n[King Tee]\nYo, now if you're hip to me, then I guess you heard \"Bass\"\nBut I got another instrument to flaunt in your face\nIt's not a flute or a trumpet, don't beef cause you love it\nA funky guitar rhythm that Pooh sampled and cut it\nSo for those who really know what dope stuff sounds like\nIf it sounds good, sounds funky, or sounds hype\nPut your ear to this and let me know what you think\nYo Pooh, bust the guitar while I grab me a drink\n\n\"listen to the gui-tar playin\" {*E. Sermon*}\n\"listen to the gui-tar playin\" {*E. Sermon*}\n\n[King Tee]\nNow to many people this tune is like fazin\nGet the crowd dancin with the funkiest persuasion\nHypnotizin suckers with some personal-fication\nGet the crowd movin (c'mon) motivation\nSee I'm like a symbol to MC's I'm a father\nNo wait, I'm a lyricist, better yet a saga\nEnough about the King cause you know I get far\nI played with the \"Bass\" now I'm messin with the guitar\nAnd the way that it sounds you say \"Shucks!\"\nIt can't be real how the player just plucks\nOn the strings, it rings yo, it's like the funkiest rhythm\nPooh brings the drums with the sticks to hit 'em\nIt's not ballet jazz punk rock or swing it's dope\nRappin brought by the T apostrophe King\nAnd if I was in school and this was an assignment\nI wouldn't type it or write it I'd just rhyme it\nCause rhyme is what I like I got a metaphor background\nA punk jumps up, I bust a verse, he sits back down\nHuh - I wrote a epic, I hope you accept it\nFly stupid rhymes I composed and perfected\nI'm down with some people that know what they're doin\nDarryl and Bobcat and Dwayne and DJ Pooh\nAnd Keith Cooley is cool see, I'm the coolest person\nSomebody drop the guitar before I start cursin\n\n\"listen to the gui-tar playin\" {*E. Sermon*}\n\"listen to the gui-tar playin\" {*E. Sermon*}\n\n[King Tee]\nSo, as it looks, the people like it\nThe funky guitar tune that we ignited\nPooh, I mean really, suckers be stumblin\nWhen they hear the funky guitar strummin\nYou know frankly, I think this cut is kinda musical\nJust like my \"Bass\" song, but don't get them confused though\nThe guitar gets your mind in the funky kind of state, huh\nAnd my bass makes the walls shake (yeah)\nSuckers can't come close with what I got goin\nWhat I be doin, what I be showin\nHow I be conquerin and how I keep rulin\nWhat makes the King Tee stay so cool and\nWhere I get my Fila's from, how I learned my slang\nHow could I afford such a big gold chain\nAnd fly girlies tempt me when (?) wanna hit me\nWhy I drink brew til my body gets tipsy\nTo ask all the questions that I just spoke though\nIt's not magic or a hoax I'm just loco\nI like bustin on the funky dope track\nSmooth like T, mo' powerful than a gat\nNow that you know what's goin around\n(c'mon) here comes the funky breakdown\n\nThat's smooth man, that made me laugh at all these suckers man\nYou laughin too Pooh? (ye-ye-yeah, hahahahaha)\n\n\"listen to the gui-tar playin\" {*E. Sermon*} (hahahahaha)\n\"listen to the gui-tar playin\" {*E. Sermon*} (hahahahaha)\n\nYo Pooh, yo Pooh, break it down for a minute\nLet me talk to the party\nNow yo, me and Pooh is feelin real hot right now y'know\nBut we want y'all to know, that see, me and my crew\nWe from Compton, y'all heard about Compton? Scratch Compton\n(Compton!) Aight, see that's where we from (Compton!)"}]}