{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "The Bumpy Johnson Album", "title": "Told Ya’ll", "image": "https://images.genius.com/05b40ef764ca6b43a79611a79d90bd0f.500x500x1.jpg", "lyrics": "[Intro]\nListen!\n\n[Hook: repeat 2X]\nI’ve been doin this long before you\nAnd I’ll be still doin this long after you\nLet’s not forget, the Mobb don’t play that shit\nWe take this more serious than just music\n\n(“I told y’all!”)\n\n[Verse 1]\nI’m not the best\nI’m the best of all time, comin’ out of New York\nBig pole in your mouth nigga fuck your talk\nBig Don Perginon P holds the fort\nI’m Top Rank, Mayweather, Golden Boy\nYou just a Friday Night Fight, up in B.B. Kings\nUndercard-ass rappers wanna step in the ring\nAnd get washed up, just so they can get that purse\nI got the main event verse, the headliner concert\nThese new niggas come and they go, before long your\nFavorite rapper getting’ real beside his self\nNigga made a lot of money, now he ridin self\nOoh~! That’s so not cool, that might be gay\nI’m disappointed at y’all fallin for the shit that he say\nThought you had better taste, I thought I raised you well\nI’m amazed at the shit, that y’all claim is ill\n\n[Hook]\n\nI’m not the greatest I’m\nThe greatest of all time, I deserve my spot\nRappers be jumin the gun, they get ahead of theyself\nThey get a taste of this lime life and lose they cool\nI used to be a douchebag asshole too\nMillionaire at 19, did what you try and do\nI ain’t gotta dress like a weirdo for star power\nAnd I ain’t build my career on rap drama\nNow my physical frame attractive, I look good\nAnd my songs is hot, no gimmicks I’m just hood\nQueensbridge ‘til my death box, from my sweatsocks\nUp to my skull cap, I’m gullier than Lennox\nYeah! Don’t bring scared business, around me\nMy 16 hard like Rockwilder and mastered\nI’m God’s avatar, box protégé\nI write a cannon puzzle, a paradox page\nThought you had better taste, I thought I raised you well\nI’m amazed at the shit, that y’all claim is ill\n\n[Hook]\n\n[Verse 3]\nI’m not the infamous, I’m\nThe most infamous there ever will be in rhyme\nI, a.k.a., E.B.J\nBut you can call me Big Boy Bars, for the time being cause\nEllsworth Bumpy goes hard in the paint\nLike I’m losin in the Finals and, this the last game\nAll I hear is Freddy Mercury, singin my theme\nAll I’m thinkin is, celebration and victory\nMy life is one huge W\nI feel like I'm RZA\nReady to take on the world, who want it with this nigga?\nSergeant songs, Captain Hooks, the big boss\nOf reality rap, you just yappin your jaws ‘bout\nBodies you never caught, keys you never bought\nTours you never did, money you never saw\nYou wanna be everything I was\nAm, and ever will be understand that\nYou wanna be everything I am\nWas, and ever will be, just keep in mind that\n\n[Hook]", "year": "2012-10-02"}]}