{"artist": "6ix9ine", "songs": [{"year": "2018-04-10", "title": "GOTTI", "album": "DAY69: Graduation Day", "lyrics": "[Intro]\nGot me a new Rollie\n(You can't even afford that)\nGotti Gotti, ah (Take off your headphones)\nGotti Gotti, uh\nGotti Gotti (Hahahaha!)\n\n[Chorus]\n'Kay, my block bang (Gang), .30 bang (Gang)\nScum Gang, big choppa, big thang, let your nuts hang\nWho they? (Gang), don't say (Gang, gang)\nBBA change your mood, ayy, any day\nGotti Gotti, cookin' up, speed it up\nDouble cup, Xanny cup, booted up\nMollied up, molly up, break it up\nCop it, then I serve it up, give it up\nGotti Gotti\n\n[Verse]\nFuck with my day ones\nYeah, you know I flooded the chain once\nGot the money, and I split it with day ones\nShe ain't fuck me back when I was lame, nah\nYeah, you know I do my dance (Do it)\nIn the club (Hey), throwin' dough\nRack it up (Rack it), shake it up\nWatch me do it, how I bust it up (Ooh), I mix it up\nThen I hit her with the blicky, uh\nSo drip it, drip it, drip it, drip it\nYou ain't got no money, you can keep her (Pew, pew, pew)\nBitch, I got my Nina, I'ma squeeze her\nIf you really wanna meet her, she a greeter\nIt was really nice to meet ya, I don't need ya (I don't need her)\nI pray to God that my niggas gon' eat (I pray to god)\nI pray to God that my family gon' see (I pray to god)\nPrayin' that the Lord take a chance with me\nWouldn't come when I was up, I was on the wrong things (Mom, please)\nI ain't silly, ain't no dumb nigga, are you dumb, nigga?\nAre you stayin' with the pump, nigga? Fuck is up, nigga?\nIs you mad? You's a fuck nigga, I don't trust niggas\nScum Gang, chew 'em up, nigga, we don't fuck with ya\n\n[Chorus]\nOkay, my block bang (Gang), 30 bang (Gang)\nScum Gang, big choppa, big thang, let your nuts hang\nWho they? (Gang), don't say (Gang, gang)\nBBA change your mood, ayy, any day\nGotti Gotti, cookin' up, speed it up\nDouble cup, Xanny cup, booted up\nMollied up, molly up, break it up\nCop it, then I serve it up, give it up\nGotti Gotti\n\n[Outro]\nThe Gotti Gotti\nWho, who really with the money, money?\nWho, who really with the Gotti Gotti?\nWho, who really with the money, money? Who?\nDo my dance, hit my dance\nFifty bands, hunnid bands, all my dance\nMollied up, molly up, give it up\nCop it, then I serve it up, give it up\nReally with the got it, got it\nWho, who really with the Gotti, Gotti?\nWho, who really with the?", "image": "https://images.genius.com/8b640cb5da010749f04fabbce0c61f8d.1000x1000x1.jpg"}]}