{"songs": [{"lyrics": "(Chorus)\nYeah, there's a price to pay for the girls you lay\nLife's gonna hand you a bill one day\nBefore your freedom or your life get took\nGet a wife or a playboy book\nOne more time\nThere's a price to pay for the girls you lay\nLife's gonna hand you a bill one day\nBefore your freedom or your life get took\nGet a girl, a wife, or a playboy book\n\nSittin' at a red light\nTryin' to get my head right\nThis girl pass with a monster-ass\nMentally distracted\nI mannishly reacted\nMy penis expanded\nHer number I demanded\nThe questions I asked her were nice and discrete\nBut now she's in my passenger seat\nTurn on the beat\nWent to my castle\nFucked without a hassle\nOh it felt great, in her asshole\nShe was sexy, seductive, her name was Morgan\nI loved the way she sucked my reproductive organ\nI road it and road it\nFinally unloaded (uhh)\nWent to the bathroom because I couldn't hold it\nOh I looked down and I was trippin'\nBecause I seen blood drippin'\nOff the tip of my penis\nIt don't take a genius to figure she's a virgin\nScrubbed my dick with detergent\nI'm in the mix, if you know what I mean\nCuz the girl's only sixteen\nYour nipples are hard\nYour booty is soft\nBut cutie, I need to drop you off, pass my keys\nSmashin' down the street\nTryin' to get rid of the broad\nBut her mama standing in the front yard\nLookin' at me weird cuz I'm gangsta geared\nI look kinda old with a fro and a beard\nShe looked at me as if I was Satan\nI smashed off on my hundred spoke daytons\nTurned the shit up had the bass go whoppin'\nStressin' like a mothafucker goin' back to Compton\nTurned down the street and I was skatin' homie\nSheriff department straight waitin' on me\nWe just need to ask a few questions homie\nWhy the fuck you putting these handcuffs on me?\nGot to the station, now they tellin' me\nThat shit I did was a felony\nMaybe you can release your rap tape\nWhen you through doing time for statutory rape\n\n(CHORUS)\nBucccccca\nPadapapadaa...\n\nMet this girl named Kim working at M&M\nShe was nice and slim\nShe got a man but she don't talk to him\nYou know, let her tell it\nSniff that pussy you can probably smell it\nAnyway she got a baby, of course, of course\nHer and her man is goin' through a divorce\nWe kept talkin' so good so far\nWe started walkin' back to my car\nFired up the engine went to my house\nPulled down my pants, started cheatin' on my spouse\nWith a slow tempo I fucked the broad\nBut she's a nympho, bitch like it fast and hard\nOh my god this girl is odd\nLost my vision as I shot my wad\nPut on my pants, cocked up my gat\nI gotta get rid of this hood rat\nCuz she's callin' other men on my telephone\nIt's time for this bitch to take her ass home\nAfter ejaculation, took the bitch home with no conversation\nNo more Luther or S. Gate\nI pulled out my all-white too short tape\nI'm playin' dopamine beat, and the shit still hit\nI'ma make the bitch walk if she talk some shit\nGot to her house, banked on the curb\nThrew my head back, fired up some herb\nShe asked me do you wanna come in?\nI said wait a minute woman\nWho do you live with?\nShe said I'm single I don't play that shit\nI don't lie, I tell every guy\nYou gotta call me first before you come by\nI said alright\nPut my car in park\nThen I walked inside\nI hit the alarm on my '83 caddy\nShe was yippin' and yappin'\nAbout her baby daddy\nTalkin' with a hoochie pitch\nShe called her baby daddy a lil ol' bitch\nTalkin' shit loud and fast\nBitch talkin' bout she kicked his ass\nSaid she socked him, like a lil ol' hoe\nBut we was disturbed by a knock on the door\nDamn, who is that? where's my gat?\nI hope I don't die fuckin' with this hood rat\nI'm tryin' to be one of those Palmdale playas\nBut now I'm caught in some chaos\nBut now I'm caught in some chaos\nBut now I'm caught-\nHey anyway man\nThe TV and the radio was playin'\nI couldn't quite figure out what they was sayin'\nThey voices started escalatin'\nAnd I'm sittin' on the couch debatin'\nShould I stay? should I leave?\nShould I grab the bitch by her fuckin' weave?\nSock her in the eye, bitch don't lie\nYou knew your baby daddy was fixin' to come by\nAnd you invited me in\nNow look at the shape I'm in\nMy palms are sweaty\nMy muscles was tense\nI stood up fool I couldn't take the suspense\nI walked to the door kinda nervous\nI'm not ready for a funeral service\nOpened up the door, calm and cool\nI got eye contact with the fool\nShe talked about him as if he was small\nCome to find out he like seven feet tall\nI spoke, he spoke\nHe gave me a pound with his hand\nI walked right past the man\nJumped in my '83 Cadillac\nDrove down the street then I never came back\nWent to the house, grabbed the mic and started rappin'\nAbout the scandalous shit that coulda happen\n\n(CHORUS)\nBuccca\nPadapapadaa...", "title": "There’s A Price 2 Pay", "album": "Sell Your Dope", "image": "https://images.genius.com/0bbd138da6ed935df988e78c78275c51.364x368x1.jpg", "year": null}], "artist": "Afroman"}