{"artist": "Cadet", "songs": [{"title": "You Need To Hear This", "album": null, "year": "2015-07-03", "image": "https://images.genius.com/9db2bc94a35881662088ec9ddd907bfe.1000x1000x1.jpg", "lyrics": "[Verse 1: Cadet]\nUh, 'aight let me explain\nMe? I was the guy that everybody liked\nI would go to school in my Avex, fake Prada's\nAnd a pair of Cortez Nikes\nNatural Charmer, life would come with ease, a breeze - especially for me\nTeacher predicted all B's and C's\nSomehow I left with all D's and E's\nBut I made it to college, and somehow I made it to Uni\nBut that's when the shit got reckless\nYou know awake in the rave, but asleep in lectures\nAnd then my friends moved-in to a house called music\nI followed soon, and then I moved in\nThe only rent was consistency\nAnd that - I couldn't stay true with\nAnd I've been kicked out and homeless ever since\nThought this? Nah man I would never think\nBut it ain't nuttin' but the odd person help me out\nWho would give me a little food or a drink\nJoey, he gave me the bars that I needed\nZach, he gave me the fire that I breathe with\nJamal, you gave me something to believe in\nAnd really, that's the only shit that I needed\nSo wait, wait, wait, wait\nHow the fuck was I living like that!?\nMe? I'd never been homeless or in uni\nIt was a metaphor, but I been feelin' like that\nSee Jamal, was the guy that gave me a change\nWarm up session, he feel it like that\nAnd the one thing I've learnt about this music in a couple weeks..\nIs anything you put in it, it will give it right back\nSee me.. I never made it F'in with the music\nThat's why a nigga feel stupid\nI'd turn one way, and life would turn another\nShit, my shit's been Rubix\nI'm a go mad if I keep on watching everybody's movements\nComparing how they do shit\nCause dun'know I flop\nAnd be that guy who's actually hard.. but musically useless\nSo now I'm like, \"fuck\" ... \"shit\"\nNow I can see, why I ain't got nowhere...\nCause yeah I be talkin' bout music\nBut my work rate shows that I've got no care\nBut shit's gonna change, mark my words\nI can no longer say.. that life ain't fair\nGet a beat, my pain and we'll off-load there\nGet it by the boat-load like a Coscos there\nSo yeah\nYou know what people say at the end of the year\nLike 'this year's my year'\nWell today is my today..\nAnd tomorrow is my tomorrow..\nAnd I'm here for the good..\nLet me make shit clear see\nI ain't trying to be the only nigga from the ends that ain't bussin'\nMotherfucker I see everybody bussin'\nKrept, Konan, Bonkaz, Stormz, they be bussin'\nEverybody bussin' but me see\nWallahi, I prayed for them\nThey deserve it, because they work hard\nHow I, would wait for a bringing out\nI realized the only nigga that could bring it is I\nIt's cool see me, I'm a boss I could dream too\nTelling big channels 'I don't need you'\nSo wait, I gotta pay you to show me love?\nBut you upload a shit MC with a buzz?!\nMe, I been so hungry that I ate through the bone\nPut a video out, and I would wait by the phone\nBut no, nigga I'm grown\nIf I get that phone call, I gotta bring my plate to the throne\nI'm Cadet (Cadet!)\nYeah, and now I'm in my zone\nSpit a couple lyrics, and you know we're shelling down the show\nSee I would wait for a bring in\nBut no... see I gotta carry my weight on my own\nSo now they lookin' at me like a nigga buggin'\nLike I ain't sick, and I ain't nothing\nI say who I am and they chat to me like Rosie\n\"Are you gonna go get your cousin?\"\nNah, it's my time and I'm'a shine through\nWait for a cosign, I don't have time to\nDie for my cuz, I won't think twice to\nDon't know who I am? Let me remind you\n\"If I shoot you in your knees your knees are gone\nThis ain't Eastenders Denise won't come back'\nR1, R2, L1, L2, X, left, down, right, up and get your health back\nListen, to the shotgun we're lifting and have him back-flippin!\nAnd who? Who am I?\nCadet, Cadet!\nMy niggas run up on city!\" - I'm that guy"}]}