{"artist": "Playboi Carti", "songs": [{"album": null, "title": "Holyfield", "image": "https://images.genius.com/089c7db7ef1ceab4c003b2ccc0c82cf4.500x500x1.jpg", "lyrics": "[Intro]\nGot my 9 tucked, take it up, off his feet for what?\nCause he talking shit, took his bitch, with my fuckin wrist\nBetty Crocker mix, mix the work, make it bottle up [DJ Fade Out] (Bring that shit back nigga, 2 phones Carti nigga... Fuck wrong with y'all niggas... Squad nigga...)\n\n[Hook]\nCautious, cautious, you better stay cautious\nThe feds out here watchin, tryna get our profit\nGot my 9 tucked, take it up, off his feet for what?\nCause he talking shit, took his bitch, with my fuckin wrist\nBetty Crocker mix, mix the work, make it bottle up\nNiggas say me, he ain't Carti, he ain't with the shits\nGotta brick in, got some more evicting, build a house with it\nGot a bitch, then got another bitch that like to fuck and shit (glass breaks)\nCautious, cautious, you better stay cautious\nThe feds out here watchin, tryna get our profit\nGot my 9 tucked, take it up, off his feet for what?\nCause he talking shit, took his bitch, with my fuckin wrist\nBetty Crocker mix, mix the work, make it bottle up\nNiggas say me, he ain't Carti, he ain't with the shits\nGotta brick in, got some more evicting, build a house with it\nGot a bitch, then got another bitch that like to fuck and shit\n\n[Verse]\nI don't tongue wrestle, with a nigga bitch I pop it off\nWatch his body fall, pick him up, then we drop him off\nFuck em all, with my team, I ball, know they second aw\nFuck with me, I fuck with you, I put you on a plug or two\nIn the streets, they know bout me\nI keep the lean I keep the heat\nIn the Audi, Fendi on my body, feelin' on ya shawty\nPurple drank, blowin purple dank, nigga the fuck you think?\nShout out to my niggas Scoob, and shout out to my nigga Nae\nShout out to my nigga La Flare, and all these thirsty hoes out here\nFlat bed, straight from hell, young nigga, can't you tell?\nEnemies, who is them? Blow money, Holyfield\nEnemies, who is them? Blow money... Blow money\nBlow money, call me Holyfield\nI throw money, call me Holyfield\nI show money, call me Holyfield\nI blow money, call me Holyfield\nFlat bed, straight from hell, young nigga, can't you tell?\nEnemies, who is them? Blow money, Holyfield\nEnemies, who is them? Blow money... Holyfield\nHolyfield... Holyfield... Holyfield\nI blow money, call me Holyfield\nI throw money, call me Holyfield", "year": null}]}