{"artist": "Boosie Badazz", "songs": [{"album": "In My Feelings. (Goin’ Thru It)", "title": "Cancer", "year": "2016-01-01", "lyrics": "[Intro]\nBoosie Badazz\nColdest words I ever heard was\n“Torrence Hatch, I’m sorry. You got cancer”\nDamn\nJust beat death penalty, now I got cancer?\n\n[Verse 1]\nFather God, I need answers\nNews to my ears, shit real from the doctor\nHe said, “Boosie, boy you got cancer”, I cried for hours\nJumping in the shower, stressing, and cried to my mama and my nana\nI can’t believe this shit\nCancer got me scared like I’m ‘bout to leave this bitch\nTold my bitch, she cried, told my niggas, they cried\nMama tried to downplay it to the family, she lied\nI’m thinking, “damn, how did I get cancer?” in my kidneys\nBack fighting for my life, I guess finish my sentence\nI guess way gone, I stress not giving up, not yet\nI need prayers, fuck respect\n\n[Hook]\nFather God, I need answers (man)\nTell me God, how did I get cancer?\nFather God, I need answers (protect me, God)\nTell me God, how did I get cancer? (Why me though?)\nRight now, shit\n\n[Verse 2]\nI’ve been stressing so bad, my nigga\nPraying to the man with both hands, my nigga\nJust want to be around in my family chilling\nLost three aunties to this pussy ass disease while you keep beef with my family, nigga\nLeave us alone, my God, we need some answers\nLeukemia at 10 years old, please heal this cancer\nMy aunty Keisha just left, it’s real with cancer\nStress ain’t do it to her, ma, she was killed with cancer\nIt’s hard to make a nigga think strong (man)\nI probably need to put some pink on (man)\nThis shit gon’ probably make my team strong (man)\nHow long I live after my kidney gone?\n\n[Hook]\nFather God, I need answers (man)\nTell me God, how did I get cancer?\nFather God, I need answers (protect me, God)\nTell me God, how did I get cancer? (Why me though?)\nRight now, shit\n\n[Outro]\nI need the answers\nDaughter will say “Dad, how you get cancer?”\nI said, “baby, I don’t know how I get cancer”\nHe’ll answer me on death row, he’ll answer me again\nTell me God, how did I get cancer?", "image": "https://images.genius.com/2164ea93fca3ae0361641a11ceda5ba2.412x412x1.jpg"}]}