{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "Disco Inferno", "year": null, "album": null, "lyrics": "Yea, yea, and it don't stop\nKool A.D. best rapper, real hip hop\nHundred dollar freestyle for you and your mamma or whoever, I don't give a fuck, ay, look\nIt go burn, burn, it's a disco inferno\nTwist the [?] slow and burn one learn some\nFuck the racist ass fascist government\nThey army of pig protecting they little piggy banks\nThe bootsy-ass war machine is a shitty tanks\nFuck prisons and schools, they both tools of mass mind control\nWe destroy to rebuild, check the melody, ill\nForever we kill all the negative plant seed\nBuild some better shit to trill forever spit\nReal little bars for a deal\nFuck a deal\nBut still considering this one option\nShout my cousin Tulio\nYo, fresh out the feds\nFinna have a little fun with a pop gun\nLames, I'm not one\nGames I'm not playin'\nStruggle in my blood, nigga, stop frayin'\nGet your dome piece knocked clean off you fuckin' neck piece\nIf you keep talkin' like hella reckless\nTake a little nap on the concrete\nLook, now I got your necklace\nYa, come up in the stop, [?] day shit\nMan, I'm kickin' you that real-ass fuckin' head up shit\nYo, bars so vivid and wicked and wild\nWith it, live with it, live with it, vibe with it\nGet, live it even make your head spin\nThrow some cardboard on the sidewalk\nWindmill, head spin, jump back\nJump back up again, kick another freestyle\nBust some [?] out of the Jansport\nSpit out a little W-I-L-D style\nJuggle the Apache break\nWhile crab-scratchin' on the third technique\nSmoke herb at the Greek diner, eat a salad\nI'm writing these ballads and they all timeless\nTime after time I quote lines till I'm shiny\nSee the designs my whole pocket cold, lined with gold I hold\nLined with the rap shit, like, Toto, guest verse on police radios, bolo\nKill a microphone dead, dolo\nRed cup, solo cut, [?]\nYou already know though, yolo\nFunky monkey, power [?], mojo, jojo, Loco\nHaha, ya'll playin' with ya'll moco\nYa'll raps is a nono\nMe, I'm all yesses\nKool A.D., the god blessin' your asses with the freshness\nYes, bitch"}]}