{"songs": [{"lyrics": "[Intro]\nUhh, uhh, yes sir!\nJust the sound of his voice is a hit, heh heh\nY'all niggas got me really confused out there\nI make Big Pimpin' or Give it 2 Me one of those\nThey hail me as the greatest writer of the 21st century\nI make some thought provokin' shit\nY'all question whether he fallin' off\nI'ma really confuse y'all on this one... follow!\n\n[Verse 1]\nWhen them tops come down, chicks' tops come down\nLike when them shots come out, make cops come around\nWhen them blocks come out, I can wake up a small town\nFinish off the block then I make my mall rounds\nStares get exchanged then the fifth come out\nThe tough guy disappear, then the bitch come out\n\"That's him!\", I'm usually what they whisper 'bout\nEither what chick he wit', or his chip amount\n'Cause I been doin' this since CHiPs was out\nWatchin' Erik Estrada\nBaggin' up at the Ramada, table full of powder\nA/C broke, 'bout to take another shower on my 25th Hour\nSpike Lees everywhere, game or the flight\nYou might see me anywhere, a day in the life\nOnly thing changed the tail number on the flight\nI can touch down and take off the same night\nI'm so bossy, bitch get off me\nTrick get off me, you can't get shit off me\nI'm so flossy, no 6's on Sprees\nLaid back, Maybachs, don't even talk to me\n\n[Chorus]\nThis is that ignorant shit you like\nNigga fuck shit ass bitch trick plus ice, c'mon\nI got that ignorant shit you love\nNigga fuck shit maricón puta and drugs, c'mon\nI got that ignorant shit you need\nNigga fuck shit ass bitch trick plus weed, c'mon\nI'm only tryin' to give you what you want\nNigga fuck shit ass bitch you like it don't front!\n\n[Verse 2]\nThey're all actors, lookin' at themselves in the mirror backwards\nCan't even face themselves, don't fear no rappers\nThey're all weirdos, De Niros in practice\nSo don't believe everything your earlobe captures\nIt's mostly backwards, unless it happens to be as accurate as me\nAnd everything said in song you happen to see\nThen, actually, believe half of what you see\nNone of what you hear, even if it's spat by me\nAnd with that said, I will kill niggas dead\nCut niggas short, give you wheels for legs\nI'm a K-I-double-L-E-R, see y'all in Hell\nShoot niggas straight through the ER, whoa!\nThis ain't B.R., no, it's S.C. CEO\nThe next Lyor, no, the next leader of the whole free world\nAnd the first thing I'ma do is free Sigel, go...\n\n[Chorus]\nI got that ignorant shit you like, nigga\nI don't give a fuck, plus ass and ice, nigga\nI got that gangsta shit you love\nNigga, bang out, brains out, money and drugs\nI got that ignorant shit you need, nigga\nHydro, Blueberry, bomb ass weed, nigga\nI got that project shit you want\nNigga, dope fiends OD, you love it don't front!\n\n[Refrain]\nI'm so bossy, bitch get off me\nTrick get off me, you can't get shit off me\nI'm so flossy, no 6's on Sprees\nLaid back, Maybachs, don't even talk to me\n\n[Break: Singing quietly]\nExcuse me bitch, fuck your name\nCan you come, can you gimme some brain?\nWhen you're done, can you please get the fuck out of my sight?\n\n[Verse 3]\nI built an ark, mami, cry me a river\nBlacken my heart by puttin' light liquor in the liver\nPut my all in the part that spreads apart now I'm back together\nYoung Goldie, The Mack forever\nHeard they love it when I'm hard on hoes\nSaid a G don't give a bitch no keys or security codes\nI agree, my lady ain't no bitch, she gets whatever I own\nSo when you see her, understand that's me, nigga\nUnderstand I'm the same OG, nigga\nI know the difference 'tween a bitch and a B, nigga\n...trick get off me, you can't get shit off me\n\n[Chorus]\nThis is that ignorant shit you like\nNigga fuck shit ass bitch trick plus ice, c'mon\nI got that ignorant shit you love\nNigga fuck shit maricón puta and drugs, c'mon\nI got that ignorant shit you need\nNigga fuck shit ass bitch trick plus weed, c'mon\nI'm only tryin' to give you what you want\nNigga fuck shit ass bitch you like it don't front!\n\n[Outro]\nI'm so bossy, bitch get off me\nTrick get off me, you can't get shit off me\nI'm so flossy, no 6's on Sprees\nLaid back, Maybachs, don't even talk to me", "title": "Ignorant Shit (Original Version)", "image": "https://images.genius.com/32c2c2dad3c9706568cf360cfa132686.388x568x1.png", "year": null, "album": null}], "artist": "JAY-Z"}