{"songs": [{"year": "1997-04-08", "image": "https://s3.amazonaws.com/filepicker-images-rapgenius/jw0MruVqRHyvUHZHvUXM_R-3459122-1331203026.jpeg.jpg", "title": "’Burban & Impalas", "album": "Still Serious", "lyrics": "[Verse 1]\nI ain't trippin off these niggas flippin, losin they mind\nGettin high, chasin hoes, I was like that at one time\nI did my thing, and still on top of my game\nGot niggas askin: Big Mike, when you gon' be droppin again?\nI just smile, go back the to lab, work on my style, collect beats\nCook it up like a ki, and take it back to the streets\nCause niggas beef when I don't speak, like they straight missin somethin\nI give em a tape, they be like 'great', pop it in they deck and start bumpin\nGot em humpin like the Gap Band, I'm back, man, look here\nDoin shows straight in all 50 states within one year\nI got tight gear for the stage, blow up and make front page\nNow it's happenin, I'm platinum with tracks my nigga Mike B. laid\nMade niggas mad, then I step, got a new click\nNow I'm ready to do shit, '97 new shit\nKeep on talkin, son, and I'ma keep on stackin\nI'm real with this shit while you niggas are out there actin\n\n[Chorus]\nPlaya, playa, make the hoes say, dollar, dollar\n'Burbans and Impalas, makin niggas holler\nWhen they recognize a Louisiana nigga straight comin Texas side\n\n[Verse 2]\nHey what's that nigga's name?\nIt's the Peterman, ain't no shame in his game\nPlaya, playa, make the hoes say, dollar, dollar\n'Burbans and Impalas, makin niggas holler\nWhen they recognize a Louisiana nigga straight comin Texas side\nSurprise, who's catchin a eye like the ufo\nThis ain't the mothership, I don't return shit that you left, hoe\nAsk her, though, I max the hoe, bags the flow\nAss to toe, hoes I hit, I let you know\nI'm the original, there's no second, yo\nBecause a nigga's kinda special, loc\nSeriously speakin weekend after weekend\nA nigga like me got the hoes seriously tweakin\nFreakin at night, I cracks it like Whodini\nHad a bitch named Jeannie\nMade her act bad for my brother Peanie\n\n[Chorus]\n\n[Verse 3]\nIt's the bigger, the blacker, the nigga comin from that swamp\nAbout to smoke a quarter for starters, so pass that blunt\nDon't stunt, what you want, niggas, what?\nSchool em with some of that buddah\nCos Kooley keep fuckin with them bustas\nAnd don't give a fuck, so what you wanna make of it?\nTotin on that swisher, I know you wanna hit it, come have your take of it\nFakin it, never, nigga cos I'm way too real for that\nRollin with a gang of niggas ready to kill for that\nGreen shit, which we smoke from Houston to New Orleans, bitch\nTake a hit and quit, and now I got you seein shit\nSo pass it to my nigga, my nigga pass it back to me\nTake it to the head, and that's the last of it\nYou see me in the back with my hoes ridin on that gold\nHigh till I die and that's the way it go, oh\nYou know, I see you bitches after the show\n\n[Chorus]\n\n{CeCe:}\n(I need it\nI need it\nI want it\nI want it\nI like it\nI like it\nGot to have it\nI got to have it\nI got to have it\nOh yeah\nYes\nI like it yeah\nOh yeah\nI want it\nI want it\nOh yeah\nOh yeah-yeah\nMakin me holler\nDollar dollar\nYeah)"}], "artist": "Big Mike"}