{"songs": [{"title": "Check", "album": "Lil Durk 2X", "year": "2016-07-22", "image": "https://images.genius.com/86d1200e07657a910cd4be129adc08d6.1000x1000x1.jpg", "lyrics": "[Chorus]\nEveryday I spend my last and I count up a check\nThen I gotta go and get it\nI lay my niggas to rest and you know whose next\n10 toes, ain't no sittin'\nHow is you tryna finesse?\nCan't finesse a finesser, the hustlers know it best\nGave the right niggas money, they say I'm a mess, no stress\nI'ma count me a check\nI'ma count me a check\nI'ma count me a check\nI'ma count me a check, check, check\nSee you can't finesse a finesser\nSee I don't be with nothin extra\nSee you can't finesse a finesser\nCount me a check\nI'm just countin' me a check\n\n[Verse 1]\nRoll up in an Audi, no lottery but we scratchin' shit\nSix Tecs for the drop but usually we sippin' Actavis\nDope boy music, them niggas gon' want to trap to this\nMacaroni my bag of homies so ain't no lackin' shit\n30 for the Rolex cool, 20 for the cross too\nBeen there when nobody was there, it was dark too\nKeep me protected from the streets, I got a cross too\nAnd if you cross me then I cross you\nRan off on the plug twice and I know they searchin'\nIf I got to say that shit twice then you know I'm merchin'\nHis and hers Rollies get them shiny looking like the ocean\nGet on top of me baby and get to surfin'\nLike a surfboard\nSippin' on this lean got me paranoid\nGotta get this green so help me Lord\nSo why you with that hater shit?\nCan't fuck with a basic bitch\nI'ma tell 'em them lies\n\n[Chorus]\nEveryday I spend my last and I count up a check\nThen I gotta go and get it\nI lay my niggas to rest and you know whose next\n10 toes, ain't no sittin'\nHow is you tryna finesse?\nCan't finesse a finesser, the hustlers know it best\nGave the right niggas money, they say I'm a mess, no stress\nI'ma count me a check\nI'ma count me a check\nI'ma count me a check\nI'ma count me a check, check, check\nSee you can't finesse a finesser\nSee I don't be with another X\nSee you can't finesse a finesser\nCount me a check\nI'm just countin' me a check\n\n[Verse 2]\nMoney is the motto, these bitches don't wanna swallow it\nBitches want the fame, all they want me to do is follow them\nShe just gon' bring me drank cause she a pharmacist\nPlay my new single at the station cause I ain't callin' in\nNiggas in the city wanna kill me, I ain't part of them\nMy niggas got 50 shot clips, they like barbers then\nShe can ride my 'Rari then cause she look like a Barbie bitch\nIf I catch her stealin' we all at her head like bobby pins\nI'ma get this money till I d-i-e\nBring bottles to my session, to my VIP\nI like my bitch's vest, let me see ID\nGettin' all this money like Lord why me\nGang in this bitch\n100 dollar bills changed in this bitch\nGot the Rollies and the chains in this bitch\nWe gon' shoot us somethin' strange in this bitch\nCause I count me up a check\n\n[Chorus]\nEveryday I spend my last  and I count up a check\nThen I gotta go and get it\nI lay my niggas to rest and you know whose next\n10 toes, ain't no sittin'\nHow is you tryna finesse?\nCan't finesse a finesser, the hustlers know it best\nGave the right niggas money, they say I'm a mess, no stress\nI'ma count me a check\nI'ma count me a check\nI'ma count me a check\nI'ma count me a check, check, check\nSee you can't finesse a finesser\nSee I don't be with another X\nSee you can't finesse a finesser\nCount me a check\nI'm just countin' me a check"}], "artist": "Lil Durk"}