{"artist": "Ice-T", "songs": [{"title": "M.V.P.S", "lyrics": "[Intro: Ice-T Talking]\nYo, yo, what's up? this is MC Ice-T\nI'm here to kick off the M.V.P.s. for the 90s\nYou know, I'm talking about my most valuable player buddies\nYou know, so I'mma drop them on you like this\nCheck it out\n\n[Ice-T]\nTo the brothers who put me on in Hip-Hop\nI'm talking bout Grandmaster Caz, Grandmaster Melle Mel\nAfrika Islam, Africa Bambaataa, Roger from Uncle Jamm's out here in L.A\nThe Unknown DJ, and the man called AJ, used to run the Radio\nPeace out, without you I wouldn't be getting it on\nYou know what I'm saying?, and y'all all are players (players, players)\nTo some of the rappers that gave me respect when others were dissing me\nI'm talking bout the man Jalil, the one Ectascy\nAnd the man Grandmaster D, I'm talking bout Whodini\nAnd also the Force MDs\nYou treated a brother real cool back in the day\nYou know, I ain't forgot that, you know what I'm saying?\nAll those other rappers were treating me like suckers, FUCK THEM!!\nCause y'all are players\nTo RUN D.M.C. who kept rap alive when rap was about to take a dive\nYou know what I'm saying?\nYou are the kings of Rock, and peace out, y'all are players\n\n[Break: Ice-T]\nPlayers, players, straight up!!\n\n[Ice-T]\nTo my true player buddies\nI'm talking about Big Daddy Kane\nYou was a player to your motherfucking heart\nYeah, you know, you're my nigga, peace!!\nTo Biz Markie, yeaaaahh boy, you know the Biz\nRemember back on the bus, when we had the bus and we was sharing it Biz?\nYeah, I ain't forgot it, you're my nigga, word\nEric B and Rakim and the man Ant, yeah\nTrue niggas with attitudes.. to King Sun, peace god\nTo Chuck, Flavor and Griff\nY'all are still one group as far as I'm concern\nAnd you are true players\nTo KRS-One and D-Nice and Scott La-Rock\nI talk to you everynight Scott, you know what time it is\nAnd the BDP posse, they're all players\n\n[Break: Ice-T]\nPlayers, players, that's right!!\n\n[Ice-T]\nTo Luke Skyywalker and my man Marquis and Mr. Mixx\nKeep it bumping down there in Miami, cause y'all are players\nTo the EPMD true players\nTo my man Moe Dee, Easy Lee and the whole crew\nY'all are players\nTo my man Daddy-O and the Stet Posse, players\nTo MC Lyte and Queen Latifah\nTwo ladies that got all the Ice's respect\nAnd that's right, that's right girls\nY'all are players (players, players)\nTo my west coast niggas, I'm talking about Too $hort\nNigga, you're in the house, Short Dawg, peace out my man\nThat's right homeboy, cause you're a motherfucking player\nTo the AmeriKKKa's Most Wanted, I'm talking about Ice Cube\nWe always been cool and we will always be cool\nCause you're my main man, and you'se a player\nTo Eazy-E, N.W.A. and The D.O.C\nThere's a lot of static going on between you and Da Lench Mob\nBut I can't forget the days we used to all tour together\nYou know what I'm saying?\nSo you got my respect, and you're motherfucking players\n\n[Break]\nPlayers, players\n\n[Ice-T]\nTo my man King Tee, seemed like he can't think without a drink\nBut he's a player, he's a player, I got to admit it\nTila, you're a goddamn player\nTo Tone Loc, Boo Yaa and the man Kid Frost\nY'all be out tearing up clubs literally, and you're true players\nTo the one and only trigger happy Geto Boys\nIt took a long time and I was there I seen you brothers coming up\nBut now you're in motherfucking effect\nAnd you're goddamn players (players, players, players)\nHa ha, to the Syndicate, too many to name\nY'all right here in the studio, so why I'mma name ya?\nI'm looking right at ya\nAnd y'all know I ain't even got to tell y'all, y'all are players\nPeace out to my manager George\nI taught you how to be a player, and you're doing well\nTo the Crime Crew, good to see y'all out of jail\nAnd y'all are all players\nRemember back in the day we used to rob jewelry stores together?\nTo the producers Afrika Islam, the one and only DJ Aladdin (Aladdin, Aladdin)\nSLJ Rock bottom, and the man called Bilal\nPeace out, y'all made this record hit and y'all players\nA special shout out is going out to the one and only MC Hammer\nA lot of people diss you man, they just jealous..\nFuck 'em, fuck 'em, fuck 'em, fuck 'em, fuck 'em...", "image": "https://images.genius.com/8ba43671bb57813daf61c8431aebd0ea.1000x1000x1.jpg", "album": "O.G. Original Gangster", "year": "1991-05-14"}]}