{"artist": "Iggy Azalea", "songs": [{"title": "Flexin & Finessin", "lyrics": "[Chorus:]\nFlexin' and Finessin'\nFlexin' and Finessin'\nAin't got no time for stressin'\nI'm just flexin' and finessin'\n\n[Verse 1: Iggy Azalea]\nOkay now, big dollars I been gettin'\nThis my world, boy, I been shittin'\nThese bad bitches? I'm friends with 'em\nThey bow down and let my friends hit 'em\nLike got damn, this Tight Gold shit!\nYou ridin' round in my old whip\nMe? Trapgold 1st? Black hood\nHe gotta double cup, and pour that good\nI got racks to play, you on my tip\nYou just window shop and don't buy shit!\nI gotta Pearl Handle, don't try shit and to these haters please stay up off my dick\nI got Cartiers on my eyelids and these Princesses on my wrist\nHow the fuck could you say it ain't fly bitch!?\nI'm so fresh to death I just died, bitch!\nNow clap clap for me, go ahead, girl, bring it back, back for me\nPull my cash out my, let her lap dance for it\nFuck around and bust a band, no black jack on it\nCall me Iggy Iggs, I'm on trippy shit\nI like Whitney's hips, I like Britney's tits\nI want 'em both to strip I'm on pippin' shit\nAnd since I can't pick… We'll do a switchy switch, word\n\n[Chorus:]\nFlexin' and Finessin'\nFlexin' and Finessin'\nAin't got no time for stressing\nI'm just flexin and finessing\n\n[Verse 2: Juicy J]\nLet’s go!\nI was counting cash with the money machine\nShe giving me head then coming outta her jeans\nSmoke a pound today roll up a Juicy J double cup full of Promethazine..\nSeen the Porsche I like, bought the bitch twice\nI can do that shit for the rest of my life\nSeen the bitch I like, hit the bitch twice\nStay flexing hard, mother fuck a price\nI get it flip it and shit it\nPoppin' molly, dig it back to business\nRide the Lamb doing twice the limit\nGot your bitch screaming from start to finish\nBank bands all on my cash, stripper bitches gone shake their ass\nTwenty years in the rap game, man, I don’t have to make it last\nThat bullshit that you smoking never been in my cigar\nWhat I'm smoking on you gotta keep in a jar\nOwn it to the shit and nigga pop and have a bar\nWith two white chicks ménage à trois\nRolling up, back to back\nI need my medicine, I got cataracts\nOne night with yo bitch then you can have her back\nMe saving these hoes imagine that\n\n[Chorus:]\nFlexin’ & Finessin', Fle-Flexin’ & Finessin'\nAin’t got no time for stressin'\nI’m just Flexin’ & Finessin'\nFlexin’ & Finessin, Flexin’ & Finessin'\nAnd Finessin', and Finessin, and Finessin'\nFlexin' and Finessin', nessin-nessin-nessin\nLook look look flexin' and finessin', nessin-nessin", "image": "https://images.genius.com/122cb5a8d88b89ac2c08aedadb152d20.1000x1000x1.png", "album": "TrapGold", "year": "2012-10-11"}]}