{"songs": [{"album": "Us or Else: Letter to the System", "image": "https://images.genius.com/c5de385a72ab3f343496cb34df9c6487.996x1000x1.png", "year": "2016-09-23", "title": "40 Acres", "lyrics": "[Verse 1: B. Rossi]\nShe done put her reparations in a handbag\nHe done spent his reparations on his swag, swag\nA black nigga, put your fortunes in a sandbag\nLaugh at your misfortune then we put it in a hashtag\nAin't no leaders only leisure, only reapers, ain't no sowers\nThey get higher, we get lower, damn it's over\nIf racism ain't in color then it's damn sure in the class\nGot the races on each other, you got niggas then there's blacks\nYou got crackers then there's whites, separated by the green\nAfter five hundred years, think we play for the same team\nSmokescreen, make the president the black guy\nIt ain't no reason why you shouldn't have success, right?\n\n[Chorus: B. Rossi]\nForty acres and a Muller\nI spent my reparations on the jeweler\nI bought a timepiece, now ain't no lookin' back\nNow ask them muthafuckas what the fuck they lookin' at\nUh, forty acres and a mule, forty acres and a mule\nThese niggas actin' fuckin' fools for forty acres and a mule\n\n[Verse 2: Killer Mike]\nAnybody interrupt freedom, kill 'em\nWord to Robert F. Williams, feel 'em\nDevil got me sick to my stomach, boo\nWord to Elijah Muhammad, ooh\nI don't give a damn what the preacher ever tell y'all\nJesus, Muhammad, ain't comin', woo\nI'mma tell y'all what the ancestors shoulda done did when they seen the first boat comin, yeah\nKilled every man, child, woman, yeah\nKilled every damn thing on it, yeah\nKilled everything if it looked European\nSend it back to the Queen like, ho\nYou ever step your foot in Kemet, bitch we slit your throat\nWe send them funny fuck boy preacher types back to the Pope\nFuck is you? Fuck your Zeus or fuck Medusa\nThis the school of Shaka Zulu\nFast forward to the future, choppa do you\nWe done dyin' and they cryin' and we screamin' hallelujah\nWhen them crackas ask why say we did it for Lumumba, fucker\n\n[Chorus: B. Rossi]\nForty acres and a Muller\nI spent my reparations on the jeweler\nI bought a timepiece, now ain't no lookin' back\nNow ask them muthafuckas what the fuck they lookin' at\nUh, forty acres and a mule, forty acres and a mule\nThese niggas actin' fuckin' fools for forty acres and a mule\n\n[Verse 3: T.I.]\nLoad up my clip off a Zimmerman\nFilling my pocket with Benjamins\nWho the fuck are you? I been a man\nThem crackers see me \"oh not him again\"\nTake your ass out the trap middle finger to Trump\nFuck the police, they crooked as they come\nThey pull you over and know you legit\nAsk you for your license, when you reach then they dump\nNow the prison yard like the cotton field\nHouse nigga's snitchin', that's what got 'em killed\nNigga thought he made it cause he got a deal\nFirst album suppo' been outta here\nNot quite dude, back to selling blow\nOn some 24s I'mma send it here, learn to stay silent\nLearn more on these streets then they did in they college\nI'm certified, don't murder guys\nBut my niggas still far from civilized\nKill for anything but civil rights be the murder case\nCause a nigga like, they heard it from the king, from the king\nWhat you mean, bitch?\nTrade my forty acres from my mule and my necklace, yeah\n\n[Chorus: B. Rossi]\nForty acres and a Muller\nI spent my reparations on the jeweler\nI bought a timepiece, now ain't no lookin' back\nNow ask them muthafuckas what the fuck they lookin' at\nUh, forty acres and a mule, forty acres and a mule\nThese niggas actin' fuckin' fools for forty acres and a mule"}], "artist": "T.I."}