{"artist": "Casey Veggies", "songs": [{"title": "Love = Hate, Ulterior Motives", "album": "Life Changes ", "year": null, "image": "https://images.genius.com/7676a7a556d8afeb36851a1fc1b85a3e.500x500x1.jpg", "lyrics": "[Part 1: Love = Hate, Produced by: T.H.C.]\n\n[Verse 1:]\nYeah, yeah, I know a lot of girls that be on the same things\nAll my niggas in the streets smoking, trying to maintain\nShe like sipping champagne, I beat it out her main frame\nMy chick part of my campaign\nAnd your chick looking like Flavor Flav\nHit that picture, fade away, and fall back, I’m all that\nNY to LA, but a CV on my ball cap\nI be around the globe, we’re going out, seing open toes\nSort dresses, them nights wrest and my fortress getting fine chick\nGet anointed, get knighted, I’m addicted to fly shit\nI’m a witness to righteous, steps finding out what my life is\nI got a quite range, at 18, my life change\nI got room keys and new things that we can do for this night thing like\n\n[Hook: Casey Veggies]\nIn the club, at the party, everybody wanna be somebody\nIn a world that’s so strange real niggas trying to maintain\nLove and hate is the same thing, love and hate is the same thing!\nIn the club, at the party, everybody wanna be somebody!\n\n[Verse 2:]\nI know a lot of things, most of which I’m gonna change\nThat come just from growing up\nLearn that love and hate is the same thing!\nI can only wife the plane jane\nMake a bad ho give me bad brains\nI realize I had brains and I got it all, man and I gotta fall\nI gave it up, man I gotta live\nGirl, tell me what the problem is!\nEverything is so cool and one thing we couldn’t do\nOne thing we couldn’t see, who real, I can’t tell\nOut the drop is gonna sell, I caught it out, starting out\nYoung niggas run everything, make her earn that wedding ring\nThen I make her sing them high notes, I got high hopes\nAnd my side along, I love you when she ride long\nThat’s my angel, she always wear a halo\nEver since I got dough, my cousin told me lay low!\nI can stay long, what did I say wrong?\nWhat happened between me and you? Why we can’t even get along?\nWatch me you call! You can’t blame it on me\nLove and hate is the same thing\nLove and hate is the same thing\n\n[Hook:]\nIn the club, at the party, everybody wanna be somebody\nIn a world that’s so strange real niggas trying to maintain\nLove and hate is the same thing, love and hate is the same thing!\nIn the club, at the party, everybody wanna be somebody!\nIn a world that’s so strange real niggas trying to maintain\nLove and hate is the same thing, love and hate is the same thing!\nIn the club, at the party, everybody wanna be somebody\n\n[Part 2: Ulterior Motives, Produced by: Rahki]\n\n[Verse 1:]\nShe wanna leave and don’t know who wrong about it\nSo confusing I can’t even write songs about it\nThinking of reasons, shouldn’t feel so alone about it\nNow I’m playing catch up, squeezing the wrong about it\nI’m from where cops come, (sirens), gone we out it\nKnow when I hit the shows, ladies ain’t swarm around me\nAnd when I leave I know the one who’ll go mourn about me\nG5 thoughts, homey my mind is clouded\nToday I bought a fit that was in the thousands\nAnd a chain cold like the ice in the mountains\nI started spittin, never contemplated bout an outcome\nNow I’m getting more income than my outcome\nMy last flow was outgunned, my last girl was not one\nMy last homey got sun, me and my brother like one\nAnd I’m only 19, the saga just begun\nYoung kids run everything under the sun\nPeople live life very relentless\nMy niggas act so hard with them scary agendas\nMy friend claim sets pray he ain’t never get injured\nTell my homeys baby steps, hope you never befriend this\n‘Cause if I’d lose who I started then why should I end it?\nNo, I’m kidding, I had to keep rewarding my millions\nStunt a little, cop a whip and take care of children\nSpread love give thanks, just like the pilgrims\n\n[Hook: BJ the Chicago Kid]\nIt’s just another day in the life of a young nigga with ulterior motives\nI wonder if I can control this\nUlterior, ulterior… motives\nUlterior, ulterior… motives, motives\n\n[Verse 2:]\nI wanna live the same life, that charm about me\nRegular times, skidrows and the campus crowded\nLess pressure, less things and my mind is skowin\nBetter relationships, we only spend time when I’m out here\nIt’s what I chose so I guess I can’t say that it’s not fair\nLike a mom in the crack house, doing the rocks there\nPut me in so deep, that’s heavy one dome kip\nI pull you one of them seats and I might pull on yo hair\nAnd when we on the east coast you know I got the cab fare\nAnd when I’m so far away I still see and love that\nEyes blood-shut red, I’m in over my head\nAct like she ain’t know I pop your head, those are my bread\nThat’s just what I think, fuckin that’s what I said\nThen I made one blink and she was leavin me here\nTold my mama I’mma make it, she was believing me yeah\nBut a couple year later, she didn't conseive I'd be here\nIn New York on my own at the regency theater\nIllest kids in America, she ain’t innocent mama\nAnd she listen to Erica, homey my girl is scholar\nYour girl is sort of a wallet, we using it til that we done with\nTell her give me my money, I’m bout the 50’s and 100’s\nAnd the conspiracy subjects are my priorities\nYou should give some of these\nI’m on my knees and I’m begging God please\nHumble my steez, I swear my whip is a tease\n\n[Hook]"}]}