{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Kane] Hey yo Teddy\n[Riley] Yo\n[Kane] I ran into a young lady Maliya last night\n[Riley] Word?\n[Kane] Must have been her husband's payday\n[Riley] Heheh\n[Kane] because she bought me this here brand new\nDiamond link that you see me with on\n[Riley] Mmm\n[Kane] Smooth, you knowhatI'msayin? You know why?\n[Riley] Why Kane?\n[Kane] Cause I get the job done\n\n[Hook x2]\n\"I work\" (x3)\n\"I work.. baby!\"\n\n[Verse 1: Big Daddy Kane]\nThe question at hand, is how do I love thee?\nI count the ways but girls don't shove me\nOne by one you can come and caress me\nUndress and molest me but you can't posess me\nBecause I love a young lady that's beautiful\nBut one that's smart for me, is more suitable\nIn other words, to make it simple and plain\nYou gotta have a brain in order to be Ms. Kane\nBut in the case of not becomin my lady\nI take em eight to eighty, dumb crippled and crazy\nCrisp and clean with no caffeine\nAnd a pair of spandex or either tight jeans\nCouldn't believe the ones with the Chinese cuts\nBut I'll take 'em with the weave hangin down to they butts\nAnd if you step up in a large sum\nLike Martin Luther King, I Shall Overcome\nI get the job done\n\n[Hook]\n\n[Verse 2: Big Daddy Kane]\nSome of you ladies make moves too quick\nAnd settle down, without havin a large pick\nRushed into becoming some poohbutt's wife\nAnd no longer do you enjoy, the married life\nWell, I let you know this is a brand new year\nSo never fear, the Big Daddy is here\nTo do things in places your husband wouldn't\nAnd do certain things he probably just couldn't\nLet me sneak into your life, like a thief in the night\nLick your body all over and squeeze you real tight\nNibble all over your ear and give your back a massage\nYou'll say, \"Oooh I like it,\" just like DeBarge (how large)\nSmooth and mild I'll make you smile, honey child\nThen hit the lights and get buckwild\nAnd when I turn her back on, you'll have to say\nLike Calgon, please take me away\nSo when your main course is doin nothin for ya\nJust look at me as a tasty side order\nThat came into your life and brought a thrill\nCause any husband won't, I'm a neighbor who will, get the job done..\n\n[Hook]\n\nT.R., take it to the bridge, uhh!\n\n[Verse 3: Big Daddy Kane]\nHere's a perfect description of me\nSix foot one, and dark and lovely\nAnd if they're sayin black is beautiful, it's true not phony\nI'm Brown-er than Bobby so won't you be my +Tenderoni+\nAnd get a whiff of this nymphomaniac\nAn up-to-date mack that's ready to attack\nAnd prove that I'm a pro and far from a rookie\nAin't no hair on my chest, but I'm one tough cookie\nWhoever said you had to be one-hundred percent\nMasculine in order to be in?\nI'd rather be more subtle and smooth and SOOTH\nGirl, you won't disapprove\nAnd I promise that you'll never forget\nHmmmmmmmmmmm, now what's a title to fit me?\nA champ like Tyson, a Captain like Kirk, no\nEmployee of the Month, cause yo, I do work\nThe K-A-N-E is on the J-O-B\nAn expert, cause I get it D-O-N-E\nSo lights, camera, action - all hail the one!\nThat gets the job done\n\n[Hook]", "image": "https://images.genius.com/e5112b31d8bd715b9e736175eff672d9.1000x1000x1.jpg", "year": "1989-09-19", "title": "I Get the Job Done", "album": "It’s a Big Daddy Thing"}]}