{"songs": [{"year": null, "image": "https://images.genius.com/dcc907148124284a9abc48db9df5e500.500x500x1.jpg", "title": "I’m the Man", "album": "Fat Boy Fresh, Vol. 1: For Members Only", "lyrics": "Feat. Joe Scudda\n[Intro: Rapper Big Pooh]\nYeah... er'rywhere I go, they be like \"AIY-YO!\", eh-heh\nI be like, \"Naw, you ain't talkin 'bout me, right?\", ha!\nThen they like, \"Aiyyo Rapper Pooh, you ain't know?!\"\nHa.. yo..\n\n[Rapper Big Pooh]\nI done been around the world, been around ya girl\nHad her 'round Prince singin \"Diamonds and Pearls\"\nBeen around Goose bottles, been around Earl\nBeen around Jasmine, been around Cheryl\nKnow a few rappers, one or two actors\nThink I'm dyslexic, got that last line backwards\nKnow a few actors, one or two rappers\nIt's all entertainment, funny shit, ain't it?\nBeen around dealers, been around shooters\nBeen around fiends, been around scenes\nRated X, Rated G, everything in between\nBut out of few records, been doin my thing\nBeen in the VIP, been pop bottles\nBeen throwin money, been knowin models\nBeen on the major, been independent\nBeen tryna stack dough and not hafta spend it\n\n[Chorus]\nI'm just sayin uh, that you the man (\"Now you the man!\")\nI'm just sayin uh, that you the man (\"Now you the man!\")\nThat you the man uh, I'm just sayin uh\nI'm just sayin uh, that you the man\n(\"Now you the man, now you the man, now you the man\")\n\n[Joe Scudda]\nUh, I done been around weed, been around coke\nBeen around cats in the hood that sold dope\nBeen around my folk, mudslingin\nDrinkin homemade wine, look how my cuz leanin\nSchemin, on the best bitch, cause my next bitch\nDon't mean nothin like my ex-bitch\nI done been around that psycho, no more issues\nBeen around more chicks ass than wet tissues\nMore like maxis, been around more these streets\nThan yellow taxis, PLEASE don't pass me\nNothin but the good, been around more\nIgnorant shit than I should, yes I know that\nStill I go back, been around cameras\nSomethin like Kodak, tell 'em they can hold that\nBeen around family, been around jerks\nBeen around oxys, xanaxs, perc's\nHA-HA! I'M FUCKED UP~!!\n\n(\"Now you the man, now you the man, now you the man\")"}], "artist": "Rapper Big Pooh"}