{"songs": [{"image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg", "lyrics": "[Intro]\nUhh, ch'yeah, uh\nDedicated too, this dedicated to... fuck it\n\n[Verse 1]\nUh, I got a pocket full of posies\nSome devil with a pitchfork keep talking like he know me\nI'm psychopathic, low key, my hyperactive dome piece\nGet no sleep, ill as fuck, the hospitals seem so weak\nI stood before an Angel as he told me bout the glory\nPut me in a room of people, how the fuck could I be lonely?\nI only get money, these labels tryna clone me\nUh, my thoughts get heavy, hit the ground and crack the concrete\nSo, I try to keep 'em in my head\nIt's sad to see when everything that you believe is dead\nWord to Heavy D, and rest in peace to all that come and pass\nLife is good sometimes, but it just doesn't last\nA bunch of stress, you see this mic is like my punching bag\nRock 'n' roll, drugs and cash, you softer than a bubble bath\nSucka ass mothafucka, mothafucka's sediment\nDoper than the shit that killed Chris Tucker in Dead Presidents\nDesert rhymes, homie, riding beats, I'm on a camel\nI'm way too hot to handle, life a beach, I brought my sandals\nYou want a war? I got a lot of ammo\nYou ain't a soldier cause you rocking camo\nYoung Rambo, hundred million fans though\nAnd I do it big, you a iPod Nano\nFire on wax, look like I rock candles\nYeah you got a show, but you ain't on my channel\n\n[Interlude]\nThat's HBO bitch, you gotta pay for that, your channel's free\n(I'm gonna fucking kill you)\nUm, Imaxin' shit mothafucka, yeah, suck my dick\n\n[Verse 2]\nHey, ayo, I'm 'bout to start gambiling with Ambien, I'm dutch smoking\nThat's a strike but fuck bowling, I could tear a pin of Maryland\nSee, I'm American, apparently it's damaging\nTo be in front of cameras in your underwear with Marilyn\nMonroe, looking dumb hoes who want to much dough\nAnd come close to have you straight tripping when you jump rope\nDon't rock the love boat, this business fucking cut throat\nAnd it's gonna crack if you just paint the wall with one coat\nRooms filled with blunt smoke, peep me through the fog\nThese rappers who be hating probably need to get a job\nSee, me I'm with my squad, getting money, living comfortable\nI know a couple hoes who model, but they ugly though\nFuck a toast, y'all is fucking broke, cut ya throat\nJudging me is nothing dope, boy you lying under oath\nGod made the world, why did man make the scriptures?\nAnd if he created Lennon, why'd he go and make a Hitler?\nI could take a photo, but I'd rather paint a picture\nOf the one Laurence Fishburne, we'll shoot up all you hipsters\nI'm from Pittsburgh, that's black and gold\nIf my skin gets filled up, I'mma tat my soul\nRunning out of paper, writing on my hand\nHundred thousand haters writing 'bout my jams\nWant a number one independent album? I'm your man\nI'mma hit Preme and leave you all right where you stand\n\n[Outro]\nAre the fires of hell aflowing?\nIs the grizzly reaper mowing?\nYes!\nThe danger must be growing for the rowers keep on rowing, and they're certainly not showing any signs that they are slowing!\nAhhh!\nMake it stop daddy!\n(This has gone on far enough quite right sir! Stop the boat!)\nWe're there\nBut hurry please, we have so much time and so little to see, wait a minute scratch that, reverse it, thank you", "year": "2012-03-23", "album": "Macadelic", "title": "Desperado"}], "artist": "Mac Miller"}