{"artist": "Phora", "songs": [{"album": "One Life To Live ", "title": "Make Some Way", "image": "https://images.genius.com/d1e75acbdeb01e13d54d7b06f6752078.1000x1000x1.jpg", "lyrics": "[Verse 1: Phora]\nYeah, they gonna see the outcome. Count my blessings every time I have one. It never comes easy when you lazy on the subject. Wait a sec, why for? Better yet, ready for the mic check. Fuck em, never break a sweat\nPay my gas, pay my dues. No matter what, I'm stayin true. Never far from nonsense cause momma didn't raise a fool. Gotta keep it movin, I ain't with that bullshit. Don't talk about it, I do it. Take action and seek improvement\nSo follow my footsteps to the state of relevance, only place that's making sense, speaking from experience. Point at blank paper, yeah I'm tired of it all. Tryin to paint a picture when you don't know how to draw\nYo, I do this for my family, I do this for my folks. I do this for the cats who used to take me as a joke, the ones that doubted me and said that I'd never amount to nothing. And even though they hate, I'm still brought up in their discussions\nAll the sudden get the time of day, last time I felt the hate. Appreciate, you never did, so I stay devilish. Insecure, you never know for sure. With this shit I endure, always leavin me, mature\nYo, nothin but love in my heart for the cats who feel my struggle. Cause sending drugs and doin deals don't really mean you hustle. Nah, cause it ain't hard to sell dope to a fiend. That ain't respect, you should try reaching your goals and your dreams\nCause I'm thicked skin, shoot opinions down, like you gotta be. Not losin sleep over lowlife fuckery. Social suicide with these Geminis, see you on the rise and do nothin but despise\nAnd you gotta watch for them snakes kid. Trust isn't common round as every other hate is. And they quick to end your life over some lunch money. And everyone's hungry, we all gotta eat but ain't enough food for all of our tummies so\nAnd it can't stop, and it won't stop, and it don't stop til we make your body rock. Here we get down, never listen to what the haters say, and when you see us comin better make some way. And it won't stop, and it don't stop til we make your body rock. Here we get down, never listen to what the haters say, and when you see us comin better make some way\nAnd your bad habits, it goes without saying. You don't understand, then you don't know what you missin. Sucked in like a gold mind, belief is hard to find. Read between the lines, so get left behind\nYo, after all's said and done, I stay true to my people. Never follow they rules cause these fools can deceive you. Look, I'll never ride with the niggas I didn't walk with. I'll never eat with the people I didn't starve with\nOn the high pedestal, but you so miniscule. Tryin to be the best but you lackin the pole. Yeah, back at square run when I hit the home run. Left you in the dirt, cause that's what you deserve\nAnd homie, I ain't with the bs, I just wanna live drama free. But every now and then I hear the devil calling me, temptin the innocent. They say we all human, but karma is a bitch and she don't like hearing excuses, nigga\nAnd it can't stop, and it won't stop, and it don't stop til we make your body rock. Here we get down, never listen to what the haters say, and when you see us comin better make some way. And it won't stop, and it don't stop til we make your body rock. Here we get down, never listen to what the haters say, and when you see us comin better make some way", "year": "2013-07-01"}]}