{"artist": "Inspectah Deck", "songs": [{"title": "Gone", "lyrics": "[Intro]\nI can't yell right now, cause I'll get fired, and my boss ll' hear me, and then I won't be able to pay off my student loans, but you know what? You're an asshole. I fucking hate you. I bought all your records, this whole fucking time I've been trying to get you to come hang out with me. I'm gonna have people fuck with your food the rest of your trip! You fucking dick!\n\nI like him. That's quite moving\n\n[Verse 1]\nTo my niggas im considered the best\nTo those niggas im considered a threat\nCause i dont give it a rest\nIt's in my nature like Vinny and Treach\nThat i bless em with the what?\nFuck the world that's that Biggie and Mef\nKing swing like a master, Bubba Watson\nMove with the true nigga, no other option\nI see green, like im teeing off golfing\nAnd that's a fact\nThese cats whack\nCall 'em Sharpton\nDeck is a colt\nBelieve how i spit it\nThe end result is your brain leaking out your fitted\nI'm a beast with it\nSimply said blink you dead\nSince lifes' a bitch my mind always think ahead\nSince life's a bitch my mind always think of bread\nGot my numbers up\nEven the odd's and beat the spread\nSo king me the crown i need up on my head\nSour by the pound now i'm out to see the dreads\n\n[hook]\nI'm gone!\nI say i'm more than sick, and no pillar get me off my shit\n(dig it!)i'm gone\nPoint of no return i m out there with an o to burn, you learn\nIm gone\nI said im lovin' the hate ,supergrind like i hustle with a cape, wait\nIm gone\nNot a shadow behind, to see me you got to travel in time\nMy mind is gone!\n\n[Verse 2]\nCooley High brother slide\nKeep my fam stoned\nStay fuckin' up your head like some bad dome\nDeck deal it\nBet you feel it in your backbone\nShorty strip for a king no stacks thrown\nUnderdog, but my game straight cash rule\nPunish y'all like my name is Frank Castle\nToss a broad to my G that's a lateral\nThe five-0 always on my back like the admiral\nPoppin' on the avenue\nBangin' in ya man's crib\nThe whole world behind my words like an adlib\nYou average!\nI get's dirty like the bastard\nIm eight-thirty\nAngry birdy's on the man's dick\nWho am i? Im the mic Max Julien\nThe superfly Truck Turner plus the Wu and 'em\nSuicide bomber time's up no defusin'g him\nDude's touch a problem they dont know what do with 'em\n\n[hook]\nI'm gone!\nI say i'm more than sick, and no pillar get me off my shit\n(dig it) i'm gone\nPoint of no return i m out there with an o to burn, you learn\nI'm gone\nI said im lovin' the hate , supergrind like i hustle with a cape, wait, I'm gone\nNot a shadow behind, to see me you got to travel in time\nMy mind is gone!", "image": "https://images.genius.com/1eb28d7266360fbb461ad268a24389ae.500x500x1.jpg", "album": "Cynthia’s Son", "year": "2014-11-17"}]}