{"songs": [{"image": "https://images.genius.com/fa0dcff8a3ed177edc3f7ef2f9830aaf.1000x1000x1.jpg", "album": "Bullmatic", "title": "Elementary!", "lyrics": "[Verse 1]\nI like cups of tea, cutting beats, matching sets of cutlery\nDepending on the fan, I like it when a fan comes up to me\nBut some of you are just too bloody much for me\nYou know me, but mutually, I've not that luxury\nSo it's worthwhile to say something introductory\nFame is a brave new world, and I'm no Huxley\nI went to Germany, so tons of people rushing Cookiebreed\nI think, if it wasn't him, it definitely was somebody\nAnd that's the point I'm trying to make, we're all just individuals\nWe all get itchy balls or sweaty bits under your tits\nIt's all normal, I'm just another organism\nWho happens to have specialize in penning lines and talking rhythm\n\n[Verse 2]\nIt's like The Prisoner, I'm Patrick McGoohan\nNow everybody knows what this fat prick is doing\nMy YouTube channel's like a kinda creepy zoo\nI spy with my eye the fact that I'll be seeing you\nBut I did it all with DIY, call it B&Q\nMy P&O Cruises launch so I see it through\nIt's difficult to be a weird dude publicly\nCause some of you are just too bloody much for me\nBut I keep doing my thing on the web\nOh, remind me I must enter king of the Web\nCause my to-do list is useless unless I really do this\nAnd every other stupid wish I'm gonna make 'em true, bitch\n\n[Verse 3]\nAt the end of my last verse, I said bitch\nWhy did I do that? It really makes my head itch\nI'd like to think I'm not misogynistic\nBut sod you if you think I'm gonna keep my lips zipped\nCan't keep my mouth shut, I'm a mouth slut\nAnd you'll never shame me out of it, bitch, now what?\nMy main reason to breathe is freedom of speech\nProvide me with a beat and I'll complete a transcript to my thought process and never press delete\nToday is just another day I get to bless the beat\nTo all my critics who are less than impressed with me\nThis is for your arguments, rest in peace", "year": "2015-03-26"}], "artist": "Dan Bull"}