{"songs": [{"image": "https://images.genius.com/c4ef992997640e926ffaf2641bba86cd.225x225x1.jpg", "title": "Believe in Me", "album": "One Kid a Thousand Coffins", "year": "2013-05-24", "lyrics": "[Verse 1]\nThe biggest G's in the game got assassinated, despite my fear of death I'm about to get my genius side on activated\nThe young boy's a rapper now, who gives a sh*t, like everybody just turned around and middle fingers flipped\nNo motivation like they ain't got nothin' on ya, my neck don't allow me to cry on my own shoulder\nNow I'm on to drop some sh*t that none of these niggas can manage\nAnd the fact that I started solo is my biggest advantage\nAt 14 I'm already at the top of my grizzy and if not then why did older niggas copy my lyrics\nPussycats minus the cats, that music is just the cigarette and mine is the crack\nI knew I had to react like it was magic, I could never hate it, man this sh*t is quite fascinating\nWhen I said its my talent they said \"Nah its a hobby.\" At that time I knew only my family had got me\nBut clock it, I never stopped did I? My first snapback tilted in pictures like I'm T.I\nVP stay strong as long as God is behind us. I need to let the success so I'm calling the young riders\nI'm a killer man sh*t just got realer, uglier than Michael Jackson going thriller\nI still rock a nation, like I was signed to Jigga. Fall back nigga I ain't sweet I'm bitter\nWe got bigger fish to fry, though Kay Cee is throwing hooks for me\nBoy you can keep your latest apple pie, she ain't got good enough looks for me\nI'm the prince now, everybody better listen now. Better discern, when they dissin' sounds like my ass is whatever they be kissin'\nLook, this is for anybody who ever doubted me, that said I wouldn't make it, know what I mean\nThey said this thing would just be something that'll disappear in a few years time\nWell its been more than a few years time, I've been 6 years in this mo'\nOkay I won't swear but I ain't gone cuss no more, for the better\n\n[Hook]\nIt's one kid a thousand coffins believe in me!\nMan I need you to believe or believe in me ( believe in me)\nIt's N. A. S. T. Y to the C zily (to the Czily)\nBelieve in me (believe in me), believe in me (believe in me), please dawg (please dawg), believe in me (believe in me)\nMan I need you to believe in me (believe in me), man I need you to believe in me (believe in me)\nMy name is N. A. S. T. Y to the C zily (Czily)\nAnd imma make it even if they don't believe in me\n\n[Verse 2]\nLook real sh*t no peanut butter\nNot tryna say I'm the biggest believer, but I believe in me, believe in God, believe in Jesus brudah\nThem other boys know when to cross the line and when to cross the boarder\nAnd know I test them like the end of November, F these youngins, sh*t now I'm a sex offender\nPause, 2's up for all my hating niggas, I need the dough up in my hand so I can bake nigga\nI appreciate everyone that helped me on this mixtape, album, whatever you prefer to call it, just a compilation of all the tracks\nIt's one kid a thousand coffins\nVP, its N. A. S. T. Y Csizzle"}], "artist": "Nasty C"}