{"songs": [{"year": "2004-02-10", "album": "The College Dropout", "image": "https://images.genius.com/dd0356a305222b40f3fd5711b44b255a.500x500x1.jpg", "title": "All Falls Down", "lyrics": "[Chorus: Syleena Johnson & Kanye West]\nOh, when it all, it all falls down\nYeah, this the real one, baby\nI'm tellin' you all, it all falls down\nUh, Chi-Town, stand up!\nOh, when it all, it all falls down\nSouthside, Southside\nWe gon' set this party off right\nI'm tellin' you all, it all falls down\nWestside, Westside\nWe gon' set this party off right\nOh, when it all\n\n[Verse 1: Kanye West]\nMan, I promise, she's so self-conscious\nShe has no idea what she doin' in college\nThat major that she majored in don't make no money\nBut she won't drop out, her parents'll look at her funny\nNow, tell me that ain't insecurr\nThe concept of school seems so securr\nSophomore, three yurrs, ain't picked a carurr\nShe like, \"Fuck it, I'll just stay down hurr and do hair.\"\n‘Cause that's enough money to buy her a few pairs\nOf new Airs, ‘cause her baby daddy don't really care\nShe's so precious with the peer pressure\nCouldn't afford a car, so she named her daughter Alexis\nShe had hair so long that it looked like weave\nThen she cut it all off, now she look like Eve\nAnd she be dealin' with some issues that you can't believe\nSingle black female addicted to retailers, and well\n\n[Chorus: Syleena Johnson & Kanye West]\nOh, when it all, it all falls down\nAnd when it falls down, who you gon' call now?\nI'm tellin' you all, it all falls down\nC'mon, c'mon, and when it falls down\nOh, when it all\n\n[Verse 2: Kanye West]\nMan, I promise, I'm so self-conscious\nThat's why you always see me with at least one of my watches\nRollie's and Pasha's done drove me crazy\nI can't even pronounce nothin', pass that Ver-say-see!\nThen I spent four hundred bucks on this\nJust to be like, \"Nigga, you ain't up on this.\"\nAnd I can't even go to the grocery store\nWithout some Ones that's clean and a shirt with a team\nIt seem we livin' the American Dream\nBut the people highest up got the lowest self-esteem\nThe prettiest people do the ugliest things\nFor the road to riches and diamond rings\nWe shine because they hate us, floss 'cause they degrade us\nWe tryna buy back our 40 acres\nAnd for that paper, look how low we'll stoop\nEven if you in a Benz, you still a nigga in a coupe\n\n[Chorus: Syleena Johnson & Kanye West]\nOh, when it all, it all falls down\nCome on, come on\nI'm tellin' you all, it all falls down\nAnd when it falls down, who you gon' call now?\nOh, when it all, it all falls down\nCome on, come on\nI'm tellin' you all, it all falls down\nAnd when it all falls down\n\n[Verse 3: Kanye West]\nI say, \"Fuck the police,\" that's how I treat 'em\nWe buy our way out of jail, but we can't buy freedom\nWe'll buy a lot of clothes, but we don't really need 'em\nThings we buy to cover up what's inside\n'Cause they made us hate ourself and love they wealth\nThat's why shorty's hollerin', \"Where the ballers at?\"\nDrug dealer buy Jordan, crackhead buy crack\nAnd the white man get paid off of all of that\nBut I ain't even gon' act holier than thou\n'Cause fuck it, I went to Jacob with 25 thou\nBefore I had a house and I'd do it again\n‘Cause I wanna be on 106 & Park, pushin' a Benz\nI want to act ballerific like it's all terrific\nI got a couple past-due bills, I won't get specific\nI got a problem with spendin' before I get it\nWe all self-conscious, I'm just the first to admit it\n\n[Chorus: Syleena Johnson & Kanye West]\nOh, when it all, it all falls down\nC'mon, c'mon\nAnd when it falls down, who you gon' call now?\nI'm tellin' you all, it all falls down\nC'mon c'mon, and when it falls down\nOh, when it all, it all falls down\nSouthside, Southside\nWe gon' set this party off right\nI'm tellin' you all, it all falls down\nWestside, Westside\nWe gon' set this party off right\nOh when it all, it all falls down\nChi-Town, Chi-Town\nWe gon' show 'em how we get down\nI'm tellin' you all, it all falls down\nNow, Syleena, you just like a safe belt, you saved my life\nC'mon\nOh when it all, it all falls down\nI'm tellin' you all, it all falls down\n\n[Produced by Kanye West]"}], "artist": "Kanye West"}