{"songs": [{"image": "https://images.genius.com/a850400541f0d88c618c08586a9713e4.503x503x1.jpg", "lyrics": "[Intro]\nYo! Yo! eh yo a yo a yo. Yo! Yo! eh yo a yo a yo!\nYo! YO! Yo!\n(shut up.) (fuck up)\n\n[Verse One]\nInnovative one, call me the creative one\nMac lick a foreign pussy with the pierced native tongue\nProbably speak in accents like its hard to calm her\nI use a metal tortoise shell as my body armor\nI got a mutated gold mastiff\nWith 12 eyes and a lime green tongue that spits acid\nI duct tape her mouth shut with I hang around sluts\nCause she'll get jealous and chew em' into ground chuck\nMy carnage rips like a hammer head shark\nSpitting liquid nitrogen until the speakers look frost bitten\nMy car engine is connected to my fierce prose\nReleasing sound demons that nibble ear lobes\nWith the wave of my right hand\nThe mic stand on stage morph into a tight band to strike fans with rage\nLadies love me when I spray the mic\nBut there ain't no 'I' in snuggle and there ain't no 'U' in \"stay the night\"\n\n[Hook]\nHey yo rappers with the sweet skills\nChicks into cheap thrills\nAlcoholics smoking gasoline weed lets build\nFeel the beat hit your spine when it slams you\nTake a swig of the 40 and spark up the bamboo\n\nWe puff the bamboo everyday! [x4]\n\n[Verse Two]\nI don't live by the sword I don't live by the gun\nI live by the gas station that sells blunts by the one\nMy floor is surrounded by dripping candles\nI'll poke my fingers through your eyes like scissor handles\nThe robots talk to me in uteral, like\n(Mac your our planet's secret weapon find a studio!)\nCyborgs travel in twisted orbs\nTo master alien genocide in the mixing board\nControversy?\nIt's more like Contra when the lasers bust\nI'm puttin on a surgical glove\nAnd dippin in a glass full of water discolored from the razor rust\n(It's music)\nCrumpled in the rubble lookin knuckled headed divas\nI buck with jeans so I can show my double headed penis\nSo you can treat it like a honey suckle munch and eat it\nI was a demon God in violent and destructive fetus\n\n[Hook 2]\nHey yo rappers with the sweet skills\nChicks into cheap thrills\nAlcoholics smokin gasoline weed lets build\nMac lethal can you feel it or are you just too fucked up from bamboo sticks?\nPuff a little bit of the monster funk\nPuff a little bit of the monster funk\nPuff a little bit of the monster funk\nSmoke some bamboo and get fucked up\n\n[Verse Three]\nIt's S.G\nThe one that put the fingers in your panties\nAnd told me that the pussy wasn't hairy\nIn control with probes\nMy skulls stretched to see the world like I replaced my eyeballs with globes\nIts like Clubber Lang was a space cadet\nI might dub your brain to a tape cassette\nMy face compress to levitate\nSo take my tape out now give it a kiss and plan a second date\nNever understand how I'm screwin raps\nMy medulla snaps and soul claps it feels like a bazooka blast\nI blew the gas through the tubes mumu lash out\nLight illuminate and prove the scrap and sewage rats\nIn your relationship your girls the boss\nAnd if she don't call in 15 minutes I'm jerkin off\nYou can't get with the way leezy swervin\nI just make you blow like Pee Wee Herman\n\n[Outro]\nUh-ha-haha\nA little bit of the bamboo sticks!\nA little green dirty ass weed, sprinkled with some white nose candy for flavor. Twisted up in one to make you feel oky-loc until you look like muthafuckin Mokie Loc. Uhhhh....\n\nPuff a little bit of the monster funk, puff a little bit of the monster funk\nPuff a little bit of the monster funk, man shut the fuck up!", "year": "2002-01-01", "album": "Men Are From Mars, Porn Stars Are From Earth", "title": "Club Bamboo"}], "artist": "Mac Lethal"}