{"songs": [{"year": "2017-06-30", "image": "https://images.genius.com/5459e9e148431643d2ed2d3bbdecc3b8.1000x1000x1.jpg", "title": "No Chorus, Pt. 10", "album": "Who Am I 3", "lyrics": "[Verse]\nNo Chorus, Pt. 10, finna cop a van\nPop a nigga ass like a fuckin' perc ten\nHit him with the bag like I'm in the first dance\nThirty to his back, leave him gone with the wind\nI'm gettin' head like a motherfuckin' mannequin\nIf you gon' bust at me why is you panicking?\nThirties all up, leave a fuck nigga vanishing\nI hit him up, ain't gon' lie, it was challenging\nSay he getting money but where it's at?\nI'm the alley, O'Malley cat\nI'm in the jungle with lions and birds\nTo the left, that's how I like my hat (crip)\nFreak hoes, I'm striking it\nBeat 'em up, Mike Tyson it\nFuck the bitch, he ain't liking it\nMade a post 'bout me, lost his life today\nI'm 'bout to pull up\nI'm driving fast, I thirtied the mag, you know what it's full of\nHe 'bout to crash 'cause I shot his ass before he could look up\nThat nigga shook up, brain got took up, names got looked up\nCommissary, get your books up\nWhat's wrong with him?\nAR to his head, I'm 'bout to dome-split him\nHeard a nigga want me dead, I had to go'n get him\nPut bananas to his head like Donkey Kong hit him\nMy money long nigga\nYours small, mine tall, get your own nigga\nI was only fourteen beating grown niggas\nGot big forty with the beam, this ho go long nigga\nAin't no way that I'ma miss and hit the wrong nigga\nChopper get to spitting wherever, bullets get to hitting whoever\nBitch I keep the eagle, no feather\nShoot a nigga just for the pleasure\nNigga better not play 'bout my cheddar\nNigga's ass better know better\nSay one thing, spark him up with the Beretta\nBitch I got them rounds like I'm Floyd Mayweather\nMayweather, bitch I'm hot like May weather\nForty on my side like we go together\nY'all niggas broke and y'all hoes too\nPussy ass nigga I expose you (that's on my mama)\nShe suck my dick, baby girl got no tooth\nConnect with the plug like I'm wifi or bluetooth\nI remember days when I had to wear Fubu\nWhen you a nail everybody wanna screw you\nShop with me, shop with me, I turn a drug deal to a robbery\nI gotta kill him, on crip ain't no stopping me\nHe tried to play me like I was monopoly\nDamn, damn, scratch a nigga out his Lamb\n2013 Lito, bitch I go ham\nI got chill like Doritos, no food stamps\nWe making moves and shit, my niggas be hitting licks\nShot a nigga down just like a cigarette\nIf he on some business shit\nLoad the forty Glock up and go hit some shit\nI swear we ain't missing shit\nI would never ever fuck on a groupie bitch\nUnless she give benefits\n\n[Outro]\nHold up, I think I fucked up on my ass, lyrics gotta go over\nThen them niggas hating on me, pull up in that Rover\nFucked a bitch last night, only bought her a soda\nGang, and I'm up off in a Lamb, I pull up, whip through in a Lamb, yeah yeah yeah\nFuck on your bitch I go HAM, fuck on your bitch I go HAM, yeah yeah\nFuck her and tell her to scram, fuck her and tell her to scram, ayy, yeah\nGreen eggs and ham, ham\nI'm tellin' ya, I'm tellin' ya man"}], "artist": "BlocBoy JB"}