{"songs": [{"year": "2001-10-16", "image": "https://images.genius.com/8af6cd69d2d9ed7258d80228afce41de.220x220x1.jpg", "title": "Casket", "album": "1 Less G n da Hood", "lyrics": "[Hook]\nIn the casket\nHELL YEAH!\nIn the casket\nIn the casket\nHELL YEAH!!\nIn the casket\nIn the casket\nHELL YEAH!!\nIn the casket\nIn the casket\nHELL YEAH!!\nIn the casket\n\n[Verse 1]\nDo you wanna know about the box\nA casket with padlocks\nBroken off the hinge, bitch, eat a cock\nBuried in the earth then forgotten about\nFeelin' good like a mothafucka first day out\nTook air in my lungs, been awhile since I did so\nSmoked me a blunt, fucked a hood rat ho\nKill a couple niggas, smack a couple bitches\nRunnin' mothafuckas for the whips and they riches\nAin't shit changed but the month and year\nBroke mothafuckas scrounging for squares and beers\nPigs scatter on the street when the dead man arise\nReal muthafuckin' killas never gon' die\n\n[Hook]\n\n[Verse 2]\nSleepin' in the casket, awoke by a strange sound\nPainful screams arise up from the cold ground\nI could be deamin', what the fuck is with my head?\n6 feet deep and I'm surrounded by the dead\nI hear a noise, someone's cryin' my name\nHow should I react, am I just goin' insane?\nAll my thug niggas hold it down on the streets\nAnd watch these muthafuckas on they grave robbin' spree\nFroze in my box, hearin' people chatter up above\nThey sayin' can ya \"kick the do' up?\" I'm still stuck\nI'm dead as shit, I know where I'm at now\nChillin' with the dead, one with the underground\nSo why these niggas out fuckin' with my grave?\nI got a maggot face and my skin's decayed\nBreak thru the door to unlock the mystery\nGot my grave plot holdin' on for my eternity\n\n[Hook]\n\n[Verse 3]\nDoors is open, pull on up by a force\nLay my body on the ground, slam the casket door\nCrowded by robed figures\nAnd the grave diggers\nAnd the shadow of the demon, gettin' bigger\nComin' for my soul, surrounded me with candles\nCame to release me to his handles\nFirst sacrifice over to the demon\nThat's why I'm a killa any season\nThey watched me close when I was alive\nAnd was happy with a muthafucka till the day I died\nNow they callin' me back to walk with the dead\nAnyone disagree catch a slug to the head\nA muthafucka come equipped with a shotgun\nAnd maggots on my face, so run bitch run\nDead man hauntin', no time for escape\nWhen you hear the gun cock, bitch, it's too late\n\n[Hook x3]"}], "artist": "Blaze Ya Dead Homie"}