{"songs": [{"title": "Da Last Outlaw", "lyrics": "\"Come on out with your hands high!\n\"Hahahaha, with your hands high!\nHahhaha huh I better reason with him\"\n\nWhy don't you ride to the rhythm of a nigga don't give a fuck about ya'\nWon't even talk about ya', ho\nYou ain't know? I'm just a hustler, in spite of myself\nRidin' all by myself, without no one else\nLooky here\nOn my Doc Hollidays, boy I piss upon your grave\nAnd wipe the smile away\nNigga, don't even try\nFistful of dollars, we gon' ride\nYa hear me, nigga?\nSee I ain't got that many friends, white tombstone\n[???] Me and Rudy go to war with - anybody\n\nFrom the niggas, to the killas\nThey callin' me a bad man ridin' 'cross the desert plains\nAnd Mama still can't explain without the 'caine\nIt's raw, boy\nCowboys hear the \"Yippie-yi-yay!\"\nMurder dancin' where the Indians play\nWatch what you say\nDurin' the spiritual ritual huntified ceremony\nClique and squads that'll get you on a Shetland pony\nMemoirs of a madman - Killer Karl Kox and Bill Watts\n'Couldn't rassle nappy niggas with a lasso\nHeated like Tabasco, sauce, it's on\nNigga quick on the draw\nAnd he get to bustin' on them bitches like the Last Outlaw\nUh, nigga what!\n\n\"Hahha...\nIs that so, now? You know, boy... you are a testly li'l cuss(whistling)\"\n\nNiggas and bitches call me Nino Corleone, I got a license to kill\nBut ain't no playa hatin' in me, I got love for the real\nSo if you see me with my guv, just move and step aside\nHit me up and let a nigga just ride\nSouth Side\nGot your mouth wide, buckin' for nothin'\nNow if you're 'bout it, be 'bout it 'bout it, and without no discussion\nNow if you're talkin', keep talkin', and get a dick in yo' mouth\nDon't hide now, torchin' up the whole house\nKnow what I'm talkin' 'bout?\nPicture me coolin' on the 6th day of June\nDown in Cancun, Mexico\nBut if you stress me, ho, I guess I gotta let it go\nAnd ain't no shootin' up at the moon\nI'm tryin' to knock yo' ass up out the saloon\nCock, kaboom!\nIn a raccoon hat like Davy Crockett\nFuckin' wit' that opium, getting high as a rocket\nAnd, um, rocket gonna blast, for playin' with the trigger\nNigga, rocket put a cap in a nigga(boo-ya!)\nFull a' that weed\nWatchin' motherfuckers bleed\nBut not takin' heed\nSteady proceeding with their devilish deeds\nFatal with flaw, mad at the world with no regards for the Law\nFinna' get to bustin' on them bitches like the last outlaw\nHuh, nigga, what!\n\n\"I coulda killed ya Dick, I coulda killed ya\nBut I don't wanna kill ya, I wanna eat\"\n\nI fought the Law, and the Law won\nYou see, I shot the sheriff but forgot his son\nTotin' on a shotgun with pistol full of hot ones\n\"Ay yo, sheriff, he still wit' you?\" I popped him and dropped him\nAnd took his potna's crown\nIt's a brand new sheriff in town\nAnd I don't think you wanna fuck around\nDouble jeopardy for the deputy dog\nFuckin' wit' a hog\nSay y'all, y'all motherfuckers tried to ball\nThe rise and fall\nFor y'all, nigga, I'll be a huckleberry\nSpittin' fire from the blood that me and Lucky Knuckles carry\nLegendary, hereditary for niggas that know\nI'm out the window with a stagecoach, fresh out the poke\nMy homie Loc gave me an order that the blind could see\nTold me to blow him away, or make him ride with me\nPut on your boots, cowboy, and pass the pound\nI got the moonshine water makin' wine(nigga)\nOne of a kind, genuine\nKnow when to hold 'em and fold 'em\nY'all niggas gotta give me mine before I roll 'em, though\nPlayin' is raw\nQuick on the draw\nHollerin' 'bout \"Fuck what you saw!\"\nChewin' on straw\nSteady bustin' like the Last Outlaw!\nHuh, nigga what!\n\n\"You gotta test yourself every day, gentlemen\nOne you stop testing yourself, you get slow\nAnd when that happens, they kill you.\"\n\n[Gunshots and screams]", "album": "My Balls and My Word", "year": null, "image": "https://images.genius.com/1613c69d81c9bbfbbbbe477f2130bb6f.500x500x1.jpg"}], "artist": "Young Bleed"}