{"songs": [{"year": "2010-05-18", "image": "https://images.genius.com/1b1da653144da5c5a984e726b5af373b.450x450x1.jpg", "title": "Rap’s Finest", "album": "Friday Night at St. Andrews", "lyrics": "[Intro: DJ Young Mase]\nI go by the name of DJ Young Mase!\nLive from St. Andrews niggas!\nAll the way from 7 Mile and Stout\nBizarre~!\n\n[Verse 1:Bizarre]\nYeah, yeah, yeah, uhhhh\nBam-bam-boom-bip, return of the psycho\nFriday the 13th, nigga I'm Michael\nBad man, Boogeyman, whatever you wanna call me ho\nWestside Detroit, that's Bizarre's barrio\nYou a sorry ho, I'll pull that tool\nI'll act a fool nigga, you'll get smoked like some Kools\nI catch a lot of cases, smack a lot of faces\nRap 101 nigga it's back to the basics\nStuck in the zone, blowin microphones\nWild the fuck out nigga, leave me alone!\nDope fiend, hydro-codeine, mescalines\nBloody murder scene, Bizarre kill a teen\nGet back, get smacked, I'll blast a four\nFuck the chit-chat, the impact'll blast your door\nI'm so hardcore and so wild\nBlack labrador, Mixed witg Grey Chow!\n\n[Interlude: DJ Young Mase]\nLadies and gentlemen!\nLive from Runyon Ave.!\nOne-fourth of D12!\nEastside's finest!\nThe Derelict, Kuniva~!\n\n[Verse 2: Kuniva]\nUhh, what up?\nYo, straight out yo' mammy throat\nA derelict, watch it or get your granny smoked\nSawed-off shotty under my nanny coat\nI'm C-Murder in his prime in the Cali yo\nCruisin the streets, who want a piece of this cold calico?\nUp in Jackson relaxin, third tier action\nGive a nigga face a slashin at my court case laughin\nPants saggin, pistol brandishin, blast it, vanishin\nDrastic, ambulance pullin up, casket managin\nNow you stiff like a plastic mannequin\nWe about that, pull a gat right where your mouth at and you panickin\nAngrier than young Anakin\nI throw bullets like a flag challengin a play, hollows hit his abdomen\n'niva's a beast, stalkin the east, packin a piece\nNobody dies, I wanna get it crackin at least\nWe can fight, I do scrappin with ease\nSo watch your tone when you 'round here askin for me\nGet off my dick bitch!\n\n[Interlude: DJ Young Mase]\nLadies and gentlemen, we still goin strong!\nBack to 7 Mile's finest\nMy nigga, Seven the General~!\n\n[Verse 3: Seven the General]\nSir yes sir\nYadada-mean, amphetamines and Vicodins\nI'm nitrogen, 7 Mile's fist-fightingest\nI'm lightin this bitch up, Bizarre said \"Get 'em dogg\"\nSo I'm gon' sic 'em like Vick said \"Finish y'all\"\nAnd I administer pain like a sinister\nSick son-of-a-bitch from Israel, I chemist raw\nYeah I cook cocaine and such\nAnd blow propane, threw out a Dutch, I'm 7 Mile as fuck\nBut that's the Westside in me\nBag up, buff up yay's and floor Hemi's (Hemi's)\nFo'-fo' semi (semi) fo' do' Sentry (Sentry)\nGrams in a Sinchie, Sandwich bag full of empties (empty)\nMashin to N.C. cause my shit sells (sells)\nMy shit's swell so I'm live from the Braile (Braile)\nOn the MILE with D12, 50 pounds in a bail\nDo a round for the town, 50 rounds and a scale (Seven)\n\n[Interlude: DJ Young Mase]\nWe not done yet!\nM.I.C. representer!\nThe King of Detroit!\nRoyce Nickel Nine!\nGet 'em~!\n\n[Verse 4: Royce Da 5'9\"]\nThe llama kinda scary, comparin it to Suge\nBefore I shoot a nigga have him actin all good\nYou can call me Tyler Perry, the bar you know is raised\nYou can take her cause she faker than your mom on braids\nLike Stevie I'm blind to the bark and behave\nYou've seen me online drunk with arsenals waved\nI go off on the brave, the same to the fearful\nAim at your head, put your thoughts on a page!\nWear a clip, air a clip, you can call me Aerosmith\n+D MC+'s +Run+ when they +Walk This Way+\n{?} M.I.C. niggas, we busy, don't speak to me\nBitches is smitten by the written lyrical wizardry\nSwitch the, flow up, so what, I'm tote, uh\nRidin with my angel like Lo-la, uh\nRecognize I'm about to blow up, though I blew\nNot the fame but the breathalyzer, ah, I'm through (hahaha)\n\n[Interlude: DJ Young Mase]\nLast but not least\nRepresentin Brick City\nAll the way from North New Jersey\nMr. Funk Doctor Spock\nRedman~!\n\n[Verse 5:Redman]\nYeah, yes sir, thank you Bizarre\nGilla House niggas! Yo!\n\nI'm a mad dog nigga, Cujo\nSo the +Dee+ watch me now like I'm Kool Moe\nI'm overseas turnin weed into euro\nNow I'm back to +Draw Four+ like Uno\nFUCK your girl roll, I never stop gettin it\nI keep runnin like your toilet need jigglin\nYou're loud but your mouth don't match the dividends\nYour rock hard flow sound a lil' impotent\nI only got sixteen, but my sixteen\nLike sixteen kids shot my six teens\nTrenchcoat, I empty 'til the clip clean\nA one-shot like Tyson hit Mitch Green\nAsk my siblings, I got a problem\nYour punchlines won't make it out of Round ONE!\nBirds, love to flaunt all around him\nYou want a bad boy? You found one\nGet money!"}], "artist": "Bizarre"}