{"artist": "C-Rayz Walz", "songs": [{"title": "LifeTime Bid", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Hook One: C-Rayz Walz]\nSitting by my lonely\nThinking ‘bout my homies\nY’all don’t really know me\n\n[Hook Two: C-Rayz Walz]\nIf I died right now, I’d be mad upset\n‘Cause the way I feel: I’m not finished yet\nBut when I leave this body, I guess I did\nSo for now, I’m doing this lifetime bid\n\n[Verse 1: C-Rayz Walz]\nWho’s the real the terrorist?  The industry or the senators\nThe pig cops who wanna pop shots to injure us\nSorry ‘bout The Towers, y’all.  We been in Babel\nSo don’t give me a pound with sound—I might stab you\nThis is for my thugs who bite the bullets and swallow the drugs\nBottles of blunts, hard-rock chumps, drama in clubs\nDo the math.  You wanna know the path?  Follow the slug\nI get paid if I could bottle the love.  Now swallow the snow\nAin’t nothing fucking fair in the cities of clutching fear\nGet your plastic melted like classic batches of Tupperware\nFuck coke!  Before I go broke, I’ll flip the raw flow\nAnd hit from every angle like a talented kid in a porno\nBy the way, I don’t spit—my scripts get dumber, fams\nI’m a type of MC you label “Instant Summer Jam”\nJust add water, add sword.  I add slaughter\nAdd sun, moon, and stars—universal explorer holding my daughter\nIn a Ford Taurus with the beast running towards us\nKicking your door up just to rush your forefronts\nMore beer, more blunts, more chicks, more bucks\nKeep acting pussy, rookie, keep getting fucked up\nPlus I fight with light, incite camouflaged steelos\nGod stay sharp amongst barb wire egos\n“It’s a Wrap”—embedded the facts in hard drive\nThe archive douse your pride with live “Peroxide”\nPass the dollar plus the math for the scholars\nWho laugh while feeding your cat to mad Rottweilers—don’t stop to holler!\nI snatch your voice box and I don’t drink beer\nI think, blink, stare, and share choice hops\nWell respect me now or you will later\nI’m cocodrilo in el barrio—alligator (The alligator)\n\n[Hook One: C-Rayz Walz] (x2)\nSitting by my lonely\nThinking ‘bout my homies\nY’all don’t really know me\n\n[Verse 2: C-Rayz Walz]\nAyyo, we come through.  Nine Inch Nails leave your tongue stuck\nYou fucked up, but that’s life—thumbs up\nYou missed out.  See you next session.  Stressing the mic blessing\nPlay the background.  You know?  Glossary section\nShit ain’t the same on these streets no more\nHit the battleground, prepare yourself for war\nEverybody want it all, gotta score in this game\nTwo slugs in the clips—one is sure to hit the brain\nThe most high—bless me.  Vision absolute\nLife’s a freefall—the mind’s the parachute\nSituations are clouds or they appear to be\nAnd when you touch ground, you walk away—finally free\nI got stacks, rhymes, and beats to match\nI got stacks—real-a-real and that’s\nI got stacks, nice dress shirts and slacks\nI got stack, cheese, and hoodie\n\n[Hook Two (Overlapped with Hook One): C-Rayz Walz]\nIf I died right now, I’d be mad upset\n‘Cause the way I feel: I’m not finished yet\nBut when I leave this body, I guess I did\nSo for now, I’m doing this lifetime bid\n\n[Hook One: C-Rayz Walz] (x6)\nSitting by my lonely\nThinking ‘bout my homies\nY’all don’t really know me\n\n[Outro: Phone Call Skit]\n[C-Rayz Walz]\nYo Breezy, what’s up?  It’s C-Rayz.  Yo, basically, man, it’s the bottom of the 9th, man.  You’re up to bat.  You know’m saying?  Don’t fly out.  You know’m saying?  Hit me back, don’t tag out.  You know?  Fuck it.  Hit a home run.  Let me know what’s going on.  So holla back.  Hollat yo piño.  Jalapeño.  Peace\n[Voice Mail System]\nEnd of message"}]}