{"songs": [{"album": null, "year": null, "title": "Byrd Call", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "Yo, JR, they've been waitin' for you, dawg\nThey've been askin'\nYou ready? You up, motherfucker, DipSet, let's go\nWriter\n\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhat's the word, y'all? Flip that herb raw\nClap, that's the byrd call\n\nIf the cops are comin', get to hop and runnin'\nQuick and drop that onion, ain't no stoppin' young'n\nPut away that herb raw, let us know the word or\nClap, that's the byrd call\n\nI still be where the weed flip, in the P's wit the trees lit\nSo much water in the order, it's just leavin' 'em seasick\nWit a ski in my V6, tryin' to skeet on a B lips\nDown low, like I'm tryin' to keep her a secret\n\nAcura on chrome, passin' me dome\nNext minute, shit, I'm finished, she'll be flaggin' it home\nBut I always keep a straggler that's known to bone\nAnd run through a lap, faster than Marion Jones\n\nMan, listen, I still got the grams flippin'\nTan pitchin', corner to the damn kitchen\nGained a couple fans, had to make a transition\nBut I'm still in the hood like your transmission\n\nNo cat could match me, I'm passin' fastly, who's half as nasty\nI got it locked from here, all the way to Cakalakie\nBut keep a mac for scrappies thinkin' it's just Laffy Taffy\nShit, this beat'll be the only thing clappin' at me\n\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhat's the word, y'all? Flip that herb raw\nClap, that's the byrd call\n\nIf the cops are comin', get to hop and runnin'\nQuick and drop that onion, ain't no stoppin' young'n\nPut away that herb raw, let us know the word or\nClap, that's the byrd call\n\nDamn, homey, in high school, you was the man, homey\nThat's what a fan told me, shit\nSame old cat, get his Kangol clapped\nBrains blown back, dissin' dame, dame don't rap\n\nShame on black, the game's so whack\nDame search for children from in front of ya buildin'\nRight to a hundred million\nGo ahead, pimpin', pimpin', go ahead, act up doggy\nGetcha limp on pimpin', if they actin' froggy\n\nTell 'em, back up off me, I come down, clap the 40\nChild, that's a badder story, I'm not in my category\nMess around, dame held Def Jam down\nSo pardon my back, jackin' any left hand pounds\n\nRedneck found, tech, tech pound, duck, duck goose\nPump, pump shoot, shoot, let's get down, down\nIt may seem petty, but we all turn mean deadly\nFor green fetti, my whole team ready\n\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhat's the word, y'all? Flip that herb raw\nClap, that's the byrd call\n\nIf the cops are comin', get to hop and runnin'\nQuick and drop that onion, ain't no stoppin' young'n\nPut away that herb raw, let us know the word or\nClap, that's the byrd call\n\nThis ain't only bars and tracks, this is for the hardest cats\nFlippin' all the hard and back, make 'em catch a heart attack\nWhen you see the narcs attack, let me know, start to clap\nClap, clap\n\nA star with a deal, Chapar be on chill\nThe car is DeVille, it's real ill, pardon the grill\nIt's foreign my nills, cruise the city with the semi\nAll silly on skinnies, like I'm starvin' my wheels, uh\n\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhat's the word, y'all? Flip that herb raw\nClap, that's the byrd call\n\nIf the cops are comin', get to hop and runnin'\nQuick and drop that onion, ain't no stoppin' young'n\nPut away that herb raw, let us know the word or\nClap, that's the byrd call"}], "artist": "J.R. Writer"}