{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Beanie Sigel\nCourt casin..\nThird felony facin\nNo probation\nMy heart racin like a blunt lacin\nHennessy and malt liquor chasin\nMy gemstar scarrin niggas faces\nFor a pound of trey eight and..\nI throw bullets like Dallas Troy Aikman\nThe callous on my index stay achin\nNiggas stay hatin\nGot me late night pacin\nI'm tight boot lacin\nMask on like I'm Jason\nShoot up shit like Larry Davis\nYou play the pulpit like Pastor Mason\nTurn cheek like Martin Luther\nI'm like Oswald sharp-shootin\nGot my eyes on my mark in the dark shootin\nBeam illuminate the target movin\nGet your organs ruined\nMove out like SWAT move in\nGot them niggas on the back-block rootin\nFor the bad guy..\nPlayground legend like Sadait(?)\nP. Kirkland...My MP state workin\nShootin-arm stay jerkin\nMy Nextel stay chripin\nCan't answer cause the feds lurkin\nIts like we catchin cancer on purpose\nBack to back chain smoking, nicotine feinin\nConversation with demons when I'm dreamin\nManic-depressive\nLike the man upstairs tryin to pass me a lesson\nBut I can't catch it\nThe game under break the pressure\nThey miss my presence\n\n[Hook 2X: Sparks]\nWe still not promised tomorrow\nTakin the bitter with the sweet up in these cold ass streets\nWe got lifestyles through our scars\nWe ride hard til our numbers get called\nThe lifestyle of a hustler...\n\n[Sparks]\nI'm feelin like deaths in the air\nGot me back to back buckin my squares\nBut I ain't bitchin I ain't scared\nI ain't budgin, in fact the thrill alone turns me on\nGot me smiling, laughin...Clutchin\nMy toast and confrontin mother fuckers\nCock-a-roaches will not catch me laughin\nSkinny and slim fram y'all get it the same\nCool niggas that'll spin out they waves\nGrimey niggas that'll spin to they graves\nJustifyin my foul ways\nI got kids to raise\nBut motherfuckers rather see me sprayed\nThan to see me pair (fucker)\nOr see me on the front page like Sig\nOr stay rolled DC with B. Sig\nYou bitch niggas stay PC when y'all see me\nUntil the day that they\nFit me in the grave and the city wreak of me\nWe got the city under siege\nS-P or R-O-C\nPoverty is a movie starrin me\nRide with no play the passenger seat\nSo y'all can see how my life so real\nSo y'all can see how my life so ill\n(I came to chill..)\n\n[Hook]\n\n[Oschino]\nTales of a hustler that's me in the flesh\nGot a Jag and a Caddy sellin dimes of the step\nNiggas wanna take my block I had to earn my respect\nSo I put his cerebellum on his grandma's steps\nYou know Oschino he'll probly kill\nGot the soul of Huey Newton nigga Bobby Seale\nNigga prolly take the stand he'll prolly squeal\nBut I got four lawyers I ain't takin the deal (Nigga)\nWe could strap without scrap or put the semi in it\nGun fully loaded like the Chrysler with the hemmy in it\nI keep it ghetto like a 40 with the Henny in it\nWent to school broke loafers on no pennies in it\nStood the coldest winter with the bummiest coat\nNeed food need shoes sold dummies of soap\nGot tired of bein broke man life was a bitch\nThey bring you flowers when you dead but no soup while you sick\nSo I switched my whole picture get involved with the bricks\nNot the ones made of semen but the ones who sniffs\nTales of hustler, niggas come for your jugular\nIf you sell one bag to they mother fuckin customers\nState P we got the city on smash\nGot every boulevard every street every ave\nGot sneakers got clothes nigga you do the math\nPush to hustle but the point is just to stack that cash\nTales of a hustler....", "image": "https://images.genius.com/48c4319dfc3c978405c6c446d03d8171.500x500x1.jpg", "year": "2005-03-29", "title": "Tales of a Hustler pt. 2", "album": "The B. Coming"}]}