{"songs": [{"lyrics": "[Jay-Z]\nUh, uhh, listen\nFirst the Fat Boys break up, now every day I wake up\nSomebody got a problem with Hov'\nWhassup y'all niggas all fed up cause I got a little cheddar\nAnd my records movin out the sto'?\nYoung fucks spittin at me, young rappers gettin at me\nMy nigga Big predicted the shit exactly\n\"Mo' Money, Mo' Problems\" - gotta move carefully\nCause faggots hate when you gettin money like athletes\nYung'uns ice-grillin me, ohh - you not feelin me?\nFine; it cost you nothin - pay me no mind\nLook, I'm on my grind cousin, ain't got time for frontin\nSensitive thugs, y'all all need hugs\nDamn though mans I'm just tryin do me\nIf the record's two mill' I'm just tryin move three\nGet a couple of chicks, get 'em to try to do E\nHopefully they'll menage before I reach my garage\nI don't want much, fuck I drove every car\nSome nice cooked food, some nice clean drawers\nBird-ass niggas I don't mean to ruffle y'all\nI know you waitin in the wing but I'm doin my thing\nWhere's the love?\n\n\"Ain't no love, in the heart of the city..\"\nI said where's the love?\n\"Ain't no love, in the heart of town..\"\nYeah..\n\nAnd then the Fugees gon' break up, now everyday I wake up\nSomebody got somethin to say\nWhat's all the fuckin fussin for? Because I'm grubbin more\nAnd I pack heat like I'm the oven door?\nNiggas pray and pray on my downfall\nBut everytime I hit the ground I bounce up like roundball\nNow I don't wanna have to kill sound bar\nDon't wanna have to cock back the four pound bar\nLook scrapper I got nephews to look after\nI'm not lookin at you dudes, I'm lookin past ya\nI thought I told you characters I'm not a rapper\nCan I live? I told you in ninety-six\nThat I came to take this shit and I did, handle my biz\nI scramble like Randall with his\nCunning-ham but the only thing runnin is numbers fam\nJigga held you down six summers; damn, where's the love?\n\n\"Ain't no love, in the heart of the city..\"\nNiggas, where's the love?\n\"Ain't no love, in the heart of town..\"\nHolla at me!!\n\"Ain't no love\" (take 'em to church) \"in the heart of the city..\"\nUh, uh, uh - my nigga where's the love?\n\"Ain't no love, in the heart of town..\"\nFuck\nThen Richard Pryor go and burn up, and Ike and Tina Turner break up\nThen I wake up to more bullshit\nYou knew me before records, you never disrespected me\nNow that I'm successful you'll pull this shit\nNigga I'll step on your porch, step to your boss\nLet's end the speculation, I'm talkin to alla y'all\nMales shouldn't be jealous that's a female trait\nWhatchu mad cause you push dimes and he sell weight?\nY'all don't know my expenses, I gotta buy a bigger place\nHehehe, and more baggies, why you all aggie?\nNigga respect the game, that should be it\nWhat you eat don't make me shit - where's the love?\n\nWhere's the love?\n\n\"Ain't no love, in the heart of the city..\"\n\"Ain't no love, in the heart of town..\"\n\"Ain't no love, in the heart of the city..\"\n\"Ain't no love, in the heart of town..\"\n\"Ain't no love, in the heart of the city..\"\n\"Ain't no love, in the heart of town..\"\n\n\"Ain't no love..\"", "title": "Heart Of The City (Ain’t No Love) - Album Version (Edited)", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}