{"songs": [{"year": "2019-03-21", "title": "Friends To Enemies", "image": "https://images.genius.com/9155384aa70839fe66e7e3144b247f30.1000x568x1.jpg", "lyrics": "[INTRO]\nYung L Harmonising\nT.U.C\n\n[HOOK: YUNG L]\nWhy be say the money change you?\nWhy you say you acting brand new?\nHaven't they know you when you no get?\nHaven't they know you you dey soft?\nMy brother hustle on the low\nOne day self na you go get your own now\nWe get one milli two milli three milli four milli\nWhy you let the money change you?\nWhy you start to get a new crew?\nHaven't they know you when you no get?\nNow you say I'm acting wretched\nMy brother hustle on the low\nOne day self na you go chop your own\nWe get one milli two milli three milli four milli\n\n[SARKODIE: VERSE ONE]\nHoly shit!\nI just lost a friend just a couple of weeks ago\nCos he turned into a snitch Why? Cos I'm rich\nFiti da a me nyaebi brother no dey show me love\nHe was caught in the midst Men I'm pissed\nEno bi say I make am wey I dawg you o\nMe no wo na chilli but you switch\nI was counting the bricks\nBut then you dey playing me tricks\nMe no wo ye cool before the hits\nOse me act different then stop with all this pretence\nYou bore sake of I'm busy working playing shows on weekends\nNa me ne bro ye tight opushi blame for defence\nMy popi tell me se wo cash ba a bi when you see friends\nEbe now I see\nWhy you let the money come between us?\nFrom the ghetto you dey with me but now wey fit sell out arenas\nYou now dey focus on peoples opinion\nEka akoma but everything happens for a real reason\nGod is a genius!\n\n[HOOK: YUNG L]\nWhy you let the money change you?\nWhy you start to get a new crew?\nHaven't they know you when you no get?\nNow you I'm acting wretched\nMy brother hustle on the low\nOne day self na you go chop your own now\nWe get one milli two milli three milli four milli\n\n[SARKODIE: VERSE TWO]\nMe maame too me nkra se kwasi fre me\nOse me nni dama soma obi e na onfa kakra nfa mbre me\nMe hia bi ako bo nsaawa eyie was na me de bi ako turne\nSesiaa  me ntumi mbo bisia me nua nom obia nsende\nAgya me ba ne Sarkodie me dware sika yi\nMesre sika a mabo mmusuo enie obia be kekam\nMefra ntoma baako toaso kora a obia se sesamu\nCommunity 9 obiaa se maame ti aye yie odamu\nMe nni te seesei nnamfo fo) obiaa se meown now\nWa mmo ho bisia na se ma nnya bi a yese manya sika na menkye\nMe wiase a me baa ye adie baako pe na mpe\nSe obi hia mmoa na wa ba na me ntumi nye\nMike! Die wa kofa aba yi manka na me boa\nWo ye Sarkodie - eye nanso wabre me adesoa\nSe nie nipa ha madwene? Mike enye asem kitoa\nMempe se me ha wadwen enti ma kyekyere na mia ma soa\n\n[HOOK: YUNG L]\nWhy you let the money change you?\nWhy you start to get a new crew?\nHaven't they know you when you no get?\nNow you say I'm acting wretched\nMy brother hustle on the low\nOne day self na you go chop your own\nWe get one milli two milli three milli four milli\n\n[OUTRO: YUNG L]\nYeah yeah\nFrom boys to men we still be friends\nMoney not change we\nBut we change the money\nWhat demma go say?\nAhhha!\nT.U.C", "album": null}], "artist": "Sarkodie"}