{"songs": [{"year": null, "title": "Hey Bobby (Reanimator remix clean)", "image": "https://images.genius.com/8b24619eca032daebf0caa5c44aa746d.512x341x1.jpg", "lyrics": "AUTHOR: Sage Francis\n\nBy the time the flags rotted off of their antennas\nThey were questioning who the real threat is\nBig Brotherly love is the 21rst Century's plague\nNo matter how bloody the glove, question evidence displayed\n\nDon't forget what two plus two equals\nDon't let them upgrade your math no matter what they have as proof of evil\nRemember when they went after the Jewish people?\nYou don't recognize that same black mask as see through?\n\nAttack of the eagles. If they don't fall dead\nBefore they reach me, I'll be damned if I don't shoot one in its bald head\nFuck what we're force fed. All I ever wanted\nWas a warm bed and a house that wasn't haunted\n\nI'd rather die for a cause than to die just because\nWe exhaust natural resources forced into wars\nRestoring wasteful ways, keeping other countries poor\n\"Monkey see, Monkey do\" I wonder what those fucking monkeys saw\n\nKeep rethinking the still-frames in your mind\nAnd guarantee they will change with time\nYour outline is pixelated with poor resolution while\nDowntime is simply wasted. You were born execution style\n\nHead first in a trial. I'll second the motion\n'Til the jury's bored to death and puts your neck in a notion\nThe situation's volatile. A naked problem child\nIs trying to find the right clown costume to make his father smile\n\nSo he bombs while he tries to tell jokes\nThis ain't a false alarm, can't you smell the smoke?\nYou're in the line of fire where they buy and sell votes\nOur sense of liberty doesn't ring true, stupid, that's why the bell broke\n\nTrench coat Mafiosos propel rocks\nAt recruitment officers and rebel against cops\n'Til they hurdle infinite circles in small cell blocks\nTurtle upon turtle 'til they're all shell shocked\n\nThis so-called president got elected in a court room\nWith the war efforts of pops he inherited a fortune\nWe \"talk, talk, talk...\" so the veterans of war assume\nThe revolution stopped. This ain't a protest tune\n\n\"Hey, Bobby...the Masters are back. They're up to no good just like the old days\nThey played dead when you stood over their grave, Bobby. They played dead when you stood over their grave\n\"Hey, Bobby...them bastards are back. It's our turn to stand over their grave\nI'm a do it right this time...I'm awake...I'm a wait until their fuckin' skin decays.\"\n\nYou can't roam a lost land as the last existing dinosaur\nThere's no escaping ass kickings in these times of war\nReplacing apples with hospitals...where doctors are hostile\nKilling two pterodactyls with one fossil\n\nI got you. If they don't fall dead\nBefore they reach me, I'll be damned if I don't shoot one in it's bald head\nFuck what we're force fed. All I ever wanted\nWas a warm bed...and house that wasn't haunted\n\nThumb through novels to have your fingerprints match\nThe description of criminals committing innocent acts\nOf compassion for tired civilians crawling with pistols\nWhile we fire million dollar warning missals\n\nForce the issues in the back of your head where eyes roll\nBrain wash yourself out of that mind control\nOr act a fool like you're told\nBut we won't see no type of justice 'til that bitch removes the blindfold\n\nThis ain't a \"Love it or leave it,\" it's a \"Change it or lose it.\"\nI'll never sing the anthem of a nation who never faces the music\nChasing an ever-elusive caveman\nIn space ships that makes trips to the futures that are name-brand\n\nFaking progress...but we ain't advanced\nEnough to change the posture of our ape stance?\nThey've got the key to the city but they prefer the break-in entry\nDuck and weave, I'm shedding light in their shadow box to make it empty\n\n\"Hey, Bobby...the Masters are back. They're up to no good just like the old days\nThey played dead when you stood over their grave, Bobby. They played dead when you stood over their grave\n\"Hey, Bobby...them bastards are back. It's our turn to stand over their grave\nI'm a do it right this time...I'm awake...I'm a wait until their fuckin' skin decays.\"\n\nAttack of the eagles. If they don't fall dead\nBefore they reach me, I'll be damned if I don't shoot one in its bald head\nFuck what we're force fed. All I ever wanted\nWas a warm bed...\n\nThere's nothing scarier than the human stories I tell ghosts\nChilling accounts with my tongue frozen to bed posts\nThe catharses of carcasses whenever threats are close\nShows a heartlessness that doesn't register on stethoscopes\n\nSell your hopes for a homeland security chart\n'Til your sense of self is broke and no man's pure in the heart\nPreventive detention for the folks who never left home\nTensions have grown into a 24/7 red zone\n\nScare tactics...have got you under control\nThe fear factors of a color code. The uppers know\nThey can't hold you down without having anchors attached\n\"It's all the same.\" Nah, balls and chains on ankles don't match\n\nSo drag your torso back to the off road\nWe may have lost the fashion battle but we ain't lost the wardrobe\nGo window shopping for your next free meal\nCuz when we start the revolution all you'll probably do is steal\n\n\"Hey, Bobby...the Masters are back. They're up to no good just like the old days\nThey played dead when you stood over their grave, Bobby. They played dead when you stood over their grave\n\"Hey, Bobby...them bastards are back. It's our turn to stand over their grave\nI'm a do it right this time...I'm awake...I'm a wait until their fucking skin decays.\"", "album": null}], "artist": "Sage Francis"}