{"songs": [{"year": null, "image": "https://images.genius.com/cc562c0aa5b047df2132b1557d8efb9a.464x464x1.jpg", "title": "Mona Lisa", "album": null, "lyrics": "[Verse]\nWuh-wuh-wuh\nYo, well it was one o' those days, wasn't nothin' to do\nAn' I was downtown, sittin' wit' my hustlin' crew\nSlid up in the corner Deli for [?], to roll a reefer\nAn' ran into this girl, her name was \"Mona...\"\nMona Lisa, the most beautiful creature\nDon't even know that every other chick is beneath her\nFake stallion, dark skinned, physical feature\nCopped her chicken wings, and a slice of pizza\nI said, \"Ill! [Ew?] You need a healthier meal\nSlide wit' me, we can go an fill your belly for real.\"\nShe said, \"Chill! Honey, relax and unzip your fly\nI'm just kiddin'! I had your ass, didn't I?\"\nIt wasn't hard to see, she had some shit wit' her\nI got in the air [?], and damn near crippled her\nShe said, \"Great Scotts! Are you Tariq?\nYou walk [?] and talk, like the 'Pimp o' the week',\"\nI had to laugh at her, 'cause at first it sound funny\nPimpin' wit' The Roots crew, workin' hard for the money\n\"But, pardon me, Tariq, please, don't even try it\nBetter call me, 'Riq Geez, and keep it quiet,\"\nShe almost got cut short, y'know, shank [?]\nFor tryna disrespect Big Bank Willie Gank\nHe thought, \"T-H-O-U-G-H-T,\"\nBut not to be a straight ass nigga [?], I said, \"See, I'm\nSorry, and I know I just flipped\nPlease, kick it wit' me, while I smoke this spliff,\"\nShe said, \" Y'know, maybe, but you seem crazy\nDon't try to play me, you better treat me as a lady,\"\nWanna hate a grown ass man, and act childish\nAn' I bet you [?] to acknow-ledge\nOver twenty-one, and yes, I got one son\nHis favou-rite MC, was the late Big Pun,\"\nTrim, thick, plus physically, fit\n\"Ya best believe, that this chick, celibate,\"\nI said, \"Celibate? Love, you need to be hugged,\"\nTried to segue, [?] wit' that thing on your tongue\n\"Ya see, it don't matter to me, I break you in\nLet me explain, to you just the way 'Riq [?] do it\nThe 'T' for the way Thought turns 'em out\nThe 'H' for the way Halfpound o' [?] burn up out\nYou know 'O's for O's, at the top of my check\nAnd 'U's the way I Use techniques, correct\nThe 'G' for G's spit,by 'Riq, G's [?]\nThe 'H-T', flip around, start off my faec-es,\"\nBut then, 'bout then, Questlove came in\nHe said, 'We got a show to do,\" and, \"Where the fuck you been?\nCome on, you know time is money, we waitin' on a boy\nAn' he tryna slang number to [?] next door?\nNigga, come along, we got a party to attend\nWit' some ghetto gold diggers, and some more of our friends,\"\nHe got on his cell, and then he waited for the minute\nThen the tour bus pulled up, he busted me in it\nAs we was headin' on our way to perform\nI could hear a melody, as Mona sang a song [?]"}], "artist": "Black Thought"}