{"artist": "Vado", "songs": [{"title": "When I Die", "year": null, "lyrics": "[Intro]\nI just need to get this said\nWith all due respect you've put me down in this game\nI didn't ask for that, not even a hand shake\nMake me want things, things I could see and I can almost touch\nThen you take them away. Not for me right?\nEveryone else but not me, I'm what?\nA mistake you make? Like some keft overs\nAnd I'm supposed to go through my life\nNo friendship, no love till I'm pissing in my bed\nCoughing the blood on the sheets then I'm alright\nThen it will all be clear.Put it in front of me and take it away\nWhy would you do that, aha\nJust to screw with me, what kind of sake fuck thinks that way\nI'm supposed to trust you,based on the treatment so far, what do you want?\nI'm here, I'm listening, I'm ready for every kind of explanation\n\n[Verse 1]\nUh turn up your stereo but you don't her me though\nI'm eating off the O's and the white like Cherios\nHoes been giving me neck, tuh. imperial\nI'm lyrical need the miracle disappear and move\nShit is real looking critical\nN iggas willplay with your kids just to get rid you\nI'm strapped up put some dolo like let me sit with you\nI just came home, the streets sayin' I need it get with you,\nThat's when he said it ain't no recruiting homie,\nI got enough, don't need another nigga shooting for me,\nThat's bout enough, had it up to here niggas up the years\nThem numbers fierce on that package, that ain't enough to share\nSo now I gotta switch up the gears\nUp the leer rari's with bucket chairs custom with the wheels\nThen give em reason to fucking steal, we all fucking here\n\n[Hook x2]\nNigga when I cry no tear shit, ain't beautiful\nNigga when I ride, no fear, I put the tool in you\nNigga when I die, don't care if it's no funeral\nNigga you alive and you here, God ain't through with you\n\n[Verse 2]\nThis kid over ten did ten now he home again\nWas the mass and rover since had to rolly and rover then\nHe was my doberman sold the rock more than hova man\nWas over when he caught his first body, he ain't been sober since\nI let them holder benz, healthy knot and a burner\nFront him a half a brick, a whole block and then work em\nTold em don’t do shit, just take care of the server\nHe having this move fist like he don't feel he a earner\nThink he a has been when I laugh like ain't you just stacking\nLike fuck captain, just fall back and start relaxing\nHe want the action, squeeze plastic ski masking\nTold em don't even ask then, not to see this is passion\nTomorrow early I need you meet up a curly\nCurly ran with a birdie and moving like ain't no worries\nIf you hurry and burry I pay with them things go for\nHere's he's key, 804, say no more\n\n[Hook x2]\n\n[Verse 3]\nMansion in Bulvia, stand with the familia\nLamping with a millia, lambobanana interior\nEvery morning I'm hand in hand in from Silvias\nHammer in my pilly so put some bampers that really up\nLike what's the cause? designer clothes\nStuck off my second god father, Hyman Roth\nBeen on his own, my real father behind them walls\nThe monologue with with just talking chains like a diamond cross\nHustled at night till I can't stand up\nGarage flooded with white like Santanas\nWe was upping the price till they can't stand us\nAll our Gucci colors is white can't scam us\n\n[Hook]", "album": "Slime Flu 3", "image": "https://images.genius.com/8066555d470cc6c865fd602c0153957a.500x500x1.jpg"}]}