{"songs": [{"title": "New KanShay West", "image": "https://images.genius.com/d39be70f638c88c431339e037c0e69e2.1000x1000x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nYeah\nHad to bring a friend along with me on this one\nMerciless, everybody\nAnd of course, I'm DeShay\nGonna kick it off first\n\n[Verse 1: brandUn DeShay]\nI'm so down like I'm supposed to be, down like I'm down on my knees\nHold the rosary, [?] stay close to me\nKnow I got a long road ahead of me\nGo ahead, do your worst, it's only gonna better me\nGot a girl head between my legs like a pedigree\nIt's easy just to let her leave, all I need is 88 keys just to breathe\nBut that is not an option\nSo while these rappers have their notepads and they're jotting\nI'm bringing steady jogging, remembering the worst days\nLonely-ass birthdays, everybody want to see tomorrow like it's Thursday\nI heard they was looking for a savior\nI'm Jesus with a little bit of gold and a pager\nWe know that we major whole different stage, this is stadium status\nStill can't believe they laughed at us\nAnd now they laugh with us\nAnd they ass-backwards\nYou know I'm that nigga\nNigga\n\n[Verse 2: Merciless]\nI'm the last hope, so I guess I am well\nThe Obama of this shit, I hope I prevail\nBut only time can tell\nMy destiny's in the stars like Orion's Belt\nBut these ain't even my songs, though, I just help\nWhen I lay my pen down, it write itself\nAnd every time I record, the mic just melts\nThis is the realest thing that I've ever felt\nYo, the music is inside me\nSaid come with me, just stay by me\nSo she played Whitney and I played Bobby\nWe painted the city red like a brand new Ferrari\nSo I got her to thank for all of this\nA closet full of kicks and a fucking Maserati, bitch\nThis is absolute bliss\nBut sometimes, I'd like to sit down and reminisce\nBut remember when I was young, hit the wishing wells?\nWishing well, I hope that I get rich and well\nNow I got more bars than a prison cell\nAnd I get to see the world like killer whales\nThis is awesome\nAnd running L.A. is so exhausting\nYou don't get it, then forget it, my lines is exquisite\nNo ribbon on my box here, boy I'm just gifted\nFlow like O.J. Simpson, B-side kill it\nGet on the track and just rip it\nLike your cheap rubber, some tired-ass jeans\nI'm the sickest nigga ever, there's no vaccine\nI spit flames, my saliva is gasoline\nSo fucking hot that I carry a canteen\nYo, so would I care about a pro-hater?\nStay on my grind like Tony Hawk, pro skater\nWe're so out of this world like a space laser\nWe're senior students, we fucking major\nYeah, we fucking major", "year": "2009-12-25", "album": "Your Favorite! MixTape"}], "artist": "Ace Hashimoto"}