{"songs": [{"image": "https://images.genius.com/b7bcbd18f4df90fee8a1067f0b2b3a7b.1000x1000x1.jpg", "title": "How Could You Leave Us", "album": "Therapy Session", "year": "2016-04-22", "lyrics": "[Intro]\nHow could you leave so unexpected?\nWe waited, we waited\nFor you, but you just left us\nWe needed you, I needed you\n\n[Verse 1]\nYo, I don't know what it's like to be addicted to pills\nBut I do know what it's like to be a witness, it kills\nMama told me she loved me, I'm thinkin' this isn't real\nI think of you when I get a whiff of that cigarette smell, yeah\nWelcome to the bottom of hell\nThey say pain is a prison, let me out of my cell\nYou say you proud of me, but you don't know me that well\nSit in my room, tears runnin' down my face and I yell\nInto my pillowcases, say you comin' to get us\nThen call a minute later just to tell us you're not, I'm humiliated\nI'm in a room with a parent that I don't barely know\nSome lady in the corner watchin' us while she's takin' notes\nI don't get it, Mom, don't you want to watch your babies grow?\nI guess pills are more important, all you have to say is \"no\"\nBut you won't do it, will you? You gon' keep poppin' 'til them pills kill you\nI know you're gone, but I can still feel you\n\n[Chorus]\nWhy would you leave us? Why would you leave us?\nHow could you leave us here?\nHow could you leave us? Why would you leave us? Oh\nHey\n\n[Verse 2]\nI got this picture in my room and it kills me\nBut I don't need a picture of my mom, I need the real thing\nNow a relationship is somethin' we won't ever have\nBut why do I feel like I lost somethin' that I never had?\nYou shoulda been there when I graduated\nTold me you loved me and congratulations\nInstead you left us at the window waitin'\nWhere you at mom?\nWe're too young to understand, where you at, huh?\nYeah, I know them drugs have got you held captive\nI can see it in your eyes, they got your mind captured\nSome say it's fun to get the high, but I am not laughin'\nAnd what you don't realize and what you're not graspin'\nThat I was nothin' but a kid who couldn't understand it\nI ain't gon' say that I forgive you 'cause it hasn't happened\nI thought that maybe I'd feel better as time passes\nIf you really cared for me, then where you at then?\n\n[Chorus]\nWhy would you leave us? Why would you leave us?\nHow could you leave us here?\nHow could you leave us? Why would you leave us? Oh\nHey\n\n[Verse 3]\nOur last conversation, you and I sat in the livin' room\nTalkin' 'bout my music and I brought you some to listen to\nYou started cryin', tellin' me this isn't you\nA couple weeks later, guess you were singin' a different tune\nYou took them pills for the last time, didn't you?\nThey took you from us once, I guess they came back to finish you\nCryin' my eyes out in the studio is difficult\nMusic is the only place that I can go to speak to you\nIt took everything inside of me, not to scream at your funeral\nSittin' in my chair, that person talkin' was pitiful\nI wish you were here, mama, but every time I picture you\nAll I feel is pain, I hate the way I remember you\nThey found you on the floor, I could tell you felt hollow\nGave everything you had, plus your life to them pill bottles\nYou gave everything you had, plus your life to them pill bottles\nDon't know if you hear me or not, but if you're still watchin', why?\n\n[Chorus]\nWhy would you leave us? Why would you leave us?\nHow could you leave us here?\nHow could you leave us? Why would you leave us? Oh\nHey\n\n[Outro]\nSometimes I think about like...\nSometimes I think about things like, you know\nWhen I'd have kids, I'm like...\nYou won't be there, you know?\nYou won't be there for any of that\nAnd I'll never get to see you again\nSometimes I wish I would've just called you\nI wish I would have just picked up the phone\nWish you were here\nI mean you should've been there for us\nYou should have been here!\nThem pills got you, right?!\nThem pills got you, right?!\nI wish you were here"}], "artist": "NF"}