{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "The Bumpy Johnson Album", "title": "Change", "image": "https://images.genius.com/05b40ef764ca6b43a79611a79d90bd0f.500x500x1.jpg", "lyrics": "[Verse 1]\nThere are two kinds of people in this world\nThose who make things happen and those who just watch and copy off of us\nI get my rush makin brush styles\nThey simulate me but imitation is the highest form of flattery\nSo gas me kid wit your blandishment\nIt only makes me realize how much you really on my dick\nSuckin all the flavor off of my love like you's a bitch\nSave something for my chick but go ahead get yo licks\nI've been doing this since Makavelli made hits\nBiggie Smalls said, \"and Mobb Deep started dun language\"\n40 inch chains and Hennessy\nShootin videos in them projects in Queens\n\n[Hook]\nNothing stays the same, hip-hop goes through eras my man\nThe only thing constant is change\nNow ask yourself, are you a follower or a leader?\nLeaders create and followers just follow the leaders\n\n[Verse 2]\nWe used to rock certified suits and Timbaland boots\nAvirex leather jackets with the bandana hoop\nSnatch the chain off yo neck, the definition of swag\nWho else but Brooklyn and Queens where all my thugs at?\nOut in California also\nThose where the days when pussy niggas couldn't rap\nThey was too afraid to get up on the stage and rock for the hood\nCause the hood was the only crowd there was\nSome niggas are stuck in that time zone\nThey can't adapt or get none of this neo dough\nHope you saved up while you was high and had your run\nCause the clock ran out and your 15 is done\n\n[Hook]\nNothing stays the same, hip-hop goes through eras my man\nThe only thing constant is change\nNow ask yourself, are you a follower or a leader?\nLeaders create and followers just follow the leaders\n\n[Verse 3]\nI see a bunch of nonsense in the game right now\nIt's a whole gang of garbage and copycat styles\nStep yo game up, step yo brain up, go get a dame\nShe deserved to live that life of the rich and famous\nNot the life of the dummy lame fucks\nThat ass deserve expensive seats and dressed up in the finest threads, that designer shit\nDiamonds are strictly for women, yea that's the new trend\nStop acting like a bitch and take the crystals off\nAnd get that glass off yo wrists and stop makin rap songs\nYou's a certified thrown ball, straight ass\nEven if you was a gangsta, your music still trash, look\n\n[Hook]\nNothing stays the same, hip-hop goes through eras my man\nThe only thing constant is change\nNow ask yourself, are you a follower or a leader?\nLeaders create and followers just follow the leaders", "year": "2012-10-02"}]}