{"artist": "A$AP Ferg", "songs": [{"title": "Fergivicious", "image": "https://images.genius.com/6a2f58fb40c2a44463c586658c8fc9ae.1000x1000x1.jpg", "album": "Trap Lord", "lyrics": "[Intro]\nYeah, a lot of you people look at me like\n\"Who the fuck this nigga think he is?\"\nLord Ferg the Second, the Fergenstein\nAll the trap lordians stand up, yeah\n\n[Verse 1]\nHi! I'm Fergivicious\nTo a bunch of bitches man, I'm Fergielicious\nRiding with a bunch of little trap villains\nTurn it up, leave yo ass on the ceiling\nFuck your opinion nigga, I be killing\nHippy white bitch on the penicilling\nGetting all the bad bitches I been feeling\nThink a nigga trapping? Yeah, I'm drug dealing\nHit her with the crack pipe get her lifted\nTake a little sip-sip of my drip-drip\nFuck a little trill bitch 'til my dick limp\nI love the way you lick-lick on my dick tip\nRiding in the Bentley, you in a Civic\nFuck your main broad 'til she on my friend's dick\n4-5-6, yeah, my niggas tripping\nShout out to the max and my niggas' Cripping\nA$AP Q, yeah, my nigga cripping\nMarty Baller macking, yeah, he Blood dripping\n5 point star for a thug nigga\n'bout 2 keys for the snow sniffing\nWhite gold teeth cause a nigga don't sleep\nNightmares of being broke cause I'm seeing no cheese\nBitch coming at me cause I'm dropping no fees\nShe can get up on a nigga for about a couple G's\n\n[Chorus]\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\n\n[Verse 2]\nHey, Joyde! Hi, twin!\nThinking 'bout my goddamn father again\nWhy he couldn't see a nigga in Medusa lens\nWhy he couldn't see a nigga cop his first Benz\nWhy he couldn't see a nigga pop his first band\nOnly bitches love me tryna get up in my pants\nRiding in a limo with a bunch of fake friends\nWho be only around me cause I make ends\nI feel the pain for my bro cause his dad died\nMy daddy gone too, my nigga, that's life\nBut them niggas did it up in they past lives\nMoët with Crystal nigga, that's right\nBet them niggas dressed up in them white suits\nRhythm and the blues in a white coupe\nSpit it through a cloud with a nice boo\nDaddy, Anna-Nicole probably like you\nAhh, I'm so vicious\nRiding in a coup with a bunch of killas\nAre you gangbanging, man? I couldn't see it\nLike twisting up your fingers in a pair of mittens\nPut 'em in the water with a bunch of fishes\nWatch a frog leap were his fucking chin is\nAre you Popeye? Eat your fucking spinach\nBunch of young Trap Lords and we down for sinning\nA$AP Soul, that's my fucking nigga\nYoung Tarzan, that's my little nigga\nCrawling in them bitches like a caterpillar\nThe bitch can't be all in my Hilfiger\nFlacko Jodye, he a trill nigga\nTwelv' the good goon be that real nigga\nNasty Baby want to kill a nigga\nAll us together the illest niggas\n\n[Chorus]\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own\nAll I know is pain\nSurviving on my own", "year": "2013-08-20"}]}