{"artist": "3rd Bass", "songs": [{"lyrics": "* Daddy Rich scratches \"Brooklyn!\" *\n* 3 bars of drum beats *\n* Daddy Rich scratches \"Brooklyn!\" *\n\n[Verse 1: MC Serch]\nReal cool.. cause Brooklyn's cool!\nFriday June the last day of school\nGirls steppin to the mall to swing\nSettin up dollars for their summer fling\nCars on the avenue create gridlock\nAnd there's girls like MAD at the bus stop\nNot waitin on the bus, but waitin on the cash flow\nFellas are laughin, gassin the past ho\nGirl steps to me and pushes issue\n\"That knot you got, is that money or tissue?\"\nFeelin on the bulge, thinkin it's her own\nI tell her that it's money and she should move on\nShe says she's pure from her legs to her thighs\nAnd we should talk over some chinese and fries\nI tell her to step, but hey that's the scene\nCause she ain't nothin.. but a Brooklyn Queen\n\n[Chorus x2]\n\"We are looking for 'Brooklyn'..\nWe are looking for the..\" Brooklyn-Queens!\n\n[Verse 2: Pete Nice]\nState the rhyme, borough of Brooklyn\nOtherwise known as Crooklyn\nFreaks fortify flesh with gold\nEars hang trunk, in a slave hold\nWalk past, don't get the time of day\nPlayed like suede, on a summer sway\nConversated, till I made her laugh\nSaid, \"I'm Pete Nice.. you want my autograph?\"\nOval Office closed as she heard this\nShe said, \"From 3rd Bass? I could do this\"\nListen closely, slowly took a swig of intoxicants\nCause the Brooklyn Queen's a gold digger\n\n[Chorus x2]\n\n[Verse 3: MC Serch]\nSquared away.. with my digits and tonight's plans\nWhen I feel a crab grab my right hand\nSlapped her on the back, tried to calm her\nAsking her, \"What's the reason for the drama?\"\nHer next move was straight out of textbook\n\"Haven't we met before?\" Giving me a sex look\nYo Wisdom, your lyrics are in bad taste\nSo I'm forced to give you nothing but the Gas Face\nYou better go, for hoppin on the cab or bus\nCause you're downtown and you're simply too fabulous\nBut get this, ain't this a humdinger?\nShe stepped to a retard sportin' a four-finger ring\nSomewhere in the skin tight jeans\nI'm gonna scoop the best of the Brooklyn-Queens\n\n[Chorus]\n\n[Verse 4: Pete Nice]\nLast exit to Brooklyn I enter\nCarefully the Queen holds my scepter\nGettin' numb like a Derelict on scotch\nI'm Dick Lewis, cause baby I'm watchin' you\nScheme on a brother for a knot\nTo choose between the have and the have-not\nDo you doubt the shade of vanilla?\nI'll play Elvis and you play Priscilla\nOh he's no hero, better yet Billy Dee\nAdvertise cheap liquor for a fee\nA Brooklyn Queen, rushes Russell Simmons\nThat's like Tyson rushin' Givens\n\n[Chorus x2]\n\n* Daddy Rich scratches \"Brooklyn!\" repeatedly over drum beat *\n* 3rd Bass says 'Brooklyn-Queens' (3X) *\n\n[MC Serch] Who's on Prince Paul's cactus?\n'Brooklyn-Queens'\n[MC Serch] Hahaha, yeah check it out\n'Brooklyn-Queens'\nYo, 'Brooklyn-Queens'\n* Daddy Rich keeps scratching *", "image": "https://images.genius.com/017ed4558b72d4f4b379d372f810be05.500x490x1.jpg", "album": "The Cactus Album", "title": "Brooklyn-Queens", "year": "1989-11-14"}]}