{"songs": [{"year": null, "image": "https://images.genius.com/6fd0c2edeadfae2824a883040dba6bd9.490x490x1.jpg", "title": "Dayz of My Neighborhood", "album": null, "lyrics": "(Blaze)\nG's up hoe's down\nI don't give a f**k if you's a nation-wide baller or rapper from my town\nYou need to bow down, out of respect or fear\nI ain't asking, I'm demanding, make sure the message is clear\nHey now player, it's all right, stop speaking my name\nUnless you're looking to fight\nI ain't looking to battle rap, with you\nI'm looking to unload my gat, and bust a cap in you\n\n(Chorus)\nThese bitches never learn, these bitches talking shit\nWhy a man turn a bitch? that shit I'll never get\nIf my name falling out your mouth (Stop that!)\nIf my name falling out your mouth (I pop gats!)\nIn the dayz of my neighborhood\nDo you remember what it was like when G's was real, and thug was life\nSands through the hourglass, and the time change\nAll bitches still act the same, you ain't thug\n\nDo you remember when G's was real, like stainless steel?\nGats they tote, catch a bullet in your throat\nBitches nowadays, need to get sprayed\nTricks ain't on the game, and the ghetto serenade\nMy name keeps falling from out your mouth\nWhich causes me and my homies, to pull the heaters out\nFind a bitch up in you, and we beat her out\nPut the barrel in yo' mouth, pull the trigger, and we out\n\n(Chorus)\nThese bitches never learn, these bitches talking shit\nWhy a man turn a bitch? that shit I'll never get\nIf my name falling out your mouth (Stop that!)\nIf my name falling out your mouth (I pop gats!)\nIn the dayz of my neighborhood\nDo you remember what it was like when G's was real, and thug was life\nSands through the hourglass, and the time change\nAll bitches still act the same, you ain't thug\n\n\"Damn the game's f**ked up\nRappers want to be actors\nActors want to be thugs\nAnd some of ya'll thugs is falling in love\nWhat's up, you need a hug?\"\n\nBack in the day respect was earned from blasting shots\nThe game changed, ya'll got earnings by getting shot\nPeople getting over, by sleeping with bitches on tracks\nAnd others looking for them, so they labeled wack\nAnd the media quick to jump on the nuts, of who's on top\nThey turn on you, as soon as someone else calls you a flop\nIt's some f**ked up shit, but it happens all the same\nBut tell me do you recall, or remember them dayz?\n\n(Chorus)\nThese bitches never learn, these bitches talking shit\nWhy a man turn a bitch? that shit I'll never get\nIf my name falling out your mouth (Stop that!)\nIf my name falling out your mouth (I pop gats!)\nIn the dayz of my neighborhood\nDo you remember what it was like when G's was real, and thug was life\nSands through the hourglass, and the time change\nAll bitches still act the same, you ain't thug\n\n(Repeats over)\nYou ain't thug!"}], "artist": "Blaze Ya Dead Homie"}