{"songs": [{"title": "Treason", "lyrics": "[Intro: Akir]\nYeah, One Enterprises, Viper Records\nPresents Akir, Immortal Technique\nAnd this is \"Treason,\" bitch! Uhh\n\n[Verse 1: Immortal Technique]\nI'm not down with the conscious rap, or the Sambos\nMy flow is cancerous milk, like Monsanto's\nSold through the hood in a package of murder\nI'm like white people, get fired and back with a burner\nGauge 5 semi, with the infrared beams\nSo fuck the Ku Klux and the Combat-18\nI put bullets in your spleen, sendin' you to the grave\nAnd through all that, a mothafucker still get paid\nAnd ‘cause of that, some niggas can't stand me, man\nBut that's the curse of the slave, like Candyman\nHouse niggas that traded they soul to get ahead (jiggaboo!)\nAnd then fucked over for placin' they faith in the feds (Snitch!)\nSo while the government talk about a mission to Mars\nThey leave the hood, stuck in a position to starve\nCapitalism's a religion that makes Satan a god\nAnd teaches self-righteous people to embrace a facade\n\n{*DP One scratches*: \"Say what?\"}\n\n[Hook: Akir + Immortal Technique]\nIt's a cut-throat business the way that we live\nBorn in the hood, tryin' to see a better life for the kids\nIt ain't wrong to make money, legit or illegal\nBut it's treason when you turn your back on your people\n\n{*DP One scratches*: \"Say what?\"}\n\n[Verse 2: Akir]\nYo, yo, they be manipulatin', politicians delegatin'\nTask of perpetratin', sounds like Satan\nMakin' racist statements of abomination\nNiggas pray to somethin' sacred\nWaitin' for that force to save 'em, instead of savin'\nMovin' destinations, property papers\nWaitin on your 40 acres, 'til you old and ancient\nSwole or achin' while the hole is gapin'\nTo cake to make your way in, I pray to God\nBut all the amen's in the world'll never make your aim win\nFamous celebrities could fall off like leprosy, they tellin' me\nSo I pay attention, fuck the envy and the jealousy\nY'all niggas could save, Akir's a latest rave\nSaw me chillin' on The Source page, fanbases span race\nComplete with shorties that blaze, be revered in my old age\nFrom rippin' the stage, and even then from above when I wave\nThrowin' flowers on my grave, burnin' sage\nSaying, \"Thanks, Abe, who made ways for freein' the slaves.\"\n\n[Hook: Akir + Immortal Technique]\nIt's a cut-throat business the way that we live\nBorn in the hood, tryin' to see a better life for the kids\nIt ain't wrong to make money, legit or illegal\nBut it's treason when you turn your back on your people\n\n[Verse 3: Immortal Technique]\nImmortal Technique, Indian chief, Lord Sovereign\nBear claw necklace and the puma moccasins\nLegal money, motherfucker, you could bring the coppers in\n‘Cause I'ma take a shit on 'em, without Johnny Coch-a-ran\nSpittin' Prometheus fire, when I speak to a liar\nI'm the last of the Essenes that'll teach a messiah\nRip your heart out with the technique of a Maya\n‘Cause only snitches and Kanye speak through a wire\n\n[Verse 4: Akir]\nFreshest attire, speak with desire, close to the passion\nI fall from Elijah, size up the evilest liars\nWho think they conspire\nMusic qualify as paranoia, mental occupiers\nTight, like a pair of pliers, brain's fried up\nAnd so I aspire to erase the pride, usin' amplifiers\nTo inspire my people, we should hire\nLike a lion fightin' vampires, tired on his way to Zion\nNever expire, only retire when they call me Sire\n\n[Hook: Immortal Technique + Akir]\nIt's a cut-throat business the way that we live\nBorn in the hood, tryin' to see a better life for the kids\nIt ain't wrong to make money, legit or illegal\nBut it's treason when you turn your back on your people, yo\n\n{*DP One scratches*: \"Say what?\"}", "year": null, "album": "Legacy", "image": "https://images.genius.com/ec568067b0f966b9ee18a0f87677e60e.1000x1000x1.jpg"}], "artist": "AKIR"}