{"songs": [{"image": "https://images.genius.com/ecde52d73331f2c86b2943a02e208d45.480x360x1.jpg", "album": null, "title": "Blackbox Freestyle", "lyrics": "[Intro]\nYeah, listen, cool, look\n\n[Verse]\nWalking down my road and I don't even know my ends now\nEverybody's shanked up, everybody's got a skeng now\nAnd man are tryna cotch with a jezzy\nTalking about they're cocking a semi\nThey move rocks and are ready\nSee, every boy's a trapper 'til the shit hits the fan\nAnd then that shit hits the walls, you're flushing bits of the raw\nAnd every girl's a trap queen, 'til they kick in the door\nAnd now you're in the station telling stories like Roald Dahl\nYour man are in a holding cell, hoping that you hold out\nMy ends is all fucked now, got a nigga tryna cut now\nI've been to the end of that road\nBruv I've been to them graveyards\nI've been to the pen for my bros\nAnd bruv I've seen what a skeng does to mugs in the south\nLike I've seen a shank leave a nigga's guts hanging out\nSeeing big straps, make a whip crash, no whiplash\nBig money, make a big man look like a kid akh\nYou ain't really from here\nArmani's clean, the vision's never cloudy\nSo know what I'm on clear, you're trapping for designer\nI'm in and out of Santander\nOn a madness doing recon for a line up\n4-1-9, that's word to my Nigerian uncle up in Lagos\nNo favours for the paper\nBring all your guys and you can lose that war\nYou bring a burner to the beef, I'll make you use that corn\nYou bring a turner to the madness, you could lose that corn\nMan that's the niggas have you missing, that's some unicorn\nSchool, they never rated, girls call me a money man\nThe yutes call me a paigon\nBut I've never been a witness like Jehovah\nSo I couldn't tell you my involvement, from sticks to revolvers\nI've never been no victim to them olders\nSo I can't disclose what the holder gets you\nHave to ask my older friends\nNever been a witness like Jehovah\nSo I couldn't tell you my involvement, from sticks to revolvers\nI've never been no victim to them olders\nSo I can't disclose what the holder gets you\nHave to ask my older friends\nFor half dark, half light, get it for a calm price\nHanging out the passy, like Heath Ledger in The Dark Knight\nWhat the fuck's a one-on-one? Fighting fucking punch to punch\nI'll boot you in your face bruv\nI won't ever watch my darg fight\nThe fuck you gonna tell me that you love me\nGave my boys my square and they still tried to bump me\nThat was way back, I had to switch the game up\nNow I got springs in my 110's, and springs in that...\nThey gave my brother 18 for a fucking murder\nA knife crime, the lifetime, the whole sentence he's serving\nNow in my chest, my brother knows it's burning\nThem visits had me crying, had me whelping\nHad me taking pills to help it\nLooking, thinking who am I?\nTrust, you never knew this guy\nGrandma died, had my mother stricken, talking suicide\nTrust me I don't say that shit\nWhy I never rate these kids\nMy mum was on a madness\nYou ain't never seen no pain like this\nI know you niggas feel this\nBrother putting on a brave face for the visit\nBut I know my brother feels it\nAnd my brother don't reveal it, na\nMy brother don't reveal it\nTake a life for my mother, my brothers don't wanna steal it\nBut this track's got me on a rage\nMy brother's stressed out, a man can see it in his face\nLike man can see it in his eyes, he's holding back the tears\nThat judge moving like a Mayan, holding back them years\nThey done my brother dirty\nDoing hard time, he didn't even do the dirties\nBut I can't say much, 'cause certain man are snitches\nAnd certain man are bitches\nAnd certain girls are witches\nAnd Wale was a witness\nPut their shanks in my brother's bag, how's that fair?\nGave Scalez 16, and bruv he wasn't even there\nCase was all banter 'til junior got cancer\nAnd mums got sick, and tales got told\nAnd then the paint wore off, and true colors got shown\nAnd certain man go free, and all the real niggas don't\nSo, shout out Lewis, and shout out Serge\nNow I'm rolling with an 'arghh' that will get man 'arghh'\nWhat? Like Wale, I'ma get you down\nA couple man they wanna get you, I'ma get you first\nI'ma get you last, and I'ma get you well\nAnd show you snitching motherfuckers just why you don't tell\nSo how the fuck you gonna tell me that you hate me?\nWhen I was dead broke, they still bumped me on my AC's\nI've never had dough, them niggas laughed, they wouldn't rate me\nNow the trainers on my feet, are like minimum like 380\nWhat? 'Cause I'm Prada boy now, I'm money boy now\nI'm piano boy now, I'm Mr. Duck a Man Down\nMr. Fucking Stop Asking, how I get my P's in\nAsking for a bring in, none of you brought me in\nBrother fuck a fake friend, why you fucking riding for?\nI've got a couple people that I'd die for\nRide out, lights out\nMy brothers pulling strings from up in High Down\nTo get you skied before the sky down, look at the sky now\nLook at this guy now", "year": "2015-05-10"}], "artist": "Dave"}