{"songs": [{"image": "https://images.genius.com/6695d2bb24f7779de6a82b14bfd69716.350x350x1.jpg", "album": "You Can Be a Daddy, But Never Daddy-O", "title": "Flowin in File", "lyrics": "Never has it been so sweet to your ear\nSo lend it here and let go your fear\nAnd give a green light to the man on the mic\nAnd keep this beat cause it's just my type\nAnd I'll ride the rhythm like a black cowboy\nAnd I'ma get busy for y'all to enjoy\nWhether dancefloor, jeep, or the comfort of your home\nI'm kickin somethin out your back that rhymes with comb\nFlippin the script, because I used to be with Stet\nBut when shit got heck, had to step and keep the rep\nLike a forty ounce brew, leave it out it gets flat\nSo I'm comin freely in ninety-three with the fat\nOkedoke supportin, a shoutout to the Hortons\nAnd Burrells for supportin all the wars that we fought in\nAnd now it's time for me to sorta claim my fame so\nPlease don't ask the question \"How low can you go?\"\nAnd as for traditional rappers and MCs\nThe Godfather sings please please please\nTo your parents, so I'ma sing a song to you\nYou're either friend or foe, so whatcha gonna do\nCause I'm\n(flowin in file with a new style) -- 2X\nIn ninety-three I'm (flowin in file with a new style)\nGive it to me I'm (flowin in file with a new style)\n\nA special shout goes out to East New York\nBrownsville, Bed-Stuy, Crown Heights, Redhook, Ft. Greene\n\nStyles upon styles, but I don't think so\nCause people only rock one style at a time\nIf you with it, as long as the Daddy has been\nYou learn that people gotta p-ay for the rhyme\nThey called a one eighty seven on a undercover cop\nBut the vest was bulletproof, so the cop didn't drop\nMy brother Ice-T couldn't take it no more\nSo he got with Sister Souljah and they bumrushed the store\nCube was inside yellin, \"Dirty Korea!\"\nTurned around looked for Yo but the cops didn't see her\nCause she eased to the back after checkin around\nTo get with Chuck, Norm, and Flav to Shut Em Down\nNews caught on, but Don't Believe the Hype\nOnly fools would believe that Rakim is on the pipe\nAs we stomp to the 90's singin songs of Tennessee\nMe and Luke's sippin daiquiris in Miami\nAnd we're rollin, couldn't keep a good rap down\nAnd if it hurts ya, we don't wanna nurture\nThat of which you fear, so I'ma leave it up to you\nIs it a new Daddy-O, or Daddy-O gettin new?\nI know you thought that if I kept back\nI would stick to producin so the wack would get fat\nBut no way, no how, and no cigar\nSo do I call out your name or do you know who you are?\nCause I'm\n\n(flowin in file with a new style) -- repeat 2X\nIn ninety-three I'm (flowin in file with a new style)\nBustin em up I'm (flowin in file with a new style)\nNow break it down for me\n\n\"Oh, Daddy, oh, Daddy, where have you been?\"\nWell I built a studio in Brooklyn\nAnd as far as rappin, no I didn't give up hope\nAnd yo Erick and Parrish, Das EFX is dope!\nAnd to Muggsy, comin out of 7A3\nProps on Cypress Hill and the House of P\nAnd though I never met him, and Flint is not my home\nShout out goes to the brother with the Breedy on the chrome\nAnd yes I get with this, so Black Sheep is a fave\nAnd to X-Clan thank you for the road that you paved\nTo the Abstract, Phifer, and the True Fu-Schnick\nAnd a LONG shout out, goes out to Slick Rick\nI still love ya Biz, but clear ya samples bro\nAnd to Big Treach and Naughty, keep talkin bout the ghetto\nTo CL and Pete makin beats for the streets\nAnd to the Main Source, makin fakes pay the cost\nTo Premier and Guru, and every other crew\nCatches wreck, as Showbiz and A.G.'ll say to you\nGive it all you got, and take it from your coach\nEnemies I'm crushin like a roach, cause I'm\n\n(flowin in file with a new style) -- repeat 2X\nIn ninety-three I'm (flowin in file with a new style)\nFor your mom I'm (flowinin file with a new style)\n\n(flowin in file with a new style) -- repeat till fade", "year": null}], "artist": "Daddy-O"}