{"songs": [{"year": "2018-12-21", "title": "​gun smoke", "image": "https://images.genius.com/fdf55cd3f0aaf3b48e1437d99bdfbcd1.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah\nYeah\nYeah\nYeah (Gun smoke)\nYeah (Gun smoke)\nYeah, yeah (Gun smoke)\nYeah, yeah, yeah (Gun smoke)\nYeah, yeah\n\n[Verse 1]\nOne man army from the get-go (Get-go)\nOne man army pullin' kick doors (Kick doors)\nTalkin' out yo' neck get you tag toed (Tag toed)\nI'm a killer whale, you a tadpole (Tadpole)\nNigga, you got asthma, you don't want smoke (Straight up)\nWho want cancer? I'm giving out smoke (Straight up)\nI got too many bitches, I can't trip bro (On God)\nMost of the time, I be caked up with my stick bro (On God)\nYeah, AK make yo' brotha do the limbo (On God)\nMake this Glock \"Shiggy Challenge\" out the window (On God)\nSavage, why you always rappin' 'bout guns for? (Straight up)\n'Cause, bitch, I fell in love with the gun smoke (Straight up)\n\n[Chorus]\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nYeah, gun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nPut my Glock down, that's a no-no (No-no)\nWhen I wear my suit, I tote my .44 (.44)\nY'all ain't killin' shit, y'all niggas hoes-hoes (Hoes-hoes)\nCryin' over pussy, you a broke joke (Broke joke)\n\n[Verse 2]\nStarted with a deuce deuce, turned it to a .38\nThen I got a Glock 9, turned it to a AK\nFirst I was a leg shooter, now I'm hittin' chest, face\nShe done caught rug burn, give that girl a neck brace\nShoot at me with a handgun, that's an insult (Straight up)\nWe got plenty sticks, nigga, plus my M's up (Straight up)\nMy young niggas ready to crash, they don't give a fuck (Straight up)\nLet it bang, let 'em hang, I'ma drop mine (Straight up)\nI don't need no shooter, everybody know I pop mine (On God)\nI'm at Crucial on stage with a Glock 9 (On God)\nI keep one in the head, I ain't got time to cock mine (On God)\nMurder Gang, nigga, I'm redder than a stop sign (On God)\nYou niggas know you need to cut out all that dickriding (Bitch)\nSkinny capris, you think you finer than yo' bitch, huh? (Lil' bitch)\nYou niggas mad 'cause I keep throwin' up Zone 6, huh? (Lil' bitch)\nLike \"Look at Savage, lil' bitch ass, he think he the shit, huh?\" (Facts)\nI think I am when I'm ridin' with this stick, huh (21)\nI think I am 'cause I just fucked that nigga bitch, huh (On God)\nI swear to god my deal worth seven figures, not six, huh (Straight up)\nYou think you hard, you wanna get shot all up in yo' shit, huh?\n\n[Chorus]\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nYeah, gun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nGun smoke (Gun smoke)\nPut my Glock down, that's a no-no (No-no)\nWhen I wear my suit, I tote my .44 (.44)\nY'all ain't killin' shit, y'all niggas hoes-hoes (Hoes-hoes)\nCryin' over pussy, you a broke joke (Broke joke)", "album": "i am﹥i was"}], "artist": "21 Savage"}