{"artist": "Canibus", "songs": [{"title": "Dear Academy", "album": "Hip-Hop for $ale", "year": "2005-11-01", "image": "https://images.genius.com/b82ecfb1a2e65da6dae50388ae145f8f.600x600x1.jpg", "lyrics": "[sampled song \"The Awful Truth\" by Carole King]\nDear Academy, take note!\nI should get, the Oscar vote\nIf I don't, I'll bite your throat!\nSigning off now, quote unquote\n\n[Canibus]\nYo, nominated for being underrated; we made a name for ourselves\nBut I guess Common was the only one that made it\nI clapped when he won his award\nHim and Black Eyed Peas and them, we was on the same tour\nAnd DMX too, you my dawg for life (rrrrrrrrr)\nI feel for you, I wanna see you get yours tonight\nMos Def you on the screen now, followin your dreams now\nMe you and Spike Lee used to sit and freestyle\nI said two words, they both got bleeped out\nIf you ever need me again, just reach out\nI got poses that belong on posters\nPour out all my emotions and double what the gross is\nEverybody in the box office know the flow sick\nI wanna thank Nottz, the producer that chose 'Bis\nMotherfuckers!\n\n[acceptance speech]\nI wanna thank my mother, I wanna thank my brother\nFor makin the film, cause all the support was very important\nFrom the beginning I got fans and, y'know cult members\nThat never let me down from day one - I'm just inebriated to be here\nI wanna thank you all\n\n[Canibus]\nYo, I don't wanna bite nobody's throat, I just want smoke\nYo pass the 'dro nigga; yo, I can't believe\nI'm sittin with Don Cheadle, Denzel and Russell Crowe man\nDave Chappelle yo I really liked your show man\nIce Cube, yo he in the next room man\nD12, me and them struck a pose man! {shhh, shhh be quiet}\nWith Slim Shady, yo this must be a omen! {shhhhhhhh shut up}\nI think I'm 'bout to go platinum, I'm EXPLODIN! {shhh you're too loud}\nI'm a fool man, what I'm 'sposed to do man\nRed & Meth, \"How High Part II\" man\nBokeem Woodbine bump me in his hood all the time\nI wanna say peace, I'm a fan of yours brah\nI seen Hov' on a hundred foot boat\nAt the Cannes Film Festival with Sophie and Cope'\nAnd Scarlett Johansson, she was with her man friend\n\"Lost in Translation,\" number one smash hit\n(And now, introducing, Can-I-BUSSSSSS!)\nYo, I'm in the game now, I ran \"8 Miles\"\nI ain't the same old nigga with the same style\nThe lifestyle of Jermaine is my brainchild\nJermaine's really like the black John Wayne (WOW)\nOr James Caan, negotiatin some rhymes for the Don\nI ain't seen my niggas in so long (so long)\nWe did a short film, \"4,3,2,1\"\nIt was hot back then when it was new, but\nI did this other film, \"Gone Til November\"\nMe and Wyclef was in the trenches together\nI did a big movie with him, he put me on soundtracks\nBack then, I didn't understand the music business\nEvery agent found it hard to find me\nIn the backwoods of Holly, rehearsin my hobby\nShoutout to R.O.C. and State Property\nI was inside the beast, shoutout to DMP, peace\n\n[shoutouts]\nKilla Khan, Sha, Black & Deco, my nigga Starr\nNottz, what?  Yeah\nThrow shots, spread out your face like Botox\nNigga what?"}]}