{"artist": "King T", "songs": [{"image": "https://images.genius.com/1be8875f252ab97264f07d49cfc3aac4.599x599x1.jpg", "title": "Duck", "year": null, "album": "IV Life", "lyrics": "King Tee:\nHey! Here comes the funk of the future\nAnd I can rock a rhyme from Perquorma to Hoover\nThe westside kid, quick to do a bid\nJust watch me cock the Glock and make room\nShit man I got a 12 guage with the infared scope\nI found a Tec 9 it use to be a radio\nBut now I'm a G, psycho, crazy\nFuck what you say and buck buck and I'm suazy\nIn my rag coup, front and back and it's quick\nPunks with bump and that 3 wheel shit\nCause that's all you need when you need to be poppin'\nBust a U-turn on 3 wheels by the cops and\nDamn if feels good to be triflin', you know what I'm sayin' cuz?\nWho got the wallet, cause I'm buzzed\nI got the black mack-11, sendin' fools to heaven\nGet the fuck out my way, this is Compton fool just...\n\nHook:\nDuck!Duck! I'm about to bust some rounds\nDuck!Duck! I'm fiendin' to bust some rounds\nDuck!Duck! Yeah, I'm about to bust some rounds\nDuck!Duck!\n\nKing Tee:\nYo check it, they be like \"He's a maniac!\"\nYeah, bitch ant that's real, get the fuck up out the car and just peel\nYo punk I said right before I crash you in the grill\nWith the ass of my Glock, watch the blood spill\nGangstas got love the nigga King Tee\nJust ask 'em who's the great weight, just watch 'em scream me\nQuick with the punch, rollin' like clunch\nComing with the real shit, runnin' with a bunch of crazy niggas with wires\nHammers and plyers, your money and your blood\nPlus the daytons and them tires\nI be goin' so low, you can't get under\nNiggas can't see me, ask Stevie Wonder, blazed in the chronic\nBumpin' Delphonics, and my shit's screamin' like that group Onyx\nBut hey, I'm the man that'll Bust That Ass open\nWhen I was young me BB gun even has a scope so...\n\nHook\n\nKing Tee:\nGod damn it's King Tee with the funky bumrush\nSmoke a lot of herb, but I never hit the dust\nI can wreck them efx cause I ain't got my check baby\nThis ain't no punk shakin' shit, I'm goin' crazy\nI think I'm goin' out of my head (say what!)\nI said I think I'm going out of my head, so E-Swift\nSince you rule in the cuts, give me the gun and just duck, come on\n\nE-Swift:\nYo, I got a black case but it ain't for the mase\nIt's for the 4-4 I use to blast you in the face\nCause I be actin' kind of triflin' like my nigga Tela\nCock the hammer blow you out your socks and your Filas\nWhich way did he go? Which way did he go?\nNiggas don't know, I got to play the down low\nPunks jump up and get blasted to the ground\nSo motherfucker duck, I'm about to bust a round\n\nHook"}]}