{"artist": "Prince Paul", "songs": [{"album": "Politics of the Business", "title": "Controversial Headlines AKA The Champion Sound Pt. 1", "image": "https://images.genius.com/f7b3f07c46a4e110f16d6822ec0efdf5.500x500x1.jpg", "lyrics": "[Hook 1: Horror City] {x2}\nWe're Horror City baby, we came to get down\nWe're here tonight to bring that champion sound, champion sound\n\n[Hook 2]\nIt's Big Sup', Rhyme Va Lore and Paul\nWe came to rock for all of y'all\nIf you shot call or ball or brawl\nJust get crunked out from wall to wall\nI came to drop a rhyme or two\nFor the hustler, the thug in you\nDJ give me a rub or two\nLovely ladies we loving you\n\n[Verse One: Big Super Star]\nI'm butt naked overseas on the beach\nSo far no worries or troubles, I'm out of reach\nLil' Kim bringing me drinks, heard she packs heat\nDestiny's Child crunked out in my suite\nPrince Paul let me find out [?]\nHey hey hey, Mr. D-D-DJ\nHeard Juvenile's a mother, not really\nWould Ray J be on if he wasn't Brandy's brother?\nTrina bootie really fat like that? I wanna know her\nSnoop really got rims on his lawn mower?\nThese questions motherfuckers be asking me, stuck\nI don't know why, but I don't give a what what\nLoved by the old school popping this\nLike when L ripped a whole up in Canibus\nI invented this\nApocalypse, black mist\nLove when it gets ghetto fabulous\n\n[Hook 1]\n\n[Verse Two: Rhyme Va Lore]\n\"Va Lore what's good? Where you been at?\nWhat you doing here? You still working at the shop? When your record gonna drop?\nYo How 'Pac make CD's with songs that new?\nDo you think he still alive, yo you heard that new Clue?\nI heard Nas dissed Jay, I heard Jay dissed Kiss\nI heard Kiss had 30 thousand 'round his wrist\nThat's a whole lot of jewels huh?\nI guess Snoop Dogg and Eminem is cool, huh?\nYou from the 'Ville, what's going on with De La?\nCan you tell Paul to call me?\nWhat's up with Poetic? Rest in peace to the god\nYo I heard Cash Money and No Limit be rolling.\"\n\"Yo B, I don't know, they all the way out there in New Orleans.\"\nSee this the type of questions motherfuckers be asking me\nAnd every other day there's something different there has to be\nA million better things for two people to talk about\nBut you gotta give the people what they want or they walking out\nIt's not about your ad, record sales or commercial\nIt's more about what the people find controversial\nControversy, risky business\nDead witness wanna tell my life story, in Horror City\n\n[Hook 2]\n\n[Verse Three:Big Super Star]\nSix tricking, niggas\nPolitician as I cruise uptown, cop a pound, half a brick and\nCatch me in Chicago on Navy Pier\nWith a trunk full of cargo\nCopped from [?]\n\n[Rhyme Va Lore]\nYou might find it kind of hard to understand my plan\nUntil you catch me in Japan hanging out with Jackie Chan\nAnd so you know the kid got doe\nWe can talk about it in the front row at the Chris Rock Show\nOr V.I.P. with Jermaine Dupri\nAt the [?] walking in behind Mary\nAnd like sixteen girls\nAt the bar we drinking expensive wines\nReminising on the way we had to get it, through relentless times\nFrom looking at Mr. Bookman, Thelma, JJ and Penny\nWinnona lived on Natalie, Cameo earned a salary\nA bullet through the window killed my mother's friend Valerie\nI'm talking about Amnity-ville, Long Island\nWhat else was you thinking?\nSmoking, drugging or drinking\nChoking, bugging or winking\nHope it wasn't just shrinking\nNo Bone Thug and linking\nYa open cousin you're pink in\nI'm loc'ing, buzzing my mink in\n\n[Hook 1]\n\n[Hook 2]", "year": "2003-01-01"}]}