{"artist": "6LACK", "songs": [{"album": "East Atlanta Love Letter", "title": "Let Her Go", "lyrics": "[Intro]\nAyy\nAre you?\n\n[Verse 1]\nAre you tryna get back at me?\nYou can't let ’em win, all they really wanna do is distract me\nShe like, \"Who you foolin'? You been out here tryna make a move, ayy\"\nShe like, \"Boy, it's a two way, groupies only followin’ what you say\" (ayy, ayy)\nIt's a shame 'cause they all know who I am (who I am)\nOverlooked, now they think they understand (understand)\nLotta bands, that'll put 'em in a trance (in a trance)\nI can't let my baby slip up out my hands, damn\n\n[Chorus]\nYeah, if I let her go (woah)\nWill I regret it? Will I forget it?\nWell, it's somethin' I don’t know (woah)\nIt’s somethin' I don’t know (it's somethin' I don't know, uh)\nIf I let her go (woah)\nWill I regret it? Will I forget it?\nWell, it’s somethin' I don't know (somethin' I don't know)\nIt's somethin' I don't know (somethin' I don't know)\n\n[Verse 2]\nYou know, you the main attraction (ah, ah, ah)\nI can't hit nobody else for the love, I need you for that action\nAnd she like, \"Who you tryin'? I ain't the only one that you been eyein'\"\nI'm like, \"Woah, money two sides\" (woah, fine)\nShe love me, she love me not, it's time to choose sides (whoa, whoa, my, god)\nIt's a shame, how could I be runnin' games? (Running games)\nAfter all the trials, after everythin' (everything)\nWedding ring, I can change your last name (last name)\nBut I can't let 'em get my baby outta pain, ayy\n\n[Chorus]\nYeah, if I let her go (woah)\nWill I regret it? Will I forget it?\nWell, it's somethin' I don't know (woah)\nIt's somethin' I don't know (it's somethin' I don't know, uh)\nIf I let her go (woah)\nWill I regret it? Will I forget it?\nWell, it's somethin' I don't know (somethin' I don't know)\nIt's somethin' I don't know (somethin' I don't know)\n\n[Bridge]\nLet her, let her go, let her go, let her go, let her go, let her go, let her go, let her go, let her go\nYeah, yeah, go\n\n[Outro: Tierra Whack]\nPeople look at me like I'm crazy\nI just think dick is a distraction, you know, like\nNiggas ain't shit, and bitches ain't shit either\nMe personally, I just, I can't afford distraction\nUhm, so, that's what I feel like niggas are", "year": "2018-09-14", "image": "https://images.genius.com/68d505210dfe645f563d657a5dd75757.1000x1000x1.jpg"}]}