{"songs": [{"image": "https://images.genius.com/9c2528fd588e5a336805a4ed4d9db564.1000x1000x1.jpg", "lyrics": "[Verse 1: Raekwon]\n(Freeze) Fix your face, when we rhyming, we been crazy\n)Rock) Throw mad bullets at you, jumping in new spacely\nAll my goons is frustrated, groan at they P.O.'s\nIt's obvious, we do this, we bust haters\nYo, gun selectors, dumb detectors\nChase my niggas, talking slick, where that Lex kid at?\nYou know we cool and we Darth Vaders\nAlways in black uniforms, rocking Clarks and sharp gators\nCan't tell me nothing, I've been shaking\nPull out them slammers, regulate the streets, I bake Satan\nHow many of us it take paper and start a war\nIt's like starting up a store that sell aces\nAll my colors and bad brothers, rag coverage\nBlack glovesers, leathers and glass lovers\nIntroduce these leaders, wanna take money\nThese dick beaters, and strangle something up, go get Jesus\n\n[Hook: Y-Not Da Beast]\nLook, the coke, the coka, the cocaine\nThe C-O-K-E, it's coke, man\nThey lift the weight up in snow plains\nYou sniff an eighth up in your brain\nThe coke, the coka, the cocaine\nThe C-O-K-E, it's coke, man\nThe prices rise like some propane\nThe nicest guys become so fame\n\n[Verse 2: U-God]\n(Freeze) Illegal transport, son, I throw bombs back and forth\n(Rock) It's a contact sport, get your arm cracked off\nYo, I blast like I'm task force, stashed in my dashboard\nExercise black thought, dance on a catwalk\nGrew up on the asphalt, tryna get my grams off\nWatch for the hand off, I'ma get my plans off\nLike you and your mans off, everybody huddle up\nTwenty cent dime pieces, watch the water bubble up\nA piece of the puzzle, son, pieces, crumble up\nMy old righteous troublesome, now I'm into major things\nMade it this far, kid, the God got on angel wings\nEvery time the flavor bring, tons of coke, mad gross\nTwo cuts of lactose, I'm underground like railroad\nMad low, son, in this hellhole, an animal\nFriendship be flammable, no shame for some to blow\nBrains out for fun, over cocaine and guns\n\n[Hook: Y-Not Da Beast]\nLook, the coke, the coka, the cocaine\nThe C-O-K-E, it's coke, man\nThey lift the weight up in snow plains\nYou sniff an eighth up in your brain\nThe coke, the coka, the cocaine\nThe C-O-K-E, it's coke, man\nThe prices rise like some propane\nThe nicest guys become so fame\n\n[Verse 3: Slaine]\nEver since a little youth\nI've been bent on stoups sipping gin and juice\nIn the booth, fill the dope game, shooting on bent up hoops\nRoll around in stolen cars, nah these ain't no rented coupes\nGrimeys behind me, they all grimey, ninety percent of controlled\nLying in the booth, put the ashes in the pipe\nBlowtorch to the crack, my fire is winter proof\nOld thoughts of black and white pictures, now they developing\nSkeletons surrounded by archangels and seraphins\nTelegram packages distributed through the whole hood\nTell him this racquet is bad for him but it's so good\nAre you a fighter? Real life scuffle, no dirt clean\nPlus a muthafucka had to hustle since 13\nI got my mind in focus, where you never been at\nHow you think I made a hundred grand, from where my pen's at\nFuck the fortune and the glamour, I don't need no fame\nI piss whiskey and spit fire, I bleed cocaine, muthafucka\n\n[Hook: Y-Not Da Beast]\nLook, the coke, the coka, the cocaine\nThe C-O-K-E, it's coke, man\nThey lift the weight up in snow plains\nYou sniff an eighth up in your brain\nThe coke, the coka, the cocaine\nThe C-O-K-E, it's coke, man\nThe prices rise like some propane\nThe nicest guys become so fame\n\n[Outro: U-God]\nFreeze! Rock!\nFreeze! Rock!\nFreeze! Rock!\nFreeze! Rock!", "title": "Coke", "year": "2009-06-23", "album": "Dopium"}], "artist": "U-God"}