{"songs": [{"album": "Freebase", "image": "https://images.genius.com/8b31226536bddeeb1ff5145959d1792f.420x420x1.jpg", "title": "FREEBASE", "year": "2014-05-05", "lyrics": "[Intro]\nWhat is it?\nFreebase\nWhat's free about it?\n\nI thought if I said now, “Listen\"\n\"Should I talk about freebase and what it\"--or somethin?\nAnd people say, \"Well, no, because, then people will start doin' it\"\nNo, let me--I gotta talk about what happened to me\n\n[Bridge]\nSee where we're from, it's all or nothing\nBut we take penitentiary chances like it's nothing\nWe came from nothing, from nothing\nFreebase on top of the oven, get money my type of discussion\nYa'll could do this shit for free, a nigga like me gon' be hustlin'\nFreebase, Freebase, Freebase, Freebase\nFreebase, Freebase, Freebase, Freebase\nFreebase\n\n[Verse 1: 2 Chainz]\nI came from nothing\nMe and my niggas, we came from nothing, sold that caine like it’s nothing\nTold you from the introduction I came from the pain and suffering\nTwo pit bulls and a TEC-9, TEC-9 use to jam up on me all the time\nSwear to god if you come up in my mama yard\nI’mma shoot that motherfucker till it get tired\nBig dually truck got six tires, big ties when I rhyme mixtapes\nAnd I keep shitting on the competition, I'm about to put out me out a shit tape\nGuess we ain't playin' by no rules, every night I freestyle on Pro Tools\nTell Flex come to the A we'll carjack him by one of them regular ass old schools\nI don't respect my elders, these right here Maison Margiela\nI cannot get no earrings, it'll make my Rolex jealous\nI been a felon since fifteen, my expedition had a big screen\nHalf you niggas was constipated, half you niggas wasn't shit then\nZone one all the way to zone six, fuck y'all, I'll buy my own shit\nFuck y'all, I'll buy my own whip, fuck y'all, I'll buy my own brick\nTell them pussy niggas that ain't pay shit \"Better be ready to let the gat loose\"\nI done did a song with everybody from Jermaine Dupri down to Papoose\n\n[Hook]\nI came from nothing, I came from nothing\nI came from nothing, I came from nothing\nI came from nothing, I came from nothing\n\n[Verse 2]\nWork hard, play hard, work hard again\nMy bankroll had twins, can you comprehend?\nSeafood lover, I don't eat pork\nUsed to hit them J's like a 3-point, my partner mascot is a pitchfork\nAnd you already know what this for - me too, rent due\nDoggin' these hoes like a shih tzu so cold I recorded in a igloo\nNigga asked me why I don't drink, man, let me tell you what the wine do\nMy partner came in and said \"This my girl\", I had to tell that motherfucker \"Mine too!\"\nCourt dates in the summertime, might pull up in a vert\nNo matter what the charges is, I'mma pull off with a smirk\nThis right here for Old Nat, this right here for Godby Road\nThis right here for Riverdale, trappin' at the Stop-N-Go\nTrappin' at the Texaco, it was Amaco before it was BP\nMy plug from Mexico, he fell out when he seen me on TV\nSold drugs to my loved ones and it's hard for me to admit it\nThe first time I've seen a crack pipe was in my parents' kitchen\n\n[Hook]\nI came from nothing, I came from nothing\nI came from nothing, I came from nothing\nI came from nothing, I came from nothing"}], "artist": "2 Chainz"}